[
    {
        "Q.No.": 1,
        "question_text": "With reference to the Parliament of India, consider the following statements:\n1. A private member's bill is a bill presented by a Member of Parliament who is not elected but only nominated by the President of India.\n2. Recently, a private member's bill has been passed in the Parliament of India for the first time in its history.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is incorrect. A private member's bill is introduced by a Member of Parliament (MP) who is not a minister.  It does not matter whether they are elected or nominated by the President. Any MP can introduce a private member's bill.\n\nStatement 2 is also incorrect.  While private member's bills are rarely passed, it's inaccurate to say that one has *never* been passed in the history of the Indian Parliament.  The provided text does not contain information to confirm or deny this.\n\n\n**Short Notes:**\n\n* **Parliament of India:** The bicameral legislature of India, consisting of the President, the Lok Sabha (House of the People), and the Rajya Sabha (Council of States).  It is responsible for making laws, scrutinizing government policies, and holding the executive accountable.\n\n* **Private Member's Bill:** A bill introduced in Parliament by an MP who is not a member of the government. These bills often have a low success rate due to limited parliamentary time and government priorities.\n\n* **Lok Sabha:** The lower house of the Indian Parliament, directly elected by the people. It is the more powerful house in terms of legislation.\n\n* **Rajya Sabha:** The upper house of the Indian Parliament, representing states. Its members are indirectly elected.  It has less power than the Lok Sabha in terms of legislation.\n\n* **President of India:** The head of state of India.  While the President nominates some members to the Rajya Sabha, this has no bearing on who can introduce a private member's bill.\n"
    },
    {
        "Q.No.": 2,
        "question_text": "With reference to the difference between the culture of Rigvedic Aryans and Indus Valley people, which of the following statements is/are correct?\n1. Rigvedic Aryans used the coat of mail and helmet in warfare whereas the people of Indus Valley Civilization did not leave any evidence of using them.\n2. Rigvedic Aryans knew gold, silver and copper whereas Indus Valley people knew only copper and iron.\n3. Rigvedic Aryans had domesticated the horse whereas there is no evidence of Indus Valley people having been aware of this animal.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nStatement 1 is correct.  Rigvedic Aryans, known for their warfare, used chariots, coats of mail, and helmets, as evidenced by their texts.  The Indus Valley Civilization, while possessing sophisticated weaponry like bronze axes and knives, hasn't yielded evidence of widespread use of coats of mail or helmets.\n\nStatement 2 is incorrect.  While both cultures knew copper, the Rigvedic Aryans are also known to have utilized gold and silver, whereas there's less definitive evidence of the Indus Valley Civilization using gold and silver extensively.  Furthermore, the Indus Valley Civilization did use copper but there is no evidence of the use of iron.\n\nStatement 3 is correct.  The Rigvedic Aryans domesticated the horse and used it extensively in warfare and transportation, as reflected in their literature.  There's little to no evidence of horse domestication or use in the Indus Valley Civilization.\n\nTherefore, only statements 1 and 3 are correct.\n\n\n**Short notes on keywords and named entities:**\n\n* **Rigvedic Aryans:** An Indo-European people who migrated to the Indian subcontinent around 1500 BCE. Their culture is primarily known through the Rigveda, the oldest known Vedic Sanskrit text.  They were pastoralists and warriors, known for their use of chariots and sophisticated weaponry.  Their society was patriarchal.\n\n* **Indus Valley Civilization:** Also known as the Harappan Civilization, this Bronze Age civilization flourished in the Indus River valley from around 3300 to 1300 BCE.  They were known for their advanced urban planning, standardized weights and measures, and sophisticated craftsmanship.  Their writing system remains undeciphered.\n\n* **Rigveda:** The oldest of the four Vedas, a collection of hymns, prayers, and rituals composed in Vedic Sanskrit. It provides crucial insights into the religious beliefs, social structures, and lifestyle of the early Indo-Aryans.\n\n* **Vedas:** A collection of ancient Sanskrit texts that form the foundation of Hinduism. They contain hymns, prayers, rituals, and philosophical treatises.\n\n* **Indo-European languages:** A large family of related languages spoken across a wide geographical area, including Europe, parts of Asia, and the Indian subcontinent.  The Rigvedic Sanskrit is considered an early Indo-European language.\n\n* **Horse:**  A domesticated animal used for transportation, warfare, and agricultural purposes.  Its domestication played a significant role in the expansion and military success of the Rigvedic Aryans.\n\n* **Coat of mail:** Body armor made of overlapping metal plates or rings, providing protection in warfare.\n\n* **Helmet:** Protective headgear worn in warfare.\n"
    },
    {
        "Q.No.": 3,
        "question_text": "'Recognition of Prior Learning Scheme' is sometimes mentioned in the news with reference to",
        "option_a": "Certifying the skills acquired by construction workers through traditional channels.",
        "option_b": "Enrolling the persons in Universities for distance learning programmes.",
        "option_c": "Reserving some skilled jobs to rural and urban poor in some public sector undertakings.",
        "option_d": "Certifying the skills acquired by trainees under the National Skill Development Programme.",
        "correct_option": "a",
        "subject": "environment",
        "year": 2017,
        "explanation": "```text\ncorrect_option: (a)\nexplanation:The Recognition of Prior Learning (RPL) scheme is designed to formally acknowledge and certify skills acquired through non-traditional channels.  Option (a) directly relates to this by mentioning the certification of skills acquired by construction workers through traditional (on-the-job) methods.  The other options are not directly related to RPL.  RPL is about validating existing skills, not about university enrollment (b), job reservation (c), or solely focusing on National Skill Development Programme trainees (d), though it could be a component of such programs.\n\nNational Skill Development Programme: A government initiative aimed at enhancing the skills of the Indian workforce.\n\nRecognition of Prior Learning (RPL): A system that formally assesses and certifies skills and knowledge acquired outside formal educational settings, such as through work experience or informal training.  It aims to provide formal qualifications for individuals who already possess the necessary skills.\n\nConstruction workers: Individuals employed in the construction industry, often acquiring skills through apprenticeships or on-the-job training rather than formal vocational education.  Their skills are often practical and hands-on.\n```\n"
    },
    {
        "Q.No.": 4,
        "question_text": "From the ecological point of view, which one of the following assumes importance in being a good link between the Eastern Ghats and the Western Ghats?",
        "option_a": "Sathyamangalam Tiger Reserve",
        "option_b": "Nallamala Forest",
        "option_c": "Nagarhole National Park",
        "option_d": "Seshachalam Biosphere Reserve",
        "correct_option": "a",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:The Sathyamangalam Tiger Reserve acts as an important ecological link between the Eastern and Western Ghats.  It's a crucial wildlife corridor allowing for gene flow and movement of animal populations between these two mountain ranges.\n\nSathyamangalam Tiger Reserve: A protected area in the Eastern Ghats of Tamil Nadu, India, known for its tiger population and diverse flora and fauna.  It plays a vital role in the connectivity of wildlife habitats.\n\nNallamala Forest: A part of the Eastern Ghats in Andhra Pradesh, India, known for its rich biodiversity.  While important for conservation, its role in connecting the Eastern and Western Ghats is less significant compared to Sathyamangalam.\n\nNagarhole National Park: Located in the Western Ghats of Karnataka, India, this national park is renowned for its tiger population and diverse ecosystem. It is not a direct link between the two Ghats.\n\nSeshachalam Biosphere Reserve: Situated in the Eastern Ghats of Andhra Pradesh, India,  this reserve is known for its unique flora and fauna.  It is not a primary corridor connecting the two Ghats.\n"
    },
    {
        "Q.No.": 5,
        "question_text": "One of the implications of equality in society is the absence of",
        "option_a": "Privileges",
        "option_b": "Restraints",
        "option_c": "Competition",
        "option_d": "Ideology",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation: Equality before the law implies the absence of special privileges.  Privileges grant special rights or advantages to certain individuals or groups, contradicting the principle of equal treatment under the law.  Restraints, competition, and ideology are not inherently incompatible with equality.  Equality before the law, a concept originating in Britain, has two main components:  absence of special privileges and equal subjection to ordinary law.  Equality under the law (an American concept) focuses on equal treatment under equal circumstances.  Both concepts aim to ensure that all persons are subject to the same laws and treated equally.  Wealth inequality, gender inequality, and low social mobility are consequences of unequal societies.  Article 14 of the Constitution of India includes legal persons (statutory corporations, companies, registered societies etc.) within the definition of \"person\", reflecting the principle of equality.  Articles 325 and 43D also relate to the concept of equality. CEDAW (Convention on the Elimination of All Forms of Discrimination Against Women) and Beijing Platform for Action (1995) are international instruments promoting gender equality.  The concept of equality also includes the right to full speech, enabling the expression of ideas without censorship.\n"
    },
    {
        "Q.No.": 6,
        "question_text": "Consider the following statements in respect of Trade Related Analysis of Fauna and Flora in Commerce (TRAFFIC):\n1. TRAFFIC is a bureau under United Nations Environment Programme (UNEP).\n2. The mission of TRAFFIC is to ensure that trade in wild plants and animals is not a threat to the conservation of nature.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: TRAFFIC (Trade Records Analysis of Flora and Fauna in Commerce) is not a bureau under the United Nations Environment Programme (UNEP).  It is a wildlife trade monitoring network.  Its mission is indeed to ensure that trade in wild plants and animals is not a threat to the conservation of nature.  Therefore, only statement 2 is correct.\n\nTRAFFIC:  A wildlife trade monitoring network working globally to ensure that trade in wild plants and animals is sustainable. It uses data and research to influence policy and practice to protect species.\n\nUNEP (United Nations Environment Programme): A leading global environmental authority that sets the global environmental agenda, promotes the coherent implementation of the environmental dimension of sustainable development within the UN system, and serves as an authoritative advocate for the global environment.\n\nWTO (World Trade Organization): An intergovernmental organization that regulates international trade and encourages the reduction of trade barriers.  The Uruguay Round, mentioned in the context, significantly impacted intellectual property rights (IP) within international trade.\n\nTRIPS (Agreement on Trade-Related Aspects of Intellectual Property Rights):  An international legal agreement administered by the WTO. It sets minimum standards for the protection of intellectual property rights (including patents, trademarks, and copyrights) for members.  It includes provisions for compulsory licensing, allowing the production of patented goods without the patent holder's consent under certain circumstances (e.g., public health emergencies).\n\nWHO (World Health Organization): A specialized agency of the United Nations responsible for international public health.  The context mentions minimum standards of protection that WHO members should follow, and the importance of data sharing and equitable distribution of vaccines and drugs in pandemic situations.\n\nCOVAX:  A global initiative aimed at equitable access to COVID-19 vaccines.  It highlights the importance of global collaboration in addressing health crises.\n\nEIA (Environmental Impact Assessment): A process of evaluating the likely environmental impacts of a proposed project or development, taking into account inter-related socio-economic, cultural and human-health impacts, both beneficial and adverse.  The context mentions its use in India in relation to river valley projects.\n\nIP (Intellectual Property):  The legal rights given to the creators of original works, including inventions, literary and artistic works, designs and symbols, names, and images used in commerce.  The context mentions its role in international trade and the challenges related to its protection in the context of bio-scanning and tools.\n\nPandemic Treaty: An ongoing negotiation to establish a legally binding agreement to improve global preparedness and response to future pandemics.  The context highlights differing views among nations regarding its legal binding nature.\n"
    },
    {
        "Q.No.": 7,
        "question_text": "Which principle among the following was added to the Directive Principles of State Policy by the 42nd Amendment to the Constitution?",
        "option_a": "Equal pay for equal work for both men and women",
        "option_b": "Participation of workers in the management of industries",
        "option_c": "Right to work, education and public assistance",
        "option_d": "Securing living wage and human conditions of work to workers",
        "correct_option": "a",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation: The 42nd Amendment to the Indian Constitution added the principle of \"Equal pay for equal work for both men and women\" to the Directive Principles of State Policy.  \n\nDirective Principles of State Policy:  These are guidelines for the state to follow when making laws and policies. They are not legally enforceable like Fundamental Rights, but they serve as a moral compass for governance and aim to create a just and equitable society.\n\nEqual pay for equal work: This principle ensures that individuals performing the same job receive the same remuneration regardless of gender.  It aims to eliminate gender-based wage disparities.  \n\nThe other options were not added by the 42nd Amendment. While participation of workers in management, the right to work, education, and public assistance, and securing a living wage are all important social and economic goals reflected in the Directive Principles, they were not specifically added by the 42nd Amendment.\n"
    },
    {
        "Q.No.": 8,
        "question_text": "Which one of the following statements is correct?",
        "option_a": "Rights are claims of the State against the citizens.",
        "option_b": "Rights are privileges which are incorporated in the Constitution of a State.",
        "option_c": "Rights are claims of the citizens against the State.",
        "option_d": "Rights are privileges of a few citizens against the many.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "* **correct_option:** (c)\n* **explanation:** Rights are claims that individuals or groups have against the state or other individuals.  Option (c) accurately reflects this definition.  Option (a) is incorrect because rights are not claims *of* the state against citizens; rather, they are limitations on the state's power. Option (b) is partially correct in that some rights are enshrined in a state's constitution, but it doesn't fully capture the essence of a right as a claim. Option (d) is incorrect as rights are not privileges held by a few against the many; rather, they are fundamental entitlements that ideally apply equally to all citizens.\n\n\n**Short notes on keywords and entities:**\n\n* **Rights:**  Fundamental entitlements or claims that individuals or groups possess, often protected by law or constitution.  They limit the power of the state and ensure individual freedoms and liberties. Rights can be civil, political, economic, social, or cultural.\n\n* **State:**  In this context, it refers to the government and its various institutions, including the legislature, executive, and judiciary. It represents the entity that is subject to the limitations imposed by citizens' rights.\n\n* **Citizens:** Members of a state or nation who are entitled to certain rights and responsibilities.  Citizenship often implies a legal connection to a country, granting them certain protections and obligations.\n\n* **Constitution:** A set of fundamental principles or established precedents according to which a state or other organization is acknowledged to be governed.  It outlines the structure of government, defines the rights and responsibilities of citizens, and sets limits on the power of the state.\n\n* **Privileges:** Special rights, advantages, or immunities granted to a particular person or group, often not shared by others.  Unlike rights, privileges are not necessarily fundamental or guaranteed.\n\n* **Fundamental Rights (FRs):**  Basic human rights guaranteed by a constitution or law, typically including rights such as freedom of speech, religion, and assembly, as well as protections against discrimination and arbitrary arrest.  These are usually justiciable, meaning they can be enforced in court.\n\n* **Justiciable:**  Capable of being decided in a court of law.  A justiciable right is one that can be brought before a court for enforcement.\n\n\n"
    },
    {
        "Q.No.": 9,
        "question_text": "Which of the following gives ‘Global Gender Gap Index’ ranking to the countries of the world?",
        "option_a": "World Economic Forum",
        "option_b": "UN Human Rights Council",
        "option_c": "UN Women",
        "option_d": "World Health Organization",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:The World Economic Forum (WEF) publishes the Global Gender Gap Report, which ranks countries based on their performance across four pillars: economic participation and opportunity, educational attainment, health and survival, and political empowerment.  The UN Human Rights Council (UNHRC) is a UN body responsible for promoting and protecting human rights globally. UN Women is a UN entity dedicated to gender equality and women's empowerment. The World Health Organization (WHO) is a specialized agency of the UN focused on international public health.  The four pillars mentioned in the context of human development (equity, sustainability, producing, empowerment) are relevant to the Global Gender Gap Index, as it assesses the progress made towards gender equality in these areas.  The different approaches to human development (income, welfare, basic needs, capability) offer various perspectives on measuring well-being, which could inform the creation of indices like the Global Gender Gap Index.  The Human Development Index (HDI) is a composite statistic of life expectancy, education, and per capita income indicators, used to rank countries by level of human development.  The Gender Inequality Index (GII) measures gender inequalities in reproductive health, empowerment, and economic status.  The provided text does not contain any further information related to the Global Gender Gap Index.\n"
    },
    {
        "Q.No.": 10,
        "question_text": "Which of the following statements is/are correct regarding Smart India Hackathon 2017?\n1. It is a centrally sponsored scheme for developing every city of our country into Smart Cities in a decade.\n2. It is an initiative to identify new digital technology innovations for solving the many problems faced by our country.\n3. It is a programme aimed at making all the financial transactions in our country completely digital in a decade.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "2 and 3 only",
        "correct_option": "b",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: Smart India Hackathon 2017 was an initiative to identify new digital technology innovations for solving problems faced by India.  It was not a centrally sponsored scheme for developing smart cities or aimed at making all financial transactions digital. Therefore, only statement 2 is correct.\n\nSmart India Hackathon: A nationwide initiative to find innovative digital solutions to various problems in India.  It encourages students and professionals to collaborate and develop technology-based solutions.\n\nStatement 1: Incorrect.  This describes a different government program focused on urban development.\n\nStatement 3: Incorrect. This describes a different government goal related to financial technology.\n"
    },
    {
        "Q.No.": 11,
        "question_text": "Which of the following statements is/are correct regarding the Monetary Policy Committee (MPC)?\n1. It decides the RBI’s benchmark interest rates.\n2. It is a 12-member body including the Governor of RBI and is reconstituted every year.\n3. It functions under the chairmanship of the Union Finance Minister.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "2 and 3 only",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:The Monetary Policy Committee (MPC) is the body responsible for deciding the monetary policy of India.  Statement 1 is correct: The MPC's primary function is to set the benchmark interest rates (repo rate, reverse repo rate, etc.) for the Reserve Bank of India (RBI).  Statement 2 is incorrect: The MPC has six members, not twelve.  It includes the Governor of the RBI as its Chairperson and the Deputy Governor of the RBI as its member. It is not reconstituted every year. Statement 3 is incorrect:  The MPC functions under the chairmanship of the Governor of the RBI, not the Union Finance Minister.\n\nReserve Bank of India (RBI): The central bank of India, responsible for managing the country's monetary policy and currency.  It plays a crucial role in maintaining financial stability and regulating the banking system.\n\nMonetary Policy Committee (MPC): A committee within the RBI responsible for setting interest rates and managing the money supply to achieve macroeconomic objectives like price stability and economic growth.  Its decisions directly impact borrowing costs and influence inflation.\n\nUnion Finance Minister: The head of the Indian Ministry of Finance, responsible for formulating and implementing the nation's financial policies, including the budget and taxation.  While the Finance Minister plays a role in overall economic policy, they do not chair the MPC.\n"
    },
    {
        "Q.No.": 12,
        "question_text": "With reference to Manipuri Sankirtana, consider the following statements:\n1. It is a song and dance performance.\n2. Cymbals are the only musical instruments used in the performance.\n3. It is performed to narrate the life and deeds of Lord Krishna.\nWhich of the statements given above is/are correct?",
        "option_a": "1, 2 and 3",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1 only",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation: Manipuri Sankirtana is a song and dance performance that narrates the life and deeds of Lord Krishna.  Statement 1 is correct. Statement 2 is incorrect because while cymbals are used, other instruments are also employed in the performance. Statement 3 is correct. Therefore, only statements 1 and 3 are correct.\n\n\nManipuri Sankirtana: A religious song and dance performance originating in Manipur, India, dedicated to Lord Krishna.  It involves devotional singing, rhythmic movements, and the use of various musical instruments, including cymbals, kartals, and mridangam.  The performances are usually part of religious festivals or celebrations.\n\nLord Krishna: A major deity in Hinduism, often depicted as a playful yet divine figure.  He is considered the eighth avatar of Vishnu and is central to many Hindu scriptures and traditions.  His life story is a rich source of inspiration for art, literature, and religious practices.\n"
    },
    {
        "Q.No.": 13,
        "question_text": "Who among the following was/were associated with the introduction of Ryotwari Settlement in India during the British rule?\n1. Lord Cornwallis\n2. Alexander Read\n3. Thomas Munro\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation:  Thomas Munro is associated with the Ryotwari Settlement, a system of land revenue collection in which individual cultivators (ryots) were assessed and paid revenue directly to the state.  Alexander Read also played a significant role in implementing the system. Lord Cornwallis is known for the Permanent Settlement, a different land revenue system.\n\n\n* **Lord Cornwallis:**  Governor-General of Bengal (1786-1793), known for the Permanent Settlement, a land revenue system that fixed the land revenue payable by zamindars in perpetuity.  This aimed to establish a stable revenue base for the British East India Company.\n\n* **Alexander Read:**  A key figure in the implementation of the Ryotwari system in Madras Presidency. He was instrumental in developing the detailed procedures and regulations for its functioning.\n\n* **Thomas Munro:**  Governor of Madras (1820-1827), considered the architect of the Ryotwari system. He refined and expanded its application, making it a significant feature of British land revenue administration in southern India.  His approach emphasized direct assessment of individual cultivators.\n\n* **Ryotwari Settlement:** A land revenue system implemented by the British in parts of India, primarily in the Madras Presidency and Bombay Presidency.  It involved direct assessment and collection of land revenue from individual peasant cultivators (ryots), unlike the zamindari system.\n"
    },
    {
        "Q.No.": 14,
        "question_text": "In the context of solving pollution problems, what is/are the advantage/advantages of bioremediation technique ?\n1. It is a technique for cleaning up pollution by enhancing the same biodegradation process that occurs in nature.\n2. Any contaminant with heavy metals such as cadmium and lead can be readily and completely treated by bioremediation using microorganisms.\n3. Genetic engineering can be used to create microorganisms specifically designed for bioremediation.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct as bioremediation uses naturally occurring biological processes to break down pollutants.  Statement 2 is incorrect; bioremediation is not always effective for all heavy metals. While microorganisms can be used to treat some heavy metal contamination, the process is complex, and complete treatment is not always guaranteed. The effectiveness depends on various factors, including the type of metal, its concentration, and the environmental conditions. Statement 3 is correct; genetic engineering is a valuable tool to enhance the efficiency of bioremediation by creating microorganisms with specific capabilities to degrade pollutants. Therefore, only statements 1 and 3 are correct.\n"
    },
    {
        "Q.No.": 15,
        "question_text": "The Trade Disputes Act of 1929 provided for",
        "option_a": "the participation of workers in the management of industries.",
        "option_b": "arbitrary powers to the management to quell industrial disputes.",
        "option_c": "an intervention by the British Court in the event of a trade dispute.",
        "option_d": "a system of tribunals and a ban on strikes.",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation:The Trade Disputes Act of 1929 aimed to establish a system of tribunals to resolve industrial disputes and, significantly, banned strikes in essential public utility services.  This contrasts with options (a), (b), and (c). Option (a) is incorrect as the act didn't involve worker participation in management. Option (b) is inaccurate because while the act aimed at controlling disputes, it didn't grant arbitrary powers to management. Option (c) is wrong as British court intervention wasn't a central feature of the act.  The act primarily focused on setting up a mechanism for dispute resolution through tribunals and restricting strikes in key sectors.\n\n\n**Short Notes:**\n\n* **Trade Disputes Act 1929:** This act was a response to growing industrial unrest in British India. It attempted to regulate trade disputes through the establishment of tribunals and boards of conciliation and arbitration.  A key feature was the prohibition of strikes in essential services. The act reflected the colonial government's desire to maintain order and control during a period of rising labor activism.\n\n* **Strikes:** Organized work stoppages by employees to pressure employers to meet demands regarding wages, working conditions, or other employment-related issues.  In the context of the 1920s and 1930s in India, strikes were a key tool used by workers to express grievances and advocate for better treatment. The Trade Disputes Act aimed to limit the use of strikes.\n\n* **Bombay textile mill strike (1928):** This major strike highlighted the growing militancy of Indian workers and the influence of communist ideology within the labor movement.  The strike involved thousands of workers and demonstrated the power of collective action in challenging colonial rule.\n\n* **S.A. Dange:** A prominent communist leader in India during the early 20th century. He played a significant role in organizing workers and advocating for their rights. His involvement in the labor movement reflects the growing influence of communist ideas in India during this period.\n\n* **Public Safety Ordinance (1929):**  This ordinance was likely enacted by the British colonial government as a response to escalating industrial unrest and political activism. It likely granted the government additional powers to suppress dissent and maintain order.\n\n* **Meerut Conspiracy Case (1929):** This case involved the arrest of numerous labor leaders, highlighting the British government's efforts to suppress communist and nationalist movements.  The arrests were part of a broader strategy to curtail labor activism and maintain colonial control.\n\n* **AITUC (All India Trade Union Congress):**  Founded in 1920, the AITUC was the first major national trade union federation in India. It played a significant role in organizing workers and advocating for their rights.  Lala Lajpat Rai's involvement as its first president reflects the connection between the nationalist movement and the labor movement.\n\n* **Trade Union Act 1926:**  This Act legally recognized trade unions in India, providing them with a framework for registration and operation.  This was a significant step towards establishing a legal basis for collective bargaining and worker representation.\n\n* **Comintern (Communist International):**  An international organization that sought to coordinate the activities of communist parties around the world.  Its influence on the Indian labor movement is evident in the rise of communist-led unions and strikes during the 1920s and 1930s.\n\n* **IIU (International Labour Union):**  This likely refers to the International Labour Organisation (ILO).  The ILO's goals include promoting social justice and internationally recognized labor standards. Its existence provided a global framework for discussions about labor rights and working conditions.\n\n* **World Trade Organisation (WTO):** Established in 1995, the WTO is an intergovernmental organization that regulates international trade. It was formed from the Uruguay Round negotiations, which aimed to create a more fair and market-oriented global trading system.\n\n\n* **Uruguay Round:** A series of trade negotiations that led to the creation of the World Trade Organization (WTO).  It aimed to reduce trade barriers and create a more liberalized global trading system.  The round addressed various aspects of trade, including agriculture, and included special provisions for developing countries.\n\n* **Green Box, Amber Box, Blue Box:** These are categories created by the Uruguay Round to classify different types of agricultural support provided by governments.  The categorization reflects an attempt to distinguish between support measures that have minimal trade-distorting effects and those that significantly distort trade.\n"
    },
    {
        "Q.No.": 16,
        "question_text": "Local self-government can be best explained as an exercise in",
        "option_a": "Federalism",
        "option_b": "Democratic decentralisation",
        "option_c": "Administrative delegation",
        "option_d": "Direct democracy",
        "correct_option": "b",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:Local self-government is best explained as democratic decentralization.  It involves the distribution of power from central government to local levels, empowering citizens at the grassroots to participate in decision-making processes that directly affect their communities.  This contrasts with federalism, which is a division of power between different levels of government (national, state, etc.), administrative delegation, which involves assigning tasks from a higher authority to a lower one without necessarily involving citizen participation, and direct democracy, which involves citizens directly making decisions without elected representatives.\n\nFederalism is a system of government where power is divided between a central government and regional governments (states, provinces, etc.).  A key feature is the constitutional distribution of powers.  The Indian federation, though initially aiming for a more federal structure, has evolved with a centralizing tendency.  The 1935 Government of India Act introduced a federal scheme, but concerns about disunity and secessionist tendencies led to a less decentralized system in independent India.  The asymmetric nature of Indian federalism reflects the varying degrees of autonomy granted to different states.\n\nDemocratic decentralization is a process by which power is devolved from central government to local levels, empowering local communities and increasing citizen participation in governance.  It aims to improve governance, enhance accountability, and promote local development.\n\nAdministrative delegation involves assigning tasks or responsibilities from a higher authority to a lower one. It is a hierarchical process focused on efficiency and effectiveness of administration, not necessarily involving citizen participation.\n\nDirect democracy is a form of government where citizens directly participate in decision-making without elected representatives. It is usually implemented at the local level due to practicality limitations in larger populations.\n"
    },
    {
        "Q.No.": 17,
        "question_text": "Consider the following statements:\nWith reference to the Constitution of India, the Directive Principles of State Policy constitute limitations upon\n1. legislative function.\n2. executive function.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: Directive Principles of State Policy (DPSPs) in the Indian Constitution are guidelines for the government to strive towards, but they are not legally enforceable like Fundamental Rights.  However, they influence the functioning of both the legislature and the executive.  The legislature must consider DPSPs when making laws, and the executive must strive to implement policies that align with them. Therefore, they indirectly constitute limitations on both legislative and executive functions.\n\nWhile courts cannot directly enforce DPSPs, they can influence government actions by interpreting laws and policies in light of the principles enshrined in DPSPs.  The government's actions can be challenged if they are demonstrably contrary to the spirit and intent of DPSPs.\n\nConstitution of India: The supreme law of India, outlining the framework of government, fundamental rights, and directive principles.\n\nDirective Principles of State Policy:  Non-justiciable provisions in the Indian Constitution that guide the state in formulating policies for social and economic justice.  They are aspirational goals rather than legally binding obligations.\n\nLegislative function: The process of making laws by the legislature (Parliament and State Legislatures).\n\nExecutive function: The implementation of laws and policies by the executive branch (Government).\n"
    },
    {
        "Q.No.": 18,
        "question_text": "The term 'Digital Single Market Strategy' seen in the news refers to",
        "option_a": "ASEAN",
        "option_b": "BRICS",
        "option_c": "EU",
        "option_d": "G20",
        "correct_option": "c",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: The Digital Single Market Strategy is a major initiative of the European Union (EU).  The EU aims to create a unified digital market within its member states, removing barriers to the free flow of digital goods and services.  This involves harmonizing regulations, improving digital infrastructure, and promoting competition.\n\nASEAN (Association of Southeast Asian Nations) is a political and economic organization of countries in Southeast Asia. BRICS (Brazil, Russia, India, China, and South Africa) is a group of emerging economies.  The G20 (Group of Twenty) is an intergovernmental forum comprising 19 countries and the European Union.\n"
    },
    {
        "Q.No.": 19,
        "question_text": "At one of the places in India, if you stand on the seashore and watch the sea, you will find that the sea water recedes from the shore line a few kilometres and comes back to the shore, twice a day, and you can actually walk on the sea floor when the water recedes. This unique phenomenon is seen at",
        "option_a": "Bhavnagar",
        "option_b": "Bheemunipatnam",
        "option_c": "Chandipur",
        "option_d": "Nagapattinam",
        "correct_option": "c",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: Chandipur beach in Odisha, India, is known for its unique phenomenon where the sea water recedes up to 5 kilometers during low tide, exposing a large expanse of the sea bed.  This happens twice a day due to the unique geographical features of the Bay of Bengal in that area.  Bhavnagar, Bheemunipatnam, and Nagapattinam are coastal towns in India but do not exhibit this specific phenomenon to the same extent.\n\nBhavnagar is a city in Gujarat, located on the Gulf of Khambhat.  Bheemunipatnam is a coastal town in Andhra Pradesh. Nagapattinam is a port city in Tamil Nadu.  These locations have typical tidal patterns but not the extreme receding of the sea like Chandipur.\n"
    },
    {
        "Q.No.": 20,
        "question_text": "With reference to the 'Prohibition of Benami Property Transactions Act, 1988 (PBPT Act)', consider the following statements:\n1. A property transaction is not treated as a benami transaction if the owner of the property is not aware of the transaction.\n2. Properties held benami are liable for confiscation by the Government.\n3. The Act provides for three authorities for investigations but does not provide for any appellate mechanism.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "2 and 3 only",
        "correct_option": "b",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  The PBPT Act defines a benami transaction as one where the property is held by a person other than the real owner, even if the real owner is unaware of the transaction.  The Act focuses on the beneficial ownership, not the knowledge of the actual owner.\n\nStatement 2 is correct. The Act empowers the government to confiscate benami properties.\n\nStatement 3 is incorrect. The Act does specify an appellate mechanism.  The adjudicating authority's decision can be appealed to the appellate tribunal and further to the High Court.\n\n\n**Short notes on keywords and named entities:**\n\n**Prohibition of Benami Property Transactions Act, 1988 (PBPT Act):** This Act aims to curb illegal transactions where property is held in the name of a person other than the actual owner (benami).  It seeks to prevent money laundering, tax evasion, and other illegal activities related to property ownership.  The Act defines benami transactions, outlines procedures for investigation and confiscation, and provides for appellate mechanisms.\n\n"
    },
    {
        "Q.No.": 21,
        "question_text": "Due to some reasons, if there is a huge fall in the population of species of butterflies, what could be its likely consequence/consequences?\n1. Pollination of some plants could be adversely affected.\n2. There could be a drastic increase in the fungal infections of some cultivated plants.\n3. It could lead to a fall in the population of some species of wasps, spiders and birds.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: A decline in butterfly populations would have several consequences.  Butterflies are important pollinators for many plants (1), so their reduction would negatively impact plant reproduction and potentially food production.  Butterflies are also a food source for various animals, including wasps, spiders, and birds (3). A decrease in butterfly numbers would likely lead to a decline in the populations of these predators.  There is no direct causal link between butterfly populations and fungal infections of plants (2), so this option is incorrect.  Therefore, only options 1 and 3 are correct consequences of a significant butterfly population decline.\n\nButterflies:  Butterflies are insects belonging to the order Lepidoptera, known for their colorful wings and role in pollination. They undergo complete metamorphosis. Many species are highly specialized in their food plants and habitats.\n\nWasps:  Wasps are flying insects with a narrow waist and often a stinging ability.  They are diverse, with some species being parasitic, others predatory, and some social.\n\nSpiders: Spiders are eight-legged arachnids that are mostly predatory, feeding on insects and other small invertebrates.  They play a crucial role in controlling insect populations.\n\nBirds: Birds are warm-blooded vertebrates characterized by feathers, wings, and beaks. They occupy diverse ecological niches and play various roles in ecosystems.\n\nPollination: Pollination is the process of transferring pollen grains from the anther of a flower to the stigma, enabling fertilization and seed production. It is essential for the reproduction of many plants.  Many animals, including insects like butterflies, are crucial pollinators.\n\nFungal infections: Fungal infections in plants can be caused by various fungal pathogens, leading to reduced growth, yield loss, and even plant death.  These infections are often influenced by environmental factors and plant health.\n"
    },
    {
        "Q.No.": 22,
        "question_text": "It is possible to produce algae based biofuels, but what is/are the likely limitation(s) of developing countries in promoting this industry?\n1. Production of algae based biofuels is possible in seas only and not on continents.\n2. Setting up and engineering the algae based biofuel production requires high level of expertise/technology until the construction is completed.\n3. Economically viable production necessitates the setting up of large scale facilities which may raise ecological and social concerns.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:Developing countries face several limitations in promoting algae-based biofuel industries.  Statement 1 is incorrect; algae cultivation isn't limited to seas; it can be done in ponds and other controlled environments on land. However, statements 2 and 3 highlight significant challenges.  Setting up algae biofuel production requires advanced technology and expertise, which developing countries may lack (statement 2).  Economically viable production necessitates large-scale facilities, potentially leading to ecological damage and social disruption due to land use and resource competition (statement 3).  Therefore, the limitations are primarily related to technological and economic factors as well as potential environmental and social impacts of large-scale operations.\n\nAlgae: Photosynthetic organisms used as a feedstock for biofuels.  Their cultivation requires specific environmental conditions and technology.\n\nBiofuels: Liquid transportation fuels derived from biomass.  They offer an alternative to fossil fuels but face production challenges.\n\nDeveloping countries: Nations with lower economic output and often limited access to advanced technologies and resources.  They face unique challenges in adopting new industries.\n"
    },
    {
        "Q.No.": 23,
        "question_text": "Which of the following are the objectives of 'National Nutrition Mission'?\n1. To create awareness relating to malnutrition among pregnant women and lactating mothers.\n2. To reduce the incidence of anaemia among young children, adolescent girls and women.\n3. To promote the consumption of millets, coarse cereals and unpolished rice.\n4. To promote the consumption of poultry eggs.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "1, 2 and 3 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "3 and 4 only",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:The National Nutrition Mission (Poshan Abhiyaan) aims to improve nutritional outcomes for children, pregnant women, and lactating mothers.  Objectives include raising awareness about malnutrition (1), reducing anaemia (2), and improving nutritional status overall. While promoting specific foods like millets or poultry eggs might be strategies employed, they aren't explicitly stated primary objectives of the mission. The focus is on broader nutritional improvements and combating deficiencies.\n\nNational Nutrition Mission (Poshan Abhiyaan): A flagship program under the Ministry of Women and Child Development, aimed at reducing stunting, undernutrition, and low birth weight among children, women, and adolescent girls.  It focuses on a holistic approach to nutrition, encompassing awareness, improved dietary practices, and access to healthcare services.\n\nAnaemia: A condition characterized by a deficiency of red blood cells or hemoglobin in the blood, resulting in pallor and fatigue.  It is a significant public health problem, particularly among women and children.\n\nPregnant women and lactating mothers: These groups have heightened nutritional needs to support fetal development and milk production.  Malnutrition during these periods can have severe consequences for both mother and child.\n\nMillets and coarse cereals: These are nutrient-rich grains that are often overlooked in favor of refined grains.  Promoting their consumption can contribute to improved dietary diversity and nutrient intake.  Unpolished rice is also a better source of nutrients compared to polished white rice.\n\nPoultry eggs: A good source of protein and essential nutrients, including vitamins and minerals.  However, the consumption of eggs is not a primary focus of the National Nutrition Mission.  The mission focuses on a diverse and balanced diet.\n"
    },
    {
        "Q.No.": 24,
        "question_text": "Consider the following statements:\n1. The Factories Act, 1881 was passed with a view to fix the wages of industrial workers and to allow the workers to form trade unions.\n2. N.M. Lokhande was a pioneer in organizing the labour movement in British India.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. The Factories Act of 1881 primarily aimed to regulate working conditions in factories, particularly concerning child labor and working hours. It did not directly address wage fixing or the formation of trade unions.  Statement 2 is correct. N.M. Lokhande was a prominent figure in the early labour movement in British India, playing a significant role in organizing workers and advocating for their rights.\n\nN.M. Lokhande: A prominent figure in the early Indian labour movement,  Lokhande is known for his efforts in organizing workers, advocating for better working conditions, and raising awareness about workers' rights during the late 19th and early 20th centuries in British India.  His work laid the foundation for future labour movements in the country.\n\nFactories Act, 1881: This act was a landmark piece of legislation in British India aimed at improving working conditions in factories.  While it didn't address wages or unions directly, it represented a crucial step toward regulating industrial labor practices and protecting workers, particularly children, from exploitation.\n"
    },
    {
        "Q.No.": 25,
        "question_text": "In the context of mitigating the impending global warming due to anthropogenic emissions of carbon dioxide, which of the following can be the potential sites for carbon sequestration?\n1. Abandoned and uneconomic coal seams\n2. Depleted oil and gas reservoirs\n3. Subterranean deep saline formations\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:Abandoned and uneconomic coal seams, depleted oil and gas reservoirs, and subterranean deep saline formations are all potential sites for carbon sequestration.  Carbon sequestration is the process of capturing and storing atmospheric carbon dioxide.  Coal seams, oil and gas reservoirs, and deep saline formations can act as storage sites for injected CO2.  The CO2 is trapped within the geological formations, preventing its release into the atmosphere.  This helps to mitigate global warming caused by anthropogenic (human-caused) CO2 emissions.\n\n* **anthropogenic emissions:** Emissions resulting from human activities, such as burning fossil fuels, deforestation, and industrial processes. These are the primary driver of current climate change.\n\n* **carbon sequestration:** The process of capturing and storing atmospheric carbon dioxide. This can be achieved through natural processes or technological methods.  It is a crucial strategy for mitigating climate change.\n\n* **abandoned and uneconomic coal seams:**  These are underground coal deposits that are no longer profitable to mine. They offer large, porous spaces suitable for CO2 storage.\n\n* **depleted oil and gas reservoirs:** These are underground rock formations that have been used to extract oil and natural gas.  The empty spaces can be used to store CO2.\n\n* **subterranean deep saline formations:** These are vast underground formations containing saline (salty) water.  They represent a large potential storage capacity for CO2.\n"
    },
    {
        "Q.No.": 26,
        "question_text": "The object of the Butler Committee of 1927 was to",
        "option_a": "Define the jurisdiction of the Central and Provincial Governments.",
        "option_b": "Define the powers of the Secretary of State for India.",
        "option_c": "Impose censorship on national press.",
        "option_d": "Improve the relationship between the Government of India and the Indian States.",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation:The Butler Committee of 1927 was appointed to improve the relationship between the Government of India and the Indian States.  The committee aimed to address issues of governance and jurisdiction concerning the princely states within the British Indian Empire.\n\n**Short Notes:**\n\n* **Butler Committee (1927):**  A committee appointed by the British Indian government to examine the relationship between the British Indian government and the princely states. Its primary objective was to resolve issues of governance and jurisdiction.\n\n* **Government of India:** The British administration ruling over British India. This administration had limited self-governance in the early 20th century.\n\n* **Indian States:**  Princely states were territories within the Indian subcontinent that were ruled by native Indian rulers who maintained a degree of autonomy under British paramountcy (British supremacy).  Their relationship with the British government was complex and often fraught with tension.\n\n* **Secretary of State for India:**  A member of the British Cabinet responsible for overseeing the administration of British India.  The office held significant power over the Indian government.  The office was later abolished.\n\n\n"
    },
    {
        "Q.No.": 27,
        "question_text": "The term ‘Domestic Content Requirement’ is sometimes seen in the news with reference to",
        "option_a": "Developing solar power production in our country",
        "option_b": "Granting licences to foreign T.V. channels in our country",
        "option_c": "Exporting our food products to other countries",
        "option_d": "Permitting foreign educational institutions to set up their campuses in our country",
        "correct_option": "a",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:Domestic Content Requirements (DCRs) mandate that a certain percentage of a product's components or manufacturing processes must originate domestically.  This is often seen in developing industries to promote local production and reduce reliance on imports.  Developing solar power production frequently involves DCRs to support the growth of domestic solar manufacturing and reduce reliance on foreign technology and components.\n\nLicensing foreign TV channels (b) is primarily governed by broadcasting regulations and not necessarily DCRs. Exporting food products (c) focuses on international trade, with regulations concerning food safety and quality standards rather than domestic content.  Permitting foreign educational institutions (d) deals with educational policies and regulations, not necessarily tied to domestic content requirements.  Therefore, (a) is the most relevant option.\n"
    },
    {
        "Q.No.": 28,
        "question_text": "Consider the following statements:\n1. The Nuclear Security Summits are periodically held under the aegis of the United Nations.\n2. The International Panel on Fissile Materials is an organ of International Atomic Energy Agency.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: Statement 1 is incorrect. The Nuclear Security Summits are not held under the aegis of the United Nations.  They were a series of summits initiated by then-U.S. President Barack Obama to strengthen global nuclear security.  Statement 2 is correct. The International Panel on Fissile Materials (IPFM) is an independent non-governmental organization, not an organ of the International Atomic Energy Agency (IAEA). However, it works closely with the IAEA and other international organizations on issues related to fissile materials.\n\nInternational Atomic Energy Agency (IAEA): The IAEA is an international organization that seeks to promote the peaceful use of nuclear energy and to prevent its use for military purposes.  It's a key player in international nuclear non-proliferation efforts, and its safeguards system is vital in verifying that nuclear materials are used only for peaceful purposes.\n\nInternational Panel on Fissile Materials (IPFM):  The IPFM is an independent, non-governmental organization that conducts research and advocacy on the control of fissile materials to prevent the production of nuclear weapons.  It provides data and analysis to inform policy discussions and promotes international cooperation on fissile material security.\n\nNuclear Security Summits:  These were a series of high-level summits held at the initiative of the U.S.  The goal was to enhance global nuclear security by focusing on preventing nuclear terrorism, securing nuclear materials, and strengthening international cooperation on nuclear safety.  The summits are no longer held.\n"
    },
    {
        "Q.No.": 29,
        "question_text": "Who among the following can join the National Pension System (NPS)?",
        "option_a": "Resident Indian citizens only",
        "option_b": "Persons of age from 21 to 55 only",
        "option_c": "All State Government employees joining the services after the date of notification by the respective State Governments",
        "option_d": "All Central Government employees including those of Armed Forces joining the services on or after 1st April, 2004",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:The National Pension System (NPS) is open to individuals aged between 21 and 55 years.  While it's primarily for Indian citizens, the options provided highlight specific groups within that broader category. Option (b) accurately reflects the age limit.\n\nNational Pension System (NPS): A defined contribution retirement savings scheme in India, offering various investment options and managed by Pension Fund Regulatory and Development Authority (PFRDA).  It aims to provide a regular income stream upon retirement.\n\nResident Indian citizens: Individuals who are Indian citizens and reside in India.\n\nState Government employees: Individuals employed by the government of a specific Indian state.\n\nCentral Government employees: Individuals employed by the central government of India, including those in the Armed Forces.\n"
    },
    {
        "Q.No.": 30,
        "question_text": "With reference to river Teesta, consider the following statements:\n1. The source of river Teesta is the same as that of Brahmaputra but it flows through Sikkim.\n2. River Rangeet originates in Sikkim and it is a tributary of river Teesta.\n3. River Teesta flows into Bay of Bengal on the border of India and Bangladesh.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nStatement 1 is incorrect. The Teesta River originates from the Pahunri glacier near the source of the Brahmaputra River, but not at the exact same point.  Both rivers have their origins in the Himalayas, but their courses diverge significantly.\n\nStatement 2 is correct. The Rangeet River, originating in Sikkim, is indeed a tributary of the Teesta River.\n\nStatement 3 is correct. The Teesta River flows into the Bay of Bengal at the India-Bangladesh border.\n\n\nShort notes on named entities:\n\n* **River Teesta:** A major trans-boundary river originating in the Himalayas and flowing through Sikkim, West Bengal (India), and Bangladesh before emptying into the Bay of Bengal.  It is known for its significant role in irrigation and hydropower generation, but also for its frequent flooding.\n\n* **Brahmaputra River:** One of Asia's major rivers, originating in Tibet (China), flowing through Arunachal Pradesh and Assam (India), and Bangladesh before reaching the Bay of Bengal.  It's a crucial river system for millions, impacting agriculture, transportation and ecosystems.\n\n* **River Rangeet:** A major tributary of the Teesta River, originating in Sikkim, India. It is also vital for hydropower in the region.\n\n* **Bay of Bengal:** A large bay in the northeastern Indian Ocean, bordered by India, Bangladesh, Myanmar, Thailand, and Sri Lanka. It's a significant body of water impacting weather patterns and maritime activity in the region.\n\n* **Sikkim:** A state in northeastern India, situated in the Himalayas.  Known for its stunning natural beauty, biodiversity, and unique culture.\n\n* **India:** A large country in South Asia, home to diverse geography, cultures, and a large population.\n\n* **Bangladesh:** A country in South Asia, bordered by India to the west, north, and east and the Bay of Bengal to the south. A densely populated nation with a largely agrarian economy heavily dependent on its river systems.\n"
    },
    {
        "Q.No.": 31,
        "question_text": "Consider the following statements:\n1. In tropical regions, Zika virus disease is transmitted by the same mosquito that transmits dengue.\n2. Sexual transmission of Zika virus disease is possible.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct.  Zika virus and dengue fever are both transmitted by *Aedes* mosquitoes, specifically *Aedes aegypti* and *Aedes albopictus*.  Statement 2 is also correct. Zika virus can be transmitted sexually through vaginal fluids and semen.\n\nZika Virus Disease: A mosquito-borne disease caused by the Zika virus, primarily transmitted through the bite of infected *Aedes* mosquitoes.  It can also be sexually transmitted.  Symptoms are often mild and include fever, rash, joint pain, and conjunctivitis.\n\nDengue: A mosquito-borne viral infection transmitted by *Aedes* mosquitoes.  Symptoms include high fever, headache, muscle and joint pain, and rash.  Severe dengue can be life-threatening.\n\n*Aedes aegypti* and *Aedes albopictus*:  Species of mosquitoes known to transmit several viruses, including Zika, dengue, chikungunya, and yellow fever. They are found in tropical and subtropical regions worldwide.  They are daytime biters and prefer to breed in stagnant water.\n"
    },
    {
        "Q.No.": 32,
        "question_text": "Consider the following statements:\n1. The Standard Mark of Bureau of Indian Standards (BIS) is mandatory for automotive tyres and tubes.\n2. AGMARK is a quality Certification Mark issued by the Food and Agriculture Organisation (FAO).\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Bureau of Indian Standards (BIS) is the national standards body of India.  The BIS certification mark is mandatory for certain products, including automotive tyres and tubes, to ensure quality and safety.  Statement 2 is incorrect. AGMARK is a quality certification mark issued by the Directorate of Marketing and Inspection (DMI), an agency under the Ministry of Agriculture & Farmers Welfare, Government of India,  not the Food and Agriculture Organisation (FAO).  The FAO is a specialized agency of the United Nations that leads international efforts to defeat hunger.  AGMARK certifies the quality of agricultural products.\n"
    },
    {
        "Q.No.": 33,
        "question_text": "What is/are the advantage/advantages of implementing the 'National Agriculture Market' scheme?\n1. It is a pan-India electronic trading portal for agricultural commodities.\n2. It provides the farmers access to nationwide market, with prices commensurate with the quality of their produce.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation:Both statements 1 and 2 are advantages of implementing the National Agriculture Market (NAM) scheme.\n\nStatement 1 is correct because NAM is indeed a pan-India electronic trading portal for agricultural commodities.  This is explicitly mentioned in the provided text. Its purpose is to connect existing Agricultural Produce Market Committees (APMCs) and other market yards to create a unified national market.\n\nStatement 2 is also correct. By providing farmers with access to a nationwide market, NAM aims to ensure that farmers receive prices commensurate with the quality of their produce. This is a key goal of the scheme, aiming to improve price discovery and realization for farmers, thereby increasing their income.  The elimination of intermediaries and enhanced transparency through the electronic platform contribute to this goal.\n\n\n**Short Notes on Named Entities:**\n\n* **National Agriculture Market (NAM):** A pan-India electronic trading portal launched to create a unified national market for agricultural commodities. It aims to improve price discovery, reduce the power of intermediaries, and increase farmer incomes by connecting them with wider markets.  It is a key component of the government's efforts to modernize agricultural marketing in India.\n\n* **Agricultural Produce Market Committees (APMCs):**  Local-level regulatory bodies that oversee agricultural marketing within their respective areas.  NAM aims to integrate these into a national network, overcoming the limitations of fragmented state-level markets.  Reforms are aimed at improving their efficiency and transparency.\n\n* **Farmers (Empowerment & Protection) Agreement on Price Assurance & Farm Services Act, 2020:** This Act aims to empower farmers by enabling them to enter into agreements with buyers for the sale of their produce, providing price assurance and streamlining the process.\n\n* **Essential Commodities (Amendments) Act, 2020:** This Act aimed to deregulate the storage and trade of most food items, except under extraordinary circumstances, to promote greater efficiency and availability.\n\n* **Agricultural Produce & Livestock Marketing (Promotion & Facilitating) Act, 2012/2017:** These Acts aim to promote and facilitate agricultural marketing, often focusing on streamlining processes and reducing restrictions on intra-state trade.\n\n* **Model APMC Act, 2003:**  A model act proposed to standardize and improve the functioning of APMCs.  However, it had limitations in creating a truly national market.\n\n* **AGMARKNET:** A C2C (consumer-to-consumer) e-governance portal intended to provide a single-window platform for agricultural marketing information and services.\n\n* **NITI Aayog:** A policy think tank of the Government of India, which has made recommendations for improving agricultural marketing, including the integration of e-trading and a unified market.\n\n\n"
    },
    {
        "Q.No.": 34,
        "question_text": "With reference to the 'National Intellectual Property Rights Policy', consider the following statements:\n1. It reiterates India's commitment to the Doha Development Agenda and the TRIPS Agreement.\n2. Department of Industrial Policy and Promotion is the nodal agency for regulating intellectual property rights in India.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation: The National Intellectual Property Rights Policy reiterates India's commitment to the Doha Development Agenda and the TRIPS Agreement.  The Department of Industrial Policy and Promotion (DIPP) is not the nodal agency for regulating intellectual property rights; that role belongs to the Department of Industrial Policy & Promotion (DIPP) in conjunction with other relevant ministries and agencies.\n\nDoha Development Agenda:  A work program of the World Trade Organization (WTO) launched in 2001, aiming to improve the trading prospects of developing countries.  Key issues include agricultural subsidies and intellectual property rights.\n\nTRIPS Agreement: The Agreement on Trade-Related Aspects of Intellectual Property Rights, a WTO agreement establishing minimum standards for the protection of intellectual property rights.  It covers patents, copyrights, trademarks, etc.\n\nDepartment of Industrial Policy and Promotion (DIPP): A department of the Indian government responsible for formulating and implementing industrial policies.  While involved in IP matters, it's not the sole regulatory body.\n"
    },
    {
        "Q.No.": 35,
        "question_text": "According to the Wildlife (Protection) Act, 1972, which of the following animals cannot be hunted by any person except under some provisions provided by law?\n1. Gharial\n2. Indian wild ass\n3. Wild buffalo\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:The Wildlife (Protection) Act, 1972, schedules various animals based on their conservation status.  Schedule I lists the most endangered species, prohibiting hunting except under specific circumstances permitted by law.  Gharials, Indian wild asses, and wild buffaloes are all listed under Schedule I of the Act. Therefore, hunting any of these animals is prohibited unless specific legal provisions allow it.\n\nGharial: A critically endangered crocodilian species found in the rivers of the Indian subcontinent.  Their survival is threatened by habitat loss, poaching, and entanglement in fishing nets.\n\nIndian Wild Ass:  An endangered species found in the Little Rann of Kutch in Gujarat, India.  Habitat loss and human encroachment are major threats to their survival.\n\nWild Buffalo:  A vulnerable species found in various parts of India.  Habitat loss, poaching, and human-wildlife conflict are significant threats.\n"
    },
    {
        "Q.No.": 36,
        "question_text": "Which of the following statements is/are true of the Fundamental Duties of an Indian citizen?\n1. A legislative process has been provided to enforce these duties.\n2. They are correlative to legal duties.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:Fundamental Duties are a part of the Indian Constitution, added in 1976 through the 42nd Amendment Act.  They are inspired by the USSR.  Statement 1 is incorrect because there is no legislative process to enforce these duties; they are primarily moral and ethical obligations.  Statement 2 is also incorrect; they are not directly correlative to legal duties, meaning the violation of a Fundamental Duty doesn't automatically lead to legal repercussions.  They are aspirational guidelines for citizens.  The 86th Amendment Act of 2002 added one more duty.  They do not apply to foreigners.  Some criticisms include their vague nature and lack of enforcement mechanisms.  While the duties aim to promote national unity, respect for the Constitution, and responsible citizenship, their impact is largely dependent on individual adherence and societal norms.\n"
    },
    {
        "Q.No.": 37,
        "question_text": "Consider the following pairs:\n1. Radhakanta Deb               -           First President of the British Indian Association\n2. Gazulu Lakshminarasu Chetty  -           Founder of the Madras Mahajana Sabha\n3. Surendranath Banerjee        -           Founder of the Indian Association\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: Radhakanta Deb was the first President of the British Indian Association.  Surendranath Banerjee founded the Indian Association. Gazulu Lakshminarasu Chetty founded the Madras Mahajana Sabha. Therefore, only pairs 2 and 3 are correctly matched.\n\nRadhakanta Deb: A prominent figure in the early Indian nationalist movement, he played a crucial role in establishing the British Indian Association, one of the first organizations advocating for Indian rights within the British Raj.\n\nGazulu Lakshminarasu Chetty: A significant figure in South Indian politics, he was instrumental in founding the Madras Mahajana Sabha, a vital organization in the growth of Indian nationalism in Madras Presidency (present-day Tamil Nadu).\n\nSurendranath Banerjee: A prominent Indian nationalist leader and orator, he was a key figure in the founding of the Indian Association, a significant organization that played a critical role in shaping the early nationalist movement in Bengal.\n"
    },
    {
        "Q.No.": 38,
        "question_text": "Which one of the following objectives is not embodied in the Preamble to the Constitution of India?",
        "option_a": "Liberty of thought",
        "option_b": "Economic liberty",
        "option_c": "Liberty of expression",
        "option_d": "Liberty of belief",
        "correct_option": "b",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation: The Preamble to the Constitution of India mentions liberty, equality, and fraternity.  It specifies liberty of thought, expression, belief, and faith. However, economic liberty is not explicitly mentioned.  While the Constitution aims to secure social, economic, and political justice, economic liberty as a specific, enumerated right is absent from the Preamble.\n\nPreamble: The Preamble is an introductory statement outlining the aims and objectives of the Indian Constitution. It's not legally binding in itself but serves as a guiding principle for interpreting the Constitution.  The Berubari Union case (1960) established that the Preamble is not a part of the Constitution's basic structure, while the Kesavananda Bharati case (1973) clarified that the basic structure of the Constitution is inviolable.\n\nLiberty:  Refers to freedom from undue restraint, encompassing various aspects such as freedom of thought, expression, belief, and action.  It forms a cornerstone of a democratic society, enabling individual growth and development.\n\nEquality:  Implies the absence of discrimination and the provision of equal opportunities for all citizens, regardless of caste, creed, sex, or religion.  It seeks to ensure equal status and opportunities for everyone.\n\nFraternity:  Signifies a sense of brotherhood and solidarity among citizens, promoting unity and harmony within the nation.  It emphasizes a shared national identity and the spirit of cooperation.\n\nLiberty of thought: The freedom to hold any belief or opinion without external coercion or censorship.\n\nLiberty of expression: The freedom to communicate one's ideas and opinions without censorship or undue restriction, including through speech, writing, and other forms of media.\n\nLiberty of belief: The freedom to hold any religious or non-religious belief without external pressure or persecution.\n\n\n"
    },
    {
        "Q.No.": 39,
        "question_text": "With reference to 'Quality Council of India (QCI)', consider the following statements:\n1. QCI was set up jointly by the Government of India and the Indian Industry.\n2. Chairman of QCI is appointed by the Prime Minister on the recommendations of the industry to the Government.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Quality Council of India (QCI) is a joint initiative of the Government of India and the Indian industry.  It was established to promote and implement quality standards across various sectors in India.\n\nStatement 2 is incorrect. While the appointment process involves the government,  the Chairman of QCI is not appointed solely based on industry recommendations to the Prime Minister. The exact appointment process may involve a more complex procedure involving various stakeholders.\n\nQCI: The Quality Council of India is a non-profit organization that works to improve the quality of goods and services in India. It sets standards, provides training and certification, and promotes quality management systems.  It plays a crucial role in enhancing the competitiveness of Indian businesses in the global market.  Its activities encompass various sectors, from manufacturing to services.\n\nGovernment of India: The Union government of India is the central government of the Republic of India. It is responsible for the overall governance, administration, and policy-making for the country.  The central government comprises various ministries and departments, each responsible for specific sectors.\n\nIndian Industry: This refers to the collective body of industries operating within India, encompassing a wide range of sectors, from agriculture to technology.  It represents a significant part of the Indian economy and plays a major role in national economic growth and development.\n"
    },
    {
        "Q.No.": 40,
        "question_text": "What is the purpose of setting up of Small Finance Banks (SFBs) in India?\n1. To supply credit to small business units\n2. To supply credit to small and marginal farmers\n3. To encourage young entrepreneurs to set up business particularly in rural areas.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation: Small Finance Banks (SFBs) in India aim to provide credit to underserved sectors.  This includes small business units and small and marginal farmers, thereby encouraging entrepreneurship, particularly in rural areas.  All three options (1, 2, and 3) accurately reflect the purpose of establishing SFBs.\n\nSmall Finance Banks:  These banks are specifically designed to cater to the financial needs of small businesses, farmers, and low-income individuals, promoting financial inclusion. They are subject to Reserve Bank of India (RBI) regulations.\n\nSmall business units:  These are typically small-scale enterprises with limited capital and workforce, often operating in the informal sector.  Access to credit is crucial for their growth.\n\nSmall and marginal farmers:  These are farmers who own small landholdings and have limited resources.  Access to credit is essential for their agricultural operations.\n\nYoung entrepreneurs: Individuals starting new businesses, often facing challenges in securing funding. SFBs are designed to support these ventures.  Rural areas:  Areas outside major cities, typically characterized by lower levels of economic development.  SFBs play a crucial role in bringing financial services to these regions.\n"
    },
    {
        "Q.No.": 41,
        "question_text": "With reference to 'Asia Pacific Ministerial Conference on Housing and Urban Development (APMCHUD)', consider the following statements.:\n1. The first APMCHUD was held in India in 2006 on the theme 'Emerging Urban Forms — Policy Responses and Governance Structure'.\n2. India hosts all the Annual Ministerial Conferences in partnership with ADB, APEC and ASEAN.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:The provided text does not contain information about the Asia Pacific Ministerial Conference on Housing and Urban Development (APMCHUD).  Therefore, I cannot verify the accuracy of statements 1 and 2.  However, based on general knowledge, statement 1 is more likely to be true than statement 2.  It's common for international conferences to have inaugural events and specific themes.  It's less common for a single nation to host all annual ministerial conferences of a regional organization in partnership with multiple other entities.  Therefore, option (a) is chosen based on probability.\n\n\nThere is no information in the provided text to give short notes on the named entities.\n"
    },
    {
        "Q.No.": 42,
        "question_text": "Democracy's superior virtue lies in the fact that it calls into activity",
        "option_a": "the intelligence and character of ordinary men and women.",
        "option_b": "the methods for strengthening executive leadership.",
        "option_c": "a superior individual with dynamism and vision.",
        "option_d": "a band of dedicated party workers.",
        "correct_option": "a",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:Democracy's strength lies in its ability to engage the intellect and moral character of average citizens in governance. Options (b), (c), and (d) focus on specific elements within a government, not the broader participation of the populace, which is central to democracy's defining characteristic.  \n\n*Democracy:* A system of government where supreme power is vested in the people and exercised by them directly or indirectly through a system of representation, typically involving periodic free and fair elections.\n\n*Executive Leadership:* The group of individuals responsible for implementing and enforcing laws and policies within a government.  In a parliamentary system, this is typically the Prime Minister and Cabinet.\n\n*Superior Individual:* A person possessing exceptional qualities of leadership, vision and dynamism. While such individuals can be influential, democracy relies on broader participation, not the dominance of a single person.\n\n*Dedicated Party Workers:* Individuals committed to a political party and actively involved in its campaigns and activities. While essential for political parties, a functioning democracy requires more than just dedicated party workers; it needs active citizen participation across the political spectrum.\n\n*Ordinary Men and Women:*  The general population, excluding those in positions of power or influence within a government.  In a democracy, these individuals are the ultimate source of authority and participate in the political process through elections and other means.\n\n*Salvador Allende:*  The democratically elected president of Chile (1970-1973) who implemented socialist reforms, ultimately overthrown by a military coup. His presidency highlights both the potential and fragility of democracy in the face of opposition and external influences.\n\n*Augusto Pinochet:*  A Chilean general who led a military coup in 1973, overthrowing the democratically elected government of Salvador Allende and establishing a brutal military dictatorship. His regime is a stark example of a non-democratic government.\n\n*Michelle Bachelet:* A Chilean politician who served as President of Chile (2006-2010 and 2014-2018).  Her election signifies the restoration of democracy in Chile after the Pinochet dictatorship.\n\n*Lech Wałęsa:*  A Polish trade union activist and politician who played a key role in the downfall of communism in Poland. He led Solidarity, the first independent trade union in a communist country.  His story illustrates the power of popular movements in achieving democratic change.\n\n*General Jaruzelski:* The Polish general who imposed martial law in Poland in 1981 to suppress the Solidarity movement. His actions highlight the fragility of democratic transitions and the challenges posed by authoritarian forces.\n\n*Kwame Nkrumah:* The first prime minister and later president of Ghana.  His initial democratic leadership later transitioned into an authoritarian regime, highlighting the risks of concentrating power even within a democratically elected government.\n\n*Aung San Suu Kyi:* A Burmese political activist, stateswoman, Nobel Peace Prize laureate and leader of the National League for Democracy in Myanmar. She is a symbol of the struggle for democracy in Myanmar despite continued military repression.\n\n*United Nations (UN):* An intergovernmental organization tasked with maintaining international peace and security, developing friendly relations among nations, achieving international co-operation, and being a centre for harmonizing the actions of nations.  The UN's democratic nature is debated due to the unequal power distribution among its member states, particularly within the Security Council.\n\n*International Monetary Fund (IMF):* An international organization that works to foster global monetary cooperation, secure financial stability, facilitate international trade, promote high employment and sustainable economic growth, and reduce poverty around the world. The IMF's democratic credentials are questioned because voting power is weighted by financial contributions, giving disproportionate influence to wealthier nations.\n\n*World Bank:* An international financial institution that provides loans and grants to the governments of low- and middle-income countries for the purpose of pursuing capital projects.  Similar to the IMF, the World Bank's democratic legitimacy is debated due to the unequal distribution of voting power.\n\n*Nelson Mandela:*  The anti-apartheid revolutionary, political leader, and philanthropist who served as President of South Africa from 1994 to 1999. His leadership was instrumental in the peaceful transition from apartheid to democracy in South Africa.\n\n*African National Congress (ANC):* The South African anti-apartheid organization that played a leading role in ending apartheid and establishing a democratic government.\n\n*Apartheid:*  A system of racial segregation and discrimination enforced in South Africa from 1948 to 1994.  The struggle against apartheid serves as a powerful example of the fight for human rights and democratic change.\n\n*B.R. Ambedkar:*  The principal architect of the Indian Constitution. His contributions highlight the importance of social justice and equality in the development of a democratic framework.\n\n*Jawaharlal Nehru:* India's first prime minister. His vision and leadership were critical in shaping independent India's democratic trajectory. His famous speech, \"Tryst with Destiny,\" captures the aspirations of the nation at the time of independence.\n\n*Rajendra Prasad:* The first president of India. His role in the Constituent Assembly underscores the importance of consensus-building in establishing a democratic framework.\n\n*Motilal Nehru:*  An Indian lawyer and independence activist, who chaired the drafting committee of the Nehru Report (1928), a significant document that laid out the framework for a future Indian constitution.\n\n\n"
    },
    {
        "Q.No.": 43,
        "question_text": "Which of the following is a most likely consequence of implementing the 'Unified Payments Interface (UPI)'?",
        "option_a": "Mobile wallets will not be necessary for online payments.",
        "option_b": "Digital currency will totally replace the physical currency in about two decades.",
        "option_c": "FDI inflows will drastically increase.",
        "option_d": "Direct transfer of subsidies to poor people will become very effective.",
        "correct_option": "d",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:The Unified Payments Interface (UPI) is a real-time mobile payment system that allows users to transfer money between bank accounts.  Option (d) is the most likely consequence because UPI facilitates direct transfer of funds, making subsidy distribution more efficient and reducing leakages associated with traditional methods.  Mobile wallets can complement UPI but aren't strictly necessary (a).  While UPI contributes to digitalization, it doesn't guarantee complete replacement of physical currency within two decades (b). FDI inflows are influenced by various factors beyond UPI's implementation (c).\n\nUPI (Unified Payments Interface): A real-time mobile payment system developed by the National Payments Corporation of India (NPCI) allowing users to transfer money between bank accounts.  It's known for its speed, convenience, and security.\n\nMobile wallets: Digital platforms that store money for online transactions.  They can be linked to bank accounts or used independently.\n\nDigital currency:  A form of currency that exists only in electronic form.  Central Bank Digital Currencies (CBDCs) are issued by central banks, while cryptocurrencies are decentralized.\n\nFDI (Foreign Direct Investment):  Investment made by a company or individual in a foreign country to gain a lasting interest.  It can involve setting up businesses or acquiring existing companies.\n"
    },
    {
        "Q.No.": 44,
        "question_text": "The terms 'Event Horizon', 'Singularity', 'String Theory' and 'Standard Model' are sometimes seen in the news in the context of:",
        "option_a": "Observation and understanding of the cosmos",
        "option_b": "Study of the solar and lunar eclipses",
        "option_c": "Placing satellites in the orbit of the Earth",
        "option_d": "Origin and evolution of living organisms",
        "correct_option": "a",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:The terms 'Event Horizon', 'Singularity', and 'String Theory' are all concepts within the field of astrophysics, specifically related to the study of black holes, the universe's origins, and the fundamental nature of matter.  The 'Standard Model' is a theoretical framework in particle physics describing fundamental forces and particles.  These concepts are central to our observation and understanding of the cosmos.\n\n* **Event Horizon:** The boundary around a black hole beyond which nothing, not even light, can escape.  It marks the point of no return for any matter or radiation falling into the black hole.\n\n* **Singularity:**  The central point of a black hole, where gravity is infinitely strong and the known laws of physics break down.  It represents a point of infinite density.\n\n* **String Theory:** A theoretical framework in physics that attempts to reconcile general relativity and quantum mechanics by proposing that fundamental particles are not point-like but rather tiny vibrating strings.  It aims to unify all the forces of nature.\n\n* **Standard Model:**  A highly successful theory in particle physics that describes the fundamental building blocks of matter (quarks and leptons) and their interactions mediated by force-carrying particles (bosons). It doesn't include gravity.\n\n\nOptions (b), (c), and (d) are not directly related to these concepts.  While satellites (c) orbit within the cosmos, their study doesn't involve these specific theoretical frameworks.  Solar and lunar eclipses (b) are astronomical events, but their study is not fundamentally connected to the ideas of event horizons, singularities, string theory, or the standard model.  The origin and evolution of life (d) is a biological topic unrelated to these physics concepts.\n"
    },
    {
        "Q.No.": 45,
        "question_text": "With reference to agriculture in India, how can the technique of genome sequencing, often seen in the news, be used in the immediate future?\n1. Genome sequencing can be used to identify crops with better tolerance to disease, various biotic and abiotic stresses such as drought.\n2. It can be used to develop new varieties of crops with higher yield.\n3. This technique helps in deciphering the host-pathogen relationships in crops.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:Genome sequencing in agriculture can be used to:\n\n1. **Identify crops with better tolerance to disease and various biotic and abiotic stresses:**  Genome sequencing allows scientists to identify genes responsible for stress tolerance.  By comparing the genomes of different crop varieties, those with superior resistance to diseases, drought, salinity, or other stresses can be pinpointed for breeding programs.\n\n2. **Develop new varieties of crops with higher yield:**  Identifying genes linked to yield traits (e.g., grain size, number of grains per plant) allows for marker-assisted selection, accelerating the development of high-yielding varieties.  Genome editing techniques can also be used to directly improve these genes.\n\n3. **Decipher host-pathogen relationships:**  Sequencing the genomes of both crops and their pathogens reveals the molecular mechanisms of infection.  This knowledge is crucial for developing disease-resistant varieties and effective control strategies.\n\n\n**Short notes on keywords and named entities:**\n\n* **Genome sequencing:**  The process of determining the complete DNA sequence of an organism. This provides a blueprint of an organism's genetic information, revealing the order of nucleotides (A, T, C, G) in its genome.\n\n* **Biotic stress:** Stress caused by living organisms, such as pathogens (bacteria, fungi, viruses), insects, weeds, or other competing plants.\n\n* **Abiotic stress:** Stress caused by non-living factors, such as drought, salinity, temperature extremes, nutrient deficiency, or heavy metals in the soil.\n\n* **Host-pathogen relationships:** The interactions between a host organism (e.g., a plant) and a pathogen that causes disease. Understanding these relationships is crucial for developing disease management strategies.\n\n* **Genome editing:** A group of technologies that allow scientists to make precise changes to an organism's DNA.  CRISPR-Cas9 is a prominent example.  This enables modification of specific genes, introducing desirable traits or correcting genetic defects.\n\n\n"
    },
    {
        "Q.No.": 46,
        "question_text": "The main advantage of the parliamentary form of government is that:",
        "option_a": "it provides continuity of policy and work",
        "option_b": "the executive and legislature work independently.",
        "option_c": "the head of the government cannot be removed.",
        "option_d": "the executive remains responsible to the more efficient.",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:The main advantage of a parliamentary system is the harmony and cooperation between the executive and legislative branches.  This leads to efficient governance and policy continuity because the executive (typically a Prime Minister and their cabinet) is drawn from and accountable to the legislature (parliament).  Option (b) is incorrect; the executive and legislature work *together* in a parliamentary system. Option (c) is false; the head of government (Prime Minister) *can* be removed through a vote of no confidence. Option (d) is vague and doesn't accurately reflect the core strength of a parliamentary system.\n\n\n**Short Notes on Important Keywords and Entities:**\n\n* **Parliamentary Form of Government:** A system where the executive branch (government) is accountable to and dependent on the legislature (parliament). The head of government is usually the leader of the majority party in the legislature.  The executive can be removed through a vote of no confidence.\n\n* **Westminster Model:** A specific type of parliamentary system, originating in the United Kingdom, characterized by a strong bicameral legislature, a prime minister as head of government, and a fusion of powers between the executive and legislature.\n\n* **Executive:** The branch of government responsible for implementing and enforcing laws. In a parliamentary system, this is typically the Prime Minister and their cabinet.\n\n* **Legislature:** The branch of government responsible for making laws.  In a parliamentary system, this is typically a parliament or congress.\n\n* **Vote of No Confidence:** A formal vote in the legislature to remove the head of government (Prime Minister) from power.  If the vote fails, the government may be dissolved leading to new elections.\n\n* **Swaran Singh Committee:** A committee formed in India in 1975 to evaluate the effectiveness of the Indian parliamentary system.  It recommended retaining the existing system.\n\n* **Separation of Powers:** A principle of governance where governmental power is divided among distinct branches (executive, legislative, and judicial) to prevent tyranny and ensure checks and balances.  This is less pronounced in a parliamentary system compared to a presidential system.\n\n\n"
    },
    {
        "Q.No.": 47,
        "question_text": "In the context of India, which one of the following is the correct relationship between Rights and Duties?",
        "option_a": "Rights are corrective with Duties.",
        "option_b": "Rights are not personal and hence cannot be separated from Duties.",
        "option_c": "Rights, Duties and the personality for the advancement of the Duties of the citizen.",
        "option_d": "Duties, not Rights, are important for the stability of the State.",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation: In the Indian context, rights and duties are intrinsically linked.  Rights are not absolute but qualified, and their enjoyment is contingent upon the fulfillment of corresponding duties.  Option (a) accurately reflects this relationship, stating that rights are corrective with duties, implying a reciprocal and interconnected nature.  The other options are inaccurate. Option (b) is incorrect as rights are personal and can be separated from duties in certain contexts, though ideally, they should complement each other. Option (c) is too vague and doesn't clearly define the relationship. Option (d) is incorrect as both rights and duties are crucial for the stability of the state.\n\n\n**Short Notes:**\n\n* **Rights:**  Fundamental Rights in India, enshrined in Part III of the Constitution, guarantee citizens' basic freedoms and liberties against state encroachment. These rights, though extensive, are not absolute and can be subject to reasonable restrictions.  They are justiciable, meaning they can be enforced through courts.\n\n* **Duties:**  Fundamental Duties in India, added to the Constitution later, outline citizens' responsibilities towards the nation, including respecting the Constitution, protecting its sovereignty, and upholding its values.  These duties are important for maintaining social order and national progress.\n\n* **State:** In this context, the \"State\" refers to the government and its various organs, including the executive, legislature, and judiciary, at both the central and state levels.  Its stability relies on both the exercise of rights and the fulfillment of duties by citizens.\n"
    },
    {
        "Q.No.": 48,
        "question_text": "The mind of the makers of the Constitution of India is reflected in which of the following?",
        "option_a": "The Preamble",
        "option_b": "The Fundamental Rights",
        "option_c": "The Directive Principles of State Policy",
        "option_d": "The Fundamental Duties",
        "correct_option": "a",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:The Preamble to the Indian Constitution succinctly encapsulates the fundamental objectives and guiding principles that inspired its creation.  It reflects the aspirations and ideals of the Constitution's framers, outlining the nation's goals and the values it seeks to uphold. While Fundamental Rights, Directive Principles of State Policy, and Fundamental Duties are all important components of the Constitution, the Preamble serves as a concise statement of the overall vision and intent.\n\nPreamble: The Preamble is the introductory statement of the Indian Constitution. It sets out the aims and objectives of the Constitution, declaring India to be a sovereign, socialist, secular, democratic, republic, assuring justice, liberty, equality, and fraternity to all citizens.  It is a statement of the nation's ideals and aspirations.\n\nFundamental Rights: These are basic human rights guaranteed to all citizens by the Constitution, enforceable by the courts. They include the right to equality, freedom, against exploitation, freedom of religion, cultural and educational rights, and right to constitutional remedies.  They are meant to protect individual liberties from state infringement.\n\nDirective Principles of State Policy: These are guidelines for the state to follow in its governance, aiming to promote social and economic justice.  While not legally enforceable in the same way as Fundamental Rights, they provide a moral and political framework for the state's actions.\n\nFundamental Duties: These are moral obligations imposed upon citizens to contribute to the nation's progress and well-being. They include respecting the Constitution, promoting harmony, safeguarding the environment, and valuing scientific temper, among others.  Their non-justiciable nature means they are not legally enforceable.\n"
    },
    {
        "Q.No.": 49,
        "question_text": "If you travel by road from Kohima to Kottayam, what is the minimum number of States within India through which you can travel, including the origin and the destination?",
        "option_a": "6",
        "option_b": "7",
        "option_c": "8",
        "option_d": "9",
        "correct_option": "b",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:Kohima is the capital of Nagaland and Kottayam is in Kerala.  Traveling by road from Nagaland to Kerala necessitates passing through several states.  A minimum of 7 states would be traversed. The route would likely go through Assam, West Bengal, Bihar, Jharkhand, Odisha, Andhra Pradesh, and finally Kerala. Therefore, option (b) is correct.\n\nKohima: Capital city of Nagaland, a state in Northeast India known for its Naga tribes and hilly terrain.\n\nKottayam: A city in Kerala, a state on the southwestern Malabar Coast of India, known for its backwaters, spices, and tourism.\n\nNagaland: A state in Northeast India, known for its diverse Naga tribes, unique culture, and mountainous landscape.\n\nKerala: A state in southwestern India, known for its lush greenery, backwaters, beaches, and spice plantations.  It is a popular tourist destination.\n\nAssam: A state in Northeast India, known for its tea plantations, wildlife, and the Brahmaputra River.\n\nWest Bengal: A state in eastern India, known for its diverse culture, history, and the city of Kolkata.\n\nBihar: A state in eastern India, known for its historical significance and contributions to Indian culture.\n\nJharkhand: A state in eastern India, known for its tribal population, forests, and mineral resources.\n\nOdisha: A state in eastern India, known for its temples, beaches, and classical dance forms.\n\nAndhra Pradesh: A state in southern India, known for its historical sites, temples, and Telugu culture.\n"
    },
    {
        "Q.No.": 50,
        "question_text": "The Parliament of India exercises control over the functions of the Council of Ministers through:\n1. Adjournment motion\n2. Question hour\n3. Supplementary questions\nSelect the correct answer using the code given below:",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "1 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:The Parliament of India uses various mechanisms to exercise control over the Council of Ministers.  Question Hour allows MPs to question ministers about government policies and actions.  Supplementary questions allow for further probing of answers given during Question Hour. Adjournment motions, while less frequently used for direct control, can be employed to discuss urgent matters of public importance and potentially hold the government accountable.  Therefore, all three options (1, 2, and 3) are ways Parliament exercises control.\n\nCouncil of Ministers:  The Council of Ministers is the executive branch of the Indian government, headed by the Prime Minister.  It is collectively responsible to the Parliament.\n\nParliament of India: The bicameral legislature of India, comprising the Lok Sabha (House of the People) and Rajya Sabha (Council of States).  It is responsible for making laws and holding the government accountable.\n\nAdjournment motion: A parliamentary procedure to interrupt the normal business of the House to discuss a matter of urgent public importance.\n\nQuestion hour: A time allocated in Parliament for Members of Parliament (MPs) to ask questions to ministers about government policies and actions.\n\nSupplementary questions: Follow-up questions asked by MPs to clarify answers given during Question Hour.\n"
    },
    {
        "Q.No.": 51,
        "question_text": "Which one of the following was a very important seaport in the Kakatiya kingdom ?",
        "option_a": "Kakinada",
        "option_b": "Motupalli",
        "option_c": "Machilipatnam (Masulipatnam)",
        "option_d": "Nelluru",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: Machilipatnam (Masulipatnam) was a very important seaport during the Kakatiya kingdom.  It was a major center for trade and commerce, facilitating the kingdom's interaction with other regions and countries through maritime routes.\n\nKakinada, Motupalli, and Nelluru were also coastal towns, but their significance as seaports during the Kakatiya period was less prominent than Machilipatnam.\n"
    },
    {
        "Q.No.": 52,
        "question_text": "With reference to 'Global Climate Change Alliance', which of the following statements is/are correct?\n1. It is an initiative of the European Union.\n2. It provides technical and financial support to targeted developing countries to integrate climate change into their development policies and budgets.\n3. It is coordinated by World Resources Institute (WRI) and World Business Council for Sustainable Development (WBCSD).\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation: The Global Climate Change Alliance (GCCA) is an initiative of the European Union (EU).  Its primary function is to provide technical and financial support to developing countries to help them integrate climate change considerations into their development policies and budgets.  The World Resources Institute (WRI) and the World Business Council for Sustainable Development (WBCSD) are not involved in its coordination.\n\nEuropean Union (EU): A political and economic alliance of 27 European countries.  Founded after World War II to promote peace and economic cooperation, the EU has expanded its influence to encompass a wide range of policies, including environmental protection and climate change mitigation.\n\nWorld Resources Institute (WRI): A global research organization that works to solve environmental problems. WRI focuses on data-driven analysis and advocacy to promote sustainable solutions across various sectors.\n\nWorld Business Council for Sustainable Development (WBCSD): A global, CEO-led organization of over 200 leading businesses working towards a sustainable future.  WBCSD focuses on integrating sustainability into business strategy and operations.\n"
    },
    {
        "Q.No.": 53,
        "question_text": "With reference to the religious history of India, consider the following statements:\n1. Sautrantika and Sammitiya were the sects of Jainism.\n2. Sarvastivadin held that the constituents of phenomena were not wholly momentary, but existed forever in a latent form.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. Sautrantika and Sammitiya were schools of thought within Buddhism, not Jainism.  Jainism's major sects are Svetambara and Digambara.\n\nStatement 2 is correct. The Sarvastivadins, a Buddhist school, believed that dharmas (constituents of phenomena)  existed in a latent form even when not manifested.  This contrasts with other Buddhist schools that held a strictly momentary view of existence.\n\n\n**Short Notes:**\n\n* **Sautrantika:** A Buddhist school emphasizing the importance of scriptures (sutras) and a realistic understanding of the world. They debated extensively about the nature of reality and consciousness.\n\n* **Sammitiya:** Another Buddhist school known for its nuanced views on the nature of reality and its emphasis on conventional truth.  They were particularly concerned with the relationship between the individual and the world.\n\n* **Jainism:** An ancient Indian religion emphasizing non-violence (ahimsa), self-discipline, and the pursuit of liberation (moksha) from the cycle of rebirth.  It has a rich history and diverse philosophical traditions.\n\n* **Svetambara and Digambara:** The two main sects of Jainism, differing primarily in their practices and interpretations of scriptures.  Svetambaras wear white clothes, while Digambaras traditionally go naked, symbolizing detachment from worldly possessions.\n\n* **Sarvastivada:** A significant Buddhist school that held the view that all dharmas (elements of reality) exist, both past, present, and future.  They emphasized the importance of monastic discipline and the study of Buddhist scriptures.\n\n* **Dharmas:** In Buddhist philosophy, dharmas are the ultimate constituents of reality, often described as momentary and interdependent.  Different Buddhist schools held varying views on the nature and existence of dharmas.\n"
    },
    {
        "Q.No.": 54,
        "question_text": "Mediterranean Sea is a border of which of the following countries ?\n1. Jordan\n2. Iraq\n3. Lebanon\n4. Syria\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 and 3 only",
        "option_c": "3 and 4 only",
        "option_d": "1, 3 and 4 only",
        "correct_option": "c",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: The Mediterranean Sea borders Lebanon and Syria.  Jordan and Iraq do not border the Mediterranean Sea.\n\nLebanon: A country in the Levant region of Western Asia, bordering Syria to the north and east, Israel to the south, and the Mediterranean Sea to the west.  Known for its diverse culture and history, it has a significant coastline along the Mediterranean.\n\nSyria: A country in Western Asia, bordering Lebanon to the west, Turkey to the north, Iraq to the east, Jordan to the south, and the Mediterranean Sea to the west.  Its geography is diverse, encompassing mountains, deserts, and plains.  \n\nJordan: A country in Western Asia, located east of the Jordan River, bordering Syria to the north, Iraq to the northeast, Saudi Arabia to the east and south, and Israel and the West Bank to the west.  It does not have a coastline on the Mediterranean.\n\nIraq: A country in Western Asia, bordering Iran to the east, Turkey and Syria to the northwest, Kuwait and Saudi Arabia to the south, and Jordan to the southwest. It lacks a Mediterranean coastline.\n"
    },
    {
        "Q.No.": 55,
        "question_text": "With reference to 'National Investment and Infrastructure Fund', which of the following statements is/are correct?\n1. It is an organ of NITI Aayog.\n2. It has a corpus of ₹4,00,000 crore at present.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:  Neither statement 1 nor statement 2 is correct. The National Investment and Infrastructure Fund (NIIF) is not an organ of NITI Aayog.  It is a  fund established by the Government of India to provide long-term capital for infrastructure projects. While the initial corpus was ₹4,00,000 crore, the current corpus may be different and requires accessing updated information to confirm the exact amount.  Therefore, neither statement is accurate based on available information.\n\nNITI Aayog: NITI Aayog (National Institution for Transforming India) is a policy think tank of the Government of India, replacing the Planning Commission.  It aims to foster cooperative federalism and improve the planning process for India's development.\n\nNational Investment and Infrastructure Fund (NIIF):  The NIIF is a fund established to catalyze private investment into infrastructure projects in India.  It aims to bridge the infrastructure financing gap in the country.\n"
    },
    {
        "Q.No.": 56,
        "question_text": "The Global Infrastructure Facility is a/an",
        "option_a": "ASEAN initiative to upgrade infrastructure in Asia and financed by credit from the Asian Development Bank.",
        "option_b": "World Bank collaboration that facilitates the preparation and structuring of complex infrastructure Public-Private Partnerships (PPPs) to enable mobilization of private sector and institutional investor capital.",
        "option_c": "Collaboration among the major banks of the world working with the OECD and focused on expanding the set of infrastructure projects that have the potential to mobilize private investment.",
        "option_d": "UNCTAD funded initiative that seeks to finance and facilitate infrastructure development in the world.",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:The Global Infrastructure Facility (GIF) is a World Bank collaboration.  Its primary function is to help prepare and structure complex infrastructure Public-Private Partnerships (PPPs). This facilitates the involvement of private sector and institutional investors in infrastructure projects.\n\n**Short notes on named entities:**\n\n* **ASEAN:** The Association of Southeast Asian Nations is a political and economic organization of ten Southeast Asian countries.\n* **Asian Development Bank (ADB):** A regional development bank that provides loans and technical assistance to its developing member countries in Asia and the Pacific.\n* **World Bank:** An international financial institution that provides loans and grants to the governments of low- and middle-income countries for the purpose of pursuing capital projects.\n* **Public-Private Partnerships (PPPs):** A cooperative arrangement between two or more public and private sectors, typically involving the sharing of resources to achieve a common goal.\n* **OECD (Organisation for Economic Co-operation and Development):** An intergovernmental economic organization with 38 member countries, focused on promoting policies to improve the economic and social well-being of people around the world.\n* **UNCTAD (United Nations Conference on Trade and Development):** An intergovernmental organization that aims to maximize the trade, investment, and development opportunities of developing countries and assist them in their efforts to integrate into the global economy.  \n\nThe other options incorrectly describe the GIF's nature and purpose.  The provided context does not directly relate to the GIF.\n"
    },
    {
        "Q.No.": 57,
        "question_text": "For election to the Lok Sabha, a nomination paper can be filed by",
        "option_a": "anyone residing in India.",
        "option_b": "a resident of the constituency from which the election is to be contested.",
        "option_c": "any citizen of India whose name appears in the electoral roll of a constituency.",
        "option_d": "any citizen of India.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (c)\n\nexplanation: To be eligible for election to the Lok Sabha, a candidate must be a citizen of India and their name must appear on the electoral roll of a constituency.  Option (a) is incorrect because residency in India alone is not sufficient;  the candidate must be registered to vote in a specific constituency. Option (b) is incorrect because while residency in the constituency is desirable, it's not the sole criterion. Option (d) is incorrect because citizenship alone is not enough; electoral roll registration is also mandatory.\n\nLok Sabha:  The lower house of the Indian Parliament, also known as the House of the People. It is directly elected by the people of India.  Its composition, including the number of seats allocated to different states and union territories, is determined by the Constitution and periodic readjustments based on census data.\n\nConstituency: A geographical area represented by a single member in a legislative body like the Lok Sabha.  The delimitation of constituencies aims to ensure roughly equal population representation across constituencies.\n\nElectoral Roll: A register of eligible voters in a constituency.  Inclusion in the electoral roll is a prerequisite for candidacy and voting in elections.\n\nCitizen of India: An individual legally recognized as a citizen of India, possessing the rights and responsibilities associated with citizenship.\n"
    },
    {
        "Q.No.": 58,
        "question_text": "Consider the following statements:\n1. In India, the Himalayas are spread over five States only.\n2. Western Ghats are spread over five States only.\n3. Pulicat Lake is spread over two States only.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1 and 3 only",
        "correct_option": "b",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The Himalayas spread over several more states in India than just five.  Statement 2 is incorrect.  The Western Ghats extend across more than five states. Statement 3 is correct. Pulicat Lake is situated on the border of Andhra Pradesh and Tamil Nadu.\n\nPulicat Lake: A brackish water lagoon located on the Coromandel Coast of South India, shared by Andhra Pradesh and Tamil Nadu.  It is one of the largest brackish water lakes in India, known for its biodiversity and birdlife.\n\nHimalayas: A massive mountain range in Asia, extending across several countries including India, Nepal, Bhutan, and China. In India, it stretches across numerous states, not just five.\n\nWestern Ghats: A mountain range running along the western coast of India.  It is a UNESCO World Heritage site and is known for its rich biodiversity, including many endemic species.  It extends across several Indian states.\n"
    },
    {
        "Q.No.": 59,
        "question_text": "Biological Oxygen Demand (BOD) is a standard criterion for",
        "option_a": "Measuring oxygen levels in blood",
        "option_b": "Computing oxygen levels in forest ecosystems",
        "option_c": "Pollution assay in aquatic ecosystems",
        "option_d": "Assessing oxygen levels in high altitude regions",
        "correct_option": "c",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation:Biological Oxygen Demand (BOD) measures the amount of dissolved oxygen needed by aerobic microorganisms to decompose organic matter in water.  High BOD indicates high levels of organic pollution in aquatic ecosystems, making it a key pollution assay. Measuring oxygen levels in blood (a) is done through different methods. Computing oxygen levels in forest ecosystems (b) involves assessing photosynthesis and respiration rates, and is not directly related to BOD. Assessing oxygen levels in high altitude regions (d) involves atmospheric pressure and is unrelated to BOD.\n"
    },
    {
        "Q.No.": 60,
        "question_text": "With reference to the role of UN-Habitat in the United Nations programme working towards a better urban future, which of the statements is/are correct?\n1. UN-Habitat has been mandated by the United Nations General Assembly to promote socially and environmentally sustainable towns and cities to provide adequate shelter for all.\n2. Its partners are either governments or local urban authorities only.\n3. UN-Habitat contributes to the overall objective of the United Nations system to reduce poverty and to promote access to safe drinking water and basic sanitation.\nSelect the correct answer using the code given below;",
        "option_a": "1, 2 and 3",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1 only",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is correct. UN-Habitat's mandate, as defined by the UN General Assembly, centers on promoting sustainable urban development that includes adequate shelter for all.  Statement 2 is incorrect. UN-Habitat collaborates with a wide range of partners, including governments, local urban authorities,  civil society organizations, the private sector, and academic institutions. Statement 3 is correct.  UN-Habitat's work directly contributes to broader UN goals of poverty reduction and improved access to essential services like safe water and sanitation.  Therefore, only statements 1 and 3 are correct.\n\n\nUN-Habitat: UN-Habitat, or the United Nations Human Settlements Programme, is a UN agency focused on sustainable urban development.  It works to improve living conditions in cities and towns worldwide.\n\nUnited Nations General Assembly: The main deliberative, policymaking, and representative organ of the UN. It consists of all UN member states, each with one vote.\n\nUnited Nations: An intergovernmental organization aiming to promote international cooperation and peace.  It has numerous agencies and programs focused on various global issues.\n"
    },
    {
        "Q.No.": 61,
        "question_text": "With reference to 'National Skills Qualification Framework (NSQF)', which of the statements given below is/are correct?\n1. Under NSQF, a learner can acquire the certification for competency only through formal learning.\n2. An outcome expected from the implementation of NSQF is the mobility between vocational and general education.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: The National Skills Qualification Framework (NSQF) allows learners to gain competency certifications through various learning pathways, including formal, non-formal, and informal learning.  Therefore, statement 1 is incorrect.  Statement 2 is correct; NSQF aims to improve mobility between vocational and general education by creating a unified framework for skills recognition and certification.\n\nNSQF:  The National Skills Qualification Framework is a competency-based framework that organizes qualifications according to a series of levels. It aims to standardize skills across various sectors, making it easier for individuals to move between jobs and educational programs.  It covers both vocational and general education.\n"
    },
    {
        "Q.No.": 62,
        "question_text": "In the context of Indian history, the principle of 'Dyarchy (diarchy)' refers to",
        "option_a": "Division of the central legislature into two houses.",
        "option_b": "Introduction of double government i.e., Central and State governments.",
        "option_c": "Having two sets of rulers; one in London and another in Delhi.",
        "option_d": "Division of the subjects delegated to the provinces into two categories.",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation: Dyarchy, in the context of Indian history, refers to the division of subjects delegated to the provinces into two categories.  One category was administered by the Governor (who represented the British Crown), and the other by ministers responsible to the elected legislature. This system aimed to introduce a degree of self-governance while retaining British control.\n\n\nThe other options are incorrect:\n\n(a) Division of the central legislature into two houses refers to bicameralism, a feature of many parliamentary systems, including the later Government of India Act 1935, but not the defining characteristic of dyarchy.\n\n(b) Introduction of double government i.e., Central and State governments describes the federal structure of a government, not specific to dyarchy.  While dyarchy involved a division of power, it was within the provincial government itself, not between central and state levels.\n\n(c) Having two sets of rulers; one in London and another in Delhi describes the overall colonial setup, with ultimate authority resting in London, but this is not synonymous with dyarchy. Dyarchy was a specific administrative arrangement *within* the Indian provinces.\n\n\n**Short notes on named entities:**\n\n**Government of India Act of 1935:**  A landmark act that introduced significant constitutional reforms in British India, including provincial autonomy, replacing dyarchy.  It established an All-India Federation (which never fully materialized), and featured a complex system of federal, provincial, and concurrent lists for powers.\n\n**Dyarchy:** A system of government where power is divided between two authorities, typically in the context of colonial rule. In India, it involved a division of administrative responsibilities between the Governor and ministers responsible to the legislature.  This was a step towards self-governance, but ultimately retained considerable British control.\n\n**Communal Award:**  A scheme introduced in 1932 by Ramsay MacDonald, the British Prime Minister, that provided for separate electorates for various religious and caste groups in India, intended to address minority concerns.  It sparked controversy, especially regarding the allocation for the depressed classes (Dalits).\n\n**Round Table Conferences:** Three conferences held in London between 1930 and 1932 to discuss constitutional reforms in India.  They involved representatives from the British government, British India, and Indian princely states, though their outcomes were limited in addressing the core demands of Indian nationalists.\n\n**Ramsay MacDonald:** The British Prime Minister who announced the Communal Award in 1932.\n\n**Gandhiji:** Mahatma Gandhi, who launched a fast unto death in protest against the Communal Award's separate electorate provision for the depressed classes.  His action led to modifications in the Award.\n\n**Yeravada Jail:** The prison in Pune, India, where Gandhi undertook his fast unto death.\n\n**Lothian Committee:**  A committee set up to examine the question of separate electorates for the depressed classes in the context of the Communal Award.\n\n\n**Indian Independence Act of 1947:** The act that partitioned India into India and Pakistan and granted independence to both.\n"
    },
    {
        "Q.No.": 63,
        "question_text": "Consider the following in respect of 'National Career Service':\n1. National Career Service is an initiative of the Department of Personnel and Training, Government of India.\n2. National Career Service has been launched in a Mission Mode to improve the employment opportunities to uneducated youth of the country.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The National Career Service (NCS) is an initiative of the Ministry of Labour and Employment, Government of India, not the Department of Personnel and Training.  Statement 2 is incorrect. While NCS aims to improve employment opportunities, its focus is not limited to uneducated youth; it caters to a broader range of job seekers.  Therefore, only statement 1 is partially correct if we consider the ministry instead of the department.\n\n\nNational Career Service (NCS): A government portal and mobile app providing job search, career guidance, and training opportunities to Indian citizens.  It aims to bridge the gap between job seekers and employers.\n\nDepartment of Personnel and Training (DoPT): A department of the Government of India responsible for personnel management, recruitment, and training of government employees.  It is involved in policy formulation and implementation related to civil services.  It is not directly involved in the National Career Service.\n\nMinistry of Labour and Employment: The ministry responsible for the National Career Service.  It oversees policies and programs related to employment, labour welfare, and industrial relations in India.\n"
    },
    {
        "Q.No.": 64,
        "question_text": "Which of the following statements best describes the term 'Scheme for Sustainable Structuring of Stressed Assets (S4A)', recently seen in the news?",
        "option_a": "It is a procedure for considering ecological costs of developmental schemes formulated by the Government.",
        "option_b": "It is a scheme of RBI for reworking the financial structure of big corporate entities facing genuine difficulties.",
        "option_c": "It is a disinvestment plan of the Government regarding Central Public Sector Undertakings.",
        "option_d": "It is an important provision in 'The Insolvency and Bankruptcy Code', recently implemented by the Government.",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:The Scheme for Sustainable Structuring of Stressed Assets (S4A) is an RBI scheme designed to help large corporate entities facing genuine financial difficulties restructure their finances.  It aims to provide a framework for resolving stressed assets without resorting to insolvency proceedings, thereby supporting economic stability.\n\nThe other options are incorrect.  Option (a) describes a different type of government scheme focusing on environmental impact assessments. Option (c) refers to a government disinvestment strategy. Option (d) incorrectly links S4A to the Insolvency and Bankruptcy Code, although both relate to financial restructuring.  The provided text does not contain information about the named entities mentioned in the question or the options.\n"
    },
    {
        "Q.No.": 65,
        "question_text": "Consider the following statements:\n1. Climate and Clean Air Coalition (CCAC) to Reduce Short Lived Climate Pollutants is a unique initiative of G20 group of countries.\n2. The CCAC focuses on methane, black carbon and hydrofluorocarbons.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The Climate and Clean Air Coalition (CCAC) is a partnership of governments, intergovernmental organizations, and other stakeholders, not a unique initiative of the G20.  The G20 is a group of 20 major economies, and while many G20 members participate in the CCAC, it's not solely a G20 initiative.\n\nStatement 2 is correct. The CCAC focuses on reducing short-lived climate pollutants (SLCPs), which include methane (CH₄), black carbon (BC), and hydrofluorocarbons (HFCs).  These pollutants have a significant impact on both climate change and air quality.  Methane is a potent greenhouse gas, black carbon is a component of soot that contributes to warming and air pollution, and HFCs are powerful greenhouse gases used in refrigeration and air conditioning.\n"
    },
    {
        "Q.No.": 66,
        "question_text": "With reference to 'Indian Ocean Dipole (IOD)' sometimes mentioned in the news while forecasting Indian monsoon, which of the following statements is/are correct?\n1. IOD phenomenon is characterised by a difference in sea surface temperature between tropical Western Indian Ocean and tropical Eastern Pacific Ocean.\n2. An IOD phenomenon can influence an El Nino's impact on the monsoon.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:The Indian Ocean Dipole (IOD) is a climate pattern characterized by a difference in sea surface temperature between the tropical western Indian Ocean and the tropical eastern Indian Ocean, not the eastern Pacific Ocean as stated in option 1.  Therefore, statement 1 is incorrect.  An IOD event can indeed influence the impact of an El Niño on the Indian monsoon. The IOD and El Niño are separate but interacting climate patterns, and their combined effects can significantly affect monsoon rainfall. Thus, statement 2 is correct.  El Niño is a climate pattern that occurs in the Pacific Ocean and is known to influence global weather patterns, including the Indian monsoon.\n\nEl Niño-Southern Oscillation (ENSO): ENSO is a climate pattern that occurs in the tropical Pacific Ocean. It involves fluctuations in sea surface temperatures, air pressure, and wind patterns. El Niño is the warm phase of ENSO, while La Niña is the cool phase. ENSO events can have significant impacts on global weather patterns, including the Indian monsoon.\n\nIndian Ocean Dipole (IOD): The IOD is a climate pattern that occurs in the Indian Ocean. It involves fluctuations in sea surface temperatures between the western and eastern parts of the Indian Ocean. The IOD can influence the Indian monsoon rainfall, sometimes independently and sometimes in conjunction with ENSO.  A positive IOD generally leads to drier conditions in eastern Australia and Indonesia and wetter conditions in eastern Africa.  A negative IOD typically results in the opposite.\n\nIndian Monsoon: The Indian monsoon is a seasonal wind pattern that brings rainfall to the Indian subcontinent. It is crucial for agriculture and the overall economy of India. The monsoon's strength and timing are influenced by various factors, including ENSO and the IOD.\n"
    },
    {
        "Q.No.": 67,
        "question_text": "If you want to see gharials in their natural habitat, which one of the following is the best place to visit?",
        "option_a": "Bhitarkanika Mangroves",
        "option_b": "Chambal River",
        "option_c": "Pulicat Lake",
        "option_d": "Deepor Beel",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: Gharials are critically endangered crocodilians found primarily in the rivers of the Indian subcontinent.  The Chambal River is one of the last remaining habitats supporting a significant gharial population.  While Bhitarkanika Mangroves are a significant ecosystem, they are not the primary habitat for gharials. Pulicat Lake is a lagoon and Deepor Beel is a lake, neither of which are suitable habitats for this riverine species.\n\nBhitarkanika Mangroves: A large mangrove ecosystem in Odisha, India, known for its diverse flora and fauna, including saltwater crocodiles, various bird species, and other reptiles.\n\nChambal River: A major river in central India, known for its gharial population, along with other wildlife like the Ganges river dolphin.\n\nPulicat Lake: A brackish water lagoon in Andhra Pradesh and Tamil Nadu, India. It supports a variety of aquatic life but not gharials.\n\nDeepor Beel: A lake near Guwahati, Assam, India,  a significant wetland ecosystem with diverse avian life.  It is not a gharial habitat.\n"
    },
    {
        "Q.No.": 68,
        "question_text": "Consider the following in respect of Indian Ocean Naval Symposium (IONS):\n1. Inaugural IONS was held in India in 2015 under the chairmanship of the Indian Navy.\n2. IONS is a voluntary initiative that seeks to increase maritime co-operation among navies of the littoral states of the Indian Ocean Region.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The inaugural IONS was held in 2008, not 2015, and it was not chaired by the Indian Navy.  Statement 2 is correct. IONS is a voluntary initiative aimed at enhancing maritime cooperation among navies in the Indian Ocean Region.  Therefore, only statement 2 is correct.\n\nIndian Ocean Naval Symposium (IONS): IONS is a multinational naval initiative that promotes cooperation and information sharing among navies of the littoral states of the Indian Ocean Region.  It aims to enhance maritime security and stability in the region.\n\nLittoral states: These are countries bordering the Indian Ocean.  They are involved in IONS to improve collaboration on maritime issues.\n"
    },
    {
        "Q.No.": 69,
        "question_text": "The painting of Bodhisattva Padmapani is one of the most famous and oft-illustrated paintings at:",
        "option_a": "Ajanta",
        "option_b": "Badami",
        "option_c": "Bagh",
        "option_d": "Ellora",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation: The provided text mentions a Reclining Buddha sculpture in Cave No. 26 of Ajanta, described as one of the most famous and oft-illustrated paintings.  Ajanta caves are known for their elaborate murals depicting scenes from the Jataka tales and the life of Buddha.  Badami, Bagh, and Ellora are also mentioned as locations of significant cave paintings and sculptures, but the question specifically points to the Padmapani Bodhisattva painting, which is prominently featured in Ajanta.\n\nAjanta Caves: Located in Maharashtra, India, these rock-cut caves are renowned for their murals and sculptures from the 2nd century BCE to the 6th century CE, showcasing the flourishing of Buddhist art during the period.\n\nBadami Caves: Situated in Karnataka, India, these caves are known for their rock-cut temples and sculptures from the 6th century CE, representing a blend of architectural styles and religious beliefs.\n\nBagh Caves: Found in Madhya Pradesh, India, these caves feature murals and sculptures, primarily from the 5th-6th centuries CE, demonstrating a unique style influenced by both Indian and Central Asian art.\n\nEllora Caves: Located in Maharashtra, India, these caves are a UNESCO World Heritage site, famous for their rock-cut temples and monasteries, representing a harmonious coexistence of Hindu, Buddhist, and Jain faiths from the 6th to 10th centuries CE.\n"
    },
    {
        "Q.No.": 70,
        "question_text": "Consider the following pairs:\n   Traditions               Communities\n1. Chaliha Sahib Festival - Sindhis\n2. Nanda Raj Jaat Yatra   - Gonds\n3. Wari-Warkari           - Santhals\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "None of the above",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation: Only statement 1 is correctly matched. The Chaliha Sahib Festival is associated with the Sindhi community.  Nanda Raj Jaat Yatra is associated with the Gonds. Wari-Warkari is associated with the Varkaris, not the Santhals.\n\nSindhis: An ethnic group primarily residing in Sindh province of Pakistan and also in India.  They have a rich cultural heritage including festivals like the Chaliha Sahib.\n\nGonds: One of the largest tribal groups in India, inhabiting central and parts of southern India. Their traditions include the Nanda Raj Jaat Yatra.\n\nVarkaris: A sect of Hindus in Maharashtra, known for their Wari pilgrimage to Pandharpur.  They are not related to Santhals.\n\nSanthals: A tribal community primarily residing in Jharkhand, West Bengal, Odisha, and Bihar.  They have their own distinct traditions and festivals.\n"
    },
    {
        "Q.No.": 71,
        "question_text": "Which of the following practices can help in water conservation in agriculture?\n1. Reduced or zero tillage of the land\n2. Applying gypsum before irrigating the field\n3. Allowing crop residue to remain in the field\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "1 and 3 only",
        "correct_option": "d",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:Reduced or zero tillage (1) helps conserve water by reducing soil disturbance, which minimizes evaporation and maintains soil moisture. Leaving crop residue (3) on the field acts as a mulch, further reducing evaporation and improving water infiltration. Applying gypsum (2) before irrigation can improve soil structure and water infiltration, but its primary benefit is in improving soil drainage and reducing salinity, not necessarily in direct water conservation.  Therefore, options 1 and 3 are directly related to water conservation in agriculture.\n\nZero tillage:  A farming technique that minimizes soil disturbance, leaving crop residue on the field. This helps retain soil moisture, reduce erosion, and improve soil health.\n\nGypsum: A soil amendment containing calcium sulfate. It improves soil structure, drainage, and reduces salinity. While it can indirectly affect water use efficiency, its primary function isn't direct water conservation.\n\nCrop residue: The leftover plant material after harvest (e.g., stalks, leaves).  Leaving it in the field acts as a natural mulch, reducing evaporation, suppressing weeds, and improving soil health.  This improves water retention in the soil.\n"
    },
    {
        "Q.No.": 72,
        "question_text": "Consider the following statements: The nation-wide 'Soil Health Card Scheme' aims at:\n1. expanding the cultivable area under irrigation.\n2. enabling the banks to assess the quantum of loans to be granted to farmers on the basis of soil quality.\n3. checking the overuse of fertilizers in farmlands.\nWhich of the above statements is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation: The Soil Health Card Scheme primarily focuses on enabling banks to assess loans based on soil quality (statement 2) and checking fertilizer overuse (statement 3).  It does *not* aim to expand the cultivable area under irrigation (statement 1).  Therefore, only statements 2 and 3 are correct.\n\nSoil Health Card Scheme: A government initiative in India to provide farmers with information on the nutrient content of their soil. This helps them make informed decisions about fertilizer use, improving crop yields and soil health.\n\nNamed entities from the question and options:  There are no other important named entities besides the scheme name in the provided context.\n"
    },
    {
        "Q.No.": 73,
        "question_text": "Consider the following pairs:\n   Commonly used / consumed materials               Unwanted or controversial chemicals likely to be found in them\n1. Lipstick                            -            Lead\n2. Soft drinks                         -            Brominated vegetable oils\n3. Chinese fast food                   -            Monosodium glutamate\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation: Lead has been found in some lipsticks, brominated vegetable oils are sometimes used in soft drinks, and monosodium glutamate (MSG) is a common additive in Chinese food, particularly fast food.  Therefore, all three pairs are correctly matched.\n\nLead: A heavy metal, lead is toxic and can accumulate in the body, causing various health problems.  Its presence in cosmetics like lipstick is a subject of concern.\n\nBrominated vegetable oils (BVOs):  These are brominated fatty acids used as emulsifiers, primarily in citrus-flavored soft drinks. They have raised health concerns due to potential bromine buildup in the body.\n\nMonosodium glutamate (MSG):  An amino acid, MSG is a flavor enhancer widely used in many cuisines. While generally regarded as safe, some individuals experience adverse reactions like headaches or nausea after consuming it.  It's often associated with Asian cuisine and processed foods.\n"
    },
    {
        "Q.No.": 74,
        "question_text": "Organic Light Emitting Diodes (OLEDs) are used to create digital display in many devices. What are the advantages of OLED displays over Liquid Crystal displays?\n1. OLED displays can be fabricated on flexible plastic substrates.\n2. Roll-up displays embedded in clothing can be made using OLEDs.\n3. Transparent displays are possible using OLEDs.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "1, 2 and 3",
        "option_d": "None of the above statements is correct",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: OLED displays offer several advantages over LCDs.  OLEDs can be made flexible and transparent because they don't require a backlight.  This allows for flexible displays that can be rolled up (statement 2) and transparent displays (statement 3).  The ability to fabricate OLEDs on flexible plastic substrates (statement 1) is also a key advantage.  Therefore, all three statements are correct.\n\nOLED (Organic Light Emitting Diode): A type of display technology that uses organic compounds to emit light when an electric current is passed through them.  They are known for their high contrast, wide viewing angles, and quick response times.\n\nLCD (Liquid Crystal Display): A type of display technology that uses liquid crystals to modulate light.  They typically require a backlight, which affects their power consumption and contrast ratio.\n"
    },
    {
        "Q.No.": 75,
        "question_text": "Which of the following is/are famous for Sun temples?\n1. Arasavalli\n2. Amarakantak\n3. Omkareshwar\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation: Arasavalli in Andhra Pradesh is famous for its Sun Temple.  The provided text mentions Konark, Martand, Katarmal, Surya Pahar, Dakshinaaka, Suryanar Kovil, Modera, and Brahmanya as other prominent sun temples.  Amarakantak and Omkareshwar are not primarily known for sun temples.  Amarakantak is a pilgrimage site associated with the origin of the Narmada River. Omkareshwar is a significant Shiva temple located on an island in the Narmada River.\n"
    },
    {
        "Q.No.": 76,
        "question_text": "Consider the following statements:\n1. In the election for Lok Sabha or State Assembly, the winning candidate must get at least 50 percent of the votes polled, to be declared elected.\n2. According to the provisions laid down in the Constitution of India, in Lok Sabha, the Speaker's post goes to the majority party and the Deputy Speaker's to the Opposition.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation:Statement 1 is incorrect.  In elections for the Lok Sabha or State Assemblies, a candidate doesn't need to secure 50% of the votes to win.  The candidate who secures the highest number of votes in a constituency is declared the winner, regardless of the percentage of votes received.\n\nStatement 2 is also incorrect. The Constitution of India doesn't mandate that the Speaker's post in the Lok Sabha goes to the majority party and the Deputy Speaker's post to the opposition. While it's a convention that the Speaker usually comes from the ruling party, there's no constitutional provision guaranteeing this. The selection of the Speaker and Deputy Speaker is done by the House itself through election.\n\n\nLok Sabha:  The lower house of the Indian Parliament, representing the people of India through elected representatives from various constituencies.  It is responsible for initiating most legislation and controlling the government's finances.\n\nState Assembly: The legislative assembly of an Indian state.  Each state has its own assembly, which is responsible for making laws for that state.\n\nConstitution of India: The supreme law of India, which lays down the framework for the governance of the country, defining the powers of the different branches of government and guaranteeing fundamental rights to its citizens.\n\nSpeaker: The presiding officer of the Lok Sabha.  Their role is to maintain order and decorum during sessions, to interpret rules and regulations, and to ensure fair and efficient conduct of business.\n\nDeputy Speaker: The second-in-command in the Lok Sabha. They preside over the House in the absence of the Speaker and assist the Speaker in their duties.  They are also elected by the House.\n"
    },
    {
        "Q.No.": 77,
        "question_text": "Which of the following has/have occurred in India after its liberalization of economic policies in 1991?\n1. Share of agriculture in GDP increased enormously.\n2. Share of India's exports in world trade increased.\n3. FDI inflows increased.\n4. India's foreign exchange reserves increased enormously.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 4 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation: After India's economic liberalization in 1991, several changes occurred:\n\n* **Share of agriculture in GDP:**  The share of agriculture in India's GDP did not increase enormously; instead, it gradually decreased as the services and industrial sectors grew.\n\n* **Share of India's exports in world trade:**  India's share of exports in world trade increased, although it remains relatively small compared to major global players like China and the US.  Liberalization measures aimed to boost exports by removing trade barriers and promoting foreign investment.\n\n* **FDI inflows:** Foreign Direct Investment (FDI) inflows into India increased significantly following liberalization.  The reforms aimed to attract foreign capital to stimulate economic growth.\n\n* **India's foreign exchange reserves:** India's foreign exchange reserves increased enormously after 1991.  Increased exports, FDI inflows, and other factors contributed to this rise.\n\nTherefore, statements 2, 3, and 4 are correct.\n\n**Short notes on important keywords and named entities:**\n\n**Economic liberalization (1991):**  A series of economic reforms initiated by India in 1991, shifting from a centrally planned economy to a more market-oriented system.  Key features included deregulation, privatization, and opening up to foreign investment.\n\n**GDP (Gross Domestic Product):** The total monetary or market value of all the finished goods and services produced within a country's borders in a specific time period.  It's a key indicator of a country's economic performance.\n\n**FDI (Foreign Direct Investment):**  Investment made by a company or individual in a foreign country to gain control or influence over an existing business or to create a new business.  It's a significant driver of economic growth.\n\n**Foreign exchange reserves:**  Assets held by a central bank in foreign currencies, gold, and other reserve assets.  These reserves are crucial for managing a country's balance of payments and exchange rate.\n\n**WTO (World Trade Organization):**  An intergovernmental organization that regulates international trade and aims to liberalize trade among its member countries.\n"
    },
    {
        "Q.No.": 78,
        "question_text": "What is the application of Somatic Cell Nuclear Transfer Technology?",
        "option_a": "Production of biolarvicides",
        "option_b": "Manufacture of biodegradable plastics",
        "option_c": "Reproductive cloning of animals",
        "option_d": "Production of organisms free of diseases",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: Somatic Cell Nuclear Transfer (SCNT) is a reproductive cloning technique.  In SCNT, the nucleus of a somatic cell (any cell other than a germ cell) is transferred into an enucleated egg cell (an egg cell that has had its own nucleus removed). This reconstructed egg cell is then stimulated to divide and develop into an embryo, which can then be implanted into a surrogate mother to develop into a clone of the somatic cell donor.  Reproductive cloning of animals is one of its applications.\n\nBiolarvicides are biological agents used to control mosquito larvae. Biodegradable plastics are plastics that can be broken down by microorganisms.  Organisms free of diseases are disease-free organisms.  These are not direct applications of SCNT.\n"
    },
    {
        "Q.No.": 79,
        "question_text": "Consider the following statements:\n1. National Payments Corporation of India (NPCI) helps in promoting the financial inclusion in the country.\n2. NPCI has launched RuPay, a card payment scheme.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct. The National Payments Corporation of India (NPCI) plays a crucial role in promoting financial inclusion in India by providing access to digital payment systems for a wider population, including those in rural and underserved areas.  NPCI's initiatives like UPI have significantly expanded access to financial services.\n\nStatement 2 is also correct.  NPCI launched RuPay, an Indian domestic card payment network, to provide an alternative to international card networks like Visa and Mastercard.  RuPay cards are widely used in India and contribute to the country's digital payment ecosystem.\n\n\nNPCI (National Payments Corporation of India): A not-for-profit organisation owned by major Indian banks, it operates several retail payment systems in India, including the Unified Payments Interface (UPI) and Immediate Payment Service (IMPS).  It aims to create a robust and efficient payment infrastructure.\n\nRuPay:  India's domestic card payment network, offering debit, credit, and prepaid cards. It aims to reduce reliance on international payment networks and promote financial inclusion.\n"
    },
    {
        "Q.No.": 80,
        "question_text": "The term 'M-STRIPES' is sometimes seen in the news in the context of",
        "option_a": "Captive breeding of Wild Fauna",
        "option_b": "Maintenance of Tiger Reserves",
        "option_c": "Indigenous Satellite Navigation System",
        "option_d": "Security of National Highways",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: The M-STRIPES (Monitoring system for tigers - intensive protection and ecological status) system uses GPS technology to geotag photographic evidence and survey information, improving the accuracy of tiger population assessments.  This system is used in the context of maintaining tiger reserves and monitoring tiger populations.\n\n\nCaptive breeding of Wild Fauna:  Involves breeding endangered species in controlled environments to increase their population and reintroduce them into the wild.  Examples mentioned include the captive breeding of Indian Pangolins at Nandankanan Zoological Park.\n\nMaintenance of Tiger Reserves:  Focuses on the conservation and management of tiger habitats to ensure the survival and growth of tiger populations.  The M-STRIPES system is directly related to this.  Examples include Panna Tiger Reserve, Corbett Tiger Reserve, and others.\n\nIndigenous Satellite Navigation System:  Refers to a domestically developed satellite-based navigation system, independent of foreign systems like GPS.  Not directly related to the provided text.\n\nSecurity of National Highways:  Concerned with the safety and protection of national highways, often involving infrastructure and law enforcement.  Not directly related to the provided text.\n"
    },
    {
        "Q.No.": 81,
        "question_text": "What is/are the most likely advantages of implementing 'Goods and Services Tax (GST)'?\n1. It will replace multiple taxes collected by multiple authorities and will thus create a single market in India.\n2. It will drastically reduce the 'Current Account Deficit' of India and will enable it to increase its foreign exchange reserves.\n3. It will enormously increase the growth and size of economy of India and will enable it to overtake China in the near future.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation: The Goods and Services Tax (GST) is designed to replace multiple indirect taxes levied by different authorities in India, creating a unified national market.  This simplification reduces compliance burdens for businesses and promotes ease of doing business. While GST might indirectly affect the current account deficit and economic growth, these are not direct or guaranteed outcomes.  A significant increase in economic growth to the extent of overtaking China is highly speculative and depends on many other factors beyond GST.  Therefore, only statement 1 accurately reflects a likely advantage of GST implementation.\n\nGoods and Services Tax (GST): A single indirect tax levied on the supply of goods and services across India, replacing multiple indirect taxes.  It aims to streamline tax collection, reduce compliance costs, and create a unified market.\n\nCurrent Account Deficit (CAD): The difference between a country's total earnings from exports and its total spending on imports. A high CAD can indicate a vulnerability in the country's external finances.\n\n"
    },
    {
        "Q.No.": 82,
        "question_text": "'Broad-based Trade and Investment Agreement (BTIA)' is sometimes seen in the news in the context of negotiations held between India and",
        "option_a": "European Union",
        "option_b": "Gulf Cooperation Council",
        "option_c": "Organization for Economic Cooperation and Development",
        "option_d": "Shanghai Cooperation Organization",
        "correct_option": "a",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (a)\nexplanation:The provided text mentions the Broad-based Trade and Investment Agreement (BTIA) in the context of negotiations between India and the European Union.  The European Union is a political and economic alliance of 27 European countries.  The Gulf Cooperation Council (GCC) is a regional intergovernmental political and economic union consisting of six Middle Eastern countries. The Organisation for Economic Co-operation and Development (OECD) is an intergovernmental economic organisation with 38 member countries, focused on promoting policies that will improve the economic and social well-being of people around the world. The Shanghai Cooperation Organisation (SCO) is a Eurasian political, economic, and security alliance.  The BTIA is a comprehensive agreement aiming to boost trade and investment between India and the EU.  While the text references other agreements and negotiations involving India and other entities, the BTIA is specifically linked to the EU.\n"
    },
    {
        "Q.No.": 83,
        "question_text": "Consider the following statements:\n1. India has ratified the Trade Facilitation Agreement (TFA) of WTO.\n2. TFA is a part of WTO's Bali Ministerial Package of 2013.\n3. TFA came into force in January 2016.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation: All three statements are correct.  The Trade Facilitation Agreement (TFA) is indeed part of the WTO's Bali Ministerial Package of 2013.  India has ratified the TFA, and it came into force in February 2017 (not January 2016 as stated in statement 3, this is a minor factual error).  The TFA aims to streamline customs procedures and reduce trade barriers.  The WTO (World Trade Organization) is an intergovernmental organization that regulates international trade.  Free Trade Agreements (FTAs) are agreements between two or more countries to reduce or eliminate trade barriers.\n"
    },
    {
        "Q.No.": 84,
        "question_text": "What is the importance of developing Chabahar Port by India?",
        "option_a": "India's trade with African countries will enormously increase.",
        "option_b": "India's relations with oil-producing Arab countries will be strengthened.",
        "option_c": "India will not depend on Pakistan for access to Afghanistan and Central Asia.",
        "option_d": "Pakistan will facilitate and protect the installation of a gas pipeline between Iraq and India.",
        "correct_option": "c",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (c)\n\nexplanation:Developing Chabahar Port is crucial for India because it provides an alternative route to access Afghanistan and Central Asia without relying on Pakistan.  Currently,  India's access to these regions is significantly hampered by strained relations with Pakistan and the lack of direct access.  Chabahar Port, located in Iran, offers a strategic sea route circumventing this obstacle.\n\n**Short notes on named entities:**\n\n* **Chabahar Port:** A port in southeastern Iran, strategically located on the Gulf of Oman. Its development is crucial for India's access to Afghanistan and Central Asia, bypassing Pakistan.\n\n* **India:** A large South Asian country with significant economic and strategic interests in the region, including access to Central Asia and Afghanistan for trade and other purposes.\n\n* **Pakistan:** A South Asian country bordering India and Afghanistan.  Geopolitical tensions between India and Pakistan have historically hindered India's access to Central Asia.\n\n* **Afghanistan:** A landlocked country in Central Asia.  Access to Afghanistan is important for India's economic and strategic interests in the region.\n\n* **Central Asia:** A region in Eurasia comprising several landlocked countries including Kazakhstan, Uzbekistan, Turkmenistan, Tajikistan, and Kyrgyzstan.  Access to Central Asia is crucial for India’s trade and connectivity with the region.\n\nThe other options are incorrect: increased trade with African countries and stronger relations with Arab oil-producing countries are not the primary reasons for developing Chabahar Port.  Pakistan is unlikely to facilitate any infrastructure projects that benefit India's access to Central Asia given the existing geopolitical tensions.\n"
    },
    {
        "Q.No.": 85,
        "question_text": "In India, it is legally mandatory for which of the following to report on cyber security incidents?\n1. Service providers\n2. Data centres\n3. Body corporate\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation: The provided text does not contain information on mandatory cybersecurity incident reporting in India.  Therefore, a definitive answer cannot be provided.  There is no information about service providers, data centers, or body corporate in relation to cybersecurity reporting within the given context.\n"
    },
    {
        "Q.No.": 86,
        "question_text": "Right to vote and to be elected in India is a",
        "option_a": "Fundamental Right",
        "option_b": "Natural Right",
        "option_c": "Constitutional Right",
        "option_d": "Legal Right",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: The right to vote and to be elected in India is a Constitutional Right.  Fundamental Rights are guaranteed by the Constitution and are justiciable (can be enforced by courts).  Natural Rights are inherent rights that exist independently of government or law. Legal Rights are rights created and protected by law. While the right to vote and be elected is rooted in the Constitution and is a legal right, it's fundamentally a constitutional right because its existence and protection are specifically defined and guaranteed by the Indian Constitution.  The Constitution outlines who is eligible to vote and contest elections, establishing this right as a cornerstone of Indian democracy.\n"
    },
    {
        "Q.No.": 87,
        "question_text": "What is the purpose of 'evolved Laser Interferometer Space Antenna (eLISA)' project?",
        "option_a": "To detect neutrinos",
        "option_b": "To detect gravitational waves",
        "option_c": "To detect the effectiveness of missile defence system",
        "option_d": "To study the effect of solar flares on our communication systems",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: The evolved Laser Interferometer Space Antenna (eLISA) project aims to detect gravitational waves.  Gravitational waves are ripples in spacetime caused by accelerating massive objects.  eLISA is designed to detect these waves with significantly greater sensitivity than ground-based detectors, allowing for the observation of much weaker and more distant events.  Neutrinos are subatomic particles, unrelated to gravitational waves. Missile defense systems and solar flares are not directly related to eLISA's objective.\n"
    },
    {
        "Q.No.": 88,
        "question_text": "What is the purpose of 'Vidyanjali Yojana'?\n1. To enable the famous foreign educational institutions to open their campuses in India.\n2. To increase the quality of education provided in government schools by taking help from the private sector and the community.\n3. To encourage voluntary monetary contributions from private individuals and organizations so as to improve the infrastructure facilities for primary and secondary schools.\nSelect the correct answer using the code given below:",
        "option_a": "2 only",
        "option_b": "3 only",
        "option_c": "1 and 2 only",
        "option_d": "2 and 3 only",
        "correct_option": "d",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (d)\nexplanation:Vidyanjali Yojana aims to improve the quality of education in government schools by encouraging participation from the private sector and the community.  It also facilitates voluntary contributions from individuals and organizations to enhance school infrastructure. Option 2 accurately reflects the scheme's focus on leveraging private sector and community engagement to improve government school education. Option 3 correctly describes the scheme's encouragement of voluntary contributions for infrastructure improvement. Option 1 is incorrect; Vidyanjali Yojana does not deal with foreign educational institutions.\n\nVidyanjali Yojana: A government initiative promoting collaboration between government schools and private entities/individuals to enhance education quality and infrastructure.  It relies on voluntary contributions and partnerships to achieve its goals.\n\nSamagra Siksha: An integrated scheme for school education in India, encompassing various aspects from pre-school to class 12. It aims to improve access, equity, and quality in education.\n\nPrivate sector: The segment of the economy comprising businesses owned and operated by private individuals or groups.  Their involvement in Vidyanjali Yojana is crucial for supplementing government resources.\n\nCommunity: A group of people living in the same place and having shared interests.  Community participation in Vidyanjali Yojana is key to localizing educational improvements.\n"
    },
    {
        "Q.No.": 89,
        "question_text": "What is the aim of the programme 'Unnat Bharat Abhiyan'?",
        "option_a": "Achieving 100% literacy by promoting collaboration between voluntary organizations and government's education system and local communities.",
        "option_b": "Connecting institutions of higher education with local communities to address development challenges through appropriate technologies.",
        "option_c": "Strengthening India's scientific research institutions in order to make India a scientific and technological power.",
        "option_d": "Developing human capital by allocating special funds for health care and education of rural and urban poor, and organizing skill development programmes and vocational training for them.",
        "correct_option": "b",
        "subject": "polity",
        "year": 2017,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Unnat Bharat Abhiyan aims to connect institutions of higher education with local communities to address development challenges through appropriate technologies.  The program leverages the knowledge and expertise of universities and colleges to find solutions for rural development issues.\n\nThe other options are incorrect because they describe different initiatives. Option (a) focuses on literacy, (c) on scientific research, and (d) on human capital development through broader means.  There is no specific mention in the provided text of the named entities like BLFS, NSSO, Human Development Index (HDI), Mahbub ul Haq, Amartya Sen, TPOS, AAY, NREGA, RTE,  etc.  Therefore, no notes on those can be provided.  The context provided does not directly relate to the Unnat Bharat Abhiyan.\n"
    },
    {
        "Q.No.": 90,
        "question_text": "Consider the following statements:\n1. The Election Commission of India is a five-member body.\n2. Union Ministry of Home Affairs decides the election schedule for the conduct of both general elections and bye-elections.\n3. Election Commission resolves the disputes relating to splits/mergers of recognised political parties.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "3 only",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (d)\n\nexplanation:Statement 1 is incorrect. The Election Commission of India is a body with a Chief Election Commissioner and two Election Commissioners, not five.  Statement 2 is incorrect. The Election Commission of India, not the Union Ministry of Home Affairs, decides the election schedule. Statement 3 is correct. The Election Commission resolves disputes related to splits and mergers of recognized political parties.  Therefore, only statement 3 is correct.\n\nElection Commission of India:  An independent constitutional body responsible for conducting free and fair elections in India. Its composition, powers, and functions are defined in the Constitution and other related laws.\n\nUnion Ministry of Home Affairs: A Union ministry responsible for internal security, policing, and other related matters in India. It does not have a direct role in setting election schedules.\n"
    },
    {
        "Q.No.": 91,
        "question_text": "In India, if a species of tortoise is declared protected under Schedule I of the Wildlife (Protection) Act, 1972, what does it imply?",
        "option_a": "It enjoys the same level of protection as the tiger.",
        "option_b": "It no longer exists in the wild, a few individuals are under captive protection; and now it is impossible to prevent its extinction.",
        "option_c": "It is endemic to a particular region of India.",
        "option_d": "Both (b) and (c) stated above are correct in this context.",
        "correct_option": "a",
        "subject": "environment",
        "year": 2017,
        "explanation": "* **correct_option:** (a)\n* **explanation:**  Schedule I of the Wildlife (Protection) Act, 1972, provides the highest level of protection to listed species.  This means that harming, hunting, or trading these species is strictly prohibited, carrying severe penalties.  Therefore, a tortoise listed under Schedule I enjoys the same level of protection as a tiger, which is also typically listed under Schedule I. Option (b) is incorrect because Schedule I listing doesn't inherently imply imminent extinction. Option (c) is also incorrect;  endemism is a separate characteristic unrelated to Schedule I protection.\n\n**Wildlife (Protection) Act, 1972:** This is India's primary legislation for protecting wild animals and plants. It establishes schedules categorizing species based on their conservation status, with Schedule I offering the highest protection.\n\n**Schedule I:** This schedule lists species that are critically endangered or highly vulnerable and require the strictest protection under the Wildlife (Protection) Act, 1972.  Examples include the tiger, one-horned rhinoceros, and various other endangered species.\n\n**Tiger:**  A large carnivorous mammal, an apex predator, and a flagship species for conservation efforts globally.  Its conservation status is a major indicator of the health of ecosystems.  Project Tiger is a notable conservation program dedicated to protecting tigers in India.\n"
    },
    {
        "Q.No.": 92,
        "question_text": "In India, Judicial Review implies",
        "option_a": "the power of the Judiciary to pronounce upon the constitutionality of laws and executive orders.",
        "option_b": "the power of the Judiciary to question the wisdom of the laws enacted by the Legislatures.",
        "option_c": "the power of the Judiciary to review all the legislative enactments before they are assented to by the President.",
        "option_d": "the power of the Judiciary to review its own judgements given earlier in similar or different cases.",
        "correct_option": "a",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation: Judicial review in India refers to the power of the judiciary to examine the constitutionality of laws and executive orders.  It does *not* involve questioning the wisdom of laws (option b), reviewing legislation before presidential assent (option c), or solely reviewing its own past judgments (option d), although the latter can be a component of the overall process.  The Indian judiciary's power of judicial review is a cornerstone of its role in upholding the Constitution's supremacy and maintaining a balance of power among the legislative, executive, and judicial branches.  Articles 13, 32, and 226 of the Indian Constitution are relevant to this power.  Landmark cases like Golaknath, Kesavananda Bharati, and Minerva Mills have shaped the understanding and application of judicial review in India.  The \"basic structure doctrine\" further defines the limits of legislative power subject to judicial review.\n"
    },
    {
        "Q.No.": 93,
        "question_text": "With reference to Indian freedom struggle, consider the following events:\n1. Mutiny in Royal Indian Navy\n2. Quit India Movement launched\n3. Second Round Table Conference\nWhat is the correct chronological sequence of the above events?",
        "option_a": "1-2-3",
        "option_b": "2-1-3",
        "option_c": "3-2-1",
        "option_d": "3-1-2",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2017,
        "explanation": "correct_option: (c)\n\nexplanation: The correct chronological order is the Second Round Table Conference, the Quit India Movement, and the Royal Indian Navy mutiny.\n\n* **Second Round Table Conference:** This conference was held in London in 1931.  It aimed to discuss the future of India's constitutional reforms under British rule.  Discussions involved representatives from various Indian political groups.  However, it didn't lead to significant progress towards immediate independence.\n\n* **Quit India Movement:** Launched in 1942, this was a mass civil disobedience movement demanding immediate independence from British rule.  It involved widespread protests and arrests throughout India.  It significantly escalated the pressure on the British government.\n\n* **Royal Indian Navy Mutiny:** This mutiny, occurring in February 1946, involved sailors of the Royal Indian Navy.  It was a major event demonstrating growing dissatisfaction with British rule and contributed to the eventual transfer of power.  The mutiny's widespread support highlighted the declining British authority in India.\n"
    },
    {
        "Q.No.": 94,
        "question_text": "Consider the following statements:\n1. Tax revenue as a percent of GDP of India has steadily increased in the last decade.\n2. Fiscal deficit as a percent of GDP of India has steadily increased in the last decade.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "economy",
        "year": 2017,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  The provided text does not contain data showing a steady increase in tax revenue as a percentage of GDP for India over the last decade.  While it mentions fiscal deficit increases and various tax reforms, it lacks the specific decade-long trend data needed to confirm or deny this statement.\n\nStatement 2 is correct. The text mentions an increase in India's fiscal deficit as a percentage of GDP from 2.9% in 2019-20 to 4.1% in 2020-21, representing a significant rise of ₹2.25 lakh crore.  Further, the aggregate public debt of states increased to 25.1% of GDP in 2021-22 from 17.2% in 2011-12. This demonstrates a clear increase in fiscal deficit as a percentage of GDP, although not necessarily a *steady* increase across the entire decade.  The information provided supports the general trend of increase, making statement 2 correct.\n\n\nShort notes on important keywords and named entities:\n\n**GDP (Gross Domestic Product):** The total monetary or market value of all the finished goods and services produced within a country's borders in a specific time period.  It's a key indicator of a nation's economic health.\n\n**Fiscal Deficit:** The difference between a government's total expenditure and its total revenue (excluding borrowings). A high fiscal deficit indicates the government is spending more than it earns and needs to borrow to cover the shortfall.\n\n**Tax Revenue:**  Income generated by the government through various taxes levied on individuals and corporations (e.g., income tax, corporate tax, GST). It forms a major part of government revenue.\n\n\n"
    },
    {
        "Q.No.": 95,
        "question_text": "Recently there was a proposal to translocate some of the lions from their natural habitat in Gujarat to which one of the following sites?",
        "option_a": "Corbett National Park",
        "option_b": "Kuno Palpur Wildlife Sanctuary",
        "option_c": "Mudumalai Wildlife Sanctuary",
        "option_d": "Sariska National Park",
        "correct_option": "b",
        "subject": "environment",
        "year": 2017,
        "explanation": "correct_option: (b)\nexplanation: The provided text mentions a proposal to relocate Asiatic lions from their natural habitat in Gujarat to Kuno Palpur Wildlife Sanctuary in Madhya Pradesh.  This was a Supreme Court directive, although the Gujarat government has expressed reluctance.\n\nCorbett National Park: Located in Uttarakhand, India, it's known for its tiger population and diverse flora and fauna. It's a significant tiger reserve.\n\nKuno Palpur Wildlife Sanctuary: Situated in Madhya Pradesh, India, it was proposed as a new habitat for Asiatic lions due to overcrowding and inbreeding concerns in Gir National Park.  It's also been considered for African cheetah reintroduction.\n\nMudumalai Wildlife Sanctuary: Located in Tamil Nadu, India, it's part of the Nilgiri Biosphere Reserve and is known for its diverse wildlife, including elephants, tigers, and deer. It forms a contiguous habitat with other protected areas.\n\nSariska National Park: Situated in Rajasthan, India, it's a tiger reserve that has faced challenges in the past due to poaching and loss of tiger population.  It's known for its rocky terrain and diverse vegetation.\n"
    },
    {
        "Q.No.": 96,
        "question_text": "Which of the following are not necessarily the consequences of the proclamation of the President's rule in a State?\n1. Dissolution of the State Legislative Assembly\n2. Removal of the Council of Ministers in the State\n3. Dissolution of the local bodies\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (c)\n\nexplanation:The proclamation of President's Rule in a state, under Article 356 of the Indian Constitution, doesn't necessitate the dissolution of local bodies.  While the President can dismiss the Council of Ministers and may choose to dissolve the State Legislative Assembly, these actions are not mandatory. The decision to dissolve the Assembly is at the President's discretion and depends on the circumstances leading to the imposition of President's Rule.  Dissolution of local bodies is not a direct consequence.\n\n**Short Notes:**\n\n* **President's Rule:** The imposition of central government rule in a state when the constitutional machinery breaks down.  This involves the President taking over the state's administration. It's subject to judicial review, as seen in the S.R. Bommai case.  The 44th Amendment Act of 1978 brought changes to the process and duration of President's Rule.\n\n* **State Legislative Assembly:** The elected legislative body of a state responsible for making laws for the state.  Its dissolution is a potential consequence of President's Rule, but not a guaranteed one.\n\n* **Council of Ministers:** The state's executive body headed by the Chief Minister. It's dismissed upon the imposition of President's Rule.\n\n* **Local Bodies:** These are self-governing entities at the local level (e.g., municipalities, panchayats). Their functioning is not directly affected by the imposition of President's Rule.\n\n* **Article 356:** The constitutional provision that empowers the President to impose President's Rule.\n\n* **Article 365:** This article deals with the situation where a state fails to comply with directions from the central government.\n\n* **S.R. Bommai Case (1994):** A landmark Supreme Court case that established important guidelines for the imposition of President's Rule, emphasizing the need for judicial oversight.\n\n* **44th Amendment Act (1978):** This amendment brought about significant changes to Article 356, limiting the President's power to impose President's Rule and strengthening judicial review.\n"
    },
    {
        "Q.No.": 97,
        "question_text": "Which of the following are envisaged by the Right against Exploitation in the Constitution of India?\n1. Prohibition of traffic in human beings and forced labour\n2. Abolition of untouchability\n3. Protection of the interests of minorities\n4. Prohibition of employment of children in factories and mines\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 4 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "correct_option: (c)\nexplanation: The Right against Exploitation, enshrined in Articles 23 and 24 of the Indian Constitution, prohibits traffic in human beings and forced labor (Article 23) and the employment of children in factories and mines (Article 24).  Abolition of untouchability is a separate right under Article 17, and protection of minority interests is covered under Articles 29 and 30, not under the Right against Exploitation. Therefore, only options 1 and 4 are envisaged by the Right against Exploitation.\n\n**Short Notes:**\n\n* **Constitution of India:** The supreme law of India, adopted on 26th November 1949 and came into effect on 26th January 1950. It outlines the fundamental rights and duties of citizens and establishes the structure of the government.\n\n* **Right against Exploitation:**  A fundamental right in the Indian Constitution that aims to protect individuals from forced labor, human trafficking, and child labor.  It aims to prevent exploitation of vulnerable sections of society.\n\n* **Traffic in human beings:**  The illegal trade and transportation of people for forced labor, sexual exploitation, or other forms of servitude.  A serious crime that violates human rights.\n\n* **Forced labour:**  Any work or service which is exacted from any person under the menace of any penalty and for which the said person has not offered himself voluntarily.  A violation of fundamental human rights.\n\n* **Abolition of untouchability:**  The practice of untouchability, based on caste discrimination, was outlawed by the Indian Constitution.  It is a violation of the right to equality and dignity.\n\n* **Protection of the interests of minorities:**  The Constitution of India guarantees protection of the rights and interests of linguistic and religious minorities through various provisions. It ensures they can preserve their culture and language.\n\n* **Prohibition of employment of children in factories and mines:**  A legal provision that safeguards children from hazardous working conditions and exploitation in factories and mines.  It is a crucial aspect of child rights protection.\n"
    },
    {
        "Q.No.": 98,
        "question_text": "Which of the following is geographically closest to Great Nicobar?",
        "option_a": "Sumatra",
        "option_b": "Borneo",
        "option_c": "Java",
        "option_d": "Sri Lanka",
        "correct_option": "a",
        "subject": "geography",
        "year": 2017,
        "explanation": "correct_option: (a)\n\nexplanation:Great Nicobar is the southernmost island of the Nicobar Islands, part of India.  Sumatra is an island in Indonesia, located relatively close to the Nicobar Islands. Borneo, Java, and Sri Lanka are significantly farther away geographically.  Sumatra is part of the Indonesian archipelago in Southeast Asia, known for its biodiversity and natural resources. Borneo is the third-largest island in the world, also in Southeast Asia, shared by Indonesia, Malaysia, and Brunei. Java is a densely populated Indonesian island, known for its volcanic landscapes and cultural richness. Sri Lanka is an island nation south of India, separated by the Palk Strait.\n"
    },
    {
        "Q.No.": 99,
        "question_text": "Out of the following statements, choose the one that brings out the principle underlying the Cabinet form of Government:",
        "option_a": "An arrangement for minimizing the criticism against the Government whose responsibilities are complex and hard to carry out to the satisfaction of all.",
        "option_b": "A mechanism for speeding up the activities of the Government whose responsibilities are increasing day by day.",
        "option_c": "A mechanism of parliamentary democracy for ensuring collective responsibility of the Government to the people.",
        "option_d": "A device for strengthening the hands of the head of the Government whose hold over the people is in a state of decline.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2017,
        "explanation": "* **correct_option:** (c)\n* **explanation:** The Cabinet form of government is fundamentally based on the principle of collective responsibility.  Option (c) accurately reflects this core principle: the government (the Cabinet) is collectively accountable to the people through the Parliament.  The other options describe potential benefits or drawbacks of a cabinet system but don't capture its defining characteristic.\n\n**Short Notes on Named Entities:**\n\n* **Cabinet:**  The Cabinet is the highest decision-making body in a parliamentary system. It comprises ministers who are collectively responsible for the government's actions.  The Cabinet's composition and functions vary across countries but generally involves the Prime Minister and key ministers heading different government departments.  The term's use in Indian context is noted to be relatively recent (1978).\n\n* **Parliamentary Democracy:** A system of government where the executive branch (government) is accountable to the legislature (Parliament). The Parliament elects or approves the head of government (Prime Minister) and can remove them through a vote of no confidence.\n\n* **Collective Responsibility:** A key principle in parliamentary systems where all members of the Cabinet are jointly responsible for government decisions and policies.  Individual ministers may have specific portfolios, but the entire Cabinet stands or falls together based on its overall performance.\n\n* **Prime Minister:** The head of government in a parliamentary system.  The Prime Minister leads the Cabinet, sets the government's agenda, and is accountable to the Parliament.\n\n* **President:** In many parliamentary systems (including India), the President is the head of state, a largely ceremonial role.  The President's powers are usually limited compared to the Prime Minister's.\n\n* **Westminster Model:** A system of parliamentary government originating in the United Kingdom.  It's characterized by a strong Parliament, a fusion of executive and legislative powers, and a cabinet system based on collective responsibility.\n\n* **Kitchen Cabinet:** An informal group of advisors to the Prime Minister, often operating outside of the formal Cabinet structure.  It's characterized by secrecy and less formal decision-making processes.\n\n* **Separation of Powers:** A principle of governance where governmental power is divided among distinct branches (legislative, executive, and judicial) to prevent tyranny and ensure checks and balances.  The degree of separation varies across different systems.\n\n* **Checks and Balances:** Mechanisms within a system of government that prevent any one branch from becoming too powerful.  These include the power of the legislature to oversee the executive, the judiciary's power of judicial review, and the executive's power to veto legislation.\n\n* **James Madison:** A key figure in the drafting of the US Constitution, known for his advocacy of separation of powers and checks and balances.\n\n* **Montesquieu:** A French political philosopher who championed the separation of powers as a means of limiting governmental power and preventing tyranny.\n\n* **Indira Gandhi:** Former Prime Minister of India. Her tenure witnessed significant political and constitutional events that impacted the Indian governmental system.\n\n* **Kesavananda Bharati Case:** A landmark case in Indian constitutional law that established the doctrine of basic structure, limiting the power of Parliament to amend fundamental aspects of the Constitution.\n\n* **Swaran Singh Committee:** A committee appointed to review the Indian governmental system, confirming the effectiveness of the parliamentary system.\n"
    },
    {
        "Q.No.": 100,
        "question_text": "Which one of the following is not a feature of Indian federalism?",
        "option_a": "There is an independent judiciary in India.",
        "option_b": "Powers have been clearly divided between the Centre and the States.",
        "option_c": "The federating units have been given unequal representation in the Rajya Sabha.",
        "option_d": "It is the result of an agreement among the federating units.",
        "correct_option": "d",
        "subject": "polity",
        "year": 2017,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Indian federalism is not the result of an agreement among the federating units.  India is described in Article 1 of its constitution as a \"Union of States,\" implying an indestructible union rather than a federation formed by agreement among pre-existing entities.  While the Government of India Act 1935 introduced a federal scheme, the current system is a unique blend of federal and unitary features, evolving through integration rather than agreement.\n\nThe other options are features of Indian federalism:\n\n(a) **Independent judiciary:** India has an independent judiciary as a crucial element of its federal structure, ensuring checks and balances between the central and state governments.  The Supreme Court plays a vital role in interpreting the Constitution and resolving disputes between different levels of government.\n\n(b) **Division of powers:** The Indian Constitution clearly divides powers between the Centre and the States through three lists: Union List, State List, and Concurrent List.  This division is a fundamental characteristic of federal systems.\n\n(c) **Unequal representation in Rajya Sabha:**  The Rajya Sabha (Council of States) represents the states, but with unequal representation based on population. This reflects a compromise between federal principles and the need for representation of larger states.  This is an example of the asymmetric nature of Indian federalism, deviating from a purely symmetrical structure.\n\n\n**Short notes on keywords and named entities:**\n\n* **Federalism:** A system of government where power is divided between a central authority and constituent political units (like states or provinces).  It balances central control with regional autonomy.\n\n* **Government of India Act 1935:** A landmark legislation that introduced a federal structure in British India.  While not a fully fledged federation, it laid some groundwork for the later Indian Constitution.\n\n* **Rajya Sabha:** The upper house of the Indian Parliament, representing the states.  It provides a voice for regional interests in national legislation.\n\n* **Union List, State List, Concurrent List:**  These lists in the Indian Constitution categorize legislative powers, assigning them to the central government, state governments, or both concurrently.\n\n* **Article 1 of the Indian Constitution:** This article defines India as a Union of States, emphasizing its unity and indivisibility.\n\n* **Asymmetric federalism:** A federal system where constituent units have unequal powers and responsibilities.  India exhibits this characteristic due to special provisions for certain states.\n\n* **K.C. Wheare:** A political scientist who analyzed Indian federalism and noted its centralized tendencies.  His work highlights the complexities of classifying the Indian system as purely federal or unitary.\n\n* **Canada model:**  The Canadian federal system has influenced the structure of Indian federalism, showcasing a balance between central authority and provincial autonomy.  However, Indian federalism has its own unique features.\n"
    }
]