[
    {
        "q_num": 1,
        "question_text": "In the Union Budget 2011-12, a full exemption from the basic customs duty was extended to the bio-based asphalt (bioasphalt). What is the importance of this material?\n1. Unlike traditional asphalt, bio-asphalt is not based on fossil fuels.\n2. Bioasphalt can be made from non-renewable resources.\n3. Bioasphalt can be made from organic waste materials.\n4. It is eco-friendly to use bioasphalt for surfacing of the roads.\nWhich of the statements given above are correct?",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "```text\ncorrect_option: (b)\nexplanation: Bio-based asphalt, also known as bioasphalt, is a sustainable alternative to traditional asphalt.  Statement 1 is correct because unlike traditional asphalt, which is derived from petroleum, bioasphalt uses renewable resources. Statement 3 is correct as bioasphalt can be produced from organic waste materials, offering a method for waste management and reducing reliance on fossil fuels. Statement 4 is also correct; using bioasphalt for road surfacing is environmentally friendlier due to its reduced carbon footprint compared to traditional asphalt. Statement 2 is incorrect because bioasphalt is made from renewable, not non-renewable resources.  Therefore, only statements 1, 3, and 4 are correct.\n\nBasic Customs Duty: A tax levied on imported goods at the border.  Full exemption means no such duty is applied.\n\nUnion Budget 2011-12:  The annual budget presented to the Indian Parliament outlining government's planned revenue and expenditure for the fiscal year.\n```\n"
    },
    {
        "q_num": 2,
        "question_text": "Consider the following:\n1. Carbon dioxide\n2. Oxides of Nitrogen\n3. Oxides of Sulphur\nWhich of the above is/are the emission/emissions from coal combustion at thermal power plants?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: Coal combustion in thermal power plants releases carbon dioxide (CO2), oxides of nitrogen (NOx), and oxides of sulfur (SOx).  CO2 is a product of the combustion of carbon in coal. NOx and SOx are formed from the nitrogen and sulfur impurities present in coal reacting with oxygen at high temperatures during combustion. Therefore, all three are emissions from coal combustion at thermal power plants.\n\nCarbon dioxide (CO2): A greenhouse gas, contributing to global warming.  It's produced by burning fossil fuels, including coal.  It's a major focus in climate change discussions.\n\nOxides of Nitrogen (NOx):  A group of gases, primarily nitric oxide (NO) and nitrogen dioxide (NO2), formed during high-temperature combustion processes.  They contribute to air pollution (smog), acid rain, and respiratory problems.\n\nOxides of Sulfur (SOx): Primarily sulfur dioxide (SO2), formed when sulfur-containing fuels like coal are burned.  A major air pollutant contributing to acid rain and respiratory issues.  Regulations like Flue Gas Desulphurization systems aim to reduce these emissions.\n"
    },
    {
        "q_num": 3,
        "question_text": "Satellites used for telecommunication relay are kept in a geostationary orbit. A satellite is said to be in such an orbit when:\n1. The orbit is geosynchronous.\n2. The orbit is circular.\n3. The orbit lies in the plane of the Earth's equator.\n4. The orbit is at an altitude of 22,236 km.\nSelect the correct answer using the codes given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: A geostationary orbit has four key characteristics: it is geosynchronous (meaning the satellite's orbital period matches the Earth's rotation period), it is circular, it lies in the plane of the Earth's equator, and it is at a specific altitude of approximately 22,236 km above the Earth's surface.  Therefore, all four statements (1, 2, 3, and 4) are necessary conditions for a geostationary orbit.\n\nGeosynchronous orbit: An orbit where a satellite's orbital period is equal to the Earth's rotational period (approximately 24 hours).  This makes the satellite appear stationary from a point on Earth's surface.\n\nCircular orbit: An orbit where the satellite maintains a constant distance from the Earth's center.  This ensures consistent signal reception.\n\nEquatorial plane:  The plane containing the Earth's equator. A geostationary satellite must orbit in this plane to remain stationary over a single point on the equator.\n\nAltitude of 22,236 km: This is the altitude required for a satellite to achieve a geostationary orbit, balancing gravitational pull and orbital velocity.\n"
    },
    {
        "q_num": 4,
        "question_text": "India has experienced persistent and high food inflation in the recent past. What could be the reasons?\n1. Due to a gradual switchover to the cultivation of commercial crops, the area under the cultivation of food grains has steadily decreased in the last five years by about 30%.\n2. As a consequence of increasing incomes, the consumption patterns of the people have undergone a significant change.\n3. The food supply chain has structural constraints.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: All three statements could contribute to high food inflation in India.\n\nStatement 1: A decrease in the area under food grain cultivation due to a shift towards commercial crops directly reduces the supply of food grains, leading to higher prices.  A 30% decrease is a significant factor.\n\nStatement 2: Changing consumption patterns due to increased incomes can lead to higher demand for certain food items, exceeding supply and thus increasing prices.  This is especially true for items considered luxury or premium foods.\n\nStatement 3: Inefficiencies and bottlenecks in the food supply chain, such as inadequate storage, transportation issues, and poor market infrastructure, can lead to significant food losses and higher prices for consumers.  These structural problems can amplify the effects of supply shortages and increased demand.\n\nTherefore, all three factors (reduced food grain production, increased demand, and supply chain constraints) can contribute to persistent and high food inflation.  The combination of these factors makes option (d) the correct answer.\n\n\n**Short Notes on Named Entities (without headings):**\n\n**Food Inflation:**  A sustained increase in the price of food products, impacting consumers' purchasing power and overall economic stability.  It's often caused by a combination of supply-side factors (production, distribution) and demand-side factors (consumer behavior, income levels).\n\n**Commercial Crops:** Crops grown primarily for sale in the market, rather than for direct consumption by the farmer or their family.  Examples include cotton, tea, coffee, and rubber.  These often command higher market prices than staple food crops.\n\n**Food Supply Chain:** The entire process involved in getting food from the farm to the consumer's table.  It encompasses production, harvesting, processing, storage, transportation, distribution, and retail.  Inefficiencies in any stage can cause price increases.\n\n**India:** A large and diverse country with a significant agricultural sector.  Food security and inflation are major concerns due to its large population and dependence on agriculture.\n\n**PDS (Public Distribution System):** A government program in India designed to provide subsidized food grains to the poor and vulnerable sections of society.  While aiming to improve food security, it faces challenges in terms of efficient distribution and reaching all intended beneficiaries.\n\n**ICDS (Integrated Child Development Services):** A centrally sponsored program in India providing healthcare and nutrition services to children under six, pregnant women, and lactating mothers.  It plays a role in improving nutritional status, but doesn't directly address food inflation.\n\n**Mid-day Meal Scheme:** A school meal program in India providing nutritious lunches to primary school children.  It enhances school attendance and nutritional levels but is not directly involved in managing food prices.\n\n**Poshan Abhiyan (National Nutrition Mission):** A government program in India focused on improving nutritional outcomes.  It addresses malnutrition but doesn't directly tackle food inflation.\n\n**AAY (Antyodaya Anna Yojana):** A sub-scheme under the PDS targeting the poorest of the poor with highly subsidized food grains.\n\n**NFSA (National Food Security Act):**  A legal framework in India providing a right to subsidized food to a significant portion of the population.  It aims to improve food security but doesn't directly control inflation.\n\n**CPI (Consumer Price Index):** A measure of the average change in prices paid by urban consumers for a basket of consumer goods and services.  Food is a major component of the CPI, and its fluctuations directly reflect food inflation.\n\n**WPI (Wholesale Price Index):**  A measure of the average change in prices received by domestic producers for their output.  It can provide insights into inflationary pressures at the producer level, but it doesn't directly reflect consumer prices.\n\n**MSP (Minimum Support Price):** The minimum price guaranteed by the government to farmers for their produce.  It aims to protect farmers' income but can also influence food prices.\n\n**GVA (Gross Value Added):** A measure of the value of goods and services produced in an economy, net of the cost of intermediate inputs.  It provides a sectoral breakdown of economic activity.\n\n**GDP (Gross Domestic Product):** The total value of goods and services produced within a country's borders.  It's a broader measure of economic output than GVA.\n"
    },
    {
        "q_num": 5,
        "question_text": "At present, scientists can determine the arrangement or relative positions of genes or DNA sequences on a chromosome. How does this knowledge benefit us?\n1. It is possible to know the pedigree of livestock.\n2. It is possible to understand the causes of all human diseases.\n3. It is possible to develop disease-resistant animal breeds.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:Knowing the arrangement of genes on a chromosome (genome sequencing) allows for several advancements.  Statement 1 is correct because understanding gene order helps in tracing lineage and pedigree in livestock.  Statement 3 is also correct; manipulating gene positions enables the development of disease-resistant animal breeds through selective breeding or genetic engineering techniques. Statement 2 is incorrect because while understanding gene arrangement is crucial for disease research, it doesn't explain *all* human diseases. Many diseases are multifactorial, involving environmental and lifestyle factors beyond genetic makeup.\n\n**Short Notes:**\n\n* **Genome:** An organism's complete set of DNA, including all genes and chromosomes.  It's a blueprint for the organism's characteristics.\n* **Chromosome:** Thread-like structures within a cell's nucleus, carrying genetic information in the form of DNA. Humans have 23 pairs.\n* **Gene:** A specific sequence of DNA that codes for a particular trait or function. Genes determine inherited characteristics.\n* **DNA sequence:** The order of nucleotide bases (adenine, guanine, cytosine, and thymine) in a DNA molecule. The sequence dictates genetic information.\n* **Pedigree:** A record of ancestry, showing the lineage and relationships within a family or breed of animals. It's used in selective breeding.\n* **Disease-resistant animal breeds:** Animal populations genetically modified or selectively bred to be less susceptible to specific diseases.  This improves livestock health and productivity.\n* **Genome editing:** Techniques used to modify an organism's genome by adding, removing, or altering DNA sequences.  CRISPR is one example.\n* **CRISPR/Cas9:** A gene-editing technology that allows precise modification of DNA sequences. It's a powerful tool for genetic research and engineering.\n\n\n"
    },
    {
        "q_num": 6,
        "question_text": "In terms of economy, the visit by foreign nationals to witness the XIX Common Wealth Games in India amounted to",
        "option_a": "Export",
        "option_b": "Import",
        "option_c": "Production",
        "option_d": "Consumption",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation:The visit by foreign nationals to India for the Commonwealth Games constitutes an export for the Indian economy.  Exports refer to goods and services produced domestically and sold to consumers in other countries.  The spending by foreign tourists contributes to the inflow of foreign exchange, boosting the service sector and overall economy.\n\nImport refers to goods and services purchased from other countries. Production is the creation of goods and services. Consumption is the utilization of goods and services.  None of these accurately describe the economic impact of foreign tourist spending related to the Commonwealth Games.\n\n\nCommonwealth Games: A multi-sport event held every four years for member nations of the Commonwealth of Nations.  The XIX Commonwealth Games were held in India.\n\nExport: Goods and services sold to foreign countries.  In this context, tourism services are exported.\n\nImport: Goods and services bought from foreign countries.\n\nProduction: The process of creating goods and services.\n\nConsumption: The use of goods and services.\n"
    },
    {
        "q_num": 7,
        "question_text": "Microbial fuel cells are considered a source of sustainable energy. Why?\n1. They use living organisms as catalysts to generate electricity from certain substrates.\n2. They use a variety of inorganic materials as substrates.\n3. They can be installed in waste water treatment plants to cleanse water and produce electricity.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: Microbial fuel cells (MFCs) are sustainable energy sources because they utilize living organisms (microbes) as catalysts to generate electricity from organic substrates. This process is environmentally friendly as it converts waste into energy.  Statement 1 is correct because it accurately describes the core principle of MFCs. Statement 3 is also correct because MFCs are being actively researched and implemented in wastewater treatment, simultaneously cleaning water and producing electricity, offering a dual benefit.  Statement 2 is incorrect; MFCs primarily use organic materials (substrates) as fuel sources, not inorganic materials.  Therefore, only statements 1 and 3 are correct.\n\n\nMicrobial fuel cells:  Bioelectrochemical devices using microbes to convert organic matter into electricity.  They offer a sustainable way to generate power from waste materials, contributing to both energy production and waste management.\n\nSustainable energy: Energy sources that can be replenished naturally and do not deplete finite resources.  They are crucial for mitigating climate change and ensuring long-term energy security.\n\nWastewater treatment plants: Facilities designed to treat wastewater from domestic, industrial, and other sources before its discharge into the environment.  Incorporating MFCs enhances their efficiency and adds electricity generation as a valuable byproduct.\n\nOrganic substrates:  Carbon-containing compounds serving as the fuel source for microbial activity in MFCs. These can include various biodegradable organic materials found in wastewater or other waste streams.\n\nInorganic materials:  Non-carbon-based compounds, which are not typically used as primary substrates in MFCs.  While some inorganic materials might play a role in MFC construction or as electron mediators, they are not the main energy source.\n"
    },
    {
        "q_num": 8,
        "question_text": "Which one of the following statements appropriately describes the \"fiscal stimulus\"?",
        "option_a": "It is a massive investment by the Government in manufacturing sector to ensure the supply of goods to meet the demand surge caused by rapid economic growth",
        "option_b": "It is an intense affirmative action of the Government to boost economic activity in the country",
        "option_c": "It is Government's intensive action on financial institutions to ensure disbursement of loans to agriculture and allied sectors to promote greater food production and contain food inflation",
        "option_d": "It is an extreme affirmative action by the Government to pursue its policy of financial inclusion",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Fiscal stimulus refers to government actions designed to boost economic activity. Option (b) accurately describes this, stating it's an intense affirmative action to boost economic activity.  The other options describe specific government actions (investment in manufacturing, action on financial institutions, action on financial inclusion) which could be *part* of a broader fiscal stimulus, but don't encompass the overall concept.\n\n\nA short note on the named entities:\n\n* **Fiscal stimulus:** Government intervention to increase aggregate demand to stimulate economic growth.  It often involves increased government spending and/or tax cuts.\n* **Manufacturing sector:** The part of the economy that transforms raw materials into finished goods.\n* **Affirmative action:**  Policies designed to address past and present discrimination by providing preferential treatment to historically disadvantaged groups or sectors. In this context, it refers to proactive government measures to improve the economy.\n* **Financial institutions:** Organizations that deal with money and credit, such as banks, credit unions, and investment firms.\n* **Agriculture and allied sectors:**  The farming industry and related fields, such as food processing and livestock.\n* **Food inflation:** A sustained increase in the price of food.\n* **Financial inclusion:** Ensuring access to financial services for all segments of the population, regardless of income or location.\n\n"
    },
    {
        "q_num": 9,
        "question_text": "The formation of ozone hole in the Antarctic region has been a cause of concern. What could be the reason for the formation of this hole?",
        "option_a": "Presence of prominent tropospheric turbulence; and inflow of chlorofluorocarbons",
        "option_b": "Presence of prominent polar front and stratospheric clouds; and inflow of chlorofluorocarbons",
        "option_c": "Absence of polar front and stratospheric clouds; and inflow of methane and chlorofluorocarbons",
        "option_d": "Increased temperature at polar region due to global warming",
        "correct_option": "b",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: The Antarctic ozone hole is primarily caused by the presence of polar stratospheric clouds (PSCs) and the inflow of chlorofluorocarbons (CFCs).  PSCs provide surfaces on which chlorine-containing compounds can react and release chlorine radicals. These radicals then catalytically destroy ozone molecules.  The polar front creates a stable, isolated vortex in the stratosphere that traps these chemicals, allowing the ozone depletion to occur.  CFCs are man-made chemicals that were widely used in various applications before their ozone-depleting effects were understood.  Tropospheric turbulence is not a primary factor in ozone hole formation, and increased temperatures in the polar regions are a consequence of global warming, not a cause of the ozone hole. Methane is an ozone-depleting substance but it is not the primary cause of the Antarctic ozone hole.\n"
    },
    {
        "q_num": 10,
        "question_text": "Consider the following actions which the Government can take:\n1. Devaluing the domestic currency.\n2. Reduction in the export subsidy.\n3. Adopting suitable policies which attract greater FDI and more funds from FIIs.\nWhich of the above action/actions can help in reducing the current account deficit?",
        "option_a": "1 and 2",
        "option_b": "2 and 3",
        "option_c": "3 only",
        "option_d": "1 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:Devaluing the domestic currency (1) makes exports cheaper and imports more expensive, thus improving the trade balance and reducing the current account deficit.  Attracting greater FDI and more funds from FIIs (3) increases capital inflows, which also helps to reduce the current account deficit.  A reduction in export subsidies (2), on the other hand, would likely *increase* the current account deficit as it makes exports less competitive.\n\nA current account deficit is a measure of a country's trade balance; it occurs when a country imports more goods and services than it exports.  Foreign Direct Investment (FDI) refers to investments made by foreign entities in domestic businesses for long-term purposes.  Foreign Institutional Investors (FIIs) are foreign entities that invest in a country's financial markets, typically for shorter-term gains.\n"
    },
    {
        "q_num": 11,
        "question_text": "The Constitution (Seventy-Third Amendment) Act, 1992, which aims at promoting the Panchayati Raj Institutions in the country, provides for which of the following?\n1. Constitution of District Planning Committees.\n2. State Election Commissions to conduct all panchayat elections.\n3. Establishment of State Finance Commissions.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:The Constitution (Seventy-Third Amendment) Act, 1992,  mandates the establishment of District Planning Committees, State Election Commissions to conduct panchayat elections, and State Finance Commissions.  Therefore, options 1, 2, and 3 are all correct.\n\n**Short Notes:**\n\n* **Constitution (Seventy-Third Amendment) Act, 1992:** This act is a landmark legislation in India aimed at strengthening the Panchayati Raj system, providing constitutional status and powers to local self-governments at the village, intermediate, and district levels.  It aims to decentralize power and promote participatory democracy.\n\n* **Panchayati Raj Institutions (PRIs):**  A system of rural local self-government in India, comprising village councils (Gram Panchayats), intermediate councils (Panchayat Samitis or Mandal Panchayats), and district councils (Zilla Parishads).  They are responsible for local development and governance.\n\n* **District Planning Committees:** Committees constituted at the district level to prepare district plans, involving PRIs and other stakeholders in the planning process.  This ensures local needs are integrated into development plans.\n\n* **State Election Commissions:** Independent bodies responsible for conducting free and fair elections to PRIs.  Their independence ensures impartiality in the electoral process.\n\n* **State Finance Commissions:**  Bodies constituted by state governments to review the financial position of PRIs, recommend grants-in-aid, and ensure adequate financial resources for their functioning.  They ensure equitable distribution of resources among PRIs.\n"
    },
    {
        "q_num": 12,
        "question_text": "Two important rivers ---- one with its source in Jharkhand (and known by a different name in Odisha), and another with its source in Odisha ---- merge at a place only a short distance from the coast of Bay of Bengal before flowing into the sea. This is an important site of wildlife and biodiversity and a protected area. Which one of the following could be this?",
        "option_a": "Bhitarkanika",
        "option_b": "Chandipur-on-sea",
        "option_c": "Gopalpur-on-sea",
        "option_d": "Simlipal",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation:Bhitarkanika is a protected area in Odisha where two rivers, the Brahmani (known as the Baitarani in Odisha) and the Mahanadi, merge near the Bay of Bengal.  The Brahmani originates in Jharkhand. Bhitarkanika is known for its significant wildlife and biodiversity, including saltwater crocodiles and mangrove forests.\n\nChandipur-on-sea, Gopalpur-on-sea, and Simlipal are coastal areas or national parks in Odisha, but they don't fit the description of two rivers merging near the Bay of Bengal.  Simlipal is a national park known for its diverse flora and fauna, but not for the confluence of the described rivers. Chandipur and Gopalpur are coastal towns known for their beaches.\n"
    },
    {
        "q_num": 13,
        "question_text": "A rapid increase in the rate of inflation is sometimes attributed to the \"base effect\". What is \"base effect\"?",
        "option_a": "It is the impact of drastic deficiency in supply due to failure of crops",
        "option_b": "It is the impact of the surge in demand due to rapid economic growth",
        "option_c": "It is the impact of the price levels of previous year on the calculation of inflation rate",
        "option_d": "None of the statements (a), (b) and (c) given above is correct in this context",
        "correct_option": "c",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: The base effect is the impact of the price levels of the previous year on the calculation of the inflation rate.  A low base in the previous year can artificially inflate the current year's inflation rate, even if prices haven't increased dramatically in absolute terms.  Conversely, a high base in the previous year can make the current year's inflation rate appear lower than it actually is.\n\nInflation:  Inflation refers to a general increase in the prices of goods and services in an economy over a period of time. When the price level rises, each unit of currency buys fewer goods and services. Consequently, inflation reflects a reduction in the purchasing power per unit of money – a loss of real value in the medium of exchange and unit of account within the economy.\n\nCPI (Consumer Price Index): The CPI is a measure that examines the weighted average of prices of a basket of consumer goods and services, such as transportation, food and medical care. It is calculated by taking price changes for each item in the predetermined basket of goods and averaging them.  The CPI is often used to monitor inflation.\n\nHeadline indices: Headline inflation is the raw inflation figure reported through the CPI without seasonal adjustments.\n\n\n"
    },
    {
        "q_num": 14,
        "question_text": "India is regarded as a country with \"Demographic Dividend\". This is due to",
        "option_a": "Its high population in the age group below 15 years",
        "option_b": "Its high population in the age group of 15-64 years",
        "option_c": "Its high population in the age group above 65 years",
        "option_d": "Its high total population",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation:India is considered to have a \"Demographic Dividend\" because of its large population in the 15-64 age group.  This group represents the working-age population, and a large proportion of working-age people relative to dependents (those under 15 and over 64) can boost economic growth.  A high population in the age group below 15 (option a) would represent a large dependent population, placing a strain on resources rather than a dividend. A high population in the age group above 65 (option c) would also represent a large dependent population, requiring significant social security spending and potentially slowing economic growth.  Option (d), high total population, is not the primary factor driving the demographic dividend; the age structure is crucial.\n\nIndia: A large, populous South Asian nation. Its large working-age population is a significant factor in its economic potential.\n\nDemographic Dividend: The economic growth potential that can result from shifts in a population’s age structure, mainly a larger proportion of working-age adults compared to dependents.\n\n15-64 years age group: The working-age population, whose productivity contributes significantly to a nation’s economy.  A large working-age population relative to dependents is key to the demographic dividend.\n\nBelow 15 years age group:  The dependent population (children). A large proportion of this age group can strain resources and slow economic growth.\n\nAbove 65 years age group: The dependent population (elderly).  A large proportion of this age group can also strain resources and slow economic growth, requiring increased social security spending.\n"
    },
    {
        "q_num": 15,
        "question_text": "Regarding \"carbon credits\", which one of the following statements is not correct?",
        "option_a": "The carbon credit system was ratified in conjunction with the Kyoto Protocol",
        "option_b": "Carbon credits are awarded to countries or groups that have reduced greenhouse gases below their emission quota",
        "option_c": "The goal of the carbon credit system is to limit the increase of carbon dioxide emission",
        "option_d": "Carbon credits are traded at a price fixed from time to time by the United Nations Environment Programme",
        "correct_option": "d",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:The carbon credit system was established under the Kyoto Protocol,  aimed at reducing greenhouse gas emissions.  Carbon credits are given to countries or entities that reduce emissions below a set quota. These credits are traded, but the price isn't fixed by the United Nations Environment Programme (UNEP); it fluctuates based on market forces.  The goal is to limit the increase of carbon dioxide emissions, not necessarily to reduce them to zero.  The Kyoto Protocol is an international treaty committing industrialized nations to emission reduction targets. The UNEP is a UN program working on environmental issues.\n"
    },
    {
        "q_num": 16,
        "question_text": "Which one of the following is not a feature of \"Value Added Tax\"?",
        "option_a": "It is a multi-point destination-based system of taxation",
        "option_b": "It is a tax levied on value addition at each stage of transaction in the production--distribution chain",
        "option_c": "It is a tax on the final consumption of goods or services and must ultimately be borne by the consumer",
        "option_d": "It is basically a subject of the Central Government and the State Governments are only a facilitator for its successful implementation",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: Value Added Tax (VAT) is a multi-stage tax levied on the value added at each stage of the production and distribution chain.  It is ultimately borne by the consumer as a tax on the final consumption of goods and services.  However, both the Central and State governments share the power to levy VAT, with the State governments playing a significant role in its implementation.  The Central government doesn't exclusively control VAT.\n\n\n* **Value Added Tax (VAT):** A consumption tax levied at each stage of production and distribution, with the final burden falling on the consumer. It aims to avoid cascading taxes and ensures neutrality in taxation.  Different types of VAT systems exist globally, with variations in the rate structure, exemptions, and administration.\n\n* **Gross Domestic Product (GDP):** The total monetary or market value of all the finished goods and services produced within a country's borders in a specific time period. It's a key indicator of a nation's economic health and growth.\n\n* **Gross Value Added (GVA):** A measure of the value of goods and services produced in an economy, net of the cost of intermediate consumption. GVA is calculated at the producer's side and provides a more nuanced view of economic activity than GDP.\n\n"
    },
    {
        "q_num": 17,
        "question_text": "A \"closed economy\" is an economy in which",
        "option_a": "the money supply is fully controlled",
        "option_b": "deficit financing takes place",
        "option_c": "only exports take place",
        "option_d": "neither exports nor imports take place",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "* **correct_option:** (d)\n* **explanation:** A closed economy is one that does not engage in international trade.  This means there are no exports (goods and services sold to other countries) or imports (goods and services bought from other countries). Option (d) accurately reflects this definition.\n\nOption (a) is incorrect.  While money supply control is a feature of many economies, it doesn't define a closed economy.\n\nOption (b) is incorrect. Deficit financing (government spending exceeding revenue) can occur in both open and closed economies.\n\nOption (c) is incorrect. An economy with only exports is an open economy, heavily involved in international trade.\n\n\n**Short notes on named entities:**\n\n* **Closed economy:** An economic system that does not interact with other economies through imports or exports.  It's a theoretical model; in reality, all economies have some degree of openness.\n\n* **Exports:** Goods and services produced domestically and sold to buyers in other countries.  They contribute to a nation's Gross Domestic Product (GDP) and balance of trade.\n\n* **Imports:** Goods and services purchased from foreign producers and brought into a country. They satisfy domestic demand and can influence prices and competition.\n\n* **Money supply:** The total amount of money in circulation within an economy at a given time. It includes currency in circulation and various forms of deposits held in banks.  Central banks often manage the money supply to influence inflation and economic growth.\n\n* **Deficit financing:** A government's practice of spending more money than it collects in revenue, often financed through borrowing.  It can stimulate economic activity but can also lead to increased national debt.\n\n\nThe provided additional contexts about agrarian economies, international trade (including raw trade, fiber trade), economic finance policies, money supply measures (M1, M2, M3, M4), money markets, inclusive growth, and various organizations (OECD, UNDP, UN SDGs) are not directly relevant to the MCQ question about closed economies and are therefore omitted from the explanation.\n"
    },
    {
        "q_num": 18,
        "question_text": "When the bark of a tree is removed in a circular fashion all around near its base, it gradually dries up and dies because",
        "option_a": "Water from soil cannot rise to aerial parts",
        "option_b": "Roots are starved of energy",
        "option_c": "Tree is infected by soil microbes",
        "option_d": "Roots do not receive oxygen for respiration",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Removing the bark in a circular fashion around the base of a tree prevents the transport of water and nutrients from the roots to the upper parts of the tree.  The vascular cambium, responsible for transporting these essential materials, is located beneath the bark.  Its disruption leads to the tree's dehydration and eventual death. Options (b), (c), and (d) are incorrect because while root starvation, microbial infection, and lack of oxygen can contribute to tree health, the immediate and primary cause of death after girdling is the disruption of the vascular system preventing water and nutrient transport.\n\nShort notes on named entities:\n\n* **Bark:** The outer covering of a tree trunk and branches, protecting the underlying tissues.  It's composed of dead cells and plays a role in water and gas exchange.\n\n* **Vascular cambium:** A layer of actively dividing cells in a tree's stem and roots, responsible for secondary growth (increasing girth) and the transport of water and nutrients (xylem and phloem).\n\n* **Roots:** The underground part of a plant, anchoring it and absorbing water and nutrients from the soil. Root systems vary depending on the species and environment.\n\n* **Aerial parts:** Above-ground parts of a plant, including the stem, branches, leaves, flowers and fruits. These are the sites of photosynthesis and reproduction.\n"
    },
    {
        "q_num": 19,
        "question_text": "The \"New START\" treaty was in the news. What is this treaty?",
        "option_a": "It is a bilateral strategic nuclear arms reduction treaty between the USA and the Russian Federation",
        "option_b": "It is a multilateral energy security cooperation treaty among the members of the East Asia Summit",
        "option_c": "It is a treaty between the Russian Federation and the European Union for the energy security cooperation",
        "option_d": "It is a multilateral cooperation treaty among the BRICS countries for the promotion of trade",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation:The New START treaty is a bilateral treaty between the USA and the Russian Federation for the reduction of strategic nuclear arms.  The acronym \"START\" stands for Strategic Arms Reduction Treaty.  This treaty is focused on limiting the number of deployed strategic nuclear warheads, bombers, and intercontinental ballistic missiles (ICBMs) that each nation can possess.\n\n\nThe other options are incorrect.  The East Asia Summit involves multiple countries in East Asia focused on security cooperation and does not have a treaty specifically named \"New START\".  Similarly, there is no \"New START\" treaty between Russia and the European Union, or among BRICS nations.  The BRICS nations (Brazil, Russia, India, China, and South Africa) focus on economic cooperation.\n"
    },
    {
        "q_num": 20,
        "question_text": "Three of the following criteria have contributed to the recognition of Western Ghats, Sri Lanka and Indo-Burma regions as hotspots of biodiversity:\n1. Species richness\n2. Vegetation density\n3. Endemism\n4. Ethno-botanical importance\n5. Threat perception\n6. Adaptation of flora and fauna to warm and humid conditions\nWhich three of the above are correct criteria in this context?",
        "option_a": "1, 2 and 6",
        "option_b": "2, 4 and 6",
        "option_c": "1, 3 and 5",
        "option_d": "3, 4 and 6",
        "correct_option": "c",
        "subject": "environment",
        "year": 2011,
        "explanation": "```text\ncorrect_option: (c)\nexplanation: Biodiversity hotspots are defined by two main criteria: high levels of endemism (species found nowhere else) and significant threat to their habitats.  Species richness (the number of species present) also plays a crucial role in identifying these areas.  Therefore, options 1, 3, and 5 (species richness, endemism, and threat perception) are the correct criteria.\n\nWestern Ghats: A mountain range in southwestern India, known for its high levels of biodiversity and endemism.  It's a biodiversity hotspot facing threats from deforestation and habitat loss.\n\nSri Lanka: An island nation off the coast of India, also a biodiversity hotspot with high levels of endemism and facing similar threats as the Western Ghats.\n\nIndo-Burma: A biodiversity hotspot encompassing parts of India, Myanmar, Thailand, Laos, Vietnam, Cambodia, and southern China.  It's characterized by high species richness and endemism, but also faces significant threats from habitat loss and human activities.\n\nOption (a) is incorrect because vegetation density, while important for biodiversity, isn't a primary criterion for designating a biodiversity hotspot. Option (b) is incorrect because ethno-botanical importance, while relevant to conservation, is not a defining characteristic of biodiversity hotspots. Option (d) is incorrect because adaptation to warm and humid conditions is a characteristic of many tropical regions but not a primary criterion for defining a biodiversity hotspot.\n```\n"
    },
    {
        "q_num": 21,
        "question_text": "Human activities in the recent past have caused the increased concentration of carbon dioxide in the atmosphere, but a lot of it does not remain in the lower atmosphere because of\n1. its escape into the outer stratosphere.\n2. the photosynthesis by phytoplankton in the oceans.\n3. the trapping of air in the polar ice caps.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: A significant portion of atmospheric carbon dioxide is absorbed by the oceans through photosynthesis by phytoplankton.  Phytoplankton are microscopic marine algae that utilize CO2 during photosynthesis, converting it into organic matter. This process helps reduce the concentration of CO2 in the lower atmosphere.\n\nWhile some CO2 escapes into the stratosphere, it's not the primary reason for the reduced concentration in the lower atmosphere.  Trapping of air in polar ice caps does store CO2, but this is a long-term storage mechanism and doesn't directly account for the immediate reduction of CO2 levels in the atmosphere.  Therefore, only statement 2 is correct.\n\n**Short notes on named entities:**\n\n* **Carbon dioxide (CO2):** A greenhouse gas that absorbs and emits infrared radiation, contributing to the greenhouse effect and global warming.  It's produced by various human activities, including burning fossil fuels and deforestation.\n\n* **Stratosphere:** The second major layer of Earth's atmosphere, extending from about 10 to 50 kilometers above the surface. The ozone layer, which protects us from harmful ultraviolet radiation, is located in the stratosphere.\n\n* **Phytoplankton:** Microscopic marine algae that form the base of most marine food webs. They are primary producers, meaning they convert sunlight, water, and carbon dioxide into organic matter through photosynthesis.  Their role in carbon sequestration is crucial for regulating atmospheric CO2 levels.\n\n* **Polar ice caps:**  The vast ice sheets covering the Arctic and Antarctic regions.  They are significant reservoirs of frozen water and store large amounts of trapped gases, including CO2.  Melting ice caps contribute to sea-level rise and release stored CO2 back into the atmosphere.\n\n\n"
    },
    {
        "q_num": 22,
        "question_text": "In the context of ecosystem productivity, marine upwelling zones are important as they increase the marine productivity by bringing the\n1. decomposer microorganisms to the surface.\n2. nutrients to the surface.\n3. bottom-dwelling organisms to the surface.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Marine upwelling zones are areas where deep, nutrient-rich waters rise to the surface. This process brings essential nutrients like nitrates and phosphates, which are crucial for phytoplankton growth, to the surface.  Phytoplankton are the base of the marine food web, so increased nutrient availability leads to higher productivity.  While upwelling may bring some bottom-dwelling organisms to the surface, the primary driver of increased productivity is the nutrient supply. Decomposer microorganisms are involved in nutrient cycling, but upwelling itself is not primarily about bringing them to the surface.  Therefore, only statement 2 is correct.\n\nNutrients:  Nutrients are essential substances required for the growth and development of organisms. In marine ecosystems, essential nutrients include nitrates and phosphates.  Their availability significantly influences primary productivity.\n\nPhytoplankton:  Microscopic plant-like organisms that form the base of most aquatic food webs. They are primary producers, converting sunlight into energy through photosynthesis. Their abundance is directly linked to nutrient availability.\n\nUpwelling: A process in which deep, cold, nutrient-rich waters rise to the surface, typically driven by wind patterns. It significantly increases primary productivity in marine ecosystems.\n"
    },
    {
        "q_num": 23,
        "question_text": "If a tropical rain forest is removed, it does not regenerate quickly as compared to a tropical deciduous forest. This is because",
        "option_a": "the soil of rain forest is deficient in nutrients",
        "option_b": "propagules of the trees in a rain forest have poor viability",
        "option_c": "the rain forest species are slow-growing",
        "option_d": "exotic species invade the fertile soil of rain forest",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Tropical rainforests have nutrient-poor soil because the nutrients are quickly absorbed by the dense vegetation and are not stored in the soil.  When the rainforest is removed, this thin layer of topsoil is easily eroded, leaving behind infertile subsoil, hindering quick regeneration.  The other options are not the primary reason for slow regeneration.  While some rainforest species may be slow-growing and propagules might have varying viability, the nutrient-poor soil is the major limiting factor.  Exotic species invasion can occur, but it's not the primary reason for the slow regeneration of the rainforest compared to a deciduous forest.\n\nTropical rainforest: A forest ecosystem characterized by high rainfall, high temperatures, and high biodiversity.  It has a complex structure with multiple layers of vegetation. The soil is typically nutrient-poor despite the high biomass because nutrients are rapidly cycled within the ecosystem.\n\nTropical deciduous forest: A forest ecosystem characterized by a distinct dry season, leading to leaf shedding by trees.  The soil tends to be more nutrient-rich compared to rainforest soil due to nutrient accumulation during the dry season.\n\nPropagules:  Any part of a plant (such as a seed, spore, or bud) that can develop into a new plant. Viability refers to the ability of the propagule to germinate and grow.\n\nExotic species: Plant or animal species introduced to an area outside of their native range.  They can sometimes outcompete native species and disrupt the ecosystem.\n"
    },
    {
        "q_num": 24,
        "question_text": "The Himalayan Range is very rich in species diversity. Which one among the following is the most appropriate reason for this phenomenon?",
        "option_a": "It has a high rainfall that supports luxuriant vegetative growth",
        "option_b": "It is a confluence of different bio-geographical zones",
        "option_c": "Exotic and invasive species have not been introduced in this region",
        "option_d": "It has less human interference",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation:The Himalayan range's high species diversity is primarily due to its location at the confluence of different biogeographical zones.  This creates a variety of habitats and microclimates, supporting a wide range of species adapted to different conditions.\n\nThe Himalayas: A vast mountain range in Asia, stretching across several countries. Its varied topography and altitudes create a diverse range of habitats, from subtropical forests to alpine meadows.  The Himalayas are a biodiversity hotspot.\n\nBiogeographical zones:  These are geographical areas with distinct sets of species due to factors like climate, geography, and evolutionary history. The Himalayas are situated at the meeting point of several such zones.\n\nHigh rainfall: While the Himalayas receive significant rainfall in certain areas, it's not the primary driver of overall biodiversity across the entire range. Rainfall varies greatly depending on location and altitude.\n\nExotic and invasive species: The introduction of non-native species can negatively impact biodiversity. However, the absence of such species doesn't explain the *high* biodiversity already present in the Himalayas.\n\nLess human interference: While reduced human impact can protect biodiversity, the Himalayas have experienced significant human influence throughout history,  and this factor alone doesn't fully explain the high level of species diversity.\n"
    },
    {
        "q_num": 25,
        "question_text": "With reference to India, consider the following Central Acts.\n1. Import and Export (Control) Act, 1947\n2. Mining and Mineral Development (Regulation) Act, 1957\n3. Customs Act, 1962\n4. Indian Forest Act, 1927\nWhich of the above Acts have relevance to/bearing on the biodiversity conservation in the country?",
        "option_a": "1 and 3 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1, 2, 3 and 4",
        "option_d": "None of the above Acts",
        "correct_option": "c",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:The Import and Export (Control) Act, 1947, regulates the import and export of goods, including those derived from biodiversity.  The Mining and Minerals Development (Regulation) Act, 1957, governs mining activities, which can significantly impact biodiversity through habitat destruction. The Customs Act, 1962, deals with customs duties and regulations, impacting the trade of products derived from biodiversity, such as timber or wildlife products. The Indian Forest Act, 1927, is directly relevant to biodiversity conservation as it manages forest resources, which are crucial habitats for numerous species.  Therefore, all four Acts have a bearing on biodiversity conservation in India.\n\n\nImport and Export (Control) Act, 1947: This Act empowers the government to regulate the import and export of various goods, including those derived from biological resources.  This control can help prevent illegal trade in endangered species and their products.\n\nMining and Mineral Development (Regulation) Act, 1957:  This Act governs the exploration, extraction, and development of minerals. Mining activities often lead to habitat destruction and biodiversity loss.  The Act, through appropriate regulations, can mitigate these negative impacts.\n\nCustoms Act, 1962:  This Act deals with the customs duties and procedures at ports and borders. It plays a role in preventing illegal wildlife trade and the smuggling of goods derived from biodiversity.\n\nIndian Forest Act, 1927: This Act governs the management and conservation of forests in India.  Forests are vital for biodiversity, and this Act aims to ensure sustainable use and protection of forest resources.\n"
    },
    {
        "q_num": 26,
        "question_text": "Karl Marx explained the process of class struggle with the help of which one of the following theories?",
        "option_a": "Empirical liberalism",
        "option_b": "Existentialism",
        "option_c": "Darwin's theory of evolution",
        "option_d": "Dialectical materialism",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: Karl Marx's theory of class struggle is explained through dialectical materialism.  Dialectical materialism is a philosophy of history that views the material conditions of life as the primary driving force of historical change.  It posits that history progresses through a series of contradictions and struggles between opposing forces (thesis and antithesis), ultimately resolving into a new synthesis.  In Marx's analysis, this struggle manifests primarily as class struggle between the bourgeoisie (owners of capital) and the proletariat (working class).\n\nEmpirical liberalism is a political philosophy emphasizing evidence-based policymaking and individual liberties. Existentialism is a philosophical movement focusing on individual existence, freedom, and responsibility. Darwin's theory of evolution explains the biological diversity of life through natural selection.\n"
    },
    {
        "q_num": 27,
        "question_text": "A layer in the Earth's atmosphere called Ionosphere facilitates radio communication. Why?\n1. The presence of ozone causes the reflection of radio waves to Earth.\n2. Radio waves have a very long wavelength.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:Neither statement 1 nor 2 is correct.  The ionosphere facilitates radio communication because it contains ionized gases that reflect radio waves back to Earth.  This reflection is not due to ozone (statement 1 is incorrect), although ozone is important in the stratosphere for absorbing harmful UV radiation.  The wavelength of radio waves (statement 2 is incorrect), while generally long, is not the primary reason for their reflection in the ionosphere; it's the interaction with charged particles.  The ionosphere is a region in Earth's upper atmosphere where solar radiation ionizes atoms and molecules, creating a layer of charged particles.  Radio waves, when encountering this layer, are refracted (bent) and reflected back toward the Earth's surface, enabling long-distance radio communication.\n"
    },
    {
        "q_num": 28,
        "question_text": "Both Foreign Direct Investment (FDI) and Foreign Institutional Investor (FII) are related to investment in a country. Which one of the following statements best represents an important difference between the two?",
        "option_a": "FII helps bring better management skills and technology, while FDI only brings in capital",
        "option_b": "FII helps in increasing capital availability in general, while FDI only targets specific sectors",
        "option_c": "FDI flows only into the secondary market, while FII targets primary market",
        "option_d": "FII is considered to be more stable than FDI",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Foreign Direct Investment (FDI) involves direct investment in a country's economy, often establishing a physical presence (e.g., building a factory).  Foreign Institutional Investors (FII) invest in a country's financial markets, primarily buying and selling stocks and bonds.  Option (b) correctly highlights a key difference: FDI targets specific sectors, while FII investments are more broadly dispersed across the market, increasing general capital availability.  Option (a) is incorrect as both FDI and FII can indirectly contribute to better management and technology transfer, though FDI is typically more directly involved. Option (c) is incorrect as both FDI and FII can invest in both primary and secondary markets, depending on the investment strategy. Option (d) is incorrect; FII investment is often considered less stable than FDI due to its shorter-term nature and susceptibility to market fluctuations.\n\n\nForeign Direct Investment (FDI):  Long-term investment made by a company or individual in a foreign country, often involving establishing a physical presence such as a factory or subsidiary.  It represents a significant commitment to the host country’s economy and often leads to technology transfer, job creation, and economic development.\n\nForeign Institutional Investor (FII): An entity that invests in the financial markets of a foreign country, primarily through the purchase and sale of publicly traded securities such as stocks and bonds.  FIIs are typically large institutional investors like mutual funds, pension funds, and hedge funds. Their investments influence market liquidity and price discovery.\n"
    },
    {
        "q_num": 29,
        "question_text": "A genetically engineered form of brinjal, known as the Bt-brinjal, has been developed. The objective of this is",
        "option_a": "To make it pest-resistant",
        "option_b": "To improve its taste and nutritive qualities",
        "option_c": "To make it drought-resistant",
        "option_d": "To make its shelf-life longer",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Bt-brinjal is a genetically modified brinjal (eggplant) engineered to be pest-resistant.  This is achieved by introducing a gene from the bacterium Bacillus thuringiensis (Bt) that produces a protein toxic to certain pests.  The other options are not the primary objective of Bt-brinjal development, though some genetic modifications might incidentally improve other traits.\n\nBt: Bacillus thuringiensis is a bacterium that produces insecticidal proteins.  These proteins are toxic to certain insect larvae, making them useful in pest control.  Bt-based pesticides are considered environmentally friendly compared to some synthetic alternatives.\n\nBrinjal (Eggplant):  A common vegetable crop grown worldwide, known for its versatility in cooking and nutritional value.  Genetic modification aims to improve its yield and reduce reliance on chemical pesticides.\n\nPest-resistant: The ability of a plant to withstand or repel pest attacks, reducing crop damage and the need for pesticides.  This is a significant goal in modern agriculture.\n\nGEAC:  (Genetic Engineering Appraisal Committee)  In India, this is the body that assesses the safety of genetically modified organisms (GMOs) before they can be released for cultivation.  Its role is crucial in regulating the use of biotechnology in agriculture.\n"
    },
    {
        "q_num": 30,
        "question_text": "With reference to \"Aam Admi Bima Yojana\", consider the following statements:\n1. The member insured under the scheme must be the head of the family or an earning member of the family in a rural landless household.\n2. The member insured must be in the age group of 30 to 65 years.\n3. There is a provision for free scholarship for up to two children of the insured who are studying between classes 9 and 12.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is incorrect because Aam Admi Bima Yojana (AAY) covers rural landless households, but the insured member doesn't necessarily have to be the head of the family.  An earning member is sufficient.\n\nStatement 2 is incorrect. The age group for AAY is typically 18-59 years, not 30-65 years.\n\nStatement 3 is correct.  AAY provides a scholarship provision for the children of the insured.\n\n\nAam Admi Bima Yojana (AAY): A social security scheme providing life insurance coverage to rural landless households and other vulnerable groups.  It aims to protect families from financial hardship due to the death of an earning member.\n\nNote: The provided additional context is irrelevant to answering the question about Aam Admi Bima Yojana.  The information on food security schemes, poverty lines, Panchayats, etc., is not directly related to the specifics of AAY.\n"
    },
    {
        "q_num": 31,
        "question_text": "In the context of global oil prices, \"Brent crude oil\" is frequently referred to in the news. What does this term imply?\n1. It is a major classification of crude oil.\n2. It is sourced from North Sea.\n3. It does not contain sulphur.\nWhich of the statements given above is/are correct?",
        "option_a": "2 only",
        "option_b": "1 and 2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Brent crude oil is a major classification of crude oil (statement 1 is correct) that is sourced from the North Sea (statement 2 is correct).  Statement 3 is incorrect; Brent crude oil's sulfur content can vary but it's not inherently sulfur-free.  Therefore, only statements 1 and 2 are correct.\n\nBrent crude oil: A benchmark grade of sweet light crude oil, meaning it has a low sulfur content and a relatively low density.  It's extracted from the North Sea and serves as a global pricing standard for oil. Its price influences the global oil market significantly.\n\nNorth Sea: A large body of water between the UK and continental Europe.  It's a significant source of oil and natural gas, and Brent crude oil is one of its key products.  Exploration and extraction activities in the North Sea have considerable economic and geopolitical implications.\n"
    },
    {
        "q_num": 32,
        "question_text": "The function of heavy water in a nuclear reactor is to",
        "option_a": "Slow down the speed of neutrons",
        "option_b": "Increase the speed of neutrons",
        "option_c": "Cool down the reactor",
        "option_d": "Stop the nuclear reaction",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Heavy water (D₂O), consisting of deuterium (²H) instead of ordinary hydrogen (¹H), is used in nuclear reactors as a moderator.  Moderators slow down neutrons without absorbing them significantly.  This is crucial because slow (thermal) neutrons are much more effective at causing nuclear fission in uranium fuel.  Options (b), (c), and (d) are incorrect. Increasing neutron speed would be counterproductive, cooling is a separate function of the reactor (though often done with water), and stopping the reaction is achieved by control rods, not heavy water.\n\nNuclear fission:  The process of splitting a heavy atomic nucleus (like uranium or plutonium) into smaller nuclei, releasing a large amount of energy.  This is the basis of nuclear power plants.\n\nNeutrons: Subatomic particles found in the nucleus of an atom, with no electrical charge. They play a key role in nuclear fission reactions.\n\nHeavy water (D₂O): Water where the hydrogen atoms are replaced by deuterium (an isotope of hydrogen with one proton and one neutron).  It is used as a moderator in some nuclear reactors.\n\nModerator: A substance used in a nuclear reactor to slow down neutrons, increasing the probability of nuclear fission.  Other moderators include graphite and light water.\n\nReactor: A device or system in which a self-sustaining nuclear chain reaction takes place.  Nuclear reactors are used to generate electricity and for other purposes.\n"
    },
    {
        "q_num": 33,
        "question_text": "In India, if a religious sect/community is given the status of a national minority, what special advantages it is entitled to?\n1. It can establish and administer exclusive educational institutions.\n2. The President of India automatically nominates a representative of the community to Lok Sabha.\n3. It can derive benefits from the Prime Minister's 15-Point Programme.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation:Only statement 1 is correct.  In India, the Constitution doesn't automatically nominate a representative of a minority community to the Lok Sabha (statement 2 is incorrect).  The Prime Minister's 15-Point Programme is a general development initiative and not specifically targeted at minority communities (statement 3 is incorrect).  However,  national minority communities can establish and administer exclusive educational institutions, which is a significant advantage derived from their status.  This is often facilitated through provisions and policies aimed at supporting minority educational rights.\n\nThe provided text does not contain information to elaborate on the Prime Minister's 15-Point Programme or the Lok Sabha nomination process.  The text does mention Articles of the Indian Constitution related to equality and special provisions for certain groups but doesn't directly address the specific advantages granted to nationally recognized minority religious sects/communities.  The document's focus is on broader constitutional provisions and historical context related to minority rights and representation in India.\n"
    },
    {
        "q_num": 34,
        "question_text": "India is home to lakhs of persons with disabilities. What are the benefits available to them under the law?\n1. Free schooling till the age of 18 years in government-run schools.\n2. Preferential allotment of land for setting up business.\n3. Ramps in public buildings.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (c)\n\nexplanation: The Rights of Persons with Disabilities Act, 2016, in India mandates certain provisions for persons with disabilities.  Free education until the age of 18 in government schools (statement 1) is a right guaranteed under this act.  The act also emphasizes accessibility in public buildings, including ramps (statement 3).  Preferential allotment of land for business (statement 2) is not explicitly guaranteed under this act, although other government schemes might offer such benefits.  Therefore, only statements 1 and 3 are correct.\n\nLakhs:  A lakh is a unit in the Indian numbering system equal to 100,000.\n\nPersons with disabilities: This refers to individuals with physical, mental, intellectual, or sensory impairments that limit their full participation in society.  The Rights of Persons with Disabilities Act, 2016, defines various categories of disabilities and provides for their rights and entitlements.\n"
    },
    {
        "q_num": 35,
        "question_text": "With what purpose is the Government of India promoting the concept of \"Mega Food Parks\"?\n1. To provide good infrastructure facilities for the food processing industry.\n2. To increase the processing of perishable items and reduce wastage.\n3. To provide emerging and eco-friendly food processing technologies to entrepreneurs.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:The Government of India promotes Mega Food Parks to achieve multiple objectives.  They aim to provide good infrastructure (including cold storage and processing units) for the food processing industry (1). This helps increase the processing of perishable items, reducing wastage and spoilage (2).  Additionally, while not explicitly stated as a primary goal in the question,  the promotion of Mega Food Parks indirectly facilitates the introduction of emerging and eco-friendly food processing technologies to entrepreneurs (3) by providing a supportive environment and infrastructure for innovation and adoption. Therefore, all three purposes are served by the initiative.\n\n\n**Short notes on keywords and named entities:**\n\n* **Mega Food Parks:** Large-scale integrated food processing facilities that aim to improve the efficiency and competitiveness of the food processing sector in India.  They typically include processing units, cold storage, and warehousing facilities, along with supporting infrastructure.\n\n* **Government of India:** The central government of the Republic of India, responsible for formulating and implementing national policies and programs, including those related to agriculture and food processing.\n\n* **Food processing industry:** The sector that transforms raw agricultural products into processed foods for consumption. It plays a crucial role in reducing post-harvest losses, adding value to agricultural produce, and creating employment opportunities.\n\n* **Perishable items:** Food products with a short shelf life, such as fruits, vegetables, and dairy products, susceptible to spoilage if not processed or stored properly.\n\n* **Emerging and eco-friendly food processing technologies:**  New and improved techniques that are environmentally sustainable and enhance efficiency in food processing.  This can include technologies that minimize waste, reduce energy consumption, and promote sustainable agricultural practices.\n\n\n"
    },
    {
        "q_num": 36,
        "question_text": "The authorization for the withdrawal of funds from the Consolidated Fund of India must come from",
        "option_a": "The President of India",
        "option_b": "The Parliament of India",
        "option_c": "The Prime Minister of India",
        "option_d": "The Union Finance Minister",
        "correct_option": "a",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation: The authorization for the withdrawal of funds from the Consolidated Fund of India comes from the President of India.  The Parliament plays a crucial role in approving the budget, which dictates how much money can be withdrawn, but the President ultimately authorizes the actual withdrawal.\n\nThe President of India is the head of state and holds the executive power of the Union.  Parliament of India is the supreme legislative body of the country, responsible for making laws. The Prime Minister of India is the head of government, leading the executive branch. The Union Finance Minister is responsible for managing the country's finances, presenting the budget to Parliament, but doesn't have the ultimate authority to authorize withdrawals from the Consolidated Fund.  The Consolidated Fund of India is the main account of the government where all revenue and expenditure are recorded.\n"
    },
    {
        "q_num": 37,
        "question_text": "All revenues received by the Union Government by way of taxes and other receipts for the conduct of Government business are credited to the",
        "option_a": "Contingency Fund of India",
        "option_b": "Public Account",
        "option_c": "Consolidated Fund of India",
        "option_d": "Deposits and Advances Fund",
        "correct_option": "c",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: All revenues received by the Union Government through taxes and other receipts for government operations are credited to the Consolidated Fund of India.  This is mandated by the Indian Constitution.\n\nThe Consolidated Fund of India is the main account of the government where all revenue receipts and loans raised by the government are deposited.  Money can only be withdrawn from this fund after parliamentary approval.\n\nThe Public Account is another account that holds money received by the government but not owned by it, such as small savings schemes or provident funds.  This money does not belong to the government and is held in trust.\n\nThe Contingency Fund of India is a reserve fund used for unforeseen expenses.  It's a small fund meant for emergencies and requires separate parliamentary approval for withdrawals.\n\nDeposits and Advances Fund is not a major account mentioned in the provided context, and is not where tax revenues are deposited.\n"
    },
    {
        "q_num": 38,
        "question_text": "Microfinance is the provision of financial services to people of low-income groups. This includes both the consumers and the self-employed. The service/services rendered under micro-finance is/are:\n1. Credit facilities\n2. Savings facilities\n3. Insurance facilities\n4. Fund Transfer facilities\nSelect the correct answer using the codes given below the lists:",
        "option_a": "1 only",
        "option_b": "1 and 4 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\n\nexplanation: Microfinance caters to low-income individuals and the self-employed, offering a range of financial services.  These services encompass credit facilities (loans), savings facilities (accounts), insurance facilities (protection against risks), and fund transfer facilities (moving money). Therefore, all four options (1, 2, 3, and 4) are correct.\n\nCredit facilities:  Loans provided to individuals with limited access to traditional banking services.  These loans are often small in amount and used for income-generating activities.\n\nSavings facilities:  Accounts that allow low-income individuals to save small amounts of money regularly.  These accounts provide a safe place to store money and encourage saving habits.\n\nInsurance facilities:  Insurance products designed to protect low-income individuals and their businesses against various risks, such as health problems, accidents, or crop failure.  These products offer financial security in times of need.\n\nFund Transfer facilities:  Services that enable low-income individuals to send and receive money easily and conveniently. This might include mobile money transfers or other digital payment systems.\n"
    },
    {
        "q_num": 39,
        "question_text": "Southeast Asia has captivated the attention of global community over space and time as a geostrategically significant region. Which among the following is the most convincing explanation for this global perspective?",
        "option_a": "It was the hot theatre during the Second World War",
        "option_b": "Its location between the Asian powers of China and India",
        "option_c": "It was the arena of superpower confrontation during the Cold War period",
        "option_d": "Its location between the Pacific and Indian oceans and its pre-eminent maritime character",
        "correct_option": "d",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (d)\n\nexplanation:Southeast Asia's geostrategic significance stems primarily from its location at the confluence of the Pacific and Indian Oceans, giving it a dominant maritime character.  This position influences global trade routes, resource access, and military deployments.\n\n* **Second World War:** While Southeast Asia was a significant theater in WWII, this is not the most encompassing explanation for its enduring geostrategic importance.  The war's impact was devastating, but the region's strategic location predates and extends beyond the conflict.\n\n* **China and India:** The region's location between China and India contributes to its strategic importance, creating a zone of interaction and competition between these major powers. However, the maritime aspect is more fundamental to global interest.\n\n* **Cold War:** The Cold War heightened tensions in Southeast Asia, making it an arena for superpower rivalry. Yet, the region's strategic importance is not solely a product of the Cold War; it persists even after the Cold War's conclusion.\n\n* **Pacific and Indian Oceans:** The location between the Pacific and Indian Oceans is the most comprehensive explanation.  This positioning affects global trade, maritime security, and resource control, making Southeast Asia a key region for global powers.\n\n* **EU:** The European Union is a political and economic alliance of European countries.  It's a major global player, influencing trade, policy, and security.\n\n* **Indo-Pacific Strategy:** A geopolitical strategy focusing on the Indo-Pacific region, emphasizing cooperation and addressing challenges posed by China's growing influence. The US and other countries have adopted Indo-Pacific strategies.\n\n* **AUKUS:** A security pact between Australia, the United Kingdom, and the United States, focused on sharing defense technology and capabilities, particularly in the Indo-Pacific region.\n\n* **BIMSTEC:** The Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation, a regional organization focused on economic and technical cooperation among South Asian and Southeast Asian countries.\n\n* **SAARC:** The South Asian Association for Regional Cooperation, a regional intergovernmental organization focused on economic and social cooperation among South Asian countries.\n\n* **NAM (Non-Aligned Movement):** A group of states that did not align with either the US or the Soviet Union during the Cold War.  India played a significant role in the NAM.\n\n* **NIEO (New International Economic Order):** A proposed reform of the global economic system to benefit developing countries, advocated by the Non-Aligned Movement.\n\n* **UNCLOS (United Nations Convention on the Law of the Sea):** An international treaty establishing a legal framework for ocean use and resource management.\n\n* **BRI (Belt and Road Initiative):** A global infrastructure development strategy led by China, aiming to improve connectivity across Asia and beyond.\n\n* **USSR (Union of Soviet Socialist Republics):** The former communist state that existed from 1922 to 1991. Its collapse marked the end of the Cold War.  Key figures include Lenin, Stalin, Khrushchev, Brezhnev, and Gorbachev.\n\n* **NATO (North Atlantic Treaty Organization):** A military alliance of North American and European countries.\n\n* **SEATO (Southeast Asia Treaty Organization):** A now-defunct Cold War military alliance focused on containing communism in Southeast Asia.\n\n* **CENTO (Central Treaty Organization):** A now-defunct Cold War military alliance focused on containing communism in the Middle East.\n\n* **CIS (Commonwealth of Independent States):** A loose confederation of former Soviet republics.\n\n* **GATT (General Agreement on Tariffs and Trade):** The predecessor to the World Trade Organization.\n\n* **WTO (World Trade Organization):** An international organization regulating international trade.\n\n* **IMF (International Monetary Fund):** An international organization that oversees the global financial system.\n\n* **World Bank:** An international financial institution that provides loans and grants to developing countries.\n\n* **UN (United Nations):** The principal international organization focused on international cooperation and conflict resolution.  Key aspects include the Security Council and General Assembly.  Kofi Annan is mentioned as a former Secretary-General.\n\n* **IAEA (International Atomic Energy Agency):** An international organization promoting the peaceful use of nuclear energy.\n\n\n"
    },
    {
        "q_num": 40,
        "question_text": "A company marketing food products advertises that its items do not contain trans-fats. What does this campaign signify to the customers?\n1. The food products are not made out of hydrogenated oils.\n2. The food products are not made out of animal fats/oils.\n3. The oils used are not likely to damage the cardiovascular health of the consumers.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:The advertisement signifies that the food products are free of trans fats.  Trans fats are unsaturated fatty acids created through a process called hydrogenation, where hydrogen is added to vegetable oil to make it solid.  This process creates trans isomers of fatty acids, which are linked to increased risk of heart disease. Therefore, statement 1 is correct because the absence of trans fats implies that hydrogenated oils were not used.  Statement 3 is also correct because reducing or eliminating trans fats is beneficial for cardiovascular health.  Statement 2 is incorrect; the absence of trans fats doesn't necessarily mean the products are free of all animal fats or oils.  Animal fats can contain saturated fats and cholesterol, which can also impact cardiovascular health, but their presence or absence is not directly related to the presence or absence of trans fats.\n\nTrans fats: Unsaturated fatty acids formed through hydrogenation of vegetable oils.  They increase the risk of heart disease.\n\nHydrogenation: A process that adds hydrogen to unsaturated fats, converting liquid oils into solid fats.  This process creates trans fats.\n\nCardiovascular health: The overall health of the heart and blood vessels.  Trans fats negatively impact cardiovascular health.\n"
    },
    {
        "q_num": 41,
        "question_text": "Among the following who are eligible to benefit from the \"Mahatma Gandhi National Rural Employment Guarantee Act\"?",
        "option_a": "Adult members of only the scheduled caste and scheduled tribe households",
        "option_b": "Adult members of below poverty line (BPL) households",
        "option_c": "Adult members of households of all backward communities",
        "option_d": "Adult members of any household",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: The Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA) guarantees 100 days of wage employment in a financial year to every rural household whose adult members volunteer for unskilled manual work.  This right is not limited to specific castes, communities, or poverty levels; it extends to adult members of any rural household.  Therefore, option (d) is correct.\n\nScheduled Castes (SCs) and Scheduled Tribes (STs):  These are categories of historically marginalized communities in India who receive affirmative action under the Indian Constitution.  MGNREGA is not limited to these groups.\n\nBelow Poverty Line (BPL) households:  This refers to households whose income falls below a government-defined poverty line. While MGNREGA aims to alleviate poverty, it's not exclusively for BPL households.  The act aims to provide employment opportunities to all rural households.\n\nBackward communities: This is a broader category encompassing various social groups that have faced historical disadvantages.  MGNREGA does not target this category specifically, rather it provides a universal right to work.\n"
    },
    {
        "q_num": 42,
        "question_text": "With reference to \"Look East Policy\" of India, consider the following statements\n1. India wants to establish itself as an important regional player in the East Asian affairs.\n2. India wants to plug the vacuum created by the termination of Cold War.\n3. India wants to restore the historical and cultural ties with its neighbours in Southeast and East Asia.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation:The Look East Policy (LEP) of India aimed to strengthen relations with Southeast and East Asian countries.  Statement 1 is correct because a key goal of the LEP was to increase India's influence and prominence in the East Asian region.  Statement 3 is also correct as the LEP sought to revive historical and cultural links with its neighbours in the region.  Statement 2 is incorrect. While the end of the Cold War did present opportunities for India to forge new relationships, it wasn't the primary driving force behind the LEP. The policy's main focus was on economic cooperation and strategic partnerships in the East Asian region, building on pre-existing historical and cultural ties.\n\n**Short Notes:**\n\n* **Look East Policy (LEP):** India's foreign policy initiative focusing on strengthening relations with Southeast and East Asia. It aimed at economic cooperation, strategic partnerships, and cultural exchange to increase India's influence in the region and counter China's growing power.  The policy has since evolved into the Act East Policy.\n\n* **Cold War:** A period of geopolitical tension between the United States and the Soviet Union and their respective allies, lasting roughly from 1947 to 1991.  It was characterized by an arms race, proxy wars, and ideological conflict.  The end of the Cold War created a power vacuum in some regions, influencing India's foreign policy decisions.\n\n* **East Asia:** A region in Asia comprising countries like China, Japan, South Korea, and others. It's a significant economic and geopolitical area.\n\n* **Southeast Asia:** A region in Asia including countries like Indonesia, Vietnam, Thailand, and others. It's strategically and economically significant, with diverse cultures and histories.\n\n* **NAM (Non-Aligned Movement):** A group of states that are not formally aligned with or against any major power bloc.  India was a founding member and played a significant role in shaping the movement's principles and objectives.  It aimed to promote peaceful coexistence and cooperation among nations regardless of their political systems.\n\n* **BRICS:** An association of five major emerging economies: Brazil, Russia, India, China, and South Africa.  It focuses on economic cooperation and development.  India's involvement reflects its growing economic and geopolitical influence.\n\n* **ASEAN (Association of Southeast Asian Nations):** A regional intergovernmental organization comprising ten Southeast Asian countries. It promotes economic, political, security, social, and cultural cooperation among its members.  India has strong ties with ASEAN as part of its Act East Policy.\n\n* **Indo-Pacific:** A geopolitical term encompassing the Indian and Pacific Oceans and the lands surrounding them.  It highlights the increasing interconnectedness of these regions and growing strategic competition.\n\n\n"
    },
    {
        "q_num": 43,
        "question_text": "When the annual Union Budget is not passed by the Lok Sabha,",
        "option_a": "the Budget is modified and presented again",
        "option_b": "the Budget is referred to the Rajya Sabha for suggestions",
        "option_c": "the Union Finance Minister is asked to resign",
        "option_d": "the Prime Minister submits the resignation of Council of Ministers",
        "correct_option": "d",
        "subject": "polity",
        "year": 2011,
        "explanation": "* **correct_option:** (d)\n* **explanation:** If the Lok Sabha fails to pass the annual Union Budget, the Council of Ministers, led by the Prime Minister, must resign.  This is because the budget is a crucial element of the government's financial plan, and its failure to pass indicates a loss of confidence in the government's ability to govern. The Union Budget, as per Article 112 of the Constitution of India, is the annual financial statement showing estimated receipts and expenditures of the government.  The Lok Sabha (House of the People) is the lower house of the Indian Parliament, and its approval is essential for the budget's passage. The Rajya Sabha (Council of States) is the upper house, and while it can suggest amendments, it cannot vote on the budget (a money bill). The Union Finance Minister is responsible for presenting the budget, but their resignation is not an automatic consequence of the budget's failure to pass.  Modifying and presenting the budget again is also not the direct consequence; the government's fate rests on the Lok Sabha's decision.\n"
    },
    {
        "q_num": 44,
        "question_text": "Under the Constitution of India, which one of the following is not a fundamental duty?",
        "option_a": "To vote in public elections",
        "option_b": "To develop the scientific temper",
        "option_c": "To safeguard public property",
        "option_d": "To abide by the Constitution and respect its ideals",
        "correct_option": "a",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation:The Constitution of India lists several Fundamental Duties in Part IV-A, added by the 42nd Amendment in 1976.  These duties are not legally enforceable, unlike Fundamental Rights.  Developing scientific temper, safeguarding public property, and abiding by the Constitution and respecting its ideals are all included as Fundamental Duties. However, the Constitution does *not* mandate voting in public elections as a Fundamental Duty.  While voting is a crucial aspect of a democracy, it is a right, not a legally binding duty under the Indian Constitution.\n"
    },
    {
        "q_num": 45,
        "question_text": "With reference to the Finance Commission of India, which of the following statements is correct?",
        "option_a": "It encourages the inflow of foreign capital for infrastructure development",
        "option_b": "It facilitates the proper distribution of finances among the Public Sector Undertakings",
        "option_c": "It ensures transparency in financial administration",
        "option_d": "None of the statements (a), (b) and (c) given above is correct in this context",
        "correct_option": "d",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: The Finance Commission of India is a constitutional body that is constituted every five years.  Its primary function is to recommend the distribution of tax revenue between the Union and the States.  It does not deal with foreign capital inflow, distribution of finances among Public Sector Undertakings, or ensuring transparency in financial administration. These are functions of different government bodies and agencies.\n\nThe Comptroller and Auditor General of India (CAG) is an independent constitutional authority that audits the accounts of the Union and State Governments.  The CAG is the guardian of public purse and is responsible for ensuring transparency and accountability in government spending.\n\nPublic Sector Undertakings (PSUs) are state-owned enterprises that operate in various sectors of the economy.\n\n\n"
    },
    {
        "q_num": 46,
        "question_text": "Consider the following:\n1. Right to education.\n2. Right to equal access to public service.\n3. Right to food.\nWhich of the above is/are Human Right/Human Rights under \"Universal Declaration of Human Rights\"?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2011,
        "explanation": "```text\ncorrect_option: (d)\nexplanation:The Universal Declaration of Human Rights (UDHR) includes the right to education (Article 26), the right to equal access to public service (implied in Article 1 and Article 21 which guarantees the right to life and liberty and implies equal opportunity), and the right to food (implied within the right to an adequate standard of living, Article 25).  Therefore, all three are considered human rights under the UDHR, although not explicitly stated in those exact terms.\n\nShort notes:\n\nUniversal Declaration of Human Rights (UDHR): A landmark document adopted by the United Nations General Assembly in 1948. It sets out fundamental human rights to be universally protected.  It's not a legally binding treaty but serves as a common standard of achievement for all peoples and all nations.\n\nRight to education:  The right to free and compulsory primary education, as well as access to higher education.  This is enshrined in international human rights law and aims to empower individuals through knowledge and skills.\n\nRight to equal access to public service: The principle that all individuals, regardless of background, should have equal opportunities for employment and advancement in government positions.  This is crucial for equitable governance and social justice.\n\nRight to food: The right to have access to sufficient, safe, and nutritious food, regularly to ensure survival and an active and healthy life. This involves both physical and economic access.\n\nArticle 1 (UDHR): All human beings are born free and equal in dignity and rights.  It forms the foundational principle of human rights, emphasizing inherent worth and equality.\n\nArticle 21 (UDHR): Everyone has the right to life, liberty and security of person.  This is a fundamental right, protecting the most basic aspects of human existence.\n\nArticle 25 (UDHR): Everyone has the right to a standard of living adequate for the health and well-being of himself and of his family, including food, clothing, housing and medical care and necessary social services, and the right to security in the event of unemployment, sickness, disability, widowhood, old age or other lack of livelihood in circumstances beyond his control. This article encompasses the right to an adequate standard of living, which includes the right to food.\n```\n"
    },
    {
        "q_num": 47,
        "question_text": "There is a concern over the increase in harmful algal blooms in the seawaters of India. What could be the causative factors for this phenomenon?\n1. Discharge of nutrients from the estuaries.\n2. Run-off from the land during the monsoon.\n3. Upwelling in the seas.\nSelect the correct answer from the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2011,
        "explanation": "```text\ncorrect_option: (d)\nexplanation: Harmful algal blooms (HABs) are a significant environmental problem, and several factors contribute to their increase.  Discharge of nutrients (eutrophication) from estuaries (where rivers meet the sea) introduces excess nitrogen and phosphorus, fueling algal growth.  Runoff from land during monsoons carries agricultural fertilizers and other pollutants into the water, further enriching it with nutrients. Upwelling brings nutrient-rich waters from deeper layers to the surface, making them available to algae.  All three factors (1, 2, and 3) contribute to the increased occurrence of HABs.\n\nEstuaries: Semi-enclosed coastal bodies of water where freshwater from rivers mixes with saltwater from the ocean. They are highly productive ecosystems but vulnerable to pollution.\n\nMonsoons: Seasonal winds that bring heavy rainfall to parts of India and other regions.  The heavy rainfall associated with monsoons can lead to increased nutrient runoff into waterways.\n\nUpwelling:  A process in the ocean where deep, cold, nutrient-rich waters rise to the surface. While vital for ocean ecosystems, it can also contribute to algal blooms by providing nutrients.\n\nHarmful Algal Blooms (HABs): Rapid increase in the population of algae or cyanobacteria in water bodies, often causing oxygen depletion (hypoxia) and producing toxins harmful to marine life and humans.\n\nEutrophication: Excessive richness of nutrients in a body of water, frequently due to runoff from the land, which causes a dense growth of plant life and death of animal life from lack of oxygen.\n```\n"
    },
    {
        "q_num": 48,
        "question_text": "Consider the following:\n1. Photosynthesis\n2. Respiration\n3. Decay of organic matter\n4. Volcanic action\nWhich of the above add carbon dioxide to the carbon cycle on Earth?",
        "option_a": "1 and 4 only",
        "option_b": "2 and 3 only",
        "option_c": "2, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:Respiration is the process by which organisms break down organic matter to release energy, producing carbon dioxide as a byproduct.  Decay of organic matter involves the decomposition of dead plants and animals by microorganisms, also releasing carbon dioxide. Volcanic action releases carbon dioxide stored in the Earth's interior. Photosynthesis, on the other hand, removes carbon dioxide from the atmosphere to produce organic matter.  Therefore, only options 2, 3, and 4 add carbon dioxide to the carbon cycle.\n\nPhotosynthesis: The process by which green plants and some other organisms use sunlight to synthesize foods from carbon dioxide and water.  It is a crucial process for removing carbon dioxide from the atmosphere.\n\nRespiration: The process in which organisms break down organic compounds to release energy, producing carbon dioxide and water as byproducts.  This is a significant source of atmospheric carbon dioxide.\n\nDecay of organic matter: The breakdown of dead organic material by decomposers (bacteria and fungi), releasing carbon dioxide, water, and nutrients back into the environment.\n\nVolcanic action: The release of gases, including carbon dioxide, from volcanic eruptions. This is a natural source of atmospheric carbon dioxide.\n"
    },
    {
        "q_num": 49,
        "question_text": "Recently, the USA decided to support India's membership in multi-lateral export control regimes called the \"Australia Group\" and the \"Wassenaar Arrangement\". What is the difference between them?\n1. The Australia Group is an informal arrangement which aims to allow exporting countries to minimize the risk of assisting chemical and biological weapons proliferation, whereas the Wassenaar Arrangement is a formal group under the OECD holding identical objectives.\n2. The Australia Group comprises predominantly of Asian, African and North American countries, whereas the member countries of Wassenaar Arrangement are predominantly from the European Union and American continents.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation:The Australia Group is an informal arrangement focusing on preventing the proliferation of chemical and biological weapons by controlling exports of related materials.  The Wassenaar Arrangement is a more formal group, operating under the OECD, with similar goals but a broader scope encompassing conventional arms and dual-use goods.  Statement 1 correctly describes the difference in formality and primary focus, while statement 2 is incorrect regarding the geographic distribution of member countries.  Both groups aim to establish global norms and control the flow of materials that could be used to create weapons of mass destruction.\n\n\nAustralia Group: An informal group of countries working to prevent the proliferation of chemical and biological weapons.  They achieve this through voluntary export controls on dual-use goods that could be diverted to these weapons programs. Membership is based on adherence to their guidelines and commitment to non-proliferation efforts.\n\nWassenaar Arrangement: A formal multilateral export control regime established in 1996 under the auspices of the Organisation for Economic Co-operation and Development (OECD). It aims to control the export of conventional arms and dual-use goods and technologies, including those with potential for weapons of mass destruction.  It involves legally binding commitments from member states.\n\nChemical Weapons Convention (1992):  A multilateral treaty banning the development, production, stockpiling, and use of chemical weapons.  It established the Organisation for the Prohibition of Chemical Weapons (OPCW) to monitor compliance and enforce the ban.\n\nBiological and Toxic Weapons Convention (1972): A treaty prohibiting the development, production, and stockpiling of biological and toxin weapons.  Verification mechanisms are weaker than those in the Chemical Weapons Convention, making enforcement more challenging.\n\nOECD (Organisation for Economic Co-operation and Development): An intergovernmental economic organisation with 38 member countries, focused on promoting economic growth and sustainable development.  They work on a range of issues, including trade, investment, and technology.  They provide a platform for policy coordination and information sharing.\n"
    },
    {
        "q_num": 50,
        "question_text": "The surface of a lake is frozen in severe winter, but the water at its bottom is still liquid. What is the reason?",
        "option_a": "Ice is a bad conductor of heat",
        "option_b": "Since the surface of the lake is at the same temperature as the air, no heat is lost",
        "option_c": "The density of water is maximum at 4°C",
        "option_d": "None of the statements (a), (b) and (c) given above is correct",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Ice is a poor conductor of heat.  This means that heat from the water below the frozen surface of the lake has difficulty transferring to the colder air above.  Consequently, the water at the bottom remains liquid even when the surface is frozen. The density of water being maximum at 4°C is relevant to the formation of ice on the surface, but doesn't explain why the water below remains liquid.  The temperature of the lake's surface being the same as the air temperature doesn't prevent heat loss; it only indicates an equilibrium state where heat loss is balanced by heat gain from other sources.\n\nIce: A solid state of water, characterized by its crystalline structure and poor thermal conductivity.  Its formation on the surface of a lake is a consequence of the density anomaly of water.\n\nHeat: A form of energy transferred due to temperature differences.  In this context, heat is transferred from the water to the atmosphere, but this process is slowed by the insulating properties of ice.\n\nConductor of Heat: A material that allows for the efficient transfer of heat energy.  Ice is a poor conductor, while water is a relatively better conductor.\n\nDensity:  A measure of mass per unit volume. Water's density is unusual in that it is highest at 4°C, decreasing as it cools or warms from this point. This is why ice floats.\n"
    },
    {
        "q_num": 51,
        "question_text": "A sandy and saline area is the natural habitat of an Indian animal species. The animal has no predators in that area but its existence is threatened due to the destruction of its habitat. Which one of the following could be that animal?",
        "option_a": "Indian wild buffalo",
        "option_b": "Indian wild ass",
        "option_c": "Indian wild boar",
        "option_d": "Indian gazelle",
        "correct_option": "b",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: The Indian wild ass ( *Equus hemionus khur*) inhabits arid and semi-arid regions, including sandy and saline areas, primarily in the Little Rann of Kutch in Gujarat, India.  They have no natural predators in this habitat, but the destruction of their habitat due to human activities, such as agriculture and infrastructure development, poses a significant threat to their existence.\n\nIndian wild buffalo (*Bubalus arnee*):  Large bovine found in diverse habitats including grasslands and wetlands.  While habitat loss is a concern, they are not exclusively found in sandy and saline areas and have predators.\n\nIndian wild boar (*Sus scrofa cristatus*): Omnivorous mammal found in various habitats, including forests, grasslands, and scrublands.  They are not limited to sandy and saline areas and have predators.\n\nIndian gazelle (*Gazella bennettii*):  Antelope found in grasslands and scrublands, but not typically in exclusively sandy and saline areas.  They have predators.\n"
    },
    {
        "q_num": 52,
        "question_text": "La Nina is suspected to have caused recent floods in Australia. How is La Nina different from El Nino?\n1. La Nina is characterised by unusually cold ocean temperature in equatorial Indian Ocean whereas El Nino is characterised by unusually warm ocean temperature in the equatorial Pacific Ocean.\n2. El Nino has adverse effect on south-west monsoon of India, but La Nina has no effect on monsoon climate.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is partially correct. La Niña is characterized by unusually *cold* ocean temperatures in the central and eastern equatorial Pacific Ocean, not the Indian Ocean. El Niño is characterized by unusually *warm* ocean temperatures in the central and eastern equatorial Pacific Ocean.  Statement 2 is incorrect. La Niña can influence the south-west monsoon of India, often leading to better than average rainfall.\n\n\nLa Niña:  A climate pattern that occurs in the Pacific Ocean, characterized by unusually cool ocean temperatures near the equator. It's the opposite of El Niño.  La Niña events typically result in altered weather patterns globally, including changes in rainfall and temperature.  In Australia, La Niña can lead to increased rainfall and flooding.\n\nEl Niño: A climate pattern that occurs in the Pacific Ocean, characterized by unusually warm ocean temperatures near the equator.  El Niño events have significant impacts on global weather patterns, often leading to droughts in some regions and heavy rainfall in others.  Its effects on the Indian monsoon are often adverse, leading to reduced rainfall.\n"
    },
    {
        "q_num": 53,
        "question_text": "The tendency for increased litigation was visible after the introduction of the land settlement system of Lord Cornwallis in 1793. The reason for this is normally traced to which of the following provisions?",
        "option_a": "Making Zamindar's position stronger vis-a-vis the ryot",
        "option_b": "Making East India Company an overlord of Zamindars",
        "option_c": "Making judicial system more efficient",
        "option_d": "None of the (a), (b) and (c) above",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: The introduction of the Cornwallis Code in 1793 strengthened the Zamindars' position relative to the Ryots (peasants).  This led to increased litigation as Zamindars, empowered by the system to collect land revenue, often exploited Ryots, leading to disputes and legal battles.  Lord Cornwallis was a Governor-General of Bengal who implemented significant land reforms.  The Zamindari system was a land revenue system in which Zamindars were granted land in exchange for collecting and remitting revenue to the British East India Company. Ryots were the peasant cultivators who worked the land.  The East India Company's role as the overlord was already established before 1793; the 1793 reforms didn't significantly alter this, but rather solidified the Zamindari system within the existing colonial structure.  The judicial system's efficiency wasn't a primary factor driving increased litigation; rather, the system's existence provided a mechanism for the increased disputes to be processed.\n"
    },
    {
        "q_num": 54,
        "question_text": "Which one of the following observations is not true about the Quit India Movement of 1942?",
        "option_a": "It was a non-violent movement",
        "option_b": "It was led by Mahatma Gandhi",
        "option_c": "It was a spontaneous movement",
        "option_d": "It did not attract the labour class in general",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "* **correct_option:** (a)\n* **explanation:** The Quit India Movement, while inspired by Mahatma Gandhi's philosophy of non-violence,  saw widespread instances of violence and defiance against British rule. This makes option (a) incorrect.  The movement was indeed led by Gandhi, making (b) true. It was also spontaneous, with widespread participation erupting across India, verifying (c). Finally, the movement did see participation from the labor class, although perhaps not as widespread as other segments of society, making (d) incorrect.\n\nMahatma Gandhi: A prominent leader of the Indian independence movement, known for his philosophy of Satyagraha (non-violent resistance). His leadership was crucial in mobilizing mass participation in various movements, including the Quit India Movement.\n\nQuit India Movement (1942): A mass civil disobedience movement launched in India during World War II. It aimed to force the British to grant India independence.  The movement was characterized by widespread protests, strikes, and acts of defiance, even though it was initially conceived as a non-violent movement.\n"
    },
    {
        "q_num": 55,
        "question_text": "Which amongst the following provided a common factor for tribal insurrection in India in the 19th century?",
        "option_a": "Introduction of a new system of land revenue and taxation of tribal products",
        "option_b": "Influence of foreign religious missionaries in tribal areas",
        "option_c": "Rise of a large number of moneylenders, traders and revenue farmers as middlemen in tribal areas",
        "option_d": "The complete disruption of the old agrarian order of the tribal communities",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation: The introduction of new land revenue systems and taxation of tribal products was a major cause of tribal insurrection in 19th-century India.  The British implemented various revenue systems (like the Zamindari system) that often led to increased tax burdens and displacement of tribal communities from their lands.  Taxation of traditional tribal products further exacerbated economic hardship and fueled resentment.\n\n\nWhile the other options played a role in some specific instances, they weren't as universally applicable a cause of widespread tribal uprisings as the land revenue and taxation policies.\n\n**Short notes on named entities:**\n\n* **Land revenue:**  A system of taxation imposed by the British on land ownership in India. Different systems were used in different regions, often leading to exploitation and displacement.  The Zamindari system, for instance, gave land ownership rights to intermediaries who collected taxes from cultivators, often demanding exorbitant amounts.\n\n* **Taxation of tribal products:**  The British government levied taxes on goods produced by tribal communities, impacting their livelihoods and traditional economies. This added to the existing economic pressures caused by land revenue policies.\n\n* **Moneylenders, traders, and revenue farmers:** These groups acted as intermediaries between the British administration and tribal communities, often exploiting their vulnerability through exploitative loan practices and unfair trade deals. Their presence increased economic inequality and resentment.\n\n* **Agrarian order:**  The traditional system of land ownership, cultivation, and social structure within tribal communities. The British policies disrupted this order, leading to economic hardship, social upheaval, and loss of traditional livelihoods.  The disruption of this system was a key factor in fueling discontent and rebellion.\n"
    },
    {
        "q_num": 56,
        "question_text": "India maintained its early cultural contacts and trade links with Southeast Asia across the Bay of Bengal. For this pre-eminence of early maritime history of Bay of Bengal, which of the following could be the most convincing explanation/explanations?",
        "option_a": "As compared to other countries, India had a better ship building technology in ancient and medieval times",
        "option_b": "The rulers of southern India always patronized traders, brahmin priests and buddhist monks in this context",
        "option_c": "Monsoon winds across the Bay of Bengal facilitated sea voyages",
        "option_d": "Both (a) and (b) are convincing explanations in this context",
        "correct_option": "c",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (c)\n\nexplanation:  The monsoon winds across the Bay of Bengal played a crucial role in facilitating sea voyages between India and Southeast Asia.  The predictable nature of the monsoon winds made sea travel safer and more reliable, contributing significantly to the sustained cultural and trade connections.\n\nIndia's shipbuilding technology, while possibly advanced, is not the most convincing single explanation for this maritime dominance.  Patronage by southern Indian rulers certainly aided the spread of Indian culture and trade, but it was the ease and predictability of monsoon winds that made regular maritime activity possible.  Therefore, (c) is the most convincing single explanation, though (b) is also a contributing factor.  The Bay of Bengal is a large bay in the northeastern Indian Ocean.  Southeast Asia refers to the countries located southeast of India and China.\n"
    },
    {
        "q_num": 57,
        "question_text": "What is the difference between Bluetooth and Wi-Fi devices?",
        "option_a": "Bluetooth uses 2-4 GHz radio frequency band, whereas Wi-Fi can use 2-4 GHz or 5 GHz frequency band",
        "option_b": "Bluetooth is used for Wireless Local Area Networks (WLAN) only, whereas Wi-Fi is used for Wireless Wide Area Networks (WWAN) only",
        "option_c": "When information is transmitted between two devices using Bluetooth technology, the devices have to be in the line of sight of each other, but when Wi-Fi technology is used the devices need not be in the line of sight of each other",
        "option_d": "The statements (a) and (b) given above are correct in this context",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Bluetooth typically operates in the 2.4 GHz frequency band, while Wi-Fi can use both the 2.4 GHz and 5 GHz bands.  Option (b) is incorrect; Bluetooth is primarily used for short-range personal area networks (PANs), while Wi-Fi is designed for Wireless Local Area Networks (WLANs).  Option (c) is also incorrect; line-of-sight is not a requirement for either technology, although obstacles can affect signal strength.  Therefore, only statement (a) is correct.\n\nBluetooth: A short-range wireless technology standard used for exchanging data between fixed and mobile devices over short distances using short-wavelength UHF radio waves in the ISM band from 2.4 to 2.485 GHz.  It is commonly used for connecting peripherals like keyboards, mice, and headphones to computers.\n\nWi-Fi:  (Wireless Fidelity)  A family of wireless networking technologies based on the IEEE 802.11 standard.  It provides high-speed wireless data communication using radio waves. Wi-Fi is used to connect devices to a local area network (LAN) and the internet.  Wi-Fi networks can cover larger areas than Bluetooth.\n\nWireless Local Area Network (WLAN): A local area network that uses radio waves to transmit data between devices over a relatively short distance.\n\nWireless Wide Area Network (WWAN): A wide area network that uses radio waves to transmit data over a large geographical area.  This is typically associated with cellular networks (like 3G, 4G, 5G).\n"
    },
    {
        "q_num": 58,
        "question_text": "With reference to micro-irrigation, which of the following statements is/are correct?\n1. Fertilizer/nutrient loss can be reduced.\n2. It is the only means of irrigation in dry land farming.\n3. In some areas of farming, receding of ground water table can be checked.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct. Micro-irrigation techniques like drip and subsurface irrigation deliver water directly to plant roots, minimizing water loss through evaporation and runoff. This efficient water use also leads to reduced fertilizer/nutrient loss as nutrients are applied directly to the plants and less leaching occurs.\n\nStatement 2 is incorrect. Micro-irrigation is a highly efficient method but not the only irrigation method used in dryland farming. Other techniques like sprinkler irrigation, and even traditional methods adapted to the specific conditions, might also be employed.\n\nStatement 3 is correct.  By delivering water precisely where it's needed, micro-irrigation reduces the overall amount of water required for irrigation. In areas facing groundwater depletion, this targeted approach can help to check the receding of the water table.\n\n\n**Short notes on keywords and named entities:**\n\n**Micro-irrigation:** A water-efficient irrigation method that delivers small amounts of water directly to plant roots, reducing water waste and improving water use efficiency.  It encompasses techniques like drip, subsurface, and other localized irrigation systems.\n\n**Dry land farming:** Farming practiced in regions with low and erratic rainfall, requiring careful water management techniques to ensure successful crop production.  Dryland farming often relies on water harvesting and efficient irrigation strategies to supplement natural rainfall.\n\n**Receding groundwater table:** The lowering of the water level in underground aquifers. Over-extraction of groundwater for irrigation and other purposes is a major cause, leading to water scarcity and environmental problems.  Sustainable irrigation practices are crucial to address this issue.\n\n**Fertilizer/nutrient loss:** The loss of fertilizers and nutrients applied to crops due to factors like leaching (movement of nutrients into the soil profile), runoff, and volatilization (loss to the atmosphere).  Efficient irrigation methods minimize this loss, improving fertilizer use efficiency and reducing environmental pollution.\n"
    },
    {
        "q_num": 59,
        "question_text": "With reference to the period of colonial rule in India, \"Home Charges\" formed an important part of drain of wealth from India. Which of the following funds constituted \"Home Charges\"?\n1. Funds used to support the India Office in London.\n2. Funds used to pay salaries and pensions of British personnel engaged in India.\n3. Funds used for waging wars outside India by the British.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (d)\n\nexplanation: Home Charges were a significant part of the drain of wealth from India during British colonial rule.  They encompassed various expenditures incurred by the British government, primarily benefiting Britain rather than India.\n\n1. **Funds used to support the India Office in London:** This refers to the administrative expenses of the India Office, the British government department responsible for managing India's affairs.  The India Office's functioning, including salaries of its staff and operational costs, was entirely funded by Indian revenues.\n\n2. **Funds used to pay salaries and pensions of British personnel engaged in India:** A substantial portion of Home Charges consisted of salaries and pensions paid to British civil servants, military personnel, and other officials serving in India. These payments were sent back to Britain, representing a direct outflow of Indian wealth.\n\n3. **Funds used for waging wars outside India by the British:**  The British often used Indian revenues to finance wars fought outside India, such as those in other colonies or European conflicts. This further contributed to the drain of wealth from India.\n\nTherefore, all three options contributed to the Home Charges, making option (d) the correct answer.\n\n\nDadabhai Naoroji: A prominent Indian nationalist and economist who played a crucial role in exposing the economic exploitation of India under British rule. His work highlighted the \"drain of wealth\" theory, emphasizing how British policies systematically transferred resources from India to Britain.\n\nHome Charges:  These were payments made from India's revenue to the British government in Britain.  They covered a range of expenses, including the costs of administering India from London, salaries of British officials in India, and military expenditures.  They represent a significant aspect of the economic exploitation of India under British rule.\n\nColonial rule in India: The period of British domination over India, lasting roughly from 1757 to 1947.  This period saw significant economic, political, and social changes in India, largely shaped by British policies and interests.  Many aspects of British rule are viewed negatively due to their exploitative nature and the resulting impoverishment of much of the Indian population.  Different stages of colonialism involved different policies and methods.\n\nDeindustrialisation: The systematic decline of Indian industries during British rule.  British policies favored British manufactured goods, leading to the decline of traditional Indian industries and hindering the development of modern industries.\n\nImpoverishment of peasantry: The British land revenue system and other policies led to widespread poverty among Indian peasants.  High taxes, loss of land ownership, and unfavorable market conditions severely impacted the rural population.\n\nEmergence of intermediaries/absentee landlordism: The British introduced systems of land ownership that led to the emergence of intermediaries between the peasants and the state, often resulting in exploitation and increased poverty for the peasants.\n\n\n"
    },
    {
        "q_num": 60,
        "question_text": "What was the reason for Mahatma Gandhi to organize a satyagraha on behalf of the peasants of Kheda?\n1. The Administration did not suspend the land revenue collection in spite of a drought.\n2. The Administration proposed to introduce Permanent Settlement in Gujarat.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: The Kheda Satyagraha, organized by Mahatma Gandhi, was primarily due to the British administration's refusal to suspend land revenue collection despite a severe drought in the Kheda district of Gujarat.  The peasants were unable to pay the taxes due to crop failure.  This is why statement 1 is correct, and statement 2 is incorrect.\n\n\nMahatma Gandhi:  A prominent leader of Indian independence movement, known for his philosophy of Satyagraha (non-violent resistance). He led numerous movements against British rule, including the Kheda Satyagraha.\n\nKheda Satyagraha: A non-violent resistance movement led by Gandhi in 1918 in Kheda district of Gujarat, India, protesting against the British government's demand for land revenue despite widespread crop failure due to drought.\n\nSatyagraha:  A philosophy and practice of non-violent resistance developed by Mahatma Gandhi. It involves the use of civil disobedience and peaceful protest to oppose injustice.\n\nKheda: A district in Gujarat, India, where the Kheda Satyagraha took place.  The region experienced a severe drought in 1918, impacting the agricultural community significantly.\n\nGujarat: A state in western India, where the Kheda district is located.\n"
    },
    {
        "q_num": 61,
        "question_text": "Biodiversity forms the basis for human existence in the following ways:\n1. Soil formation\n2. Prevention of soil erosion\n3. Recycling of waste\n4. Pollination of crops\nSelect the correct answer using the codes given below.",
        "option_a": "1, 2 and 3 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:Biodiversity supports human existence in numerous ways.  Soil formation relies on the diverse organisms within the soil, including bacteria, fungi, and insects, which break down organic matter and create soil structure.  Biodiversity prevents soil erosion by holding soil together with plant roots and other organic matter.  Waste recycling is a crucial ecosystem service provided by decomposers (bacteria, fungi) that break down organic waste.  Finally, pollination of crops is essential for food production, and is primarily done by insects and other animals.  All four options (soil formation, soil erosion prevention, waste recycling, and crop pollination) are directly linked to biodiversity and are crucial for human survival.  Therefore, option (d) is correct.\n"
    },
    {
        "q_num": 62,
        "question_text": "Aspartame is an artificial sweetener sold in the market. It consists of amino acids and provides calories like other amino acids. Yet, it is used as a low-calorie sweetening agent in food items. What is the basis of this use?",
        "option_a": "Aspartame is as sweet as table sugar, but unlike table sugar, it is not readily oxidized in human body due to lack of requisite enzymes",
        "option_b": "When aspartame is used in food processing, the sweet taste remains, but it becomes resistant to oxidation",
        "option_c": "Aspartame is as sweet as sugar, but after ingestion into the body, it is converted into metabolites that yield no calories",
        "option_d": "Aspartame is several times sweeter than table sugar, hence food items made with small quantities of aspartame yield fewer calories on oxidation",
        "correct_option": "c",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:Aspartame is a dipeptide artificial sweetener that is many times sweeter than sucrose (table sugar).  While it is composed of amino acids and thus contains calories, the amount is negligible because only a tiny amount is needed to achieve the desired sweetness. Upon ingestion, aspartame is metabolized into its components: aspartic acid, phenylalanine, and methanol. These metabolites yield very few calories, making aspartame a low-calorie sweetener.\n\nAspartame: An artificial sweetener composed of two amino acids, aspartic acid and phenylalanine, and methanol. It is significantly sweeter than sucrose, requiring smaller quantities to achieve the same level of sweetness.  Its low-calorie nature stems from the minimal caloric yield of its metabolic byproducts.\n\nTable sugar (Sucrose): A disaccharide composed of glucose and fructose, it is a common natural sweetener. It is readily oxidized in the body to provide energy, yielding a significant number of calories.\n\nAmino acids: The building blocks of proteins.  They contain carbon, hydrogen, oxygen, and nitrogen and serve as the basic units for protein synthesis in living organisms.  They also contribute to energy production.\n"
    },
    {
        "q_num": 63,
        "question_text": "What was the purpose with which Sir William Wedderburn and W. S. Caine had set up the Indian Parliamentary Committee in 1893?",
        "option_a": "To agitate for Indian political reforms in the House of Commons",
        "option_b": "To campaign for the entry of Indians into the Imperial Judiciary",
        "option_c": "To facilitate a discussion on India's Independence in the British Parliament",
        "option_d": "To agitate for the entry of eminent Indians into the British Parliament",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation:The Indian Parliamentary Committee, established in 1893 by Sir William Wedderburn and W. S. Caine, aimed to advocate for Indian political reforms within the House of Commons.  Their primary goal was to pressure the British government to grant greater political rights and representation to Indians.\n\n\nSir William Wedderburn: A prominent British member of Parliament and a strong supporter of Indian self-governance. He was deeply involved in the Indian National Congress and worked tirelessly to promote understanding of Indian aspirations in Britain.\n\nW. S. Caine:  A British Liberal politician and a vocal advocate for Indian reforms. He shared Wedderburn's commitment to improving the political status of Indians within the British Empire.\n\nHouse of Commons: The lower house of the UK Parliament, responsible for making and amending laws.  The Committee's focus on the House of Commons reflects their strategy to influence British policy through parliamentary means.\n"
    },
    {
        "q_num": 64,
        "question_text": "What is the difference between a CFL and an LED lamp?\n1. To produce light, a CFL uses mercury vapour and phosphor while an LED lamp uses semi-conductor material.\n2. The average life span of a CFL is much longer than that of an LED lamp.\n3. A CFL is less energy-efficient as compared to an LED lamp.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct. CFLs (Compact Fluorescent Lamps) use mercury vapor and phosphor to produce light, while LEDs (Light Emitting Diodes) use semiconductor material.  Statement 2 is incorrect. LEDs have a much longer lifespan than CFLs. Statement 3 is correct. LEDs are significantly more energy-efficient than CFLs.  Therefore, only statements 1 and 3 are correct.\n\nCFL (Compact Fluorescent Lamp): A CFL is a low-energy light bulb that uses electricity to excite mercury vapor. This produces ultraviolet (UV) light that then strikes a phosphor coating on the inside of the bulb, converting the UV light into visible light.\n\nLED (Light Emitting Diode): An LED is a semiconductor light source that emits light when current flows through it.  Unlike CFLs, LEDs don't use mercury or phosphor and are more energy efficient and long-lasting.\n"
    },
    {
        "q_num": 65,
        "question_text": "Recently, \"oilzapper\" was in the news. What is it?",
        "option_a": "It is an eco-friendly technology for the remediation of oily sludge and oil spills.",
        "option_b": "It is the latest technology developed for undersea oil exploration.",
        "option_c": "It is a genetically engineered high biofuel yielding maize variety.",
        "option_d": "It is the latest technology to control the accidentally caused flames from oil wells.",
        "correct_option": "a",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Based on news reports, \"oilzapper\" refers to an eco-friendly technology used for the remediation of oily sludge and oil spills.  It's a method for cleaning up oil pollution.  The other options are incorrect; they describe unrelated technologies.\n"
    },
    {
        "q_num": 66,
        "question_text": "A married couple adopted a male child. A few years later, twin boys were born to them. The blood group of the couple is AB positive and O negative. The blood group of the three sons is A positive, B positive, and O positive. The blood group of the adopted son is",
        "option_a": "O positive",
        "option_b": "A positive",
        "option_c": "B positive",
        "option_d": "Cannot be determined on the basis of the given data",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation:The parents have blood group AB positive and O negative.  The possible alleles for the AB positive parent are A and B, and for the O negative parent are O and O.  Therefore, the children can inherit A, B, or O alleles.  The children's blood groups are A positive, B positive, and O positive. Since the O positive child can only receive an O allele from each parent, and the parents only have A and B alleles to give, this O positive child must be adopted. The other two children (A positive and B positive) are biologically related to the parents.  Therefore, the adopted son's blood group is O positive.\n\n\nBlood groups are determined by the presence or absence of specific antigens (A and B antigens) on the surface of red blood cells.  The ABO blood group system categorizes blood into four types: A, B, AB, and O.  Rh factor is another antigen that can be present (positive) or absent (negative).  Inheritance of blood groups follows Mendelian genetics.\n"
    },
    {
        "q_num": 67,
        "question_text": "Mahatma Gandhi said that some of his deepest convictions were reflected in a book titled, \"Unto this Last\" and the book transformed his life. What was the message from the book that transformed Mahatma Gandhi?",
        "option_a": "Uplifting the oppressed and poor is the moral responsibility of an educated man.",
        "option_b": "The good of individual is contained in the good of all.",
        "option_c": "The life of celibacy and spiritual pursuit are essential for a noble life.",
        "option_d": "All the statements (a), (b) and (c) are correct in this context.",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "* **correct_option:** (b)\n* **explanation:**  The core message from John Ruskin's \"Unto This Last\" that profoundly impacted Mahatma Gandhi was the principle of **the good of the individual is contained in the good of all**.  Gandhi interpreted this to mean that true progress and individual fulfillment are inextricably linked to the well-being of society as a whole, particularly the poor and marginalized.  While options (a) and (c) touch upon aspects of Gandhi's philosophy, they are not the central theme Ruskin presented that resonated so deeply with him.\n\nMahatma Gandhi: A prominent leader of the Indian independence movement known for his philosophy of nonviolent resistance (Satyagraha).\n\nJohn Ruskin: A prominent 19th-century English art critic, social thinker, and writer whose work \"Unto This Last\" significantly influenced Gandhi.  The book advocated for ethical economics and social responsibility.\n\n\"Unto This Last\":  A book by John Ruskin that argues against the purely materialistic pursuit of wealth and advocates for a moral and ethical approach to economics, emphasizing the importance of labor and the well-being of all members of society.\n"
    },
    {
        "q_num": 68,
        "question_text": "With reference to Indian freedom struggle, Usha Mehta is well-known for",
        "option_a": "Running the secret Congress Radio in the wake of Quit India Movement.",
        "option_b": "Participating in the Second Round Table Conference.",
        "option_c": "Leading a contingent of Indian National Army.",
        "option_d": "Assisting in the formation of Interim Government under Pandit Jawaharlal Nehru.",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Usha Mehta is known for running the Congress Radio, a clandestine radio station, during the Quit India Movement.  This was a crucial act of defiance against the British government's suppression of dissent.\n\nQuit India Movement: A mass civil disobedience movement launched in India in 1942, demanding immediate independence from British rule.  It was marked by widespread arrests of Indian National Congress leaders and large-scale protests.\n\nCongress Radio: A secret radio station operated by Usha Mehta and others during the Quit India Movement. It broadcast news and messages of resistance to the Indian people, circumventing the British censorship.\n\nSecond Round Table Conference: A conference held in London in 1931, involving representatives from the British government and the Indian National Congress, to discuss constitutional reforms in India.\n\nIndian National Army: An army formed by Subhas Chandra Bose during World War II, with the aim of fighting alongside the Axis powers against the British.\n\nInterim Government under Pandit Jawaharlal Nehru: A government formed in 1946, under the leadership of Jawaharlal Nehru, as a step towards India's independence.  It served as a transitional government before India's full independence in 1947.  Pandit Jawaharlal Nehru was a prominent leader of the Indian National Congress and the first Prime Minister of India.\n"
    },
    {
        "q_num": 69,
        "question_text": "A new optical disc format known as the Blu-ray Disc (BD) is becoming popular. In what way is it different from the traditional DVD?\n1. DVD supports Standard Definition video while BD supports High Definition video.\n2. Compared to a DVD, the BD format has several times more storage capacity.\n3. Thickness of BD is 2.4 mm while that of DVD is 1.2 mm.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Blu-ray Disc (BD) and Digital Versatile Disc (DVD) are both optical disc formats used for storing data, including video.  Statement 1 is correct: DVDs primarily support Standard Definition (SD) video, while BDs support High Definition (HD) video due to their higher storage capacity and data transfer rates. Statement 2 is correct: BDs have significantly more storage capacity than DVDs, allowing for longer videos and higher-quality audio. Statement 3 is incorrect:  While the physical dimensions may vary slightly between different BD and DVD types, the thickness difference mentioned is not a consistent or defining characteristic.  Therefore, only statements 1 and 2 are correct.\n\nBlu-ray Disc (BD): A high-density optical disc format offering significantly greater storage capacity and higher data transfer rates than DVDs, enabling the storage and playback of high-definition video and large amounts of data.\n\nDigital Versatile Disc (DVD): A widely used optical disc format for storing digital data, including video, audio, and computer data.  Compared to Blu-ray, it offers lower storage capacity and supports standard-definition video.\n"
    },
    {
        "q_num": 70,
        "question_text": "With reference to the period of Indian freedom struggle, which of the following was/were recommended by the Nehru report?\n1. Complete Independence for India.\n2. Joint electorates for reservation of seats for minorities.\n3. Provision of fundamental rights for the people of India in the Constitution.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: The Nehru Report, officially titled the \"Report of the Committee on the Constitution of the Indian National Congress,\"  recommended the establishment of a dominion status for India within the British Commonwealth. While it didn't advocate for complete independence (option 1), it did propose a constitution that included fundamental rights (option 3) and joint electorates with reserved seats for minorities (option 2).  Therefore, only options 2 and 3 were recommended.\n\nJawaharlal Nehru:  The first Prime Minister of India, a key figure in the Indian independence movement, and a leading member of the Congress Party. He played a crucial role in shaping India's foreign policy and domestic politics.\n\nNehru Report: A document prepared by a committee headed by Motilal Nehru in 1928, outlining the Congress's vision for a constitution for India. It proposed dominion status and a framework of rights.\n\nFundamental Rights: Basic human rights guaranteed by a constitution, usually including rights to equality, freedom of speech, and due process.  The Nehru Report included a framework for such rights.\n\nJoint electorates: Electoral systems where all voters vote together, regardless of their religion or community.  This contrasted with separate electorates for minorities.\n\nMinority:  A group of people significantly smaller in number than the majority population, often differentiated by religion, ethnicity, or language.  The Nehru Report addressed minority representation.\n"
    },
    {
        "q_num": 71,
        "question_text": "Among the following States, which one has the most suitable climatic conditions for the cultivation of a large variety of orchids with minimum cost of production, and can develop an export oriented industry in this field?",
        "option_a": "Andhra Pradesh",
        "option_b": "Arunachal Pradesh",
        "option_c": "Madhya Pradesh",
        "option_d": "Uttar Pradesh",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (b)\n\nexplanation:Arunachal Pradesh's location in the Eastern Himalayas provides a climate ideal for orchid cultivation.  The region's high altitude, humidity, and varied microclimates support a wide diversity of orchid species.  This contrasts with the other states listed: Andhra Pradesh has a more diverse climate but may lack the consistent humidity needed for many orchids; Madhya Pradesh and Uttar Pradesh have mostly drier climates less suitable for orchid cultivation on a large scale.  The lower production costs in Arunachal Pradesh are likely due to readily available natural resources and a suitable climate that minimizes the need for artificial temperature and humidity control.  This makes Arunachal Pradesh best suited to develop an export-oriented orchid industry.\n\n\nAndhra Pradesh: A state in Southern India, known for its diverse agriculture, including rice, cotton, and sugarcane.  Its climate varies from coastal regions to inland areas, affecting agricultural practices.\n\nArunachal Pradesh: A state in Northeast India, located in the Eastern Himalayas. It is characterized by its mountainous terrain, high rainfall, and diverse flora and fauna.  The state's climate is significantly different from the other options, having a cooler and more humid climate than the others which is vital for orchids.\n\nMadhya Pradesh: A state in central India, with diverse geography and climate, ranging from plains to hills, supporting crops like wheat, maize, and pulses.  Its climate is generally drier than that of Arunachal Pradesh.\n\nUttar Pradesh: A state in northern India, known for its vast plains and diverse agricultural production, including wheat, rice, and sugarcane. It has a mostly temperate climate, unlike the humid climate needed for orchid growth.\n"
    },
    {
        "q_num": 72,
        "question_text": "Which one of the following is not a site for in-situ method of conservation of flora?",
        "option_a": "Biosphere Reserve",
        "option_b": "Botanical Garden",
        "option_c": "National Park",
        "option_d": "Wildlife Sanctuary",
        "correct_option": "b",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation:In-situ conservation methods involve protecting species in their natural habitats. Biosphere reserves, national parks, and wildlife sanctuaries are all examples of protected areas where in-situ conservation is practiced.  Botanical gardens, on the other hand, are examples of ex-situ conservation, where plants are conserved outside their natural habitats.  A botanical garden cultivates plants for research, conservation, display, and education.  Biosphere reserves are large areas of terrestrial and coastal ecosystems promoting biodiversity conservation, research, monitoring, education, and sustainable development. National Parks are legally protected areas managed for the conservation of biodiversity and ecosystem processes. Wildlife sanctuaries primarily focus on protecting specific animal species and their habitats.\n"
    },
    {
        "q_num": 73,
        "question_text": "Consider the following statements: In India, a Metropolitan Planning Committee\n1. is constituted under the provisions of the Constitution of India.\n2. prepares the draft development plans for metropolitan area.\n3. has the sole responsibility for implementing Government sponsored schemes in the metropolitan area.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "polity",
        "year": 2011,
        "explanation": "correct_option: (b)\n\nexplanation: Metropolitan Planning Committees (MPCs) in India are established by state legislation, not the Constitution.  Therefore, statement 1 is incorrect.  Their primary function is to prepare draft development plans for metropolitan areas, making statement 2 correct.  MPCs do not have sole responsibility for implementing government schemes; various agencies and departments are involved, so statement 3 is incorrect.  Thus, only statement 2 is correct.\n\n\nMetropolitan Planning Committee (MPC): A committee responsible for preparing development plans for metropolitan areas in India.  It's established through state legislation and works in coordination with other government bodies.\n\nConstitution of India: The supreme law of India, outlining the framework of the government and fundamental rights.  It does not directly establish MPCs.\n\nGovernment-sponsored schemes:  Projects and initiatives funded by the Indian government to address various developmental needs.  Implementation involves multiple agencies beyond MPCs.\n"
    },
    {
        "q_num": 74,
        "question_text": "What is the difference between \"vote-on-account\" and \"interim budget\"?\n1. The provision of a \"vote-on-account\" is used by a regular Government, while an \"interim budget\" is a provision used by a caretaker Government.\n2. A \"vote-on-account\" only deals with the expenditure in Government's budget, while an \"interim budget\" includes both expenditure and receipts.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  A vote-on-account is a mechanism used by a government (regular or caretaker) to obtain parliamentary approval for essential expenditure for a limited period, typically a few months,  before the full budget is passed. An interim budget, on the other hand, is presented by a caretaker government and covers government expenses until the formation of a new government after elections.  Both are used to address short-term financial needs but in different contexts.\n\nStatement 2 is correct. A vote-on-account primarily deals with government expenditure. The interim budget, while encompassing expenditure, also includes receipts to provide a broader financial picture for the interim period.\n\n**Short notes:**\n\n* **Vote-on-account:** A short-term measure to allow a government (regular or caretaker) to spend money on essential services before the full annual budget is ready.  It's a temporary funding solution, usually covering only expenditure.\n\n* **Interim budget:** A temporary budget presented by a caretaker government (a government serving until a new one is formed) to cover essential expenses until the new government presents its budget. It includes both receipts and expenditure.\n\n* **Budget (Annual Financial Statement):** As per Article 112 of the Indian Constitution, the budget is the government's annual financial statement, detailing estimated receipts and expenditures for the fiscal year.  The Department of Economic Affairs (DEA) in the Ministry of Finance is responsible for preparing the Union Budget.\n\n* **Caretaker Government:** A temporary government, usually formed after an election and before the new government is sworn in.  Its primary role is to maintain essential government functions.\n\n\n"
    },
    {
        "q_num": 75,
        "question_text": "Regarding the International Monetary Fund, which one of the following statements is correct?",
        "option_a": "It can grant loans to any country",
        "option_b": "It can grant loans to only developed countries",
        "option_c": "It grants loans to only member countries",
        "option_d": "It can grant loans to the central bank of a country",
        "correct_option": "c",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: The International Monetary Fund (IMF) is an international organization that provides loans and financial assistance to its member countries.  It does not lend to non-member countries or only developed nations. While it can provide loans that indirectly benefit a country's central bank, the loans are officially granted to the member country's government.  Therefore, option (c) is the correct answer.\n"
    },
    {
        "q_num": 76,
        "question_text": "The 2004 Tsunami made people realize that mangroves can serve as a reliable safety hedge against coastal calamities. How do mangroves function as a safety hedge?",
        "option_a": "The mangrove swamps separate the human settlements from the sea by a wide zone in which people neither live nor venture out",
        "option_b": "The mangroves provide both food and medicines which people are in need of after any natural disaster",
        "option_c": "The mangrove trees are tall with dense canopies and serve as an excellent shelter during a cyclone or tsunami",
        "option_d": "The mangrove trees do not get uprooted by storms and tides because of their extensive roots",
        "correct_option": "d",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: The extensive root systems of mangrove trees are crucial for their survival in coastal areas.  These roots, which include prop roots and stilt roots, anchor the trees firmly in the ground, preventing them from being uprooted by strong storms and tides. This makes them an effective natural barrier against coastal calamities like tsunamis.\n\nThe 2004 Tsunami: A devastating tsunami that struck the Indian Ocean in 2004, causing widespread destruction and loss of life.  This event highlighted the importance of natural coastal defenses such as mangroves.\n\nMangroves:  Salt-tolerant trees and shrubs that thrive in coastal intertidal zones. They are characterized by unique adaptations like pneumatophores (aerial roots) for respiration in oxygen-poor soil and viviparity (seeds germinate on the parent plant).  They provide a variety of ecosystem services, including coastal protection.  Examples of mangrove locations in India include Sundarbans (West Bengal), Bhitarkanika (Odisha), Krishna-Godavari delta (Andhra Pradesh), Pichavaram (Tamil Nadu), Gulf of Kutch (Gujarat), Ratnagiri (Maharashtra), and the Andaman & Nicobar Islands.\n\nOption (a) is incorrect because while mangrove swamps do create a buffer zone, people often live near them and use the area.  Option (b) is incorrect as while mangroves provide resources, this is not their primary role in coastal protection. Option (c) is incorrect; the trees' height and canopy offer some protection but not as effectively as their root system in preventing erosion and wave damage.\n"
    },
    {
        "q_num": 77,
        "question_text": "The Jain philosophy holds that the world is created and maintained by",
        "option_a": "Universal Law",
        "option_b": "Universal Truth",
        "option_c": "Universal Faith",
        "option_d": "Universal Soul",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation: Jain philosophy emphasizes the inherent order and principles governing the universe, rather than a creator god.  It posits that the universe operates according to universal laws (principles of karma, reincarnation, etc.), which maintain the cyclical nature of existence.  Universal Truth in Jainism refers to the ultimate reality, achieved through right knowledge, faith, and action.  Universal Faith and Universal Soul are not central tenets of the creation/maintenance of the world in Jain philosophy.\n\nUniversal Law: In Jainism, this refers to the natural laws governing the universe, including karma and reincarnation. These laws are not imposed by a deity but are inherent in the cosmic order.\n\nUniversal Truth: In Jainism, this represents the ultimate reality, achieved through self-realization and liberation from the cycle of birth and death.  It's the understanding of the true nature of reality, free from illusion.\n\nUniversal Faith: While Jainism is a faith, the concept of a \"universal faith\" isn't a core element in explaining the world's creation or maintenance.  Jainism focuses on individual spiritual practice.\n\nUniversal Soul: Jainism believes in the existence of multiple souls (jiva), not a single universal soul that creates or sustains the world.  The universe itself is viewed as eternal and self-existent.\n\nMahavira: The last Tirthankara (spiritual teacher) of Jainism, known for his teachings on non-violence, asceticism, and the path to liberation (moksha).  He lived in ancient India and greatly influenced the development of Jain philosophy and practices.\n\nSvetambara and Digambara: The two main sects of Jainism, differing primarily in their monastic practices and interpretations of certain scriptures.  Svetambaras allow the wearing of white clothes, while Digambaras traditionally go naked.\n\nPawapuri: An ancient city in Bihar, India, significant to Jainism as the place where Mahavira attained Nirvana (liberation).\n\nFive Doctrines (Mahavira's additions):  These are principles of ethical conduct: non-violence (ahimsa), truthfulness (satya), non-stealing (asteya), non-attachment (aparigraha), and chastity (brahmacharya).  These form the foundation of Jain ethical life.\n"
    },
    {
        "q_num": 78,
        "question_text": "Salinization occurs when the irrigation water accumulated in the soil evaporates, leaving behind salts and minerals. What are the effects of salinization on the irrigated land?",
        "option_a": "It greatly increases the crop production",
        "option_b": "It makes some soils impermeable",
        "option_c": "It raises the water table",
        "option_d": "It fills the air spaces in the soil with water",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Salinization, the accumulation of salts in soil due to evaporation of irrigation water, leads to several detrimental effects on irrigated land.  Option (b) is correct because the salts build up, affecting soil structure and making it impermeable to water and air, hindering root growth and nutrient uptake. Option (c) is partially correct;  increased salinity can contribute to a rise in the water table, but it's not the primary effect.  Option (a) is incorrect; salinization drastically reduces crop production. Option (d) is incorrect; salinization leads to a lack of water in air spaces due to the salt accumulation.\n\nSalinization: The process where salts accumulate in the soil due to evaporation of irrigation water, leading to reduced soil fertility and crop yields.\n\nIrrigation: The artificial application of water to land to assist in the production of crops.  Different methods exist, including tank, well, canal, sprinkler, drip, and subsurface irrigation, each with advantages and disadvantages regarding cost, efficiency, and suitability to different terrains and water sources.\n\nImpermeable:  A characteristic of a substance that does not allow liquids or gases to pass through. In the context of soil, impermeability hinders water infiltration and root penetration.\n"
    },
    {
        "q_num": 79,
        "question_text": "The \"Red Data Books\" published by the International Union for Conservation of Nature and Natural Resources (IUCN) contain lists of\n1. Endemic plant and animal species present in the biodiversity hotspots.\n2. Threatened plant and animal species.\n3. Protected sites for conservation of nature and natural resources in various countries.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 3",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "environment",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: The IUCN Red Data Books primarily list threatened plant and animal species.  While they may incidentally include endemic species or mention protected sites relevant to conservation efforts, their core function is documenting threatened species.\n\nInternational Union for Conservation of Nature and Natural Resources (IUCN): A global organization dedicated to conserving biodiversity and promoting sustainable use of natural resources.  They publish the Red List of Threatened Species, a crucial tool for conservation efforts worldwide.\n\nEndemic species:  Plants and animals found exclusively in a specific geographic location and nowhere else.  Endemism is often a key factor in identifying biodiversity hotspots.\n\nBiodiversity hotspots:  Regions with exceptionally high levels of endemic species and significant habitat loss, making them priorities for conservation.\n\nProtected sites: Areas designated for the conservation of nature and natural resources, including national parks, wildlife sanctuaries, and other protected areas.  These sites help preserve biodiversity and ecosystem services.\n"
    },
    {
        "q_num": 80,
        "question_text": "Why is the offering of \"teaser loans\" by commercial banks a cause of economic concern?\n1. The teaser loans are considered to be an aspect of sub-prime lending and banks may be exposed to the risk of defaulters in future.\n2. In India, the teaser loans are mostly given to inexperienced entrepreneurs to set up manufacturing or export units.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. Teaser loans, characterized by low initial interest rates that subsequently increase, are associated with subprime lending.  This practice can lead to higher default rates when borrowers face the increased payments, exposing banks to significant financial risk.  Subprime lending refers to lending to borrowers with poor credit history, making them higher risk for default.\n\nStatement 2 is not entirely accurate. While teaser loans might be offered to entrepreneurs, it's not their primary target group, nor is it necessarily limited to inexperienced entrepreneurs in manufacturing or export sectors.  The risk associated with teaser loans is primarily linked to the loan structure itself, not the borrower's profile.\n\n\n**Short notes on important keywords and named entities:**\n\n* **Teaser loans:** Loans with artificially low initial interest rates that subsequently rise, often leading to borrower distress and increased default risk for lenders.\n\n* **Subprime lending:** Extending credit to borrowers with weak creditworthiness, increasing the lender's risk of default.\n\n* **Commercial banks:** Financial institutions that provide various banking services, including lending to individuals and businesses.  They are subject to regulatory oversight.\n\n* **Defaulters:** Borrowers who fail to repay their loans as agreed upon in the loan contract.\n\n* **India:** A large, diverse developing economy with a significant banking sector and a substantial informal economy.  The Indian economy is characterized by a large agricultural sector and a growing manufacturing and service sector.\n"
    },
    {
        "q_num": 81,
        "question_text": "An artificial satellite orbiting around the Earth does not fall down. This is so because the attraction of Earth",
        "option_a": "does not exist at such distance",
        "option_b": "is neutralized by the attraction of the moon",
        "option_c": "provides the necessary speed for its steady motion",
        "option_d": "provides the necessary acceleration for its motion",
        "correct_option": "d",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation: An artificial satellite orbiting Earth doesn't fall because Earth's attraction provides the necessary centripetal acceleration for its continuous circular motion.  Option (a) is incorrect; gravity's effect diminishes with distance but still exists at satellite altitudes. Option (b) is incorrect; the Moon's gravity is far weaker than Earth's at satellite orbital distances and doesn't neutralize Earth's pull. Option (c) is partially correct in that the satellite's speed is crucial, but it's the *acceleration* caused by gravity, not just speed alone, that keeps it in orbit.  A satellite needs a specific velocity (speed and direction) to maintain a stable orbit around the Earth.  The gravitational force of the Earth provides the centripetal force required to keep the satellite moving in a circular path. If the satellite were to move slower, it would fall towards the Earth. If it were to move faster, it would escape Earth's gravitational pull.\n\n\nShort notes on keywords and named entities:\n\n* **Artificial satellite:** A human-made object placed into orbit around a planet or other celestial body.  They are used for various purposes, including communication, navigation, Earth observation, and scientific research.\n\n* **Earth:** The third planet from the Sun and the only astronomical object known to harbor life. It is the densest planet in the Solar System.\n\n* **Gravity:** The force that attracts a body towards the center of the earth, or towards any other physical body having mass. It is what keeps planets in orbit around the Sun.\n\n* **Acceleration:** The rate of change of velocity of an object with respect to time. In a circular orbit, the acceleration is directed towards the center of the circle.\n\n* **Moon:** Earth's only natural satellite, orbiting the Earth. Its gravitational pull causes tides on Earth.\n\n"
    },
    {
        "q_num": 82,
        "question_text": "In the context of Indian economy, consider the following statements:\n1. The growth rate of GDP has steadily increased in the last five years.\n2. The growth rate in per capita income has steadily increased in the last five years.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "```text\ncorrect_option: (d)\nexplanation:Statement 1 is incorrect.  The growth rate of GDP has not steadily increased over the last five years. While there have been periods of growth, there has also been volatility and fluctuations.  Statement 2 is also incorrect for the same reason; per capita income growth is linked to GDP growth and population growth.  Therefore, neither statement is correct.\n\nGDP (Gross Domestic Product): The total monetary or market value of all the finished goods and services produced within a country's borders in a specific time period.  It's a key indicator of a country's economic health.\n\nPer Capita Income:  A measure of the average income earned per person in a specific geographic area (like a country) during a specific period. It's calculated by dividing the total national income by the total population.  It reflects the average standard of living.\n\nVision IAS: An organization that provides educational resources and coaching for competitive exams, particularly in India.  The provided text appears to be an excerpt from one of their study materials.  The text mentions multiple cities in India, suggesting a wide reach and coverage of their services.\n```\n"
    },
    {
        "q_num": 83,
        "question_text": "In India, which of the following have the highest share in the disbursement of credit to agriculture and allied activities?",
        "option_a": "Commercial Banks",
        "option_b": "Cooperative Banks",
        "option_c": "Regional Rural Banks",
        "option_d": "Microfinance Institutions",
        "correct_option": "a",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: While the provided text doesn't directly state the highest share of credit disbursement to agriculture, it gives context suggesting Commercial Banks (a) have a significant role.  Cooperative Banks (b) also play a part in rural credit. Regional Rural Banks (c) are specifically designed to serve rural areas, including agricultural credit. Microfinance Institutions (d) provide small loans, but their overall share in agricultural credit compared to commercial banks is likely lower.  The historical context of bank nationalization in India (1969 and 1980) indicates a significant expansion of commercial bank reach into rural areas, likely increasing their share in agricultural lending.  The absence of specific data prevents a definitive statement, but based on the provided information and general knowledge of the Indian financial system, commercial banks are the most likely answer.\n"
    },
    {
        "q_num": 84,
        "question_text": "Which of the following can aid in furthering the Government's objective of inclusive growth?\n1. Promoting Self-Help Groups\n2. Promoting Micro, Small and Medium Enterprises\n3. Implementing the Right to Education Act\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\nexplanation:All three options contribute to inclusive growth.  Promoting Self-Help Groups (SHGs) empowers marginalized communities by providing access to credit and resources, fostering entrepreneurship and improving their livelihoods.  Promoting Micro, Small and Medium Enterprises (MSMEs) stimulates economic activity, creating jobs and income opportunities, particularly in rural areas. The Right to Education Act ensures access to education for all children, enhancing human capital and reducing inequality. Therefore, all three options are crucial for achieving inclusive growth as defined by the UNDP – where everyone participates in growth, and benefits are shared equally.  The UN SDGs, particularly Goal 8 (Decent Work and Economic Growth), directly relate to these initiatives.  SHGs, MSMEs, and education are all key drivers of rising income and job opportunities, leading to a more prosperous middle class and robust domestic demand, all essential components of inclusive growth.\n"
    },
    {
        "q_num": 85,
        "question_text": "Why is the Government of India disinvesting its equity in the Central Public Sector Enterprises (CPSES)?\n1. The Government intends to use the revenue earned from the disinvestment mainly to pay back the external debt.\n2. The Government no longer intends to retain the management control of the CPSES.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (d)\n\nexplanation:The provided text does not contain information to answer the question about the reasons behind the Indian government's disinvestment in Central Public Sector Enterprises (CPSEs).  Therefore, neither statement 1 nor statement 2 can be confirmed or denied based on the given context.  The document focuses on unrelated topics such as constitutional provisions (Articles 371 and 371A), panchayat finances, and economic policies.  There is no mention of government debt or management control of CPSEs.\n"
    },
    {
        "q_num": 86,
        "question_text": "What is the difference between asteroids and comets?\n1. Asteroids are small rocky planetoids, while comets are formed of frozen gases held together by rocky and metallic material.\n2. Asteroids are found mostly between the orbits of Jupiter and Mars, while comets are found mostly between Venus and Mercury.\n3. Comets show a perceptible glowing tail, while asteroids do not.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "1 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\n\nexplanation: Statement 1 is correct. Asteroids are small, rocky bodies orbiting the Sun, while comets are composed of ice, dust, and rock.  Statement 2 is incorrect. The asteroid belt is located between Mars and Jupiter, not Jupiter and Mars.  Comets originate from the Kuiper Belt and Oort Cloud, far beyond the orbit of Mars. Statement 3 is correct. Comets develop a tail as they approach the Sun, due to the vaporization of their icy material.  This tail is not present in asteroids.  Therefore, only statements 1 and 3 are correct.\n\n\nVenus:  Earth's \"twin\" planet in terms of size and mass, but with a drastically different atmosphere and surface temperature.  It has a retrograde rotation, meaning it spins in the opposite direction to most other planets.\n\nMercury: The smallest and innermost planet in our solar system, with no moons.\n\nMars: The fourth planet from the Sun, known for its reddish appearance due to iron oxide on its surface.  It has two moons, Phobos and Deimos.\n\nJupiter: The largest planet in our solar system, a gas giant with a prominent red spot (a large storm). It has 79 known moons.\n\nSaturn: A gas giant known for its extensive ring system composed of ice and rock particles. It has 62 confirmed moons.\n\nUranus: An ice giant with a unique axial tilt, resulting in extreme seasonal variations. It rotates in a retrograde direction. It has 27 moons.\n\nNeptune: An ice giant, the farthest planet from the Sun. It has 14 known moons.\n\nPluto: A dwarf planet located in the Kuiper Belt, a region beyond Neptune containing numerous icy bodies.  It was once considered the ninth planet but was reclassified. It has 5 known moons.\n\nKuiper Belt: A region of the solar system beyond Neptune containing numerous small icy bodies, including dwarf planets like Pluto.\n\nAsteroid Belt: A region between Mars and Jupiter containing a vast number of asteroids, remnants from the early solar system.\n\nRetrograde Rotation:  Rotation of a planet in a direction opposite to the direction of its revolution around the sun.\n\nPrograde Rotation:  Rotation of a planet in the same direction as its revolution around the sun.\n"
    },
    {
        "q_num": 87,
        "question_text": "Economic growth is usually coupled with",
        "option_a": "Deflation",
        "option_b": "Inflation",
        "option_c": "Stagflation",
        "option_d": "Hyperinflation",
        "correct_option": "b",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation:Economic growth typically leads to increased consumer spending and investment, driving up demand for goods and services.  This increased demand, exceeding the supply in the short term, puts upward pressure on prices, resulting in inflation.\n\nDeflation is a decrease in the general price level of goods and services in an economy over a period of time.  When the price level falls, each unit of currency buys more goods and services. Consequently, inflation is negative.\n\nInflation is a general increase in the prices of goods and services in an economy over a period of time.  When the price level rises, each unit of currency buys fewer goods and services. Consequently, purchasing power decreases.\n\nStagflation is a period of slow economic growth and high unemployment (stagnation) while prices rise (inflation).\n\nHyperinflation is a period of rapid, excessive, and out-of-control inflation.  It erodes the purchasing power of money very quickly, rendering it essentially worthless.  The ABI inflation target of 2% mentioned in the context represents a common goal for central banks to maintain price stability, preventing both deflation and runaway inflation.  The context also mentions various measures of money supply (reserve money, broad money, narrow money, M1, M2, M3, M4), money markets, and the role of monetary policy (repo rate, CRR, SLR) in managing inflation.  Inclusive growth, as defined by the OECD and UNDP, emphasizes economic growth that benefits all segments of the population, not just the wealthy.  The UN SDGs (Sustainable Development Goals) are a set of 17 interlinked global goals designed to be a \"blueprint to achieve a better and more sustainable future for all\".\n"
    },
    {
        "q_num": 88,
        "question_text": "The lowering of Bank Rate by the Reserve Bank of India leads to",
        "option_a": "More liquidity in the market",
        "option_b": "Less liquidity in the market",
        "option_c": "No change in the liquidity in the market",
        "option_d": "Mobilization of more deposits by commercial banks",
        "correct_option": "a",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (a)\nexplanation: Lowering the Bank Rate, the interest rate at which the Reserve Bank of India (RBI) lends money to commercial banks, increases liquidity in the market.  A lower Bank Rate makes borrowing cheaper for commercial banks, encouraging them to borrow more from the RBI. This increased borrowing leads to a higher money supply in the market, thus increasing liquidity.  The RBI is the central bank of India, responsible for monetary policy and maintaining financial stability. Commercial banks are financial institutions that accept deposits and provide loans to individuals and businesses.  Option (b) is incorrect because a lower Bank Rate leads to increased, not decreased, liquidity. Option (c) is incorrect because there will be a definite change in liquidity. Option (d) is a possible indirect consequence, but the direct and primary effect is increased market liquidity.\n"
    },
    {
        "q_num": 89,
        "question_text": "Westerlies in southern hemisphere are stronger and persistent than in northern hemisphere. Why?\n1. Southern hemisphere has less landmass as compared to northern hemisphere.\n2. Coriolis force is higher in southern hemisphere as compared to northern hemisphere\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation:The strength and persistence of westerlies are influenced by several factors.  One key factor is the distribution of land and water. The Southern Hemisphere has significantly less landmass compared to the Northern Hemisphere. This results in less frictional drag on the wind, allowing the westerlies to be stronger and more consistent. The Coriolis effect, while important in influencing wind direction, does not directly explain the greater strength of Southern Hemisphere westerlies.  The Coriolis force is related to the Earth's rotation and is slightly stronger at higher latitudes. While the difference in Coriolis force between the hemispheres is negligible in explaining the difference in westerlies strength. Therefore, statement 1 is correct, and statement 2 is incorrect.\n"
    },
    {
        "q_num": 90,
        "question_text": "Between India and East Asia, the navigation-time and distance can be greatly reduced by which of the following?\n1. Deepening the Malacca straits between Malaysia and Indonesia.\n2. Opening a new canal across the Kra isthmus between the Gulf of Siam and Andaman Sea.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\n\nexplanation: Opening a new canal across the Kra Isthmus would significantly reduce the distance and travel time between India and East Asia.  Currently, ships traveling between these regions must navigate the Malacca Strait, a narrow and congested waterway. A Kra Canal would provide a shorter, more direct route, bypassing the Malacca Strait altogether. Deepening the Malacca Strait would improve its capacity, but not to the same extent as creating a new canal.\n\nMalacca Strait: A narrow strait separating the Malay Peninsula from Sumatra, Indonesia. It is one of the world's busiest shipping lanes, connecting the Indian Ocean to the South China Sea.  Its strategic importance is immense, making its congestion a major concern for global trade.\n\nKra Isthmus: A narrow strip of land in southern Thailand, connecting the Malay Peninsula to the rest of mainland Southeast Asia.  A canal across this isthmus has been proposed for centuries as a way to shorten shipping routes between the Indian Ocean and the Pacific Ocean.  The project faces significant environmental and geopolitical challenges.\n"
    },
    {
        "q_num": 91,
        "question_text": "Regular intake of fresh fruits and vegetables is recommended in the diet since they are a good source of antioxidants. How do antioxidants help a person maintain health and promote longevity?",
        "option_a": "They activate the enzymes necessary for vitamin synthesis in the body and help prevent vitamin deficiency",
        "option_b": "They prevent excessive oxidation of carbohydrates, fats and proteins in the body and help avoid unnecessary wastage of energy",
        "option_c": "They neutralize the free radicals produced in the body during metabolism",
        "option_d": "They activate certain genes in the cells of the body and help delay the ageing process",
        "correct_option": "c",
        "subject": "economy",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: Antioxidants are substances that can prevent or slow damage to cells caused by free radicals, which are unstable molecules that can damage cells and contribute to aging and various diseases.  Option (c) correctly states that antioxidants neutralize free radicals produced during metabolism.\n\nFree radicals: Unstable molecules with unpaired electrons, highly reactive, and can damage cells by oxidizing them.  They are a byproduct of normal metabolic processes.\n\nAntioxidants: Substances that prevent oxidation by inhibiting the reactions of free radicals. They donate electrons to stabilize free radicals, preventing them from causing damage.  Found in fruits and vegetables.\n\nMetabolism: The chemical processes that occur within a living organism to maintain life.  Includes building up and breaking down molecules.\n\nOption (a) is incorrect; vitamin synthesis is primarily driven by enzymes and coenzymes, not directly by antioxidants. Option (b) is incorrect; antioxidants don't primarily prevent oxidation of macronutrients, but rather neutralize the free radicals that cause oxidative damage. Option (d) is partially true, as antioxidant effects can influence gene expression and potentially slow aging, but this is not their primary mechanism of action.\n"
    },
    {
        "q_num": 92,
        "question_text": "Regarding the Indus Valley Civilization, consider the following statements:\n1. It was predominantly a secular civilization and the religious element, though present, did not dominate the scene.\n2. During this period, cotton was used for manufacturing textiles in India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2011,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is correct. Archaeological evidence suggests the Indus Valley Civilization lacked centralized religious structures or dominant religious iconography. While religious practices likely existed, they weren't as prominent as in some other ancient civilizations.  Statement 2 is also correct.  Archaeological finds at Mohenjo-daro include pieces of woven cotton, indicating cotton textile production during the Indus Valley Civilization.\n\nIndus Valley Civilization: Also known as the Harappan Civilization, this Bronze Age civilization flourished in the Indus River valley (present-day Pakistan and northwest India) from c. 3300 to 1300 BCE.  Known for its urban planning, standardized weights and measures, and sophisticated craftsmanship.\n\nCotton: A soft, fluffy staple fiber that grows in a boll, or protective case, around the seeds of the cotton plants of the genus Gossypium.  It's been cultivated and used for textiles for millennia.\n\nMohenjo-daro: One of the largest cities of the Indus Valley Civilization, located in present-day Pakistan.  Famous for its advanced urban planning, including a sophisticated drainage system.\n\nHarappa: Another major city of the Indus Valley Civilization, located in present-day Pakistan.  The civilization was named after this site, which was one of the first to be excavated.\n\nAramaic: An ancient Northwest Semitic language, once widely spoken across the Near East.  Used for official and administrative purposes in various empires.\n\nGreek:  A family of Indo-European languages originating in ancient Greece.  Spread through conquest and trade.\n\nPrakrit: A group of Middle Indo-Aryan languages spoken in ancient India.  The earliest inscriptions in India were written in Prakrit scripts.\n\nBrahmi: One of the earliest known writing systems of India, used to write Prakrit.  It's the ancestor of many modern Indian scripts.\n\nKharosthi: Another early writing system used in ancient northwest India and Central Asia, written right to left.  Used to write Prakrit.\n\nAsoka: An emperor of the Mauryan Empire (c. 268-232 BCE).  Famous for his edicts promoting non-violence and the spread of Buddhism.  His inscriptions are a major source for understanding his reign.\n\nMagadha: A powerful ancient kingdom in present-day Bihar, India.  Its strategic location, fertile lands, and access to resources contributed to its rise.\n\nMauryan Empire: A powerful ancient Indian empire (c. 322-185 BCE) that unified much of the Indian subcontinent under Chandragupta Maurya and his successors.\n\nPataliputra: The capital of the Mauryan Empire, located in present-day Patna, India.  A major center of administration and trade.\n\nTaxila: An ancient city in present-day Pakistan, a major center of learning and trade.  It served as a provincial capital during the Mauryan Empire.\n\nUjjayini: An ancient city in present-day Madhya Pradesh, India.  It was a major center of trade on ancient routes.\n\n\n"
    },
    {
        "q_num": 93,
        "question_text": "The lower Gangetic plain is characterised by humid climate with high temperature throughout the year. Which one among the following pairs of crops is most suitable for this region?",
        "option_a": "Paddy and cotton",
        "option_b": "Wheat and Jute",
        "option_c": "Paddy and Jute",
        "option_d": "Wheat and cotton",
        "correct_option": "c",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (c)\n\nexplanation:The lower Gangetic plain experiences a humid climate with high temperatures throughout the year.  Paddy (rice) thrives in such conditions, requiring abundant water and warmth. Jute also prefers a warm, humid climate and plenty of water.  Wheat, on the other hand, needs a cooler climate and dry conditions during ripening, making it unsuitable for this region. Cotton requires warm temperatures but also needs a certain amount of dryness; while it can tolerate humidity, the consistently high humidity of the lower Gangetic plain might not be ideal. Therefore, paddy and jute are the most suitable crop pair.\n\nPaddy (Rice): A staple food crop grown in flooded fields, requiring high temperatures and rainfall.  It is a Kharif crop.\n\nJute: A natural fiber crop used for making burlap and other products. It requires warm, humid conditions and ample water. It is a Kharif crop.\n\nWheat: A major cereal crop requiring a cool, moist climate during growth and a dry, warm climate during ripening. It is a Rabi crop.\n\nCotton: A fiber crop requiring warm temperatures and sunny conditions. While it can tolerate some humidity, excessive humidity can negatively impact its growth. It is a Kharif crop.\n"
    },
    {
        "q_num": 94,
        "question_text": "What could be the main reason/reasons for the formation of African and Eurasian desert belt?\n1. It is located in the sub-tropical high pressure cells.\n2. It is under the influence of warm ocean currents.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (a)\n\nexplanation: The formation of the African and Eurasian desert belt is primarily due to its location within the sub-tropical high-pressure cells.  These high-pressure systems cause descending air, which is dry and inhibits cloud formation and precipitation, leading to arid conditions. Warm ocean currents can influence regional climates, but their impact is secondary compared to the dominant effect of the sub-tropical high-pressure cells in creating desert conditions.\n\nSub-tropical high-pressure cells: These are large-scale atmospheric pressure systems located around 30 degrees latitude north and south of the equator.  They are characterized by descending air, which suppresses cloud formation and rainfall, leading to dry and arid conditions.\n\nAfrican and Eurasian desert belt: This refers to the vast desert regions spanning across Africa (Sahara, Namib) and Eurasia (Arabian, Thar, Gobi). These deserts are characterized by extremely low rainfall, high temperatures, and unique flora and fauna adapted to arid conditions.\n\nWarm ocean currents: These are currents of warm water that flow along the coasts of continents. They generally increase regional temperatures and humidity, but their impact on desert formation is less significant than the atmospheric pressure systems.\n"
    },
    {
        "q_num": 95,
        "question_text": "The jet aircrafts fly very easily and smoothly in the lower stratosphere. What could be the appropriate explanation?\n1. There are no clouds or water vapour in the lower stratosphere.\n2. There are no vertical winds in the lower stratosphere.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Jet aircrafts fly smoothly in the lower stratosphere primarily because of the absence of significant vertical winds.  While the lower stratosphere is relatively dry, the lack of vertical air currents is the more significant factor contributing to smooth flight.  Clouds and water vapor are less prevalent in the lower stratosphere compared to the troposphere because the air is very stable and dry. However, this is not the primary reason for smooth flight. The lower stratosphere is characterized by stable air layers with minimal turbulence.\n"
    },
    {
        "q_num": 96,
        "question_text": "Consider the following statements:\n1. Biodiversity is normally greater in the lower latitudes as compared to the higher latitudes.\n2. Along the mountain gradients, biodiversity is normally greater in the lower altitudes as compared to the higher altitudes.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation: Biodiversity, the variety of life, generally shows a latitudinal gradient, meaning it's higher in lower latitudes (closer to the equator) and lower in higher latitudes (closer to the poles). This is due to factors like higher solar energy and more stable climates near the equator. Similarly, along mountain gradients, biodiversity tends to be greater at lower altitudes and decreases with increasing altitude.  This is because conditions at lower altitudes are typically more favorable for a wider range of species.  Therefore, both statements 1 and 2 are correct.\n"
    },
    {
        "q_num": 97,
        "question_text": "The Brahmaputra, Irrawady and Mekong rivers originate in Tibet and flow through narrow and parallel mountain ranges in their upper reaches. Of these rivers, Brahmaputra makes a \"U\" turn in its course to flow into India. This \"U\" turn is due to",
        "option_a": "Uplift of folded Himalayan series",
        "option_b": "Syntactical bending of geologically young Himalayas",
        "option_c": "Geo-tectonic disturbance in the tertiary folded mountain chains",
        "option_d": "Both (a) and (b) above",
        "correct_option": "d",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (d)\n\nexplanation:The Brahmaputra River's \"U\" turn is primarily attributed to the syntactical bending of the geologically young Himalayas,  a feature caused by the uplift of the folded Himalayan series.  Option (d) encompasses both these factors.\n\nBrahmaputra River: This major river originates in Tibet and flows through the Himalayas before entering India, where it makes a significant \"U\" turn. It is a transboundary river, crucial for several countries' economies and ecosystems.\n\nIrrawady River: A major river of Southeast Asia, originating in Tibet and flowing through Myanmar.\n\nMekong River: Another major river of Southeast Asia, also originating in Tibet, flowing through several countries before reaching the South China Sea.  It's known for its biodiversity and importance to regional agriculture.\n\nHimalayas:  A massive mountain range in Asia, formed by the collision of the Indian and Eurasian tectonic plates.  Geologically young, they are still experiencing uplift and tectonic activity.  This ongoing process shapes the course of rivers flowing through the region.\n\nSyntactical Bending:  A geological term referring to the curvature or bending of mountain ranges, often due to tectonic forces.  The Brahmaputra's \"U\" turn is a prime example of this phenomenon.\n\nTertiary Folded Mountain Chains: The Himalayas are part of a larger system of folded mountains formed during the Tertiary period (roughly 66 to 2.6 million years ago).  The tectonic forces that created these mountains continue to influence their shape and the rivers that flow through them.\n"
    },
    {
        "q_num": 98,
        "question_text": "A state in India has the following characteristics:\n1. Its northern part is arid and semi-arid\n2. Its central part produces cotton.\n3. Cultivation of cash crops is predominant over food crops.\nWhich one of the following states has all of the above characteristics?",
        "option_a": "Andhra Pradesh",
        "option_b": "Gujarat",
        "option_c": "Karnataka",
        "option_d": "Tamil Nadu",
        "correct_option": "b",
        "subject": "geography",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation: Gujarat's northern part is arid and semi-arid, its central part is known for cotton production (especially in the black soil regions), and cash crops are more dominant than food crops in the state's agriculture.\n\nAndhra Pradesh:  Andhra Pradesh has diverse geographical regions, including coastal areas, plains, and plateaus. While cotton is grown in some parts, the state's agricultural profile is more balanced between food and cash crops.\n\nKarnataka: Karnataka also has a varied geography, with coastal regions, plateaus, and the Western Ghats.  While it produces cotton, its agricultural landscape isn't solely dominated by cash crops.  Arid and semi-arid regions are less prominent.\n\nTamil Nadu:  Tamil Nadu's climate and soil conditions are not predominantly arid and semi-arid.  While it cultivates cotton, it also has a substantial food crop production.\n"
    },
    {
        "q_num": 99,
        "question_text": "What is \"Virtual Private Network\"?",
        "option_a": "It is a private computer network of an organization where the remote users can transmit encrypted information through the server of the organization.",
        "option_b": "It is a computer network across a public internet that provides users access to their organization's network while maintaining the security of the information transmitted.",
        "option_c": "It is a computer network in which users can access a shared pool of computing resources through a service provider.",
        "option_d": "None of the statements (a), (b) and (c) given above is a correct description of Virtual Private Network.",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2011,
        "explanation": "correct_option: (b)\nexplanation:A Virtual Private Network (VPN) extends a private network across a public network, such as the internet.  This allows users to access their organization's network securely, as if they were physically present within the private network.  The data transmitted is encrypted, protecting it from unauthorized access. Option (a) is partially correct but doesn't emphasize the public network aspect. Option (c) describes a cloud computing model, not a VPN.  A VPN focuses on secure network access, not shared computing resources.\n"
    },
    {
        "q_num": 100,
        "question_text": "The \"dharma\" and \"rita\" depict a central idea of ancient Vedic civilization of India. In this context, consider the following statements:\n1. Dharma was a conception of obligations and of the discharge of one's duties to oneself and to others.\n2. Rita was the fundamental moral law governing the functioning of the universe and all it contained.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2011,
        "explanation": "correct_option: (c)\nexplanation:Both statements 1 and 2 are correct.\n\n* **Dharma:** In ancient Vedic civilization, Dharma represented the righteous conduct, moral order, and social duty. It encompassed one's obligations to oneself, family, community, and the cosmos.  Adherence to Dharma was considered essential for maintaining cosmic and social harmony.  It wasn't merely a set of rules but a way of life, emphasizing ethical behavior and fulfilling one's role in society.\n\n* **Rita:** Rita was the cosmic order, the natural law governing the universe and its workings. It was the principle of truth, order, and justice that underpinned the functioning of the universe.  Maintaining Rita was crucial for the well-being of both individuals and the cosmos.  Disruption of Rita was believed to lead to chaos and suffering.\n\n* **Vedic Civilization:**  The Vedic period in ancient India (roughly 1500-500 BCE) is characterized by the Vedas, a collection of sacred texts.  These texts contain hymns, prayers, rituals, and philosophical insights that reflect the beliefs and practices of the early Indo-Aryans. Dharma and Rita were central concepts in their worldview.\n\nThe provided additional text does not directly relate to the question about Dharma and Rita.  The extra text discusses Buddhism, rule of law, and various aspects of ancient Indian history and art but does not offer relevant information to answer the question about Dharma and Rita.\n"
    }
]