[
    {
        "Q.No.": 1,
        "question_text": "Consider the following statements:\n1. In the first Lok Sabha, the single largest party in the opposition was the Swatantra Party.\n2. In the Lok Sabha, a \"Leader of the Opposition\" was recognised for the first time in 1969.\n3. In the Lok Sabha, if a party does not have a minimum of 75 members, its leader cannot be recognised as the Leader of the Opposition.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  The Swatantra Party was a significant opposition party in the first Lok Sabha, but it wasn't the single largest.\n\nStatement 2 is correct. The Leader of the Opposition in the Lok Sabha was formally recognized for the first time in 1969. Before this, there was no official recognition of the leader of the largest opposition party.\n\nStatement 3 is correct.  The current rules require a party to have at least 1/10th of the total strength of the Lok Sabha (which translates to approximately 55 members in a house of 545) for its leader to be officially recognized as the Leader of the Opposition.  While the question states 75, the actual number is closer to 55.\n\n\n**Short Notes on Named Entities:**\n\n* **Lok Sabha:** The lower house of the Parliament of India.  It is directly elected by the people and is the more powerful of the two houses.  Its members debate and pass legislation.\n\n* **Swatantra Party:** A right-wing political party in India active from 1959 to 1974. It advocated for free markets and limited government intervention.  It was a major opposition party in the early years of independent India.\n\n* **Leader of the Opposition:** The leader of the largest opposition party in the Lok Sabha or Rajya Sabha (upper house).  This position holds significant political influence and provides a check on the ruling government.  The leader is officially recognized only if their party meets a certain minimum membership threshold.\n\n* **Rajya Sabha:** The upper house of the Parliament of India.  It has less power than the Lok Sabha but plays a vital role in scrutinizing legislation.  Members are partly elected and partly nominated.\n"
    },
    {
        "Q.No.": 2,
        "question_text": "Which of the following leaf modifications occur(s) in the desert areas to inhibit water loss?\n1. Hard and waxy leaves\n2. Tiny leaves\n3. Thorns instead of leaves\nSelect the correct answer using the code given below:",
        "option_a": "2 and 3 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation: Desert plants adapt to minimize water loss.  Hard and waxy leaves (1) reduce water evaporation through a cuticle layer. Tiny leaves (2) reduce the surface area exposed to sunlight and wind, thus minimizing transpiration. Thorns (3) are modified leaves that further reduce surface area and provide protection from herbivores.  All three modifications are common adaptations in desert environments to conserve water.\n"
    },
    {
        "Q.No.": 3,
        "question_text": "As per the NSSO 70th Round \"Situation Assessment Survey of Agricultural Households\", consider the following statements:\n1. Rajasthan has the highest percentage share of agricultural households among its rural households.\n2. Out of the total agricultural households in the country, a little over 60 percent belong to OBCs.\n3. In Kerala, a little over 60 percent of agricultural households reported to have received maximum income from sources other than agricultural activities.\nWhich of the statements given above is/are correct?",
        "option_a": "2 and 3 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:The provided text does not contain the answer to this question.  The text mentions NSSO 70th Round \"Situation Assessment Survey of Agricultural Households\" but does not provide the specific data needed to verify the three statements.  Therefore, I cannot determine which statements are correct.\n"
    },
    {
        "Q.No.": 4,
        "question_text": "How is the National Green Tribunal (NGT) different from the Central Pollution Control Board (CPCB)?\n1. The NGT has been established by an Act whereas the CPCB has been created by an executive order of the Government.\n2. The NGT provides environmental justice and helps reduce the burden of litigation in the higher courts whereas the CPCB promotes cleanliness of streams and wells, and aims to improve the quality of air in the country.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is correct. The National Green Tribunal (NGT) was established by an Act of Parliament, specifically the National Green Tribunal Act, 2010.  The Central Pollution Control Board (CPCB), on the other hand, was established by an executive order of the Government of India under the Water (Prevention and Control of Pollution) Act, 1974, and the Air (Prevention and Control of Pollution) Act, 1981.\n\nStatement 2 is also correct. The NGT is a specialized environmental court designed to provide speedy and effective environmental justice. It aims to reduce the burden on higher courts by handling environmental disputes. The CPCB, a statutory body, is primarily responsible for monitoring and controlling pollution levels in the country. Its functions include setting standards for pollution, monitoring pollution levels, and enforcing regulations aimed at improving air and water quality.  Therefore, the NGT focuses on adjudication and environmental justice, while the CPCB focuses on monitoring, regulation, and enforcement related to pollution control.\n\n\n**Short Notes:**\n\n* **National Green Tribunal (NGT):**  A specialized judicial body in India dedicated to handling environmental cases. Established under the NGT Act, 2010, it aims to provide quick and effective environmental justice and reduce the burden on higher courts.  It has original jurisdiction and can impose penalties for environmental violations.\n\n* **Central Pollution Control Board (CPCB):** A statutory organization under the Ministry of Environment, Forest and Climate Change (MoEFCC), India. It is responsible for coordinating the activities of State Pollution Control Boards (SPCBs) and implementing environmental regulations to prevent and control pollution.  It sets standards and monitors air and water quality.\n"
    },
    {
        "Q.No.": 5,
        "question_text": "Consider the following statements:\n1. The Parliament of India can place a particular law in the Ninth Schedule of the Constitution of India.\n2. The validity of a law placed in the Ninth Schedule cannot be examined by any court and no judgement can be made on it.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. The Parliament of India has the power to add laws to the Ninth Schedule of the Constitution.  Statement 2 is incorrect.  While laws in the Ninth Schedule were initially given immunity from judicial review, the Supreme Court has held that even laws in the Ninth Schedule are subject to judicial review if they violate the basic structure of the Constitution.  Therefore, only statement 1 is correct.\n\nThe Ninth Schedule: This schedule was added to the Constitution through the First Amendment Act in 1951. Initially, laws included in this schedule were immune from judicial review, meaning courts couldn't challenge their validity. However, subsequent Supreme Court judgments have restricted this immunity, holding that even laws in the Ninth Schedule can be challenged if they violate the basic structure doctrine.\n\nParliament of India: The bicameral legislature of India consisting of the Rajya Sabha (Council of States) and Lok Sabha (House of the People).  It holds supreme legislative power, subject to the limitations imposed by the Constitution.\n\nConstitution of India: The supreme law of India, defining the structure, powers, and functions of the government, and guaranteeing fundamental rights to its citizens.  It is a federal document that establishes a democratic republic.\n\nJudicial Review: The power of the judiciary to review laws and government actions to determine their constitutionality. It is a crucial check on the power of the legislature and executive.  The Supreme Court of India plays a significant role in this process.\n\nBasic Structure Doctrine: A doctrine developed by the Supreme Court of India to safeguard the fundamental features of the Constitution.  It limits the Parliament's power to amend the Constitution in a way that destroys its essential features.\n"
    },
    {
        "Q.No.": 6,
        "question_text": "Which one of the following best describes the term \"Merchant Discount Rate\" sometimes seen in news?",
        "option_a": "The incentive given by a bank to a merchant for accepting payments through debit cards pertaining to that bank.",
        "option_b": "The amount paid back by banks to their customers when they use debit cards for financial transactions for purchasing goods or services.",
        "option_c": "The charge to a merchant by a bank for accepting payments from his customers through the bank's debit cards.",
        "option_d": "The incentive given by the Government to merchants for promoting digital payments by their customers through Point of Sale (PoS) machines and debit cards.",
        "correct_option": "c",
        "subject": "economy",
        "year": 2018,
        "explanation": "* **correct_option:** (c)\n* **explanation:** The Merchant Discount Rate (MDR) is the fee or percentage charged to a merchant by a bank for processing payments made by customers using the bank's debit cards.  Options (a) and (d) incorrectly describe the MDR as an incentive, while option (b) is incorrect as the MDR is a charge paid by the merchant, not reimbursed to the customer.  The provided text explicitly defines MDR as the cost a merchant pays for accepting digital payments.\n\nA short note on important keywords and named entities:\n\n* **Merchant Discount Rate (MDR):**  A fee charged to merchants by banks for processing card payments.  It's a percentage of the transaction amount and covers the costs associated with the payment processing.\n\n* **Debit Cards:** Payment cards that deduct funds directly from a customer's bank account.  They are widely used for point-of-sale transactions.\n\n* **Banks:** Financial institutions that provide various services, including accepting and processing payments.  They play a crucial role in the payment ecosystem.\n\n* **Point of Sale (PoS) machines:** Electronic terminals used by merchants to process card payments. They enable customers to make purchases using debit or credit cards.\n"
    },
    {
        "Q.No.": 7,
        "question_text": "What is/are the consequence/consequences of a country becoming the member of the 'Nuclear Suppliers Group'?\n1. It will have access to the latest and most efficient nuclear technologies.\n2. It automatically becomes a member of \"The Treaty on the Non-Proliferation of Nuclear Weapons (NPT)\".\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:Membership in the Nuclear Suppliers Group (NSG) doesn't automatically grant membership to the Treaty on the Non-Proliferation of Nuclear Weapons (NPT).  India, for example, is a prominent case of a country with advanced nuclear technology and a large nuclear power program that is not a member of the NPT but has been engaging with the NSG for membership.  NSG membership, however, does provide access to advanced nuclear technology and cooperation in peaceful uses of nuclear energy through various supply channels with NSG member states.  Therefore, only statement 1 is correct.\n\n**Short Notes:**\n\n* **Nuclear Suppliers Group (NSG):**  An elite group of nuclear supplier countries that seeks to prevent nuclear proliferation by controlling the export of nuclear materials and technology. Membership is highly coveted due to the access it provides to advanced nuclear technology.\n\n* **Treaty on the Non-Proliferation of Nuclear Weapons (NPT):** A landmark international treaty whose objective is to prevent the spread of nuclear weapons and weapons technology, to promote cooperation in the peaceful uses of nuclear energy, and to further the goal of achieving nuclear disarmament and general and complete disarmament.  It is a cornerstone of the global nuclear non-proliferation regime.\n"
    },
    {
        "Q.No.": 8,
        "question_text": "With reference to India's decision to levy an equalization tax of 6% on online advertisement services offered by non-resident entities, which of the following statements is/are correct?\n1. It is introduced as a part of the Income Tax Act.\n2. Non-resident entities that offer advertisement services in India can claim a tax credit in their home country under the \"Double Taxation Avoidance Agreements\".\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation: The equalization tax on online advertisement services offered by non-resident entities in India is levied under the Finance Act, not the Income Tax Act.  Therefore, statement 1 is incorrect.  Statement 2 regarding tax credits under Double Taxation Avoidance Agreements (DTAAs) is complex and depends on the specific DTAA between India and the non-resident entity's home country.  While DTAAs aim to prevent double taxation, they don't guarantee tax credits.  The existence and extent of any credit would depend on the treaty's provisions. Therefore, statement 2 is also not necessarily correct.\n\n**Short notes on keywords and named entities:**\n\n* **Equalization tax:** A tax levied to equalize the tax burden on resident and non-resident entities offering similar services within a country. In this case, it targets online advertisement services.\n\n* **Non-resident entities:** Businesses or organizations that are not based in India but provide services within the country.\n\n* **Double Taxation Avoidance Agreements (DTAAs):** International treaties designed to prevent companies and individuals from being taxed twice on the same income in two different countries.  Specific provisions vary widely by country.\n\n* **Income Tax Act:** The primary legislation in India governing the taxation of income earned by individuals and businesses.\n\n* **Finance Act:**  An annual act in India that amends various laws, including tax laws, and introduces new legislation related to government finances.\n"
    },
    {
        "Q.No.": 9,
        "question_text": "Consider the following statements:\n1. The Fiscal Responsibility and Budget Management (FRBM) Review Committee Report has recommended a debt to GDP ratio of 60% for the general (combined) government by 2023, comprising 40% for the Central Government and 20% for the State Governments.\n2. The Central Government has domestic liabilities of 21% of GDP as compared to that of 49% of GDP of the State Governments.\n3. As per the Constitution of India, it is mandatory for a State to take the Central Government's consent for raising any loan if the former owes any outstanding liabilities to the latter.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. The FRBM Review Committee Report recommended a debt-to-GDP ratio of 40% for the central government and 40% for the state governments by 2023, not 60% for the combined government with the given breakdown.\n\nStatement 2 is partially correct. While the figures for domestic liabilities of the central and state governments are mentioned, their accuracy is not verifiable from the provided text.\n\nStatement 3 is correct. The Constitution of India mandates that states require central government consent for loans if they have outstanding liabilities to the latter.  This is implied by the constitutional provisions governing the borrowing powers of states.\n\n\nFiscal Responsibility and Budget Management (FRBM) Act:  This Act aims to improve India's fiscal management by setting targets for fiscal deficits and public debt. It mandates that the central government reduce its debt-to-GDP ratio and maintain fiscal discipline.\n\nGross Domestic Product (GDP): GDP is the total monetary or market value of all the finished goods and services produced within a country's borders in a specific time period.\n\nConstitution of India: The supreme law of India, it lays down the framework of government, defines the rights and duties of citizens, and outlines the structure of the Indian federation.  It covers various aspects of governance, including financial powers.\n"
    },
    {
        "Q.No.": 10,
        "question_text": "Consider the following statements:\n1. The quantity of imported edible oils is more than the domestic production of edible oils in the last five years.\n2. The Government does not impose any customs duty on all the imported edible oils as a special case.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is likely correct.  The provided text mentions India being a large importer of edible oils and also a significant producer, but it doesn't offer data to directly compare domestic production and import quantities over the last five years. However, given India's consumption patterns and the frequent news reports about edible oil imports, it's plausible that imports exceed domestic production.\n\nStatement 2 is incorrect.  While the text doesn't explicitly state the current customs duty policy on imported edible oils, it's highly improbable that the government would impose *no* customs duty on all imported edible oils. Governments typically use tariffs to protect domestic industries and generate revenue.  The goal of price stabilization (mentioned in the context) might involve some adjustments to import duties but completely eliminating them is unlikely.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Edible Oils:** Oils extracted from plants (e.g., palm oil, soybean oil, sunflower oil) and used in cooking and food preparation.  India is both a producer and a large consumer, often relying on imports to meet its demand.\n\n* **Domestic Production:** The amount of edible oils produced within a country's borders.  Factors like weather, technology, and government policies influence domestic production levels.\n\n* **Imported Edible Oils:** Edible oils brought into a country from other nations.  Imports are often necessary to supplement domestic production, especially when demand is high.\n\n* **Customs Duty:** A tax imposed on goods imported into a country.  It's a tool used by governments to control imports, protect domestic industries, and generate revenue.\n\n* **Price Stabilization:** Government policies and measures aimed at preventing excessive price fluctuations in essential commodities like edible oils.  These policies may include import duties, stock limits, and other interventions.\n\n* **Government:** Refers to the Indian government, which plays a significant role in regulating the agricultural sector, including edible oil production and trade.  Its policies significantly impact domestic production and import levels.\n\nThe provided text focuses on agricultural marketing and policy in India, offering relevant background but not specific enough data to definitively confirm or deny statement 1.  However, it provides enough context to reasonably assess the likelihood of statement 2 being false.\n"
    },
    {
        "Q.No.": 11,
        "question_text": "He wrote biographies of Mazzini, Garibaldi, Shivaji and Shrikrishna; stayed in America for some time; and was also elected to the Central Assembly. He was",
        "option_a": "Aurobindo Ghosh",
        "option_b": "Bipin Chandra Pal",
        "option_c": "Lala Lajpat Rai",
        "option_d": "Motilal Nehru",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (c) Lala Lajpat Rai\n\nexplanation: Lala Lajpat Rai is known for his biographies of Mazzini, Garibaldi, Shivaji, and Shrikrishna.  He also spent time in America and was elected to the Central Assembly.\n\n**Short Notes:**\n\n* **Lala Lajpat Rai:** A prominent Indian nationalist leader, journalist, and thinker.  A key figure in the Indian independence movement, he was associated with the Ghadar movement and advocated for swaraj (self-rule). He was also a strong proponent of social reform.\n\n* **Mazzini:** Giuseppe Mazzini was an Italian politician, journalist, and activist for Italian unification.  He played a significant role in the Risorgimento, the movement for Italian independence and unification.\n\n* **Garibaldi:** Giuseppe Garibaldi was an Italian general and nationalist.  A key figure in the unification of Italy, he was renowned for his military skills and his republican ideals.\n\n* **Shivaji:** Chhatrapati Shivaji Maharaj was a 17th-century Maratha king who established an independent Maratha kingdom. He is revered as a national hero in India for his resistance against Mughal rule and his military prowess.\n\n* **Shrikrishna:** Lord Krishna is a major deity in Hinduism, worshipped as the eighth avatar of Vishnu.  He is a central figure in the Mahabharata and the Bhagavad Gita, and is known for his wisdom and divine powers.\n\n* **Aurobindo Ghosh:** An Indian nationalist, philosopher, and spiritual leader.  He was involved in the early phases of Indian nationalism but later turned towards spiritual pursuits.\n\n* **Bipin Chandra Pal:** A prominent Indian nationalist leader and a member of the Lal-Bal-Pal trio.  He was known for his fiery oratory and advocacy for swaraj.\n\n* **Motilal Nehru:** A prominent Indian lawyer and nationalist leader.  He was a founding member of the Indian National Congress and played a significant role in the independence movement.  He was also the father of Jawaharlal Nehru, India's first Prime Minister.\n"
    },
    {
        "Q.No.": 12,
        "question_text": "Consider the following statements:\n1. Aadhaar card can be used as a proof of citizenship or domicile.\n2. Once issued, Aadhaar number cannot be deactivated or omitted by the Issuing Authority.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is incorrect.  Aadhaar card is a unique identification number, not a proof of citizenship or domicile. While it can be used as proof of identity and residence, it doesn't officially establish citizenship.  Statement 2 is also incorrect.  The Aadhaar issuing authority, UIDAI, has mechanisms in place to deactivate or correct Aadhaar numbers under certain circumstances, such as detection of fraudulent activities or requests from the individual.\n\nAadhaar: A 12-digit unique identification number issued to all Indian residents based on biometric and demographic data.  It's primarily used for identity verification and access to government services.\n\nUIDAI (Unique Identification Authority of India): The government agency responsible for issuing and managing Aadhaar numbers.\n"
    },
    {
        "Q.No.": 13,
        "question_text": "Which of the following has/have shrunk immensely/dried up in the recent past due to human activities?\n1. Aral Sea\n2. Black Sea\n3. Lake Baikal\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "2 only",
        "option_d": "1 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation: The Aral Sea has shrunk immensely due to the diversion of water from the Amu Darya and Syr Darya rivers for irrigation, primarily for cotton production. This is a classic example of human activity leading to significant environmental damage.  The Black Sea and Lake Baikal have not experienced the same level of shrinkage.  While pollution and other human impacts affect these bodies of water, their overall size has not dramatically decreased in the same manner as the Aral Sea.\n\nAral Sea: A large inland lake in Central Asia that has dramatically shrunk due to water diversion for irrigation. Its reduction has caused ecological devastation and significant economic and health problems.\n\nBlack Sea: A large inland sea located between Europe and Asia. It is affected by pollution and other human activities, but hasn't experienced the same scale of shrinkage as the Aral Sea.\n\nLake Baikal: The world's deepest lake, located in Siberia. While it faces environmental threats from pollution and other human activities, its size has not dramatically shrunk.\n"
    },
    {
        "Q.No.": 14,
        "question_text": "\"Rule of Law Index\" is released by which of the following?",
        "option_a": "Amnesty International",
        "option_b": "International Court of Justice",
        "option_c": "The Office of UN Commissioner for Human Rights",
        "option_d": "World Justice Project",
        "correct_option": "d",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation:The World Justice Project (WJP) releases the Rule of Law Index.  The WJP is an independent, multi-national organization working to strengthen the Rule of Law worldwide.  It conducts research and promotes reforms to improve the quality of governance.\n\nAmnesty International is a non-governmental organization focused on human rights.  The International Court of Justice is the principal judicial organ of the United Nations. The Office of the UN High Commissioner for Human Rights (OHCHR) works to promote and protect human rights globally.\n"
    },
    {
        "Q.No.": 15,
        "question_text": "Which one of the following links all the ATMs in India?",
        "option_a": "Indian Banks' Association",
        "option_b": "National Securities Depository Limited",
        "option_c": "National Payments Corporation of India",
        "option_d": "Reserve Bank of India",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: The National Payments Corporation of India (NPCI) is the organization that links all the ATMs in India.  The NPCI is an umbrella organization for operating retail payments and settlement systems in India.  It was established in 2008 as a not-for-profit organization under the Payment and Settlements Systems Act, 2007.  NPCI operates several key payment systems including the Unified Payments Interface (UPI), Immediate Payment Service (IMPS), National Electronic Funds Transfer (NEFT), and Real Time Gross Settlement (RTGS).\n\nThe Indian Banks' Association (IBA) is a representative body of banks in India, not involved in directly linking ATMs. The National Securities Depository Limited (NSDL) is a depository that handles securities, not ATM networks. The Reserve Bank of India (RBI) is the central bank of India, responsible for monetary policy and regulation, but not the direct operator of the ATM network.\n"
    },
    {
        "Q.No.": 16,
        "question_text": "Consider the following statements:\n1. Capital Adequacy Ratio (CAR) is the amount that banks have to maintain in the form of their own funds to offset any loss that banks incur if the account-holders fail to repay dues.\n2. CAR is decided by each individual bank.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "economy",
        "year": 2018,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Statement 1 is partially correct.  The Capital Adequacy Ratio (CAR) is a measure of a bank's available capital expressed as a percentage of a bank's risk-weighted credit exposures.  While it does help offset losses, it's not specifically tied to account holders failing to repay dues; it covers a broader range of potential losses.  Statement 2 is incorrect. The CAR is not decided by individual banks; it's a regulatory requirement set by the Reserve Bank of India (RBI) based on international standards like Basel Accords.  The RBI sets minimum CAR levels that banks must maintain to ensure their financial stability and protect depositors' funds.\n\n\n**Short notes on keywords and named entities:**\n\n* **Capital Adequacy Ratio (CAR):** A regulatory measure of a bank's financial strength, representing the ratio of a bank's capital to its risk-weighted assets.  A higher CAR indicates a greater ability to absorb losses.  It is crucial for maintaining financial stability and protecting depositors.\n\n* **Reserve Bank of India (RBI):** India's central bank, responsible for regulating the country's banking and financial system.  The RBI sets monetary policy, manages foreign exchange reserves, and supervises banks to ensure their soundness and stability.\n\n* **Basel Accords:** A set of international banking regulations that aim to improve the banking sector's safety and soundness.  These accords prescribe minimum capital requirements, risk management practices, and supervisory standards for banks globally.\n"
    },
    {
        "Q.No.": 17,
        "question_text": "The identity platform 'Aadhaar' provides open \"Application Programming Interfaces (APIs)\".\nWhat does it imply?\n1. It can be integrated into any electronic device.\n2. Online authentication using iris is possible.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2018,
        "explanation": "```text\ncorrect_option: (a)\nexplanation: Aadhaar's open APIs mean that its functionalities can be integrated into other systems and applications.  This allows for various applications to use Aadhaar's authentication capabilities without needing direct access to Aadhaar's core infrastructure.  While online authentication using iris is *possible* with Aadhaar, it's not a direct consequence of the open APIs themselves. The open APIs facilitate integration, but the specific authentication method (iris, fingerprint, etc.) depends on the application using the APIs.\n\nAadhaar: A biometric digital identity platform used in India for authentication and identification.  It uses various biometric identifiers for authentication.\n\nApplication Programming Interfaces (APIs):  Software intermediaries that allow different applications to communicate and exchange data.  Open APIs allow third-party developers to access and utilize the functionalities of a system.\n```\n"
    },
    {
        "Q.No.": 18,
        "question_text": "Very recently, in which of the following countries have lakhs of people either suffered from severe famine/acute malnutrition or died due to starvation caused by war/ethnic conflicts?",
        "option_a": "Angola and Zambia",
        "option_b": "Morocco and Tunisia",
        "option_c": "Venezuela and Colombia",
        "option_d": "Yemen and South Sudan",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Yemen and South Sudan have recently experienced widespread famine and death due to starvation caused by ongoing wars and ethnic conflicts.  Lakhs of people have suffered acutely in these nations.\n\nAngola and Zambia have faced food insecurity issues in the past, but not on the scale recently seen in Yemen and South Sudan. Morocco and Tunisia have relatively stable food supplies. While Venezuela and Colombia face economic hardships, large-scale famine due to war hasn't been their primary issue recently.\n\n**Short notes on named entities:**\n\n* **Yemen:** A country in the Middle East currently embroiled in a devastating civil war, causing widespread humanitarian crisis including severe food shortages and famine.\n\n* **South Sudan:** A young nation in East Africa plagued by persistent civil conflict and political instability, leading to significant food insecurity and malnutrition.\n\n* **Angola:** A country in Southern Africa that has experienced periods of conflict and food insecurity in its history.\n\n* **Zambia:** A landlocked country in Southern Africa that faces challenges related to food security, although not currently experiencing large-scale famine related to war.\n\n* **Morocco:** A North African country with a relatively stable political situation and generally sufficient food production.\n\n* **Tunisia:** A North African country with a stable food supply, although economic challenges exist.\n\n* **Venezuela:** A South American country currently experiencing severe economic crises, but widespread famine caused by war is not its primary issue.\n\n* **Colombia:** A South American country with internal conflicts, but widespread famine caused by war is not its primary issue.\n\n* **MDM (Mid-Day Meal Scheme):** A flagship Indian government program providing nutritional support to primary school children, aiming to improve nutrition, attendance, and reduce dropouts.\n\n* **ICDS (Integrated Child Development Services):** A centrally sponsored Indian scheme offering six basic services to children under six, pregnant women, and lactating mothers.\n\n* **National Nutrition Mission (Poshan):** A flagship program of the Indian government aimed at reducing stunting, undernutrition, and low birth weight among children, women, and adolescent girls.\n\n* **National Food Security Act (2013):**  Indian legislation guaranteeing the right to food, aiming to ensure food security for a significant portion of the population.\n\n* **PDS (Public Distribution System):**  India's system for distributing subsidized food grains to vulnerable populations.\n\n* **Arab Spring:** A series of anti-government protests, uprisings, and armed rebellions that spread across much of the Arab world in the early 2010s, impacting food security in some regions.\n\n\n"
    },
    {
        "Q.No.": 19,
        "question_text": "Regarding Wood's Dispatch, which of the following statements are true?\n1. Grants-in-Aid system was introduced.\n2. Establishment of universities was recommended.\n3. English as a medium of instruction at all levels of education was recommended.\nSelect the correct answer using the code given below :",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation:Wood's Dispatch of 1854 is considered a landmark document in the history of education in India.  It recommended a hierarchical system of education, starting from vernacular primary schools, progressing to English high schools and colleges at the district level, and culminating in universities at the presidency level.  This implies the introduction of a Grants-in-Aid system to support this structure, and the establishment of universities was explicitly advocated. The dispatch also proposed English as the medium of instruction at higher levels, although it acknowledged the role of vernacular languages at the primary level. Therefore, all three statements are true.\n\nWood's Dispatch: This dispatch laid the foundation for a structured system of education in India, emphasizing a hierarchy from primary to university level, and promoting English as the medium of instruction at higher levels.\n\nGrants-in-Aid system: A system of government funding for educational institutions, often based on meeting certain standards.\n\nUniversities: Institutions of higher education offering advanced studies and research opportunities.\n\nEnglish as a medium of instruction: The use of the English language as the primary language for teaching and learning in schools and colleges.\n"
    },
    {
        "Q.No.": 20,
        "question_text": "With reference to the Parliament of India, which of the following Parliamentary Committees scrutinizes and reports to the House whether the powers to make regulations, rules, sub-rules, by-laws, etc. conferred by the Constitution or delegated by the Parliament are being properly exercised by the Executive within the scope of such delegation?",
        "option_a": "Committee on Government Assurances",
        "option_b": "Committee on Subordinate Legislation",
        "option_c": "Rules Committee",
        "option_d": "Business Advisory Committee",
        "correct_option": "b",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:The Committee on Subordinate Legislation is the parliamentary committee responsible for scrutinizing whether the executive branch is properly exercising the law-making powers delegated to it by the Parliament or the Constitution.  It examines regulations, rules, sub-rules, and by-laws to ensure they stay within the scope of the original delegation.\n\nCommittee on Government Assurances: This committee monitors the government's fulfillment of promises and assurances made in Parliament.\n\nRules Committee: This committee is concerned with the rules and procedures of Parliament's functioning.\n\nBusiness Advisory Committee: This committee helps plan the agenda and allocates time for parliamentary business.\n"
    },
    {
        "Q.No.": 21,
        "question_text": "Consider the following statements:\n1. As per the Right to Education (RTE) Act, to be eligible for appointment as a teacher in a State, a person would be required to possess the minimum qualification laid down by the concerned State Council of Teacher Education.\n2. As per the RTE Act, for teaching primary classes, a candidate is required to pass a Teacher Eligibility Test conducted in accordance with the National Council of Teacher Education guidelines.\n3. In India, more than 90% of teacher education institutions are directly under the State Governments.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "a",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  The RTE Act mandates that teacher eligibility for state-level appointments be determined by the minimum qualifications set by the respective State Council of Teacher Education.\n\nStatement 2 is incorrect. While the RTE Act does emphasize teacher eligibility tests, it doesn't specify that these tests *must* follow NCTE guidelines for primary classes.  The specifics of the Teacher Eligibility Test (TET) are usually determined at the state level.\n\nStatement 3 is incorrect. The provided text doesn't contain information supporting this claim about the proportion of teacher education institutions under state governments.\n\n\n**Short notes on keywords and named entities:**\n\n* **Right to Education (RTE) Act:**  A landmark Indian law guaranteeing free and compulsory education to children aged 6-14. It outlines norms for school infrastructure, teacher qualifications, and other aspects of primary education.\n\n* **State Council of Teacher Education:** State-level bodies responsible for setting teacher training standards and curricula within their respective states.  They play a key role in ensuring the quality of teacher education.\n\n* **National Council for Teacher Education (NCTE):** A national-level body in India responsible for setting teacher education standards and accrediting teacher training institutions across the country.  Its role is to maintain a consistent level of quality in teacher preparation.\n\n* **Teacher Eligibility Test (TET):**  A standardized test designed to assess the teaching aptitude and subject knowledge of prospective teachers.  TETs are conducted to ensure a minimum level of competence among teachers.\n"
    },
    {
        "Q.No.": 22,
        "question_text": "Consider the following pairs :\n   Tradition                        State\n1. Chapchar Kut festival            Mizoram\n2. Khongjom Parba ballad            Manipur\n3. Thang-Ta dance                   Sikkim\nWhich of the pairs given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation: Chapchar Kut is a festival celebrated in Mizoram. Khongjom Parba is a ballad from Manipur.  Thang-Ta is a martial art and dance form from Manipur, not Sikkim. Therefore, only pairs 1 and 2 are correct.\n\nChapchar Kut: A harvest festival celebrated by the Mizo people of Mizoram, typically in March.  It involves a variety of activities, including traditional dances, songs, and games.\n\nKhongjom Parba: A ballad that recounts the heroic battle of Khongjom in Manipur during the Anglo-Manipuri War of 1891. It celebrates the bravery and sacrifice of Manipuri soldiers.\n\nThang-Ta: A traditional martial art and dance form from Manipur. It involves the use of various weapons and is considered an important part of Manipuri culture.\n"
    },
    {
        "Q.No.": 23,
        "question_text": "Consider the following statements:\n1. The Food Safety and Standards Act, 2006 replaced the Prevention of Food Adulteration Act, 1954.\n2. The Food Safety and Standards Authority of India (FSSAI) is under the charge of Director General of Health Services in the Union Ministry of Health and Family Welfare.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Food Safety and Standards Act, 2006, repealed the Prevention of Food Adulteration Act, 1954.  The Food Safety and Standards Authority of India (FSSAI) is an autonomous body established under the FSS Act, 2006.  Statement 2 is incorrect; FSSAI is not under the Director-General of Health Services.  It functions independently under the Ministry of Health and Family Welfare but is not directly under the Director-General.\n\n**Short notes on named entities:**\n\n* **Food Safety and Standards Act, 2006:** This Act consolidated and amended the laws relating to food safety and standards in India, replacing the older Prevention of Food Adulteration Act.  It aims to ensure the safety and quality of food products for consumers.\n\n* **Prevention of Food Adulteration Act, 1954:** This was the previous legislation governing food safety in India. It was considered outdated and inadequate in addressing modern food safety challenges, leading to its replacement by the FSS Act, 2006.\n\n* **Food Safety and Standards Authority of India (FSSAI):**  This is an autonomous body established under the FSS Act, 2006.  It is responsible for protecting and promoting public health through the regulation and supervision of food safety and quality standards in India.  It sets standards, licenses food businesses, and monitors food safety across the country.\n\n* **Director General of Health Services:** This is a senior administrative position within the Union Ministry of Health and Family Welfare in India.  They oversee the public health infrastructure and programs of the Ministry, but they do not directly control FSSAI.\n"
    },
    {
        "Q.No.": 24,
        "question_text": "The term \"two-state solution\" is sometimes mentioned in the news in the context of the affairs of",
        "option_a": "China",
        "option_b": "Israel",
        "option_c": "Iraq",
        "option_d": "Yemen",
        "correct_option": "b",
        "subject": "polity",
        "year": 2018,
        "explanation": "* **correct_option:** (b)\n* **explanation:** The \"two-state solution\" refers to a proposed resolution of the Israeli-Palestinian conflict where two independent states, one Israeli and one Palestinian, coexist peacefully.  This solution is frequently discussed in news reports concerning the Israeli-Palestinian conflict.\n\nChina is a major global power with a significant impact on international relations. Its economic rise and assertive foreign policy have reshaped the global order.  The \"One China\" policy and \"One Country, Two Systems\" are important concepts related to China's political system.\n\nIsrael is a country in the Middle East, frequently involved in geopolitical tensions. Its relationship with Palestine is a major source of conflict, and the \"two-state solution\" is a commonly proposed resolution.\n\nIraq is a country in the Middle East with a history of political instability and conflict. The US-led invasion of Iraq in 2003 is a significant event in recent history.\n\nYemen is a country in the Middle East currently experiencing a protracted civil war, creating a major humanitarian crisis.\n"
    },
    {
        "Q.No.": 25,
        "question_text": "With reference to the provisions made under the National Food Security Act, 2013, consider the following statements:\n1. The families coming under the category of 'below poverty line (BPL)' only are eligible to receive subsidised food grains.\n2. The eldest woman in a household, of age 18 years or above, shall be the head of the household for the purpose of issuance of a ration card.\n3. Pregnant women and lactating mothers are entitled to a 'take-home ration' of 1600 calories per day during pregnancy and for six months thereafter.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3.",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. The NFSA aims to provide subsidized food grains to a larger population than just those below the poverty line (BPL).  While BPL families were a significant focus initially, the act expanded coverage to include a larger percentage of the population.\n\nStatement 2 is correct. The NFSA designates the eldest woman of 18 years or above in a household as the head of the household for ration card issuance, aiming to empower women.\n\nStatement 3 is correct.  The NFSA provides for a higher calorie intake ('take-home ration') for pregnant women and lactating mothers to support their nutritional needs during a crucial period.  The exact caloric value might vary slightly based on interpretations, but the principle of enhanced nutritional support is central to the act.\n\n\n**Short Notes on Named Entities:**\n\n**National Food Security Act, 2013 (NFSA):**  A landmark legislation in India aiming to ensure food security for a substantial portion of the population by providing subsidized food grains. It shifted from a welfare approach to a rights-based approach, guaranteeing access to food as a fundamental right.\n\n**Below Poverty Line (BPL):** A categorization used in India to identify individuals and households living below a certain poverty threshold.  The criteria for BPL status have varied over time and have been subject to criticism for inaccuracies and exclusions.\n\n**Antyodaya Anna Yojana (AAY):** A program launched in 2000 preceding the NFSA, targeting the poorest of the poor with highly subsidized food grains.  It served as a precursor to the broader coverage provided by the NFSA.\n\n**Public Distribution System (PDS):** A government-run network for distributing subsidized food grains and other essential commodities to the population. The PDS has faced challenges related to efficiency, targeting, and leakages.\n\n**Targeted Public Distribution System (TPOS):** A modified version of the PDS focusing on delivering subsidized food to those identified as poor or vulnerable.  It was a step towards more targeted assistance before the NFSA's comprehensive approach.\n\n**Minimum Support Price (MSP):** The price at which the government guarantees to purchase agricultural produce from farmers, ensuring a minimum income for them.  MSP is crucial for the functioning of the PDS, as the government procures grains at MSP for distribution.\n\n**Food Corporation of India (FCI):** The primary agency responsible for procuring, storing, and distributing food grains under the PDS. The FCI's efficient management is vital for the success of the food security programs.\n"
    },
    {
        "Q.No.": 26,
        "question_text": "(d) 3 only\n\n26. India enacted The Geographical Indications of Goods (Registration and Protection) Act, 1999 in order to comply with the obligations to",
        "option_a": "ILO",
        "option_b": "IMF",
        "option_c": "UNCTAD",
        "option_d": "WTO",
        "correct_option": "d",
        "subject": "environment",
        "year": 2018,
        "explanation": "* **correct_option:** (d)\n* **explanation:** The Geographical Indications of Goods (Registration and Protection) Act, 1999 was enacted by India to fulfill its obligations under the World Trade Organization (WTO).  The WTO is an intergovernmental organization that regulates international trade.  The ILO (International Labour Organization) focuses on labor standards, the IMF (International Monetary Fund) on international finance, and UNCTAD (United Nations Conference on Trade and Development) on trade and development, particularly for developing countries.  The 1999 Act aims to protect the geographical indications of goods produced in India, ensuring their unique identity and quality.  This is a key aspect of international trade agreements and compliance with WTO rules.\n"
    },
    {
        "Q.No.": 27,
        "question_text": "Consider the following statements:\n1. In India, State Governments do not have the power to auction non-coal mines.\n2. Andhra Pradesh and Jharkhand do not have gold mines.\n3. Rajasthan has iron ore mines.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "d",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is incorrect.  State governments in India do have the power to auction some non-coal mines.  The auctioning of mines is a complex process involving both central and state governments, and the exact powers vary depending on the type of mine and the specific legislation.\n\nStatement 2 is incorrect.  While the provided text doesn't explicitly state the locations of all gold mines in India, it does not support the assertion that Andhra Pradesh and Jharkhand lack them.  The presence or absence of gold mines in specific states would require additional information.\n\nStatement 3 is correct. The text mentions Rajasthan having iron ore mines.\n\n\n**Short Notes on Named Entities:**\n\n* **Andhra Pradesh:** A state in Southern India known for its diverse geography and economy.  It has significant agricultural and industrial sectors.\n* **Jharkhand:** A state in Eastern India, rich in mineral resources, particularly coal and iron ore.  It is a major contributor to India's industrial output.\n* **Rajasthan:** A state in Western India known for its deserts, forts, and rich cultural heritage. It also has significant mineral resources.  \n* **Maharashtra:** A state in Western India, the most populous state in the country. It is a major industrial and economic hub.\n* **Gujarat:** A state in Western India, known for its industrial development, particularly in the petrochemical and textile sectors.\n* **Nagaland:** A state in Northeast India, known for its unique tribal culture and mountainous terrain.\n* **Assam:** A state in Northeast India, known for its tea plantations and diverse flora and fauna.\n* **Manipur:** A state in Northeast India, known for its rich cultural heritage and natural beauty.\n* **Telangana:** A state in Southern India, formed in 2014.  It has a growing IT sector and is known for its historical sites.\n* **Sikkim:** A state in Northeast India, known for its stunning Himalayan landscapes and Buddhist monasteries.\n* **Mizoram:** A state in Northeast India, known for its lush green hills and unique tribal culture.\n* **Arunachal Pradesh:** A state in Northeast India, bordering China and known for its biodiversity and mountainous terrain.\n* **Goa:** A state on the Western coast of India, known for its beaches and tourism.\n* **Karnataka:** A state in Southern India, known for its IT industry, coffee plantations, and historical sites.\n\n"
    },
    {
        "Q.No.": 28,
        "question_text": "With reference to digital payments, consider the following statements:\n1. BHIM app allows the user to transfer money to anyone with a UPI-enabled bank account.\n2. While a chip-pin debit card has four factors of authentication, BHIM app has only two factors of authentication.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation: Statement 1 is correct. BHIM app, based on the Unified Payments Interface (UPI), facilitates money transfers between any two UPI-enabled bank accounts.  UPI is a mobile-based payments network that allows users to transfer money between bank accounts instantly.\n\nStatement 2 is also correct. A chip-pin debit card typically employs four factors of authentication: something you have (the card), something you know (the PIN), something you are (biometrics, sometimes), and something you do (signature or PIN entry). BHIM app primarily uses two factors: something you have (the smartphone) and something you know (the mobile PIN or biometric authentication).  Therefore, BHIM has fewer authentication factors than a chip-pin debit card.\n\n\nBHIM: BHIM (Bharat Interface for Money) is a mobile payment app based on UPI. It allows for quick and easy peer-to-peer (P2P) and peer-to-merchant (P2M) transactions.\n\nUPI: Unified Payments Interface is a real-time mobile payment system that allows users to transfer money instantly between bank accounts.  It is the backbone of many mobile payment apps in India.\n"
    },
    {
        "Q.No.": 29,
        "question_text": "Among the following cities, which one lies on a longitude closest to that of Delhi ?",
        "option_a": "Bengaluru",
        "option_b": "Hyderabad",
        "option_c": "Nagpur",
        "option_d": "Pune",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation:  The longitude of Delhi is approximately 77°E.  Among the given options, Nagpur's longitude is closest to 77°E.  While precise longitudes aren't provided, geographical knowledge places Nagpur closer to Delhi's longitude than Bengaluru, Hyderabad, or Pune.\n\nBengaluru (Bangalore): A major city in southern India, known for its contributions to electronics, aerospace, and biotechnology.  It has a significant IT industry and is a major center for research and development.\n\nHyderabad: A city in southern India, historically significant as the capital of various kingdoms. It's now a major center for IT, pharmaceuticals, and biotechnology.  It has a rich cultural heritage and is known for its historical monuments.\n\nNagpur: A city in central India, geographically located closer to Delhi compared to the southern cities.  It serves as a major transportation hub.\n\nPune: A city in western India, known for its educational institutions and historical significance. It's a major center for automobile manufacturing and IT.\n"
    },
    {
        "Q.No.": 30,
        "question_text": "International Labour Organization's Conventions 138 and 182 are related to",
        "option_a": "Child labour",
        "option_b": "Adaptation of agricultural practices to global climate change",
        "option_c": "Regulation of food prices and food security",
        "option_d": "Gender parity at the workplace",
        "correct_option": "a",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation: ILO Conventions 138 and 182 are core international labor standards focusing on eliminating child labor.  Convention 138 sets a minimum age for admission to employment or work, while Convention 182 prohibits and takes action to eliminate the worst forms of child labor.  The other options are not directly related to these conventions.  Adaptation of agricultural practices to global climate change addresses environmental and agricultural issues. Regulation of food prices and food security deals with economic policy. Gender parity at the workplace focuses on workplace equality.\n"
    },
    {
        "Q.No.": 31,
        "question_text": "Regarding Money Bill, which of the following statements is not correct?",
        "option_a": "A bill shall be deemed to be a Money Bill if it contains only provisions relating to imposition, abolition, remission, alteration or regulation of any tax.",
        "option_b": "A Money Bill has provisions for the custody of the Consolidated Fund of India or the Contingency Fund of India.",
        "option_c": "A Money Bill is concerned with the appropriation of moneys out of the Contingency Fund of India.",
        "option_d": "A Money Bill deals with the regulation of borrowing of money or giving of any guarantee by the Government of India.",
        "correct_option": "a",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:A Money Bill, as per the Indian Constitution,  primarily deals with financial matters.  Option (a) is incorrect because a Money Bill is not limited to only tax-related provisions. It can also include other financial matters.\n\nA Money Bill can include provisions related to the Consolidated Fund of India (the main account of the government's receipts and expenditures), the Contingency Fund of India (a reserve fund for unforeseen expenses), and borrowing or guarantees by the government (options b, c, and d).  These are all legitimate aspects of a Money Bill.  The key is that the *predominant* purpose of the bill must be financial in nature.  A bill solely focused on taxation might be a Money Bill, but a Money Bill is not solely limited to taxation.\n"
    },
    {
        "Q.No.": 32,
        "question_text": "With reference to the election of the President of India, consider the following statements:\n1. The value of the vote of each MLA varies from State to State.\n2. The value of the vote of MPs of the Lok Sabha is more than the value of the vote of MPs of the Rajya Sabha.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:The value of each MLA's vote in the Presidential election is determined by the population of the state they represent, divided by the number of MLAs.  Therefore, the value varies from state to state, making statement 1 correct.  The value of an MP's vote from the Lok Sabha is higher than that of an MP from the Rajya Sabha.  This is because the Lok Sabha has more members, and the formula to calculate the value of an MP's vote considers the total number of members in each house. Therefore, statement 2 is incorrect.\n\nPresident of India: The head of state of the Republic of India, elected indirectly by an electoral college.\n\nMLA: Member of the Legislative Assembly, a member of a state's legislative body.\n\nMP: Member of Parliament, a member of either the Lok Sabha (House of the People) or the Rajya Sabha (Council of States), the two houses of India's Parliament.\n\nLok Sabha: The lower house of the Indian Parliament, directly elected by the people.\n\nRajya Sabha: The upper house of the Indian Parliament, representing the states.\n"
    },
    {
        "Q.No.": 33,
        "question_text": "In the Indian context, what is the implication of ratifying the 'Additional Protocol' with the 'International Atomic Energy Agency (IAEA)'?",
        "option_a": "The civilian nuclear reactors come under IAEA safeguards.",
        "option_b": "The military nuclear installations come under the inspection of IAEA.",
        "option_c": "The country will have the privilege to buy uranium from the Nuclear Suppliers Group (NSG).",
        "option_d": "The country automatically becomes a member of the NSG.",
        "correct_option": "a",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation: Ratifying the Additional Protocol with the IAEA means that India agrees to allow the IAEA to conduct more comprehensive inspections of its civilian nuclear facilities.  This doesn't include military installations.  While it increases the chances of gaining access to nuclear technology and fuel from the NSG (Nuclear Suppliers Group), it doesn't automatically grant membership.  The NSG is a group of nuclear supplier countries that seek to prevent nuclear proliferation by controlling the export of nuclear materials and technology.  IAEA (International Atomic Energy Agency) is an international organization that seeks to promote the peaceful use of nuclear energy and to prevent nuclear proliferation. The Additional Protocol enhances the IAEA's safeguards system, allowing for more intrusive inspections to verify the absence of undeclared nuclear materials and activities.\n"
    },
    {
        "Q.No.": 34,
        "question_text": "Consider the following countries:\n1. Australia\n2. Canada\n3. China\n4. India\n5. Japan\n6. USA\nWhich of the above are among the 'free-trade partners' of ASEAN?",
        "option_a": "1, 2, 4 and 5",
        "option_b": "3, 4, 5 and 6",
        "option_c": "1, 3, 4 and 5",
        "option_d": "2, 3, 4 and 6",
        "correct_option": "b",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:  The provided text mentions that India has signed FTAs with several countries, including Australia, Japan, and the United Arab Emirates.  China is also a significant trading partner of ASEAN.  Therefore, option (b) containing China, India, Japan, and the USA is the most likely correct answer.  While the text doesn't explicitly list all ASEAN free trade partners, the information provided strongly suggests this option.\n\n\nAustralia: A country in Oceania, known for its diverse wildlife, vast landscapes, and strong economy. It has a free trade agreement with ASEAN.\n\nCanada: A North American country, known for its vast natural resources, multicultural society, and advanced economy.  The text doesn't directly indicate an FTA with ASEAN.\n\n\nChina: A large country in East Asia, with a significant role in global trade and economy. It has extensive trade relations with ASEAN.\n\nIndia: A large country in South Asia, with a rapidly growing economy and significant population. It has a free trade agreement with ASEAN.\n\nJapan: An East Asian island nation, known for its technological advancements and economic strength.  It has a free trade agreement with ASEAN.\n\nUSA: A North American country, a global economic and military power. The text does not directly indicate an FTA with ASEAN.\n\nASEAN: The Association of Southeast Asian Nations, a regional intergovernmental organization comprising ten Southeast Asian countries.  ASEAN has numerous free trade agreements with various countries worldwide.\n\nFree Trade Agreement (FTA): An agreement between two or more countries that reduces or eliminates tariffs and other trade barriers.  FTAs aim to promote international trade and economic cooperation.\n"
    },
    {
        "Q.No.": 35,
        "question_text": "With reference to the 'Global Alliance for Climate-Smart Agriculture (GACSA)', which of the following statements is/are correct?\n1. GACSA is an outcome of the Climate Summit held in Paris in 2015.\n2. Membership of GACSA does not create any binding obligations.\n3. India was instrumental in the creation of GACSA.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:The Global Alliance for Climate-Smart Agriculture (GACSA) is a voluntary alliance, meaning membership does not create any binding obligations (statement 2 is correct).  While GACSA's formation was influenced by discussions at the 2015 Paris Climate Summit, it wasn't a direct outcome of the summit itself (statement 1 is incorrect). India played a significant role in the conceptualization and initial development of GACSA (statement 3 is correct).  Therefore, only statements 2 and 3 are correct.\n\nGACSA:  The Global Alliance for Climate-Smart Agriculture is a voluntary partnership of governments, civil society organizations, the private sector, and research institutions working to promote climate-smart agriculture practices globally.  It aims to improve food security, enhance resilience to climate change, and reduce greenhouse gas emissions from agriculture.\n\nParis Climate Summit (COP21): The 2015 United Nations Climate Change Conference, held in Paris, resulted in the Paris Agreement, a landmark international treaty on climate change mitigation, adaptation, and finance.  While GACSA's formation was influenced by the increased global focus on climate action following the summit, it wasn't directly established as a formal outcome of the summit.\n\nIndia:  India is a major agricultural nation and a significant player in global climate discussions.  Its involvement in GACSA reflects its commitment to sustainable agriculture and climate change mitigation.\n"
    },
    {
        "Q.No.": 36,
        "question_text": "Which of the following is/are the aim/aims of \"Digital India\" Plan of the Government of India?\n1. Formation of India's own Internet companies like China did.\n2. Establish a policy framework to encourage overseas multinational corporations that collect Big Data to build their large data centres within our national geographical boundaries.\n3. Connect many of our villages to the Internet and bring Wi-Fi to many of our schools, public places and major tourist centres.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:The Digital India plan primarily aims to improve digital infrastructure and literacy across India.  Option 3, connecting villages to the internet and expanding Wi-Fi access, directly reflects this goal.  Options 1 and 2 are not primary aims of the Digital India plan. While the plan might indirectly support the growth of Indian internet companies, it doesn't explicitly aim to create them in the same way China did. Similarly, attracting multinational data centers is not a central objective, though it might be a secondary benefit.\n\n**Short notes on named entities:**\n\n* **Digital India Plan:** A flagship program of the Indian government designed to transform India into a digitally empowered society and knowledge economy. It focuses on bridging the digital divide, improving digital literacy, and enhancing digital infrastructure.\n\n* **China:**  A major global power with a significant presence in the technology sector, known for its state-sponsored development of domestic internet companies.  Used here for comparison with India's approach.\n\n* **Big Data:** Extremely large and complex datasets that require advanced computing technologies to analyze and process.  The plan does not explicitly focus on Big Data but the improved infrastructure could facilitate its use.\n\n* **BharatNet:** A government project to provide broadband connectivity to all Gram Panchayats (village councils) in India. It's a key component of the Digital India initiative.\n\n* **National Information Centre (NIC):** An Indian government organization responsible for providing information technology support and services to various government departments.  It plays a crucial role in the Digital India plan.\n\n* **Gram Panchayats:** The local self-governing bodies at the village level in India.  Connecting them to the internet is a core aim of Digital India.\n\n\n* **Net Neutrality:** The principle that internet service providers (ISPs) should treat all data on the internet equally, without discriminating or charging differentially by user, content, website, platform, application, type of attached equipment, or mode of communication.  While not explicitly part of Digital India's aims, a neutral internet is vital for its success.\n\n* **TRAI (Telecom Regulatory Authority of India):**  The regulatory body for the telecommunications sector in India.  Its decisions regarding net neutrality are relevant to the digital landscape.  \n\n\n"
    },
    {
        "Q.No.": 37,
        "question_text": "Consider the following pairs:\n   Towns sometimes mentioned in news                Country\n1. Aleppo                                           Syria\n2. Kirkuk                                           Yemen\n3. Mosul                                            Palestine\n4. Mazar-i-sharif                                   Afghanistan\nWhich of the pairs given above are correctly matched?",
        "option_a": "1 and 2",
        "option_b": "1 and 4",
        "option_c": "2 and 3",
        "option_d": "3 and 4",
        "correct_option": "b",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation: Aleppo is in Syria, and Mazar-i-Sharif is in Afghanistan.  Kirkuk is in Iraq, and Mosul is in Iraq, not Yemen or Palestine respectively. Therefore, only pairs 1 and 4 are correctly matched.\n\nAleppo: A major city in Syria, historically significant and frequently mentioned in news due to its involvement in conflicts.\n\nKirkuk: A city in northern Iraq, known for its oil reserves and ethnically diverse population, often featured in news related to Iraqi politics and conflicts.\n\nMosul: A large city in northern Iraq, also significantly impacted by conflicts and frequently featured in news reports.\n\nMazar-i-Sharif: A city in northern Afghanistan, important historically and strategically, often mentioned in news concerning Afghan conflicts and political developments.\n"
    },
    {
        "Q.No.": 38,
        "question_text": "In the Federation established by The Government of India Act of 1935, residuary powers were given to the",
        "option_a": "Federal Legislature",
        "option_b": "Governor General",
        "option_c": "Provincial Legislature",
        "option_d": "Provincial Governors",
        "correct_option": "a",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:The Government of India Act of 1935 established a federation in India.  A crucial aspect of this federation was the allocation of residuary powers, meaning powers not explicitly assigned to either the federal or provincial governments.  The Act vested these residuary powers in the Federal Legislature (the central government).\n\nThe Governor-General was the head of state, representing the British Crown. The Provincial Legislatures were the lawmaking bodies of the provinces, and Provincial Governors were the heads of the provinces, representing the Crown at the provincial level.  The Act aimed to create a system of shared governance, but ultimately, the central government retained significant control through the residuary powers.\n"
    },
    {
        "Q.No.": 39,
        "question_text": "Consider the following statements:\n1. The Speaker of the Legislative Assembly shall vacate his/her office if he/she ceases to be a member of the Assembly.\n2. Whenever the Legislative Assembly is dissolved, the Speaker shall vacate his/her office immediately.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:Both statements 1 and 2 are correct.  The Speaker's position is intrinsically linked to their membership in the Legislative Assembly. If they cease to be a member (statement 1), or if the Assembly is dissolved (statement 2), they automatically vacate the Speaker's office.  This ensures the Speaker always represents the active body of the Assembly.\n\nSpeaker of the Legislative Assembly: The presiding officer of a legislative assembly, responsible for maintaining order and decorum during sessions.  Their role is crucial for the smooth functioning of the legislative process.  The Speaker's decisions on procedural matters are generally final within the assembly.\n\nLegislative Assembly: The lower house of a bicameral legislature or the sole legislative body in a unicameral system. It is the primary forum for lawmaking and representing the interests of the people.  The composition and powers of a legislative assembly are defined by the constitution or governing laws of a particular jurisdiction.\n\nDissolution of the Legislative Assembly: The termination of the assembly's term, usually triggered by factors such as the completion of its term, a vote of no confidence, or a decision by the executive branch (e.g., the Governor or President in some systems).  Dissolution results in the calling of new elections.\n"
    },
    {
        "Q.No.": 40,
        "question_text": "Which one of the following reflects the most appropriate relationship between law and liberty?",
        "option_a": "If there are more laws, there is less liberty.",
        "option_b": "If there are no laws, there is no liberty.",
        "option_c": "If there is liberty, laws have to be made by the people.",
        "option_d": "If laws are changed too often, liberty is in danger.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "* **correct_option:** (c)\n* **explanation:** Option (c) reflects the most appropriate relationship between law and liberty.  A just and fair legal system requires the active participation of the people in its creation and enforcement. Laws made without the consent or input of the governed are more likely to be oppressive and restrictive of liberty.\n\nOption (a) is an oversimplification.  While excessive laws can restrict liberty,  a well-structured legal system can actually protect and enhance liberty by establishing order and protecting individual rights.\n\nOption (b) is incorrect.  Without laws, there is anarchy, not liberty.  Liberty requires a framework of rules to protect individuals from arbitrary power and ensure fairness.\n\nOption (d) is partially true; frequent and unpredictable changes to laws can undermine stability and create uncertainty, potentially threatening liberty. However,  the possibility of necessary law changes to better protect liberty is not excluded.\n\n\n**Short Notes on Keywords and Entities:**\n\n* **Law:** A system of rules created and enforced through social or governmental institutions to regulate behavior.  Laws ideally balance individual liberty with the needs of society.\n\n* **Liberty:** The state of being free within society from oppressive restrictions imposed by authority on one's way of life, behavior, or political views.  It is a fundamental human right.\n\n* **Rule of Law:** A principle that all persons, institutions, and entities are accountable to laws that are publicly promulgated, equally enforced, and independently adjudicated.  It ensures fairness, prevents arbitrary power, and protects fundamental rights.\n\n* **CJI NV Raman:**  (Assuming this refers to a Chief Justice of India,  N. V. Ramana)  A high-ranking judicial official; his quote highlights the connection between the rule of law and societal civility.\n\n* **Article 14 (of the Indian Constitution):** Guarantees equality before the law and equal protection of the laws within India. This means everyone is subject to the same laws and treated equally under them.\n\n* **Equality before law:**  A principle ensuring no special privileges are granted and all are subject to ordinary laws.\n\n* **Equal protection of the law:** A principle ensuring similar treatment under the law for similarly situated individuals.\n\n* **Judicial Activism:** Where courts take a more active role in shaping public policy, often involving the interpretation and application of laws to address social or political issues.\n\n* **Judicial Overreach:** An extreme form of judicial activism, where courts overstep their authority and encroach upon the roles of the legislature or executive branches of government.\n"
    },
    {
        "Q.No.": 41,
        "question_text": "Consider the following statements:\n1. No criminal proceedings shall be instituted against the Governor of a State in any court during his term of office.\n2. The emoluments and allowances of the Governor of a State shall not be diminished during his term of office.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct.  Article 361 of the Indian Constitution grants immunity from criminal proceedings to the Governor of a State during their term of office.  Statement 2 is also correct. Article 158 of the Indian Constitution states that the emoluments and allowances of the Governor shall not be diminished during their term of office.  Therefore, both statements are correct.\n\nGovernor of a State: The Governor is the head of the state executive in India's federal structure.  They are appointed by the President and hold office during the pleasure of the President.  Their primary role is to ensure the smooth functioning of the state government.\n\n\nArticle 361: This article of the Indian Constitution provides protection to the President and Governors from legal proceedings during their tenure. It shields them from criminal and civil suits.\n\nArticle 158: This article deals with the emoluments, allowances, and privileges of the Governor. It ensures that their financial compensation cannot be reduced during their time in office.\n"
    },
    {
        "Q.No.": 42,
        "question_text": "The well-known painting “Bani Thani” belongs to the",
        "option_a": "Bundi school",
        "option_b": "Jaipur school",
        "option_c": "Kangra school",
        "option_d": "Kishangarh school",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation: The painting \"Bani Thani\" is associated with the Kishangarh school of painting.\n\nBundi school: A school of Rajasthani painting known for its distinctive style characterized by bold colors, dynamic compositions, and depictions of nature and courtly life.  The paintings often feature landscapes and scenes of hunting and warfare.\n\nJaipur school:  A prominent school of Rajasthani painting, known for its elegance and refinement, often depicting royal portraits, court scenes, and romantic themes.  The style is characterized by delicate brushwork and a sophisticated use of color.\n\nKangra school: A school of Pahari painting, known for its lyrical beauty, delicate lines, and romantic themes. It flourished in the Kangra region of the Himalayas and is famed for its depictions of Krishna and Radha, as well as landscapes.\n\nKishangarh school: A school of Rajasthani painting, particularly known for its idealized and romantic portrayal of the female form, often associated with the legendary \"Bani Thani.\"  The style is characterized by delicate lines, soft colors, and an emphasis on emotional expression.  The Kishangarh style is considered unique among the Rajasthani schools for its emphasis on idealized beauty and emotional intensity.\n"
    },
    {
        "Q.No.": 43,
        "question_text": "What is “Terminal High Altitude Area Defense (THAAD)”, sometimes seen in the news?",
        "option_a": "An Israeli radar system",
        "option_b": "India’s indigenous anti-missile programme",
        "option_c": "An American anti-missile system",
        "option_d": "A defence collaboration between Japan and South Korea",
        "correct_option": "c",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: Terminal High Altitude Area Defense (THAAD) is an American anti-missile system designed to shoot down short, medium, and intermediate-range ballistic missiles during their terminal phase (descent).  It's a mobile system, meaning it can be deployed to different locations.\n\nIsrael is known for its advanced military technology, including radar systems; however, THAAD is not an Israeli system.  India has its own indigenous anti-missile programs, but THAAD is not one of them.  While Japan and South Korea have defense collaborations, THAAD's development and deployment are primarily led by the United States.\n"
    },
    {
        "Q.No.": 44,
        "question_text": "With reference to cultural history of India, consider the following statements:\n1. Most of the Tyagaraja Kritis are devotional songs in praise of Lord Krishna.\n2. Tyagaraja created several new ragas.\n3. Annamacharya and Tyagaraja are contemporaries.\n4. Annamacharya kirtanas are devotional songs in praise of Lord Venkateshwara.\nWhich of the statements given above are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 and 4 only",
        "option_c": "1, 2 and 3",
        "option_d": "2, 3 and 4",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation:\n\nStatement 1 is incorrect.  Most of Tyagaraja's kritis are devotional songs in praise of Lord Rama, not Krishna.\n\nStatement 2 is correct. Tyagaraja is credited with creating several new ragas (melodic frameworks in Carnatic music).\n\nStatement 3 is incorrect. Annamacharya lived from roughly 1408-1503 CE, while Tyagaraja lived from 1767-1847 CE. They were not contemporaries.\n\nStatement 4 is correct. Annamacharya's kirtanas are devotional songs primarily in praise of Lord Venkateshwara.\n\n\nShort notes on named entities:\n\n**Tyagaraja:** A prominent composer of Carnatic music, known for his profound devotional kritis (songs) dedicated mainly to Lord Rama.  His compositions significantly enriched Carnatic music's melodic and lyrical landscape.\n\n**Annamacharya:** A 15th-century Telugu poet and composer, renowned for his numerous kirtanas (devotional songs) dedicated to Lord Venkateshwara. He is considered a pioneer of the bhakti movement in Telugu-speaking regions.\n\n**Ragas:** Melodic frameworks or scales used in Indian classical music.  They provide a structure for improvisation and composition, each with its unique character and emotional quality.  Carnatic and Hindustani music both have distinct raga systems.\n\n**Kritis:** A specific type of song in Carnatic music, characterized by a complex structure and lyrical depth. They are usually devotional in nature and often set to specific ragas.  They form a core element of Carnatic music's repertoire.\n\n**Kirtanas:** Devotional songs, often part of a larger religious or ritual context.  The style and form of kirtanas vary across different regions and traditions of India.  They are usually sung in a congregational setting.\n\n**Lord Krishna:** A major deity in Hinduism, worshipped as the eighth avatar (incarnation) of Vishnu. He is often depicted as a mischievous child and a divine lover, and is associated with numerous myths and legends.\n\n**Lord Venkateshwara:** A form of Vishnu, specifically worshipped at the Tirumala Venkateswara Temple in Andhra Pradesh.  He is a highly revered deity in South India, and his temple attracts millions of pilgrims annually.\n\n**Lord Rama:** A major deity in Hinduism, worshipped as the seventh avatar (incarnation) of Vishnu.  He is the central figure in the epic Ramayana, known for his righteousness and devotion to dharma (righteous conduct).\n"
    },
    {
        "Q.No.": 45,
        "question_text": "Which of the following are regarded as the main features of the \"Rule of Law\"?\n1. Limitation of powers\n2. Equality before law\n3. People's responsibility to the Government\n4. Liberty and civil rights\nSelect the correct answer using the code given below:",
        "option_a": "1 and 3 only",
        "option_b": "2 and 4 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation:The Rule of Law emphasizes that everyone, including those in power, is subject to and accountable under the law.  This inherently involves limitations on power (1) and equality before the law (2).  Liberty and civil rights (4) are also protected under the Rule of Law, as it ensures that fundamental rights are upheld and arbitrary exercise of power is prevented.  However, \"People's responsibility to the Government\" (3) is not a core feature of the Rule of Law. While citizens have responsibilities, the Rule of Law primarily focuses on the government's responsibility to uphold the law and respect the rights of its citizens.\n\n**Short notes:**\n\n* **Rule of Law:** A principle ensuring everyone, regardless of status, is accountable under publicly promulgated laws. It promotes justice, protects rights, and prevents arbitrary governance.  The absence of it leads to tyranny and injustice.\n\n* **Limitation of Powers:**  This prevents any branch of government or individual from exceeding their lawful authority, safeguarding individual liberties and preventing abuse of power.  Checks and balances are crucial to implementing this.\n\n* **Equality before the law:**  All individuals are treated equally under the law, irrespective of social status, wealth, or political influence. This principle ensures fairness and prevents discrimination in the application of legal processes.\n\n* **People's responsibility to the Government:** While citizens have a duty to obey laws and participate in civic life, this is not a defining feature of the Rule of Law itself.  The Rule of Law primarily concerns the government's obligations.\n\n* **Liberty and civil rights:**  These are fundamental rights and freedoms guaranteed to individuals under the Rule of Law, such as freedom of speech, assembly, and religion, and protection against arbitrary arrest or detention.  These are essential for a just and free society.\n\n* **NV Raman (CJI):**  This refers to a Chief Justice of India (though the provided text doesn't specify which one).  CJIs play a vital role in upholding the Rule of Law within a country's judicial system.\n\n\n"
    },
    {
        "Q.No.": 46,
        "question_text": "Which one of the following statements correctly describes the meaning of legal tender money?",
        "option_a": "The money which is tendered in courts of law to defray the fee of legal cases",
        "option_b": "The money which a creditor is under compulsion to accept in settlement of his claims",
        "option_c": "The bank money in the form of cheques, drafts, bills of exchange, etc.",
        "option_d": "The metallic money in circulation in a country",
        "correct_option": "b",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation: Legal tender money refers to the currency that a creditor is legally obligated to accept as payment for a debt.  Option (b) accurately reflects this definition.\n\nOption (a) is incorrect;  \"tendered in courts\" refers to the submission of money as payment, not its legal status.\n\nOption (c) is incorrect; cheques, drafts, and bills of exchange are not inherently legal tender; their acceptability depends on the agreement between parties.\n\nOption (d) is incorrect; while metallic money can be legal tender, the definition isn't limited to just metallic forms.  Legal tender encompasses various forms of currency designated by law.\n"
    },
    {
        "Q.No.": 47,
        "question_text": "If a commodity is provided free to the public by the Government, then",
        "option_a": "the opportunity cost is zero.",
        "option_b": "the opportunity cost is ignored.",
        "option_c": "the opportunity cost is transferred from the consumers of the product to the tax-paying public.",
        "option_d": "the opportunity cost is transferred from the consumers of the product to the Government.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:When the government provides a commodity for free, it doesn't mean the opportunity cost disappears.  The resources used to produce and distribute the free commodity could have been used for something else.  Option (c) correctly identifies that this opportunity cost is shifted from the individual consumers (who would otherwise pay for the commodity) to the general tax-paying public, who fund the government's provision of the good.  The government is the intermediary in this transfer, but the ultimate cost is borne by taxpayers.\n\nCommodity: A raw material or primary agricultural product that can be bought and sold.  Commodities are typically undifferentiated; one unit is largely the same as another.\n\nGovernment: The governing body of a state or country; responsible for the creation and enforcement of laws, the regulation of the economy, and the provision of public services.\n\nOpportunity cost: The value of the next best alternative forgone when making a decision.  It represents the cost of choosing one option over another.\n\nConsumers: Individuals or groups who purchase and use goods and services to satisfy their needs and wants. Consumer behavior is driven by factors such as price, income, and preferences.\n\nTax-paying public: The collective group of individuals and entities within a jurisdiction who are obligated to pay taxes to the government. Tax revenue is a primary source of funding for government operations and programs.\n"
    },
    {
        "Q.No.": 48,
        "question_text": "Increase in absolute and per capita real GNP do not connote a higher level of economic development, if",
        "option_a": "industrial output fails to keep pace with agricultural output.",
        "option_b": "agricultural output fails to keep pace with industrial output.",
        "option_c": "poverty and unemployment increase.",
        "option_d": "imports grow faster than exports.",
        "correct_option": "c",
        "subject": "economy",
        "year": 2018,
        "explanation": "* **correct_option:** (c)\n* **explanation:** An increase in absolute and per capita real GNP (Gross National Product) signifies economic growth, but not necessarily economic development.  Economic development encompasses broader improvements in living standards, including poverty reduction and employment generation. If poverty and unemployment increase despite rising GNP, it indicates that the economic growth is not translating into widespread benefits for the population, hence not connoting higher economic development.\n\nReal GNP:  Real GNP adjusts nominal GNP for inflation, providing a more accurate picture of economic output growth.\n\nPer Capita Real GNP: This metric divides real GNP by the population, showing the average income per person.  A higher value suggests increased average wealth, but doesn't reflect income distribution.\n\nPoverty: A state of deprivation characterized by a lack of access to basic needs like food, shelter, and healthcare.  High poverty rates, even with economic growth, signal unequal distribution of wealth.\n\nUnemployment: The state of being without a job while actively seeking employment. High unemployment indicates underutilization of human resources and reduced income for a significant portion of the population.\n\nOption (a) and (b) focus on sectoral imbalances (agriculture vs. industry). While such imbalances can hinder development, they don't automatically negate the possibility of improved development if other factors, such as poverty and unemployment, are addressed. Option (d) focuses on the trade balance (imports vs. exports). A trade deficit can be a symptom of economic issues, but again, it doesn't directly contradict the possibility of development if other indicators improve.\n"
    },
    {
        "Q.No.": 49,
        "question_text": "Consider the following statements:\nHuman capital formation as a concept is better explained in terms of a process which enables\n1. individuals of a country to accumulate more capital.\n2. increasing the knowledge, skill levels and capacities of the people of the country.\n3. accumulation of tangible wealth.\n4. accumulation of intangible wealth.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 4",
        "option_d": "1, 3 and 4",
        "correct_option": "c",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: Human capital formation is a process that improves the knowledge, skills, and capabilities of a country's population.  Statement 1 is incorrect because it focuses on capital accumulation in a general sense, not specifically human capital. Statement 3 is incorrect as it refers to tangible wealth, while human capital is intangible. Statement 4 is correct, as increased knowledge and skills represent intangible wealth. Therefore, only statements 2 and 4 are correct.\n\nHuman capital:  Refers to the economic value of a worker's experience and skills.  Investing in education and training increases human capital, leading to higher productivity and economic growth.\n\nIntangible wealth: Represents assets that lack physical form but have economic value, such as knowledge, skills, brand reputation, and intellectual property.  Human capital is a key component of intangible wealth.\n\nTangible wealth: Refers to physical assets that have economic value, such as buildings, machinery, and land.  It differs from human capital, which is an intangible asset.\n"
    },
    {
        "Q.No.": 50,
        "question_text": "Despite being a high saving economy, capital formation may not result in significant increase in output due to",
        "option_a": "weak administrative machinery",
        "option_b": "illiteracy",
        "option_c": "high population density",
        "option_d": "high capital-output ratio",
        "correct_option": "d",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation: A high saving economy implies a large amount of capital is available for investment. However, if the capital-output ratio is high, it means that a large amount of capital investment is required to generate a unit of output.  This implies that even with high savings, the increase in output might be insignificant.  This is because the productivity of capital is low, meaning the efficiency of converting savings into output is low.\n\nHigh capital-output ratio: This refers to the amount of capital required to produce one unit of output. A high ratio indicates inefficiency in capital utilization, meaning that a large investment is needed to achieve a small increase in production.\n\nWeak administrative machinery: Inefficient bureaucracy and lack of proper implementation of policies can hamper economic growth.\n\nIlliteracy: A less educated workforce is less productive and may not be able to effectively utilize advanced technology and capital.\n\nHigh population density: While not directly related to capital formation, high population density can put pressure on resources and infrastructure, potentially hindering economic progress.\n"
    },
    {
        "Q.No.": 51,
        "question_text": "After the Santhal Uprising subsided, what was/were the measure/measures taken by the colonial government?\n1. The territories called 'Santhal Paraganas' were created.\n2. It became illegal for a Santhal to transfer land to a non-Santhal.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: Following the Santhal Uprising, the British colonial government established the Santhal Paraganas as a separate administrative unit to grant the Santhals some degree of autonomy and control over their land.  Additionally, regulations were implemented to prevent the Santhals from losing their land to non-Santhals through unfair land transactions.\n\n\nSanthal Uprising: A major tribal rebellion in the mid-19th century in present-day Jharkhand and West Bengal, India.  It was triggered by the encroachment of the Santhal's land and resources by outsiders and the exploitative practices of the colonial administration and zamindars. The uprising, though ultimately unsuccessful, highlighted the oppressive nature of colonial rule and the need for better protection of tribal rights.\n\nSanthal Paraganas: A region in present-day Jharkhand, India, created by the British as a separate administrative district following the Santhal Uprising. The creation aimed to protect Santhal land and provide them a degree of self-governance.  It was intended to separate the Santhals from the exploitative practices of the zamindari system and other non-tribal elements.\n"
    },
    {
        "Q.No.": 52,
        "question_text": "Economically, one of the results of the British rule in India in the 19th century was the",
        "option_a": "increase in the export of Indian handicrafts",
        "option_b": "growth in the number of Indian owned factories",
        "option_c": "commercialization of Indian agriculture",
        "option_d": "rapid increase in the urban population",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation: The British rule in India during the 19th century led to the commercialization of Indian agriculture.  While the British initially focused on mercantilism and monopolizing trade, the later stages saw a shift towards free trade, though heavily favoring British interests. This led to the increased production of cash crops for export to Britain, fundamentally altering the agricultural landscape and making it more market-oriented. This contrasts with options (a), (b), and (d):\n\n(a) **Increase in the export of Indian handicrafts:**  British policies actually led to the decline of Indian handicrafts due to competition from British manufactured goods and the redirection of resources towards cash crops.  Handicrafts, a significant part of the Indian economy, suffered immensely under colonial rule.\n\n(b) **Growth in the number of Indian-owned factories:** The British promoted the development of industries that benefited their own economy, not necessarily fostering the growth of Indian-owned factories.  Instead, deindustrialization occurred in many sectors.\n\n(d) **Rapid increase in the urban population:** While urbanization did occur to some extent, it was not a rapid or widespread phenomenon compared to the transformative impact of the commercialization of agriculture.  The British primarily focused on exploiting resources and establishing infrastructure that served their own economic objectives.\n\n\n**Short notes on named entities:**\n\n* **British rule in India (19th century):**  This period saw the consolidation of British power in India, characterized by economic exploitation, political subjugation, and significant social and cultural changes.  The East India Company's rule transitioned to direct British Crown rule after the Sepoy Mutiny of 1857.\n\n* **Indian handicrafts:** Traditional Indian crafts, such as textiles, pottery, and metalwork, which were once a major part of the Indian economy and known for their quality and artistry.\n\n* **Indian-owned factories:**  Factories owned and operated by Indians, representing indigenous industrial capabilities.  These were largely suppressed under British rule.\n\n* **Commercialization of Indian agriculture:** The transformation of Indian agriculture from subsistence farming to cash-crop production driven by market forces, primarily to meet the demands of the British Empire. This often led to displacement of farmers and ecological damage.\n\n* **Mercantilism:** An economic system where a nation's power is directly related to its wealth, often achieved through trade monopolies and the accumulation of precious metals.  This was the dominant economic philosophy during the early stages of British rule in India.\n\n\n"
    },
    {
        "Q.No.": 53,
        "question_text": "If the President of India exercises his power as provided under Article 356 of the Constitution in respect of a particular State, then",
        "option_a": "the Assembly of the State is automatically dissolved.",
        "option_b": "the powers of the Legislature of that State shall be exercisable by or under the authority of the Parliament.",
        "option_c": "Article 19 is suspended in that State.",
        "option_d": "the President can make laws relating to that State.",
        "correct_option": "b",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:When the President of India invokes Article 356 of the Constitution,  the Parliament gains the power to legislate for the affected State.  The State Assembly may be suspended or dissolved, but this isn't automatic. Article 19 (related to fundamental rights) is not automatically suspended. The President doesn't directly make laws for the State; the Parliament does.\n\nArticle 356: This article allows the central government to take over the administration of a state if the constitutional machinery breaks down.  It's a controversial provision as it can be used to curb opposition-led state governments.  The President's action is subject to judicial review.\n\nArticle 19: This article guarantees fundamental rights, including freedom of speech, assembly, and movement.  These rights are not automatically suspended under Article 356.\n\nParliament: The bicameral legislature of India, consisting of the Lok Sabha (House of the People) and Rajya Sabha (Council of States).  Under Article 356, Parliament assumes legislative powers for the affected state.\n\nPresident of India: The head of state of India, primarily a ceremonial role but with significant powers in specific situations, including invoking Article 356.\n\nState Assembly: The legislative body of an Indian state.  Under Article 356, it can be suspended or dissolved.\n\nS.R. Bommai Case (1994): A landmark Supreme Court case that clarified the scope and limitations of Article 356, emphasizing the importance of judicial review.  It established that the President's proclamation under Article 356 is subject to judicial review.\n\n44th Constitutional Amendment Act (1978): This amendment introduced significant changes to Article 356, including strengthening the judicial oversight of the President's actions.\n"
    },
    {
        "Q.No.": 54,
        "question_text": "Consider the following pairs:\n   Craft                        Heritage of\n1. Puthukkuli shawls            Tamil Nadu\n2. Sujni embroidery             Maharashtra\n3. Uppada Jamdani saris         Karnataka\nWhich of the pairs given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation: Only the pair \"Puthukkuli shawls - Tamil Nadu\" is correct.  Sujni embroidery is associated with Bihar, not Maharashtra. Uppada Jamdani saris are from Andhra Pradesh, not Karnataka.\n\nPuthukkuli shawls: These are traditional shawls from Tamil Nadu, known for their intricate weaving techniques and often featuring vibrant colors and designs.\n\nSujni embroidery:  A type of embroidery originating in Bihar, India, characterized by its use of running stitch and often incorporating geometric patterns.\n\nUppada Jamdani saris: These are fine, handwoven saris from Uppada in Andhra Pradesh, India.  They are known for their intricate jamdani weaving technique, creating delicate patterns.\n"
    },
    {
        "Q.No.": 55,
        "question_text": "In which of the following areas can GPS technology be used?\n1. Mobile phone operations\n2. Banking operations\n3. Controlling the power grids\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: GPS technology is used in mobile phone operations for location services and navigation.  It's also used in controlling power grids for monitoring and managing the distribution of electricity across a network.  While banks might use location data, direct use of GPS technology within banking operations isn't as prominent as in the other two areas.  Therefore, options 1 and 3 are correct.\n\nMobile phone operations:  Mobile phones utilize GPS signals to determine their location, enabling features like mapping, navigation, and location-based services.  The Global Positioning System is a satellite-based radionavigation system operated by the United States government.\n\nPower grids: GPS technology aids in synchronizing and monitoring the performance of power grids, enhancing efficiency and reliability. Precise timing provided by GPS is crucial for grid stability.\n\nBanking operations: While banks may use location data for fraud prevention or customer services, the core operations of banking don't directly rely on GPS technology in the same way as mobile phones or power grids.\n"
    },
    {
        "Q.No.": 56,
        "question_text": "Consider the following statements:\n1. The Reserve Bank of India manages and services Government of India Securities but not any State Government Securities.\n2. Treasury bills are issued by the Government of India and there are no treasury bills issued by the State Governments.\n3. Treasury bills offer are issued at a discount from the par value.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is incorrect. The Reserve Bank of India (RBI) manages and services both Central Government Securities and State Government Securities.  The RBI's role in managing government securities includes managing the government's borrowing program, issuing and servicing government bonds, and conducting open market operations. While the RBI primarily deals with the Government of India's securities, it also plays a role in the management of State Development Loans (SDLs), which are securities issued by state governments.  In recent years, the RBI has expanded its engagement with SDLs, including conducting open market operations (OMOs) in SDLs.\n\nStatement 2 is incorrect. While Treasury bills are primarily issued by the Central Government, some states also issue treasury bills to manage their short-term cash flow needs.  However, these are less common than those issued by the central government.\n\nStatement 3 is correct. Treasury bills are typically issued at a discount to their face value. The difference between the face value and the issue price represents the investor's return.  The investor receives the face value of the bill upon maturity, making the difference the implicit interest earned.\n\n\n**Short notes on important keywords and named entities:**\n\n* **Reserve Bank of India (RBI):** India's central bank, responsible for monetary policy, regulating banks, and managing the country's foreign exchange reserves.  It plays a crucial role in maintaining financial stability and managing government debt.\n\n* **Government of India Securities:** Debt instruments issued by the Indian government to finance its fiscal deficit. These include treasury bills and bonds.\n\n* **State Government Securities:** Debt instruments issued by state governments in India to finance their spending.  These are often referred to as State Development Loans (SDLs).\n\n* **Treasury Bills:** Short-term debt instruments issued by the government at a discount and redeemed at face value on maturity. They are used for short-term borrowing and cash flow management.\n\n* **Open Market Operations (OMO):** The buying and selling of government securities by the central bank to influence money supply and interest rates.  The RBI uses OMOs to manage liquidity in the market.\n\n* **State Development Loans (SDLs):**  Bonds issued by state governments in India to raise funds.  They are a key source of financing for state governments.\n"
    },
    {
        "Q.No.": 57,
        "question_text": "Consider the following statements:\n1. The Earth's magnetic field has reversed every few hundred thousand years.\n2. When the Earth was created more than 4000 million years ago, there was 54% oxygen and no carbon dioxide.\n3. When living organisms originated, they modified the early atmosphere of the Earth.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct. The Earth's magnetic field has indeed reversed numerous times throughout its history, with reversals occurring roughly every few hundred thousand years, although the intervals are not perfectly regular.\n\nStatement 2 is incorrect. The early Earth's atmosphere was very different from today's.  It had very little free oxygen (O2) and likely contained significant amounts of carbon dioxide (CO2), methane (CH4), and other gases. The 54% oxygen figure is far too high for the early Earth. The presence of significant amounts of free oxygen is a relatively recent phenomenon in Earth's history, largely due to the evolution of photosynthetic organisms.\n\nStatement 3 is correct. The evolution of life, particularly photosynthetic organisms, dramatically altered the Earth's atmosphere. Photosynthesis led to the gradual increase in atmospheric oxygen and a decrease in carbon dioxide, fundamentally changing the composition of the atmosphere and paving the way for the evolution of more complex life forms.\n\nTherefore, only statements 1 and 3 are correct.  The Earth's magnetic field: The Earth's core generates a magnetic field that protects the planet from harmful solar radiation. This field reverses polarity periodically, a phenomenon recorded in rocks.  Oxygen: Oxygen is a crucial element for most life on Earth.  Its rise in the atmosphere was a major event in Earth's history. Carbon dioxide:  A greenhouse gas, CO2 plays a significant role in regulating Earth's temperature. Photosynthesis: The process by which plants convert light energy into chemical energy, releasing oxygen as a byproduct.\n"
    },
    {
        "Q.No.": 58,
        "question_text": "The terms 'WannaCry, Petya and EternalBlue' sometimes mentioned in the news recently are related to",
        "option_a": "Exoplanets",
        "option_b": "Cryptocurrency",
        "option_c": "Cyber attacks",
        "option_d": "Mini satellites",
        "correct_option": "c",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: WannaCry, Petya, and EternalBlue are all names associated with major cyberattacks.  WannaCry was a ransomware attack that spread rapidly across the globe in 2017, encrypting files and demanding ransom payments. Petya (also known as NotPetya) was a destructive malware attack in 2017 that caused significant damage to businesses and infrastructure. EternalBlue is an exploit, a piece of software that takes advantage of a vulnerability in Microsoft's Windows operating systems, which was used in both WannaCry and NotPetya to spread rapidly.  The other options are unrelated; exoplanets are planets outside our solar system, cryptocurrency is digital or virtual currency, and mini-satellites are small artificial satellites.\n"
    },
    {
        "Q.No.": 59,
        "question_text": "With reference to the circumstances in Indian agriculture, the concept of \"Conservation Agriculture\" assumes significance. Which of the following fall under the Conservation Agriculture?\n1. Avoiding the monoculture practices\n2. Adopting minimum tillage\n3. Avoiding the cultivation of plantation crops\n4. Using crop residues to cover soil surface\n5. Adopting spatial and temporal crop sequencing/crop rotations\nSelect the correct answer using the code given below:",
        "option_a": "1, 3 and 4",
        "option_b": "2, 3, 4 and 5",
        "option_c": "2, 4 and 5",
        "option_d": "1, 2, 3 and 5",
        "correct_option": "c",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: Conservation agriculture is a farming system that aims to conserve arable land, regenerate degraded lands, and promote sustainable agricultural practices.  The three main principles are:  minimum soil disturbance (minimum tillage), permanent soil cover (using crop residues), and diversification of plant species (crop rotations and intercropping).\n\nOption 1: Avoiding monoculture practices is beneficial for soil health and biodiversity, but it's not a core principle of conservation agriculture.  Monoculture is the practice of growing a single crop species in a field repeatedly.\n\nOption 2: Minimum tillage is a core principle. Minimum tillage farming involves reducing the amount of soil disturbance during planting and cultivation.\n\nOption 3: Avoiding cultivation of plantation crops is not a principle of conservation agriculture. Plantation crops are a type of cropping system.\n\nOption 4: Using crop residues to cover the soil surface is a core principle.  Crop residues are the leftover plant material after harvest, such as stalks, leaves, and stems.\n\nOption 5: Adopting spatial and temporal crop sequencing/crop rotations is a core principle. Crop rotation is the practice of growing different types of crops in a field over time. Intercropping is the practice of growing two or more crops in the same field simultaneously.\n\nTherefore, only options 2, 4, and 5 align with the core principles of conservation agriculture.  Options 1 and 3 are not directly related to the core tenets of conservation agriculture.\n"
    },
    {
        "Q.No.": 60,
        "question_text": "The term \"sixth mass extinction/sixth extinction\" is often mentioned in the news in the context of the discussion of:",
        "option_a": "Widespread monoculture practices in agriculture and large-scale commercial farming with indiscriminate use of chemicals in many parts of the world that may result in the loss of good native ecosystems.",
        "option_b": "Fears of a possible collision of a meteorite with the Earth in the near future in the manner it happened 65 million years ago that caused the mass extinction of many species including those of dinosaurs.",
        "option_c": "Large scale cultivation of genetically modified cropsin many parts of the world and promoting their cultivation in other parts of the world which may cause the disappearance of good native crop plants and the loss of food biodiversity.",
        "option_d": "Mankind's over-exploitation/misuse of natural resources, fragmentation/loss of natural habitats, destruction of ecosystems, pollution and global climate change.",
        "correct_option": "d",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (d)\n\nexplanation: The term \"sixth mass extinction\" or \"sixth extinction\" is frequently used in news reports to describe the ongoing, human-caused loss of biodiversity.  Option (d) accurately reflects this, citing mankind's actions as the primary driver: overexploitation of resources, habitat destruction, pollution, and climate change.  These factors are all significant contributors to the decline in species populations and ecosystems worldwide.\n\nMonoculture (a) and genetically modified crops (c) contribute to biodiversity loss, but are not the sole or primary causes of the sixth mass extinction.  A meteorite impact (b), while a cause of past mass extinctions, is not the current context for the term \"sixth mass extinction.\"\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Sixth mass extinction/sixth extinction:**  This refers to a period of accelerated species extinction currently underway, primarily driven by human activities.  It's characterized by a significantly higher rate of species loss than the background extinction rate.  Scientists debate the precise criteria and timing, but the overwhelming consensus points to a substantial biodiversity crisis.\n\n* **Monoculture:**  An agricultural practice where a single crop is cultivated over a large area.  This reduces biodiversity within the agricultural landscape and can make the system vulnerable to pests and diseases.  It often leads to the depletion of soil nutrients and requires heavy pesticide use.\n\n* **Genetically modified crops:** Crops whose genetic material has been altered using biotechnology. While offering potential benefits like increased yields and pest resistance, concerns exist about the impact on biodiversity, particularly the potential for gene flow to wild relatives and the displacement of traditional crop varieties.\n\n* **Overexploitation/misuse of natural resources:** The unsustainable use of natural resources, exceeding the rate at which they can replenish. This includes overfishing, deforestation, and excessive mining, leading to resource depletion and ecosystem damage.\n\n* **Fragmentation/loss of natural habitats:** The breaking up of large, continuous habitats into smaller, isolated patches. This reduces the available space for species, restricts their movement, and makes them more vulnerable to extinction.\n\n* **Destruction of ecosystems:** The significant alteration or complete loss of natural ecosystems, such as forests, wetlands, and coral reefs, due to human activities.  This leads to a cascade of negative impacts on biodiversity, climate regulation, and other ecosystem services.\n\n* **Pollution:** The contamination of the environment with harmful substances, including air, water, and soil pollution. Pollution can directly kill organisms, disrupt ecosystems, and contribute to climate change.\n\n* **Global climate change:** Long-term shifts in global temperatures and weather patterns, primarily caused by increased greenhouse gas emissions from human activities. Climate change alters habitats, disrupts ecological processes, and leads to species extinctions.\n\n* **Biodiversity loss:** The decline in the variety of life on Earth, encompassing species, genetic diversity, and ecosystem diversity. It is a major concern with far-reaching consequences for human well-being and the planet.\n\n* **IPCC (Intergovernmental Panel on Climate Change):** A scientific body established by the United Nations to assess the science related to climate change.  The IPCC provides regular reports summarizing the current state of knowledge on climate change, its impacts, and potential mitigation and adaptation strategies.\n\n* **Amazon Basin:** The world's largest river basin, encompassing parts of several South American countries.  It is characterized by its exceptionally high biodiversity, including the Amazon rainforest, a crucial carbon sink and habitat for countless species.\n\n* **Ganga-Brahmaputra basin:** A large river basin in the Indian subcontinent, encompassing parts of several Indian states.  It is a densely populated area with rich agricultural lands and significant biodiversity, but faces challenges from pollution and development.\n\n* **Toucans:**  A family of brightly colored birds found in the Neotropics, known for their large, colorful bills.  They are arboreal (tree-dwelling) and are an important part of the rainforest ecosystem.\n\n* **Manioc (Cassava):** A starchy tuberous root crop, an important staple food in many tropical regions.  It is relatively drought-tolerant and can grow in poor soils, making it a valuable food source in challenging environments.\n\n* **Kolkata:** A major city in eastern India, located on the Hooghly River. It is a significant port city and a center of commerce and culture.\n\n* **Deodars and firs:** Types of coniferous trees commonly found in mountainous regions with cool climates, such as the Himalayas.  They are adapted to harsh conditions and have needle-like leaves.\n\n* **Bengal tiger:** A subspecies of tiger found in the mangrove forests of the Sundarbans delta in India and Bangladesh.  It is an endangered species.\n\n* **Piranha:** A genus of freshwater fish found in South America, known for their sharp teeth and predatory behavior.  Certain species are known to feed on flesh.\n\n* **Maloca:** A traditional communal dwelling found among some indigenous groups in the Amazon rainforest.  They are often large structures with steeply sloping roofs.\n\n* **Bison (American buffalo):** A large, grazing mammal native to North America.  It was nearly driven to extinction by hunting but has since recovered through conservation efforts.\n\n* **Cowboys:**  Individuals who work on ranches, typically in the American West, managing cattle and other livestock.  Their traditional image is tied to horse riding and the use of lassoes.\n\n* **Velds:** The temperate grasslands of South Africa.  They are characterized by rolling plateaus and a varied landscape.\n\n* **Sahara desert:** The world's largest hot desert, located in North Africa.  It is characterized by extremely high temperatures, low rainfall, and sparse vegetation.\n\n* **Ladakh:** A cold desert region in the Himalayas, in the Indian state of Jammu and Kashmir.  It is known for its high altitude, extremely cold and dry climate, and unique culture.\n\n* **Yak:** A long-haired, domesticated bovine found in the high-altitude regions of Central Asia.  They are well-adapted to cold climates and provide milk, meat, and wool.\n\n* **Hemis, Thiksey, Shey, Lamayuru:**  Famous Buddhist monasteries located in Ladakh. They are significant centers of Buddhist culture and attract many tourists.\n\n* **Zoji La Pass:** A high mountain pass in the Himalayas, connecting Ladakh with the Kashmir Valley in India.  It is an important route for transport and trade.\n\n\n"
    },
    {
        "Q.No.": 61,
        "question_text": "With reference to the Indian Regional Navigation Satellite System (IRNSS), consider the following statements:\n1. IRNSS has three satellites in geostationary and four satellites in geosynchronous orbits.\n2. IRNSS covers entire India and about 5500 sq. km beyond its borders.\n3. India will have its own satellite navigation system with full global coverage by the middle of 2019.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "None",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. IRNSS (now renamed NAVIC) consists of seven satellites; three in geostationary orbit and four in geosynchronous orbit.\n\nStatement 2 is incorrect.  IRNSS provides navigation services to India and the region extending up to 1500 km from its borders, not 5500 sq km.\n\nStatement 3 is incorrect.  India's own satellite navigation system with full global coverage was not achieved by the middle of 2019.  While NAVIC provides regional coverage, it does not have global coverage.\n\n\nIRNSS/NAVIC: The Indian Regional Navigation Satellite System, now called NAVIC, is an independent regional navigation satellite system developed by India.  It provides accurate positioning and timing services to users within its coverage area.\n\nGeostationary orbit: A geostationary orbit is a special type of geosynchronous orbit where a satellite appears stationary relative to a point on the Earth's surface.\n\nGeosynchronous orbit: A geosynchronous orbit is an orbit where a satellite's orbital period matches the Earth's rotational period (approximately 24 hours).  However, unlike a geostationary orbit, the satellite's position relative to the Earth's surface may change over time.\n"
    },
    {
        "Q.No.": 62,
        "question_text": "Consider the following phenomena:\n1. Light is affected by gravity.\n2. The Universe is constantly expanding.\n3. Matter warps its surrounding space-time.\nWhich of the above is/are the prediction/predictions of Albert Einstein's General Theory of Relativity, often discussed in media?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation: Einstein's General Theory of Relativity predicts that light is affected by gravity (gravitational lensing) and that matter warps spacetime (causing gravitational effects).  The universe's expansion is supported by observational evidence and is consistent with General Relativity, but it's not a direct prediction in the same way the other two are.\n\nAlbert Einstein: A German-born theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics. His work is also known for its influence on the philosophy of science.\n\nGeneral Theory of Relativity: Einstein's theory of gravitation that explains gravity as a curvature of spacetime caused by mass and energy. It replaced Newton's law of universal gravitation and provides a more accurate description of gravity, especially in strong gravitational fields.\n"
    },
    {
        "Q.No.": 63,
        "question_text": "With reference to the Genetically Modified mustard (GM mustard) developed in India, consider the following statements:\n1. GM mustard has the genes of a soil bacterium that give the plant the property of pest-resistance to a wide variety of pests.\n2. GM mustard has the genes that allow the plant cross-pollination and hybridization.\n3. GM mustard has been developed jointly by the IARI and Punjab Agricultural University.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is incorrect. GM mustard does not have genes from a soil bacterium for pest resistance.  It uses genes for self-pollination to prevent cross-pollination with other mustard varieties.  Statement 2 is incorrect.  The whole point of the genetic modification is to *prevent* cross-pollination.  Statement 3 is correct. GM mustard was developed jointly by the Indian Agricultural Research Institute (IARI) and Punjab Agricultural University.\n\n**IARI (Indian Agricultural Research Institute):** A premier national institute in India dedicated to agricultural research and education.  It plays a crucial role in developing high-yielding crop varieties and improving agricultural practices across the country.\n\n**Punjab Agricultural University:** A leading agricultural university in India, known for its contributions to agricultural research and extension services, particularly in the Punjab region.  It focuses on improving crop production, livestock management, and other related areas.\n\n**GM Mustard:** Genetically modified mustard is a type of mustard plant whose genetic material has been altered using biotechnology techniques to enhance certain desirable traits. In this case, the aim was to improve the plant's characteristics for better yield and other beneficial attributes.  However, concerns about its potential impact on biodiversity and the environment led to delays in its commercialization.\n\n**GEAC (Genetic Engineering Appraisal Committee):**  A body in India responsible for assessing the safety of genetically modified organisms (GMOs) before they can be released for commercial use.  It evaluates potential risks to human health and the environment.\n"
    },
    {
        "Q.No.": 64,
        "question_text": "Consider the following pairs:\n   Terms sometimes seen in news             Context/Topic\n1. Belle II experiment                      Artificial Intelligence\n2. Blockchain technology                    Digital/ Cryptocurrency\n3. CRISPR-Cas9                              Particle Physics\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:\n\n* **Belle II experiment:** This is a particle physics experiment at the SuperKEKB accelerator in Japan. It studies B mesons to understand CP violation and other fundamental physics questions.  It's not related to Artificial Intelligence.\n\n* **Blockchain technology:** This is a distributed, decentralized, and public digital ledger used to record and verify transactions across many computers. It's heavily associated with cryptocurrencies like Bitcoin but also has applications beyond finance.\n\n* **CRISPR-Cas9:** This is a gene-editing technology that allows scientists to make precise changes to DNA.  It's a powerful tool in biology, medicine, and agriculture, not particle physics.\n\nTherefore, only pair 2 (Blockchain technology and Digital/ Cryptocurrency) is correctly matched.\n"
    },
    {
        "Q.No.": 65,
        "question_text": "Which of the following statements best describes \"carbon fertilization\"?",
        "option_a": "Increased plant growth due to increased concentration of carbon dioxide in the atmosphere",
        "option_b": "Increased temperature of Earth due to increased concentration of carbon dioxide in the atmosphere",
        "option_c": "Increased acidity of oceans as a result of increased concentration of carbon dioxide in the atmosphere",
        "option_d": "Adaptation of all living beings on Earth to the climate change brought about by the increased concentration of carbon dioxide in the atmosphere",
        "correct_option": "a",
        "subject": "environment",
        "year": 2018,
        "explanation": "```text\ncorrect_option: (a)\nexplanation: Carbon fertilization refers to the increased growth of plants due to the higher concentration of carbon dioxide (CO2) in the atmosphere.  CO2 is a crucial component of photosynthesis, the process by which plants convert light energy into chemical energy.  Higher CO2 levels can lead to increased photosynthetic rates, resulting in enhanced plant growth.\n\nCarbon dioxide (CO2): A greenhouse gas, naturally occurring in the atmosphere, vital for plant photosynthesis but also a major contributor to climate change through its heat-trapping properties.  Increased atmospheric CO2 levels are primarily due to human activities like burning fossil fuels.\n\nGlobal Warming/Increased Temperature of Earth: A gradual increase in the Earth's average surface temperature caused by the accumulation of greenhouse gases like CO2, methane, and nitrous oxide in the atmosphere, trapping heat and leading to climate change.\n\nOcean Acidification: The ongoing decrease in the pH of the Earth's oceans, caused by the absorption of excess CO2 from the atmosphere.  This increased acidity harms marine organisms, particularly those with calcium carbonate shells or skeletons.\n\nClimate Change: Long-term shifts in temperatures and weather patterns, mainly caused by human activities, such as burning fossil fuels, and deforestation.  It encompasses a wide range of impacts, including rising sea levels, more frequent and intense heatwaves, and changes in precipitation patterns.\n\nPermafrost: Permanently frozen ground, typically found in high-latitude and high-altitude regions. It contains significant amounts of organic carbon, and its thawing due to warming releases greenhouse gases into the atmosphere, accelerating climate change.  The thawing permafrost also affects infrastructure and ecosystems.\n\nPhytoplankton: Microscopic marine algae that form the base of the marine food web. They play a vital role in the global carbon cycle through photosynthesis and oxygen production.  Changes in ocean conditions due to climate change can impact phytoplankton populations and their functions.\n\nIPCC (Intergovernmental Panel on Climate Change): The leading international body for assessing the science related to climate change.  It provides regular reports summarizing the current state of scientific knowledge on climate change, its impacts, and potential mitigation and adaptation strategies.  It is a UN body.\n\nCFCs (Chlorofluorocarbons):  Synthetic chemicals previously used in refrigerants, aerosols, and other applications.  They were found to deplete the ozone layer, leading to increased ultraviolet radiation reaching the Earth's surface.  Their production and use have been largely phased out under the Montreal Protocol.\n\nOzone Layer: A region in the Earth's stratosphere containing a high concentration of ozone (O3), which absorbs most of the harmful ultraviolet radiation from the sun.  The ozone layer protects life on Earth from the damaging effects of UV radiation.\n\nGlaciers: Large masses of ice that persist year-round, found in mountainous regions and polar areas. They are highly sensitive to changes in temperature and precipitation, and their melting contributes to sea-level rise.\n```\n"
    },
    {
        "Q.No.": 66,
        "question_text": "When the alarm of your smartphone rings in the morning, you wake up and tap it to stop the alarm which causes your geyser to be switched on automatically. The smart mirror in your bathroom shows the day's weather and also indicates the level of water in your overhead tank. After you take some groceries from your refrigerator for making breakfast, it recognises the shortage of stock in it and places an order for the supply of fresh grocery items. When you step out of your house and lock the door, all lights, fans, geysers and AC machines get switched off automatically. On your way to office, your car warns you about traffic congestion ahead and suggests an alternative route, and if you are late for a meeting, it sends a message to your office accordingly.\nIn the context of emerging communication technologies, which one of the following terms best applies to the above scenario?",
        "option_a": "Border Gateway Protocol",
        "option_b": "Internet of Things",
        "option_c": "Internet Protocol",
        "option_d": "Virtual Private Network",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "* **correct_option:** (b)\n* **explanation:** The scenario describes a network of interconnected devices (smartphone, geyser, smart mirror, refrigerator, car, etc.) communicating with each other and exchanging data to automate tasks and provide information. This is the core concept of the Internet of Things (IoT).  \n\nBorder Gateway Protocol (BGP) is a routing protocol used on the internet to exchange routing information between autonomous systems. Internet Protocol (IP) is a set of communication protocols that define how data is transmitted over the internet. A Virtual Private Network (VPN) is a secure network connection that extends a private network across a public network.  None of these are directly related to the described smart home and automotive integration scenario.\n"
    },
    {
        "Q.No.": 67,
        "question_text": "With reference to solar power production in India, consider the following statements :\n1. India is the third largest in the world in the manufacture of silicon wafers used in photovoltaic units.\n2. The solar power tariffs are determined by the Solar Energy Corporation of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. While India is a significant player in the solar energy sector, it is not the third largest manufacturer of silicon wafers globally.  The exact ranking fluctuates, but  India's manufacturing capacity in this area is still developing.\n\nStatement 2 is also incorrect.  Solar power tariffs in India are not solely determined by the Solar Energy Corporation of India (SECI).  While SECI plays a major role in the procurement and development of solar power projects, tariff determination involves a more complex process, including bidding processes and market dynamics.  The tariffs are often influenced by factors like the technology used, the location of the project, and competitive bidding among developers.\n\n\n**Short notes on named entities:**\n\n* **Solar Energy Corporation of India (SECI):** A central public sector undertaking under the Ministry of New and Renewable Energy (MNRE), India.  SECI's primary role is to facilitate the development of solar energy projects in India.  It acts as a key player in procuring solar power through competitive bidding, thereby helping reduce costs and accelerate the growth of the sector.\n\n* **Silicon wafers:**  Thin, flat, and circular slices of silicon used in photovoltaic (PV) cells to convert sunlight into electricity. They are a crucial component of solar panels. The purity and quality of silicon wafers significantly impact the efficiency and cost-effectiveness of solar cells.\n\n* **Photovoltaic (PV) units:** Devices that directly convert sunlight into electricity using the photovoltaic effect.  PV units are the core components of solar panels and systems. Their efficiency and durability are critical factors determining the overall performance of a solar energy system.\n"
    },
    {
        "Q.No.": 68,
        "question_text": "The staple commodities of export by the English East India Company from Bengal in the middle of the 18th century were",
        "option_a": "Raw cotton, oil-seeds and opium",
        "option_b": "Sugar, salt, zinc and lead",
        "option_c": "Copper, silver, gold, spices and tea",
        "option_d": "Cotton, silk, saltpetre and opium",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (d)\n\nexplanation:The English East India Company's major exports from Bengal in the mid-18th century were cotton, silk, saltpetre (potassium nitrate, used in gunpowder), and opium.  \n\nCotton: A major textile fiber, widely cultivated in Bengal.  Silk: A luxury textile fiber produced through sericulture, also significant in Bengal's economy. Saltpetre: A crucial component in gunpowder, making it a strategic export. Opium: A highly addictive narcotic, increasingly important as a trade commodity by this period.\n\n\nThe other options are incorrect. While some of the commodities listed in options (a), (b), and (c) were traded, they weren't the staple exports from Bengal during the specified period.  Sugar was produced in Bengal, but not in the quantities of cotton, silk, saltpetre, and opium.  The other items in options (a), (b), and (c) were not major exports from Bengal at this time.\n"
    },
    {
        "Q.No.": 69,
        "question_text": "Which one of the following is a very significant aspect of the Champaran Satyagraha?",
        "option_a": "Active all-India participation of lawyers, students and women in the National Movement",
        "option_b": "Active involvement of Dalit and Tribal communities of India in the National Movement",
        "option_c": "Joining of peasant unrest to India's National Movement",
        "option_d": "Drastic decrease in the cultivation of plantation crops and commercial crops",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: The Champaran Satyagraha is significant for its role in connecting peasant unrest with India's broader National Movement.  It marked a pivotal moment where Gandhiji successfully mobilized peasants to fight for their rights, demonstrating the power of mass mobilization and civil disobedience in the struggle for independence.\n\nGandhiji:  Mohandas Karamchand Gandhi, a prominent leader of the Indian independence movement, is known for his philosophy of Satyagraha (non-violent resistance) and his role in achieving India's independence from British rule. His leadership in Champaran Satyagraha was a crucial step in his rise to national prominence.\n\nChamparan Satyagraha: A non-violent resistance movement led by Mahatma Gandhi in 1917 in Champaran district of Bihar, India.  It focused on the plight of indigo farmers exploited by British planters.  The movement's success in achieving concessions for the farmers was a major turning point in the Indian independence movement.\n\nDalit and Tribal communities:  Dalits (formerly known as \"untouchables\") and Tribal communities represent marginalized groups in Indian society. While their involvement in the Champaran Satyagraha was not the primary focus, their participation highlights the broader reach of Gandhi's movement beyond the educated elite.\n\nPeasant unrest:  The widespread discontent and resistance among Indian peasants against oppressive landowning systems and taxation policies during British rule. The Champaran Satyagraha is a prime example of how such unrest was channeled into the larger nationalist movement.\n\n\nActive all-India participation:  While the Champaran Satyagraha involved some all-India participation, it was primarily localized in Bihar.  The other options are not directly supported by the context of the Champaran Satyagraha.\n\nDrastic decrease in cultivation: There is no evidence in the provided text to suggest a drastic decrease in the cultivation of plantation crops after the Champaran Satyagraha.\n"
    },
    {
        "Q.No.": 70,
        "question_text": "Who among the following were the founders of the \"Hind Mazdoor Sabha\" established in 1948?",
        "option_a": "B. Krishna Pillai, E.M.S. Namboodiripad and K.C. George",
        "option_b": "Jayaprakash Narayan, Deen Dayal Upadhyay and M.N. Roy",
        "option_c": "C.P. Ramaswamy Iyer, K. Kamaraj and Veeresalingam Pantulu",
        "option_d": "Ashok Mehta, T.S. Ramanujam and G.G. Mehta",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (d)\n\nexplanation: Ashok Mehta, T.S. Ramanujam, and G.G. Mehta were the founders of the Hind Mazdoor Sabha, established in 1948.\n\nB. Krishna Pillai was a prominent communist leader in Kerala.  E.M.S. Namboodiripad was the first Chief Minister of Kerala and a key figure in the communist movement in India. K.C. George was an Indian politician and member of the Indian National Congress.\n\nJayaprakash Narayan was a socialist leader and known for his contribution to the Bhoodan movement. Deen Dayal Upadhyay was an ideologue of the Bharatiya Janata Party (BJP) and proponent of Integral Humanism. M.N. Roy was a Marxist revolutionary and philosopher.\n\nC.P. Ramaswamy Iyer was a prominent Indian politician and administrator. K. Kamaraj was a significant leader of the Indian National Congress. Veeresalingam Pantulu was a social reformer from Andhra Pradesh.\n"
    },
    {
        "Q.No.": 71,
        "question_text": "With reference to the religious practices in India, the \"Sthanakvasi\" sect belongs to",
        "option_a": "Buddhism",
        "option_b": "Jainism",
        "option_c": "Vaishnavism",
        "option_d": "Shaivism",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation: The Sthanakvasi sect is a branch of Jainism.  Jainism is an ancient Indian religion that emphasizes non-violence, self-discipline, and the pursuit of spiritual liberation.  Buddhism is another ancient Indian religion founded by Siddhartha Gautama, emphasizing enlightenment and the path to Nirvana. Vaishnavism and Shaivism are two major schools of Hinduism, with Vaishnavism centered on the worship of Vishnu and Shaivism focused on Shiva.\n"
    },
    {
        "Q.No.": 72,
        "question_text": "With reference to the cultural history of India, consider the following statements:\n1. White marble was used in making Buland Darwaza and Khankah at Fatehpur Sikri.\n2. Red sandstone and marble were used in making Bara Imambara and Rumi Darwaza at Lucknow.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Buland Darwaza and the Khankah at Fatehpur Sikri were built using white marble.  Fatehpur Sikri, a city built by Mughal emperor Akbar, is known for its impressive architecture which prominently features white marble. The Buland Darwaza is a massive gateway, while the Khankah is a Sufi monastery.\n\nStatement 2 is incorrect. The Bara Imambara and Rumi Darwaza in Lucknow primarily used red sandstone, not marble.  The Bara Imambara is a large Shia Muslim building complex known for its intricate architecture and the Bhool Bhulaiya (labyrinth).  The Rumi Darwaza is a gateway with a Persian architectural style.  While some decorative elements may incorporate marble, the primary material is red sandstone.\n"
    },
    {
        "Q.No.": 73,
        "question_text": "Which one of the following foreign travellers elaborately discussed about diamonds and diamond mines of India?",
        "option_a": "Francois Bernier",
        "option_b": "Jean-Baptiste Tavernier",
        "option_c": "Jean de Thevenot",
        "option_d": "Abbe Barthelemy Carre",
        "correct_option": "b",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation: Jean-Baptiste Tavernier was a French gem merchant and traveler who extensively documented his travels through Persia, India, and other parts of Asia. His six journeys to India, spanning several decades, provided detailed accounts of the diamond mines and trade in India, significantly contributing to European understanding of the Indian diamond industry.  His observations on the mining techniques, the quality of diamonds, and the social and economic aspects of diamond production in India are considered highly valuable.\n\nFrancois Bernier was a French physician and traveler who spent twelve years in Mughal India (1656-1668). While he wrote extensively about Mughal society, politics, and economy, his accounts don't focus specifically on diamonds and diamond mines to the same extent as Tavernier's.\n\nJean de Thevenot was a French traveler who visited India in the 17th century. His travelogue offers descriptions of various aspects of Indian life, but he didn't concentrate on diamonds.\n\nAbbe Barthelemy Carre was a French missionary and traveler who visited India in the 17th century. His observations primarily focused on religious and social aspects of India, not the diamond industry.\n"
    },
    {
        "Q.No.": 74,
        "question_text": "With reference to Indian history, who among the following is a future Buddha, yet to come to save the world?",
        "option_a": "Avalokiteshvara",
        "option_b": "Lokesvara",
        "option_c": "Maitreya",
        "option_d": "Padmapani",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2018,
        "explanation": "* **correct_option:** (c)\n* **explanation:** Maitreya is the future Buddha in Mahayana Buddhism, prophesied to appear on Earth to usher in an era of peace and enlightenment.  Avalokiteshvara (also known as Lokesvara), and Padmapani are important Bodhisattvas, beings who have achieved enlightenment but choose to remain in the world to help others attain it.  They are not future Buddhas.  A Bodhisattva is a person who is on the path to becoming a Buddha, but chooses to postpone their own enlightenment to help others.  Gautama Buddha was the historical Buddha, the founder of Buddhism.  His teachings focused on the Four Noble Truths and the Eightfold Path to overcome suffering and achieve Nirvana.\n"
    },
    {
        "Q.No.": 75,
        "question_text": "Which one of the following statements does not apply to the system of Subsidiary Alliance introduced by Lord Wellesley?",
        "option_a": "To maintain a large standing army at other's expense",
        "option_b": "To keep India safe from Napoleonic danger",
        "option_c": "To secure a fixed income for the Company",
        "option_d": "To establish British paramountcy over the Indian States",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:The Subsidiary Alliance system, implemented by Lord Wellesley, aimed to achieve several goals.  It allowed the British East India Company to maintain a large standing army in India at the expense of the Indian states (a). This provided a significant financial advantage to the Company (c).  The system also aimed to establish British paramountcy over the Indian states (d), effectively making them subordinate to British control.  However, the primary strategic goal was not solely to protect India from the Napoleonic threat (b), although that was a contributing factor. The system was broader in scope and aimed to consolidate British power and influence throughout India.\n\nLord Wellesley:  The Governor-General of India (1798-1805) who implemented the Subsidiary Alliance system as a key element of his expansionist policy in India.  His policies significantly increased British power and influence in the region.\n\nNapoleonic danger: The threat posed by Napoleon Bonaparte's ambitions in Europe, which indirectly affected India.  Wellesley saw the need to secure India against potential French invasion, though the Subsidiary Alliance was a more general strategy than solely anti-Napoleonic.\n\nBritish East India Company (EIC): A powerful trading company that gradually assumed political control over large parts of India.  The Subsidiary Alliance system was a major tool in consolidating the EIC's political dominance.\n"
    },
    {
        "Q.No.": 76,
        "question_text": "Which of the following led to the introduction of English Education in India?\n1. Charter Act of 1813\n2. General Committee of Public Instruction, 1823\n3. Orientalist and Anglicist Controversy\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (d)\n\nexplanation: The introduction of English education in India was a multifaceted process influenced by several factors.\n\n* **Charter Act of 1813:** This act mandated the allocation of one lakh rupees annually for the promotion of education in India, specifically focusing on the knowledge of modern sciences.  This marked a significant step towards government involvement in education, although the implementation was gradual and initially focused on Western knowledge.\n\n* **General Committee of Public Instruction, 1823:** Established to oversee the allocation of funds for education, this committee became the site of the Orientalist-Anglicist controversy.  This debate centered on whether to prioritize traditional Indian learning (Orientalist view) or Western knowledge through the English language (Anglicist view). The committee's existence and the controversy within it significantly shaped the direction of education policy.\n\n* **Orientalist and Anglicist Controversy:** This debate directly impacted the choice of medium of instruction and curriculum.  The Anglicists, led by figures like Lord Macaulay, eventually prevailed, leading to a greater emphasis on English education and Western knowledge.  The controversy highlighted conflicting views on the nature of Indian education and its role in relation to British rule.\n\n\nTherefore, all three factors – the Charter Act's financial provision, the Committee's establishment, and the resulting controversy – contributed to the introduction of English education in India.  The Charter Act provided the funding, the Committee provided the administrative structure, and the controversy shaped the curriculum and language choices.\n"
    },
    {
        "Q.No.": 77,
        "question_text": "Which one of the following is an artificial lake?",
        "option_a": "Kodaikanal (Tamil Nadu)",
        "option_b": "Kolleru (Andhra Pradesh)",
        "option_c": "Nainital (Uttarakhand)",
        "option_d": "Renuka (Himachal Pradesh)",
        "correct_option": "a",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation: Kodaikanal is an artificial lake created by building a dam across the Pambar River.  Kolleru is a natural lake. Nainital is a natural lake situated in a valley in the Kumaon Himalayas. Renuka is a natural lake in Himachal Pradesh.\n"
    },
    {
        "Q.No.": 78,
        "question_text": "With reference to Pradhan Mantri Kaushal Vikas Yojana, consider the following statements:\n1. It is the flagship scheme of the Ministry of Labour and Employment.\n2. It, among other things, will also impart training in soft skills, entrepreneurship, financial and digital literacy.\n3. It aims to align the competencies of the unregulated workforce of the country to the National Skill Qualification Framework.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (d)\nexplanation:All three statements are correct regarding the Pradhan Mantri Kaushal Vikas Yojana (PMKVY).\n\n1.  **It is the flagship scheme of the Ministry of Labour and Employment:** PMKVY is indeed a flagship scheme under the Ministry of Skill Development and Entrepreneurship, not the Ministry of Labour and Employment.  This statement is therefore incorrect.\n\n2.  **It, among other things, will also impart training in soft skills, entrepreneurship, financial and digital literacy:** PMKVY's scope includes training in soft skills, entrepreneurship, financial literacy, and digital literacy, in addition to vocational skills. This statement is correct.\n\n3.  **It aims to align the competencies of the unregulated workforce of the country to the National Skill Qualification Framework:** A primary goal of PMKVY is to align the skills of the unregulated workforce with the National Skills Qualification Framework (NSQF), thereby improving their employability. This statement is correct.\n\nTherefore, only statements 2 and 3 are correct.  The provided text does not contain information to clarify the ministry under which PMKVY falls.  The other information provided is irrelevant to the question.\n"
    },
    {
        "Q.No.": 79,
        "question_text": "In 1920, which of the following changed its name to \"Swarajya Sabha\"?",
        "option_a": "All India Home Rule League",
        "option_b": "Hindu Mahasabha",
        "option_c": "South Indian Liberal Federation",
        "option_d": "The Servants of India Society",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation: The South Indian Liberal Federation changed its name to Swarajya Sabha in 1920.\n\nThe All India Home Rule League was a movement advocating for self-rule in India, founded during World War I.  The Hindu Mahasabha was a Hindu nationalist organization that emerged in the early 20th century. The Servants of India Society was a socio-political organization founded by Gopal Krishna Gokhale to train Indians in public service.  The South Indian Liberal Federation was a political organization in South India that later transformed into the Swarajya Sabha, reflecting a shift towards more assertive demands for self-governance.\n"
    },
    {
        "Q.No.": 80,
        "question_text": "Which among the following events happened earliest ?",
        "option_a": "Swami Dayanand established Arya Samaj.",
        "option_b": "Dinabandhu Mitra wrote Neeldarpan.",
        "option_c": "Bankim Chandra Chattopadhyay wrote Anandmath.",
        "option_d": "Satyendranath Tagore became the first Indian to succeed in the Indian Civil Services Examination.",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (d)\n\nexplanation: Satyendranath Tagore's success in the Indian Civil Services Examination happened in 1863.  The other events occurred later:\n\n* **Swami Dayanand established Arya Samaj:**  Arya Samaj was founded in 1875 by Swami Dayanand Saraswati.  It was a Hindu reform movement advocating for a return to Vedic principles, monotheism, and social reform.\n\n* **Dinabandhu Mitra wrote Neeldarpan:**  Neeldarpan, a Bengali-language play depicting the suffering of indigo farmers in Bengal, was written and published in 1860. Dinabandhu Mitra was a Bengali playwright and social reformer.\n\n* **Bankim Chandra Chattopadhyay wrote Anandmath:** Anandmath, a Bengali novel by Bankim Chandra Chattopadhyay, was published in 1882.  It's famous for containing the song \"Vande Mataram,\" which later became a nationalist anthem.\n\nSatyendranath Tagore (1842-1923):  The eldest son of Debendranath Tagore and elder brother of Rabindranath Tagore, he was a pioneering figure for Indians in the British Indian Civil Service, breaking barriers for his countrymen.\n\nSwami Dayanand Saraswati (1824-1883): A prominent figure in 19th-century India, he founded the Arya Samaj, a reform movement that advocated for a return to Vedic principles and social reform.\n\nDinabandhu Mitra (1830-1873): A Bengali playwright known for his powerful and socially conscious dramas, particularly *Neeldarpan*, which exposed the plight of indigo farmers under British rule.\n\nBankim Chandra Chattopadhyay (1838-1894): A highly influential Bengali novelist, poet, and journalist of the 19th century, he is remembered for works like *Anandmath*, which played a significant role in the Indian independence movement.\n"
    },
    {
        "Q.No.": 81,
        "question_text": "Which of the following is/are the possible consequence/s of heavy sand mining in riverbeds?\n1. Decreased salinity in the river\n2. Pollution of groundwater\n3. Lowering of the water-table\nSelect the correct answer using the code given below :",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation: Heavy sand mining in riverbeds leads to several negative consequences.  Lowering of the water table (3) is a direct result as the mining removes the riverbed material that helps retain groundwater.  Pollution of groundwater (2) can occur due to the release of sediment and other pollutants into the water table during mining activities.  Decreased salinity in the river (1) is not a direct consequence; in fact, it might increase salinity in some areas due to changes in water flow and mixing. Therefore, only options 2 and 3 are correct consequences.\n\nSand mining: The extraction of sand from riverbeds, often for construction purposes.\n\nRiverbeds: The bottom of a river channel, formed by sediment accumulation.\n\nWater table: The upper surface of groundwater, the level below which the ground is saturated with water.\n\nGroundwater: Water present beneath the Earth's surface in soil pore spaces and rock fractures.\n\nSalinity: The concentration of salts in water.  High salinity in rivers is usually associated with increased evaporation in arid regions or saltwater intrusion.\n"
    },
    {
        "Q.No.": 82,
        "question_text": "With reference to agricultural soils, consider the following statements:\n1. A high content of organic matter in soil drastically reduces its water holding capacity.\n2. Soil does not play any role in the sulphur cycle.\n3. Irrigation over a period of time can contribute to the salinization of some agricultural lands.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect.  A high content of organic matter in soil actually increases its water holding capacity. Organic matter improves soil structure, creating more pore space for water retention.\n\nStatement 2 is incorrect. Soil plays a crucial role in the sulfur cycle.  Microorganisms in soil convert organic sulfur into inorganic forms that plants can absorb, and vice-versa.  The soil acts as a reservoir for sulfur.\n\nStatement 3 is correct.  Irrigation, especially if the water source is high in salts, can lead to the accumulation of salts in the soil over time. This process is known as salinization, which reduces soil fertility and harms plant growth.  Evaporation of irrigation water leaves behind dissolved salts.\n\nTherefore, only statement 3 is correct.\n"
    },
    {
        "Q.No.": 83,
        "question_text": "The Partnership for Action on Green Economy (PAGE), a UN mechanism to assist countries transition towards greener and more inclusive economies, emerged at",
        "option_a": "The Earth Summit on Sustainable Development 2002, Johannesburg",
        "option_b": "The United Nations Conference on Sustainable Development 2012, Rio de Janeiro",
        "option_c": "The United Nations Framework Convention on Climate Change 2015, Paris",
        "option_d": "The World Sustainable Development Summit 2016, New Delhi",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation:The Partnership for Action on Green Economy (PAGE) is a United Nations initiative supporting countries' transitions to greener, more inclusive economies.  While the provided text doesn't state PAGE's origin, options (a), (b), (c), and (d) refer to significant environmental conferences: The Earth Summit on Sustainable Development (Johannesburg, 2002), the United Nations Conference on Sustainable Development (Rio de Janeiro, 2012), the United Nations Framework Convention on Climate Change (Paris, 2015), and the World Sustainable Development Summit (New Delhi, 2016).  These summits all focused on sustainable development and environmental issues, making it plausible that PAGE emerged from one of them.  Further research is needed to pinpoint its exact origin.\n\n* **The Earth Summit on Sustainable Development 2002, Johannesburg:**  This summit, also known as Rio+10, reviewed progress on the 1992 Rio Declaration and Agenda 21, focusing on implementing sustainable development goals.\n* **The United Nations Conference on Sustainable Development 2012, Rio de Janeiro:**  Also known as Rio+20, this conference addressed the challenges of sustainable development in the context of global environmental changes and economic crises.\n* **The United Nations Framework Convention on Climate Change 2015, Paris:** This conference resulted in the Paris Agreement, a legally binding international treaty on climate change mitigation, adaptation, and finance.\n* **The World Sustainable Development Summit 2016, New Delhi:** An annual event focusing on sustainable development solutions, particularly relevant to developing nations.\n* **Partnership for Action on Green Economy (PAGE):** A UN mechanism assisting countries in transitioning towards greener and more inclusive economies.  The provided text lacks the information to determine its origin year and location.\n\n"
    },
    {
        "Q.No.": 84,
        "question_text": "\"3D printing\" has applications in which of the following?\n1. Preparation of confectionery items\n2. Manufacture of bionic ears\n3. Automotive industry\n4. Reconstructive surgeries\n5. Data processing technologies\nSelect the correct answer using the code given below:",
        "option_a": "1, 3 and 4 only",
        "option_b": "2, 3 and 5 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation:3D printing, or additive manufacturing, is a process of creating three-dimensional objects from a digital design by successively adding material layer by layer.  The provided text mentions its use with various materials including thermoplastics, metals, resins, and biomaterials.\n\nConfectionery items (1): 3D printing can create intricate and customized confectionery designs, showcasing its versatility beyond traditional manufacturing methods.\n\nBionic ears (2):  The biocompatibility of certain 3D printing materials allows for the creation of customized bionic ears, representing a significant advancement in medical technology.\n\nAutomotive industry (3): 3D printing is used in the automotive industry for prototyping, creating customized parts, and even producing end-use components, improving efficiency and design flexibility.\n\nReconstructive surgeries (4):  Bioprinting, a subset of 3D printing, enables the creation of tissues and organs for reconstructive surgeries, offering personalized solutions for patients.\n\nData processing technologies (5):  3D printing does not have direct applications in data processing technologies.  Data processing relies on software and hardware designed for information manipulation, not physical object creation.  Therefore, option 5 is incorrect.\n\nThe National Strategy on Additive Manufacturing (mentioned in the provided text) highlights the government's support for advancing 3D printing technologies and expanding its applications across various sectors.  The economic benefits, including increased Gross Value Added (GVA), are also emphasized.  The challenges mentioned include high costs and a shortage of skilled manpower.\n"
    },
    {
        "Q.No.": 85,
        "question_text": "Consider the following statements:\n1. The Barren Island volcano is an active volcano located in the Indian territory.\n2. Barren Island lies about 140 km east of Great Nicobar.\n3. The last time the Barren Island volcano erupted was in 1991 and it has remained inactive since then.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "3 only",
        "option_d": "1 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. Barren Island volcano is an active volcano located in the Andaman and Nicobar Islands, which is an Indian territory.  Statement 2 is likely correct,  as the distance between Barren Island and Great Nicobar is approximately 140 km. However, precise verification requires a map. Statement 3 is incorrect. While the last major eruption was in 1991, the volcano has shown signs of activity since then, with smaller eruptions and volcanic activity reported in subsequent years.  Therefore, only statement 1 is definitively correct.\n\nBarren Island: A volcanic island in the Andaman Sea, part of the Andaman and Nicobar Islands. It is the only active volcano in South Asia.\n\nGreat Nicobar: The southernmost island of the Andaman and Nicobar archipelago.  It is located to the west of Barren Island.\n"
    },
    {
        "Q.No.": 86,
        "question_text": "Why is a plant called Prosopis juliflora often mentioned in news?",
        "option_a": "Its extract is widely used in cosmetics.",
        "option_b": "It tends to reduce the biodiversity in the area in which it grows.",
        "option_c": "Its extract is used in the synthesis of pesticides.",
        "option_d": "None of the above",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation: Prosopis juliflora is often mentioned in news reports because of its invasive nature and negative impact on biodiversity.  It aggressively outcompetes native plant species, leading to a reduction in biodiversity in the areas where it establishes itself.  This makes it a significant ecological concern.\n\nProsopis juliflora:  Also known as mesquite, this is a thorny, drought-resistant tree or shrub native to the Americas. It has been introduced to many parts of the world, where it has become an invasive species in various ecosystems due to its rapid growth and ability to thrive in harsh conditions.  Its invasiveness often leads to significant ecological damage.\n"
    },
    {
        "Q.No.": 87,
        "question_text": "Consider the following statements:\n1. Most of the world's coral reefs are in tropical waters.\n2. More than one-third of the world's coral reefs are located in the territories of Australia, Indonesia and Philippines.\n3. Coral reefs host far more number of animal phyla than those hosted by tropical rainforests.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct.  Most coral reefs are found in tropical and subtropical waters because these areas provide the warm water temperatures (ideally between 23-29°C) necessary for coral growth and survival.\n\nStatement 2 is correct.  The Coral Triangle, encompassing areas of Australia, Indonesia, and the Philippines, is known to contain more than one-third of the world's coral reefs.  This region's high biodiversity and unique geographic features create ideal conditions for reef development.\n\nStatement 3 is incorrect. While coral reefs are incredibly biodiverse, tropical rainforests generally host a greater number of animal phyla.  Coral reefs boast high species richness within a limited number of phyla, whereas rainforests exhibit a broader representation across various phyla.\n\nTherefore, only statements 1 and 2 are correct.\n\n**Short notes on named entities:**\n\n* **Australia:** A large island nation in the Southern Hemisphere, known for its diverse ecosystems, including the Great Barrier Reef, the world's largest coral reef system.\n* **Indonesia:** An archipelago nation in Southeast Asia, with extensive coastlines and a high number of coral reefs, contributing significantly to the Coral Triangle.\n* **Philippines:** An archipelago nation in Southeast Asia, also located within the Coral Triangle, possessing a rich marine biodiversity and numerous coral reefs.\n* **Tropical waters:** Waters found in tropical regions, characterized by warm temperatures, high sunlight, and generally calm conditions, which are essential for the growth of most coral reefs.\n* **Coral reefs:** Underwater ecosystems characterized by reef-building corals.  They are highly biodiverse and provide numerous ecosystem services.  Threats to coral reefs include coral bleaching, pollution, and overfishing.\n* **Tropical rainforests:** Forests found in tropical regions, characterized by high rainfall and high biodiversity. They are known for their high species richness across many phyla.\n\n"
    },
    {
        "Q.No.": 88,
        "question_text": "\"Momentum for Change: Climate Neutral Now\" is an initiative launched by",
        "option_a": "The Intergovernmental Panel on Climate Change",
        "option_b": "The UNEP Secretariat",
        "option_c": "The UNFCCC Secretariat",
        "option_d": "The World Meteorological Organization",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:The \"Momentum for Change: Climate Neutral Now\" initiative was launched by the UNFCCC Secretariat.\n\nThe UNFCCC (United Nations Framework Convention on Climate Change) is an international environmental treaty adopted in 1992.  Its secretariat, based in Bonn, Germany, supports the implementation of the treaty, including initiatives like \"Climate Neutral Now,\" which aims to encourage individuals, businesses, and governments to achieve carbon neutrality.\n\nThe IPCC (Intergovernmental Panel on Climate Change) assesses the science related to climate change.  The UNEP (United Nations Environment Programme) is a leading global environmental authority. The WMO (World Meteorological Organization) is a specialized agency of the UN focused on weather, climate, and water resources.\n"
    },
    {
        "Q.No.": 89,
        "question_text": "With reference to educational institutions during colonial rule in India, consider the following pairs:\n   Institution                                      Founder\n1. Sanskrit College at Benaras                      William Jones\n2. Calcutta Madarsa                                 Warren Hastings\n3. Fort William College                             Arthur Wellesley\nWhich of the pairs given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation: The Calcutta Madarsa was founded by Warren Hastings in 1781.  The Sanskrit College at Benaras was founded by Jonathan Duncan in 1791, not William Jones. Fort William College was established by Lord Wellesley in 1800.\n\nWarren Hastings:  The first Governor-General of Bengal, Hastings played a significant role in establishing British power in India. His administration is marked by both achievements and controversies.  The establishment of the Calcutta Madarsa is one of his notable contributions.\n\nCalcutta Madarsa: Established in 1781, this institution was aimed at promoting the study of Islamic law and related subjects. It represented an early attempt by the British to understand and engage with the existing educational systems in India.\n\nJonathan Duncan: A British official in the East India Company, Duncan is remembered for his efforts in promoting education and cultural preservation in India. His founding of the Sanskrit College at Benaras reflects his interest in traditional Indian learning.\n\nSanskrit College at Benaras: Established in 1791, this college focused on the study of Hindu law, philosophy, and Sanskrit literature. It was one of the early institutions established by the British to support traditional Indian learning.\n\nLord Wellesley:  Governor-General of India from 1798 to 1805, Wellesley pursued an ambitious policy of expanding British influence and control in India.  He is known for his military achievements and for his efforts to establish a more systematic system of governance.\n\nFort William College: Founded in 1800, this college was primarily intended to train civil servants of the East India Company. It played a crucial role in the development of English-language education and the spread of Western knowledge in India.  It aimed to improve the administrative capacity of the British in India.\n\nWilliam Jones: A renowned scholar and Orientalist, Jones founded the Asiatic Society of Bengal in 1784. His contributions were mainly in the field of Indology and promoting the study of Indian languages and culture. He was not associated with the founding of any of the institutions listed in the question.\n"
    },
    {
        "Q.No.": 90,
        "question_text": "Consider the following pairs:\n   Regions sometimes mentioned in news              Country\n1. Catalonia                                        Spain\n2. Crimea                                           Hungary\n3. Mindanao                                         Philippines\n4. Oromia                                           Nigeria\nWhich of the pairs given above are correctly matched?",
        "option_a": "1, 2 and 3",
        "option_b": "3 and 4 only",
        "option_c": "1 and 3 only",
        "option_d": "2 and 4 only",
        "correct_option": "c",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation: Catalonia is an autonomous community in Spain. Mindanao is an island in the southern Philippines. Crimea is a peninsula in Ukraine, not Hungary. Oromia is a region in Ethiopia, not Nigeria. Therefore, only pairs 1 and 3 are correctly matched.\n\nCatalonia: An autonomous community in northeastern Spain with a distinct Catalan language and culture.  There have been long-standing movements for independence from Spain.\n\nCrimea: A peninsula in southern Ukraine, annexed by Russia in 2014. The annexation is internationally unrecognized.\n\nMindanao: The second-largest island in the Philippines, known for its diverse ethnic groups and ongoing conflict.\n\nOromia: The largest region in Ethiopia, inhabited predominantly by the Oromo people.  It is a significant area for Ethiopian politics and often features in news related to ethnic tensions.\n"
    },
    {
        "Q.No.": 91,
        "question_text": "Consider the following events:\n1. The first democratically elected communist party government formed in a State in India.\n2. India's then largest bank, 'Imperial Bank of India', was renamed 'State Bank of India'.\n3. Air India was nationalised and became the national carrier.\n4. Goa became a part of independent India.\nWhich of the following is the correct chronological sequence of the above events?",
        "option_a": "4-1-2-3",
        "option_b": "3-2-1-4",
        "option_c": "4-2-1-3",
        "option_d": "3-1-2-4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:The events are:\n\n4. Goa's annexation to India (1961)\n1. Formation of the first democratically elected communist government in Kerala (1957)\n2. Imperial Bank of India's renaming to State Bank of India (1955)\n3. Air India's nationalisation (1953)\n\n\nTherefore, the correct chronological order is 4-1-2-3.\n\n**Short Notes on Named Entities:**\n\n* **Imperial Bank of India:**  India's largest bank before independence, established in 1921 through the merger of several Presidency banks. It played a vital role in the country's financial system.  It was later renamed the State Bank of India.\n\n* **State Bank of India:**  India's largest public sector bank, formed in 1955 from the Imperial Bank of India.  It's a crucial institution in India's financial landscape, playing a key role in national development.\n\n* **Air India:** India's international airline, nationalized in 1953.  It was a significant symbol of national pride and played a key role in connecting India to the rest of the world.  It has since been privatized.\n\n* **Goa:** A state in western India, formerly a Portuguese colony. It was annexed by India in 1961, ending Portuguese colonial rule in India.  Known for its beaches, culture, and history.\n\n* **Kerala:** A state in southwest India known for its unique culture, spices, backwaters, and high literacy rate.  It was the site of India's first democratically elected communist government.\n\n* **Communist Party of India (CPI):** One of India's major communist parties, established in 1925. It has played a significant role in Indian politics, advocating for socialist and communist ideals.  It has experienced internal splits and ideological shifts over time.\n"
    },
    {
        "Q.No.": 92,
        "question_text": "Right to Privacy is protected as an intrinsic part of Right to Life and Personal Liberty. Which of the following in the Constitution of India correctly and appropriately imply the above statement?",
        "option_a": "Article 14 and the provisions under the 42nd Amendment to the Constitution",
        "option_b": "Article 17 and the Directive Principles of State Policy in Part IV",
        "option_c": "Article 21 and the freedoms guaranteed in Part III",
        "option_d": "Article 24 and the provisions under the 44th Amendment to the Constitution",
        "correct_option": "c",
        "subject": "polity",
        "year": 2018,
        "explanation": "correct_option: (c)\n\nexplanation: Article 21 of the Indian Constitution guarantees the right to life and personal liberty.  The Supreme Court of India has interpreted this right to encompass the right to privacy as an intrinsic part of it.  Part III of the Constitution contains the Fundamental Rights, including Article 21 and other freedoms that contribute to personal liberty.  Therefore, Article 21 and the freedoms guaranteed in Part III correctly and appropriately imply that the right to privacy is an intrinsic part of the right to life and personal liberty.\n\n\nArticle 14: Guarantees equality before the law and equal protection of the laws within the territory of India.  It allows for reasonable classification but prohibits arbitrary discrimination.\n\n42nd Amendment:  A significant amendment to the Indian Constitution, it added the words \"socialist\" and \"secular\" to the Preamble and made several changes to Directive Principles and Fundamental Rights.\n\nArticle 17: Abolishes untouchability and its practice in any form.\n\nDirective Principles of State Policy (Part IV):  Non-justiciable guidelines for the state to strive towards social and economic justice.\n\nArticle 24:  Prohibits the employment of children below the age of 14 in hazardous industries.\n\n44th Amendment:  Another significant amendment; it introduced several changes, including modifications to the Fundamental Rights and Directive Principles.  It aimed to address some of the concerns raised about the 42nd Amendment.\n\nArticle 32:  Guarantees the right to constitutional remedies, enabling citizens to approach the Supreme Court for enforcement of their fundamental rights.\n"
    },
    {
        "Q.No.": 93,
        "question_text": "Consider the following:\n1. Areca nut\n2. Barley\n3. Coffee\n4. Finger millet\n5. Groundnut\n6. Sesaum\n7. Tamarind\nThe Cabinet Committee on Economic Affairs has announced the Minimum Support Price for which of the above?",
        "option_a": "1, 2, 3 and 6 only",
        "option_b": "2, 4, 5 and 7 only",
        "option_c": "1, 3, 4, 5 and 6 only",
        "option_d": "1, 2, 3, 4, 5, 6 and 7",
        "correct_option": "b",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:The Cabinet Committee on Economic Affairs (CCEA) announces Minimum Support Prices (MSPs) for various agricultural commodities to ensure price stability and protect farmers' interests.  Based on the provided text, the CCEA has announced MSPs for barley, finger millet, groundnut, and tamarind.  These are options 2, 4, 5, and 7.  Therefore, the correct option is (b).\n\nAreca nut: A nut obtained from the areca palm tree, often chewed with betel leaves. It has stimulant properties.\n\nBarley: A cereal grain used for food, animal feed, and brewing.  It's a significant crop globally.\n\nCoffee: A beverage crop with beans containing caffeine, a stimulant.  It's a major export commodity for many countries.\n\nFinger millet: A nutritious cereal grain, a staple food in some parts of the world.  It's drought-resistant.\n\nGroundnut (Peanut): A legume crop producing edible seeds rich in oil and protein.  It's a valuable source of nutrition.\n\nSesame: An oilseed crop producing seeds used for oil extraction and as a food ingredient. The oil is valued for its flavor and nutritional properties.\n\nTamarind: A tropical fruit tree producing pods containing a sweet and sour pulp used in cuisine and traditional medicine.  It's grown in many tropical regions.\n\nMinimum Support Price (MSP): A price set by the government for agricultural products to ensure a minimum income for farmers.  It aims to prevent price fluctuations that could harm farmers.\n\nCabinet Committee on Economic Affairs (CCEA): A committee of the Indian government responsible for making decisions on economic matters.\n"
    },
    {
        "Q.No.": 94,
        "question_text": "In which one of the following States is Pakhui Wildlife Sanctuary located?",
        "option_a": "Arunachal Pradesh",
        "option_b": "Manipur",
        "option_c": "Meghalaya",
        "option_d": "Nagaland",
        "correct_option": "a",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (a)\nexplanation: Pakhui Wildlife Sanctuary is located in Arunachal Pradesh.  Arunachal Pradesh is a state in Northeast India, known for its biodiversity and rich flora and fauna.  Manipur, Meghalaya, and Nagaland are also states in Northeast India, each with their own unique ecological features and protected areas.  The provided text does not contain information about the specific species found in Pakhui Wildlife Sanctuary.\n"
    },
    {
        "Q.No.": 95,
        "question_text": "With reference to India's satellite launch vehicles, consider the following statements:\n1. PSLVs launch the satellites useful for Earth resources monitoring whereas GSLVs are designed mainly to launch communication satellites.\n2. Satellites launched by PSLVs appear to remain permanently fixed in the same position in the sky, as viewed from a particular location on Earth.\n3. GSLV Mk III is a four-stage launch vehicle with the first and third stages using solid rocket motors; and the second and fourth stages using liquid rocket engines.\nWhich one of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 2",
        "option_d": "1 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is correct. PSLVs (Polar Satellite Launch Vehicles) are primarily used for launching smaller satellites into lower Earth orbits, often for Earth observation missions like resources monitoring. GSLVs (Geosynchronous Satellite Launch Vehicles), on the other hand, are designed to launch heavier communication satellites into geostationary orbits.\n\nStatement 2 is incorrect. Satellites launched by PSLVs into lower Earth orbits do not remain fixed in the same position in the sky. Their apparent position changes as the Earth rotates.  Geostationary satellites launched by GSLVs, however, do appear to remain fixed because their orbital period matches Earth's rotation.\n\nStatement 3 is incorrect. The GSLV Mk III is a three-stage launch vehicle, not four.  The first stage uses solid rocket motors, the second stage uses liquid rocket engines, and the third stage also uses a cryogenic liquid engine.\n\n\nShort notes on named entities:\n\nPSLV (Polar Satellite Launch Vehicle): An Indian expendable launch system used to place satellites into polar and other low Earth orbits.  Known for its reliability and cost-effectiveness.\n\nGSLV (Geosynchronous Satellite Launch Vehicle): A heavier-lift Indian launch vehicle designed to place satellites into geostationary orbits, typically for communication purposes.  Different marks (Mk I, Mk II, Mk III) represent successive improvements in capability.\n\nGSLV Mk III: The most powerful Indian launch vehicle currently in operation, capable of launching heavier payloads into geostationary transfer orbits.  It represents a significant step forward in India's space launch capabilities.\n"
    },
    {
        "Q.No.": 96,
        "question_text": "With reference to the governance of public sector banks in India, consider the following statements:\n1. Capital infusion in public sector banks by the Government of India has steadily increased in the last decade.\n2. The merger of associate banks with the parent State Bank of India has been effected.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is partially correct. While the government has infused capital into public sector banks, the increase hasn't been consistently steady over the last decade. There have been fluctuations depending on the financial health of the banks and government priorities. Statement 2 is correct.  Several associate banks were merged with the State Bank of India (SBI) in 2017 to streamline operations and improve efficiency.\n\nGovernment of India: The central government of India, responsible for various policies and initiatives, including those related to public sector banks.\n\nPublic Sector Banks: Banks owned and controlled by the Indian government, playing a crucial role in the nation's financial system.  They provide a wide range of banking services to individuals and businesses.  Their governance and financial health are major concerns for the government.\n\nState Bank of India (SBI): India's largest public sector bank, created through the merger of several associate banks and playing a significant role in the country's economy.  It offers a wide range of financial services.\n"
    },
    {
        "Q.No.": 97,
        "question_text": "Consider the following items:\n1. Cereal grains hulled\n2. Chicken eggs cooked\n3. Fish processed and canned\n4. Newspapers containing advertising material\nWhich of the above items is/are exempted under GST (Goods and Services Tax)?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2018,
        "explanation": "correct_option: (a)\n\nexplanation:  The provided text does not contain information about GST exemptions.  Therefore, a definitive answer cannot be provided based solely on the given context.  More information is needed to determine which items, if any, are GST exempt.  The context does discuss food processing, agricultural marketing, and government policies related to food procurement and distribution, but it does not provide details about GST.\n"
    },
    {
        "Q.No.": 98,
        "question_text": "Consider the following statements:\n1. The definition of \"Critical Wildlife Habitat\" is incorporated in the Forest Rights Act, 2006.\n2. For the first time in India, Baigas have been given Habitat Rights.\n3. Union Ministry of Environment, Forest and Climate Change officially decides and declares Habitat Rights for Primitive and Vulnerable Tribal Groups in any part of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\n\nexplanation:The Forest Rights Act, 2006, does not define \"Critical Wildlife Habitat\".  While the Act recognizes the rights of forest-dwelling communities, it doesn't specifically address the concept of critical wildlife habitats in its definition of rights.  The second statement is correct.  The Baiga tribe in India has been granted habitat rights, marking a first for the country. The third statement is incorrect. The Union Ministry of Environment, Forest and Climate Change does play a role in conservation and tribal rights, but it's not the sole authority that decides and declares habitat rights for all primitive and vulnerable tribal groups across India. The process involves multiple stakeholders and legal frameworks.\n\n**Short notes on named entities:**\n\n* **Forest Rights Act, 2006:**  This Act in India recognizes the rights of forest-dwelling communities to forest resources, including land and other resources that they have traditionally used and occupied.  It aims to address historical injustices and promote sustainable forest management.\n\n* **Baigas:** An indigenous tribal group primarily residing in central India, known for their close connection with forest ecosystems and traditional practices.  Their livelihoods and cultural identity are deeply intertwined with the forest.\n\n* **Union Ministry of Environment, Forest and Climate Change:** The Indian government ministry responsible for environmental protection, forest conservation, and climate change mitigation.  It formulates policies, implements programs, and oversees various environmental regulations.\n\n* **Habitat Rights:** Rights granted to certain groups, often indigenous communities, to reside in and utilize specific habitats crucial to their cultural survival and way of life.  These rights are usually linked to land and resource access.\n\n* **Primitive and Vulnerable Tribal Groups:** A categorization used in India to identify tribal communities facing socio-economic and cultural vulnerabilities.  These groups often have unique customs and dependencies on forest resources.\n"
    },
    {
        "Q.No.": 99,
        "question_text": "Consider the following:\n1. Birds\n2. Dust blowing\n3. Rain\n4. Wind blowing\nWhich of the above spread plant diseases?",
        "option_a": "1 and 3 only",
        "option_b": "3 and 4 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2018,
        "explanation": "correct_option: (c)\nexplanation: Birds, wind, and dust can all spread plant diseases.  Birds can carry pathogens on their feathers or in their digestive tracts. Wind can carry fungal spores and bacteria over long distances. Dust can also transport pathogens. Rain, while it can facilitate the spread of some diseases by washing pathogens from plants to the soil or other plants, is not a primary vector in the same way the other three are.  Therefore, the correct option is (c).\n\nBirds: Birds are animals characterized by feathers, wings, beaks, and laying hard-shelled eggs.  Many bird species play crucial roles in seed dispersal and pollination, but some can also act as vectors for plant diseases.\n\nDust blowing: Dust storms can carry fungal spores, bacteria, and viruses over long distances, contributing to the spread of plant diseases.  The fine particles of dust can act as a transport medium for these pathogens.\n\nRain: Rain is precipitation in the form of liquid water droplets. While rain can help spread some plant diseases by washing away pathogens or facilitating their dispersal, it's not the primary means of transmission compared to wind or birds.\n\nWind blowing: Wind is the movement of air caused by differences in atmospheric pressure. It's a significant factor in spreading plant diseases, carrying lightweight spores and other pathogens over vast distances.\n"
    },
    {
        "Q.No.": 100,
        "question_text": "With reference to organic farming in India, consider the following statements:\n1. 'The National Programme for Organic Production' (NPOP) is operated under the guidelines and directions of the Union Ministry of Rural Development.\n2. 'The Agricultural and Processed Food Products Export Development Authority' (APEDA) functions as the Secretariat for the implementation of NPOP.\n3. Sikkim has become India's first fully organic State.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2018,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The National Programme for Organic Production (NPOP) operates under the Union Ministry of Commerce and Industry, not the Ministry of Rural Development.  Statement 2 is correct. The Agricultural and Processed Food Products Export Development Authority (APEDA) serves as the Secretariat for NPOP implementation. Statement 3 is also correct. Sikkim is indeed the first fully organic state in India.  Therefore, only statements 2 and 3 are correct.\n\nNPOP (National Programme for Organic Production): A national initiative to promote and regulate organic farming in India, ensuring quality and credibility of organic products.  It sets standards and certification processes for organic farming.\n\nAPEDA (Agricultural and Processed Food Products Export Development Authority):  A statutory body under the Ministry of Commerce and Industry, responsible for the export promotion of various agricultural and processed food products.  Its role in NPOP involves overseeing the certification and export of organic products.\n\nSikkim: A state in Northeast India that has achieved 100% organic certification, showcasing its commitment to sustainable agriculture and environmental protection.  This was a significant achievement in promoting organic farming practices on a large scale.\n"
    }
]