[
    {
        "Q.No.": 1,
        "question_text": "Consider the following statements:\nStatement-I  : The atmosphere is heated more by incoming solar radiation than by terrestrial radiation.\nStatement-II : Carbon dioxide and other greenhouse gases in the atmosphere are good absorbers of long wave radiation.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "b",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:Statement-I is incorrect. The atmosphere is heated more by terrestrial radiation (infrared radiation emitted by the Earth's surface) than by incoming solar radiation (shortwave radiation).  While the sun provides the initial energy, the Earth's surface absorbs this energy and re-radiates it as heat in the form of infrared radiation. This infrared radiation is then absorbed by greenhouse gases in the atmosphere, leading to atmospheric warming.  Statement-II is correct.  Carbon dioxide (CO2) and other greenhouse gases (like methane, nitrous oxide, etc.) are effective at absorbing longwave (infrared) radiation emitted by the Earth's surface. This absorption traps heat within the atmosphere, contributing to the greenhouse effect.  Therefore, both statements are true, but Statement-II does not explain Statement-I.\n\nGreenhouse gases:  These are gases in the Earth's atmosphere that trap heat.  The main greenhouse gases are carbon dioxide, methane, nitrous oxide, and water vapor.  They absorb infrared radiation, preventing it from escaping into space and causing a warming effect.\n\nIncoming solar radiation: This refers to the electromagnetic radiation emitted by the sun that reaches the Earth's atmosphere.  A portion of this radiation is reflected back into space, while the rest is absorbed by the Earth's surface and atmosphere.\n\nTerrestrial radiation:  This is the infrared radiation emitted by the Earth's surface after absorbing solar radiation.  It is a major driver of atmospheric warming due to its absorption by greenhouse gases.\n"
    },
    {
        "Q.No.": 2,
        "question_text": "Consider the following statements:\nStatement-I  : Thickness of the troposphere at the equator is much greater as compared to poles.\nStatement-II : At the equator, heat is transported to great heights by strong convectional currents.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:Statement-I is correct. The thickness of the troposphere varies with latitude, being greatest at the equator and least at the poles.  This is because the equator receives more solar radiation, leading to stronger heating and greater atmospheric expansion. Statement-II is also correct and directly explains Statement-I.  Stronger convection currents at the equator transport heat upwards, contributing to the greater thickness of the troposphere in that region.  The troposphere is the lowest layer of Earth's atmosphere, characterized by decreasing temperature with altitude.  Convectional currents are upward movements of air caused by heating.\n"
    },
    {
        "Q.No.": 3,
        "question_text": "Consider the following:\n1. Pyroclastic debris\n2. Ash and dust\n3. Nitrogen compounds\n4. Sulphur compounds\nHow many of the above are products of volcanic eruptions?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: Pyroclastic debris, ash and dust are all materials ejected from a volcano during an eruption.  Sulphur compounds are also released into the atmosphere during volcanic eruptions as gases which later condense.  Therefore, all four options are products of volcanic eruptions.\n\nPyroclastic debris: Fragments of volcanic rock, solidified lava, and ash that are ejected during explosive volcanic eruptions.  They range in size from fine ash to large blocks and bombs.\n\nAsh and dust: Fine particles of volcanic rock and glass that are ejected into the atmosphere during volcanic eruptions.  Ash can cause significant disruption to air travel and damage infrastructure.\n\nNitrogen compounds: Volcanic eruptions release various nitrogen-containing gases, such as ammonia and nitrogen oxides. These gases contribute to the atmospheric nitrogen cycle.\n\nSulphur compounds: Volcanoes release significant amounts of sulfur dioxide (SO2), which can react in the atmosphere to form sulfuric acid aerosols, contributing to acid rain and atmospheric cooling.\n"
    },
    {
        "Q.No.": 4,
        "question_text": "Which of the following is/are correct inference/inferences from isothermal maps in the month of January?\n1. The isotherms deviate to the north over the ocean and to the south over the continent.\n2. The presence of cold ocean currents, Gulf Stream and North Atlantic Drift make the North Atlantic Ocean colder and the isotherms bend towards the north.\nSelect the answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:In January, isotherms (lines connecting points of equal temperature) generally deviate northward over oceans and southward over continents. This is because water has a higher specific heat capacity than land, meaning it takes longer to heat up and cool down.  Therefore, ocean temperatures remain relatively warmer in January than land temperatures, causing the isotherms to bend northward over the oceans. Conversely, land cools down more quickly, resulting in southward bending of isotherms over continents.\n\nStatement 2 is incorrect. While cold ocean currents like the Labrador Current do influence the temperature of the North Atlantic, the Gulf Stream and North Atlantic Drift are warm currents that actually *increase* temperatures in the North Atlantic, causing isotherms to bend towards the south, not the north.\n"
    },
    {
        "Q.No.": 5,
        "question_text": "Which of the following countries are well known as the two largest cocoa producers in the world?",
        "option_a": "Algeria and Morocco",
        "option_b": "Botswana and Namibia",
        "option_c": "Côte d'Ivoire and Ghana",
        "option_d": "Madagascar and Mozambique",
        "correct_option": "c",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Côte d'Ivoire and Ghana are well-known as two of the largest cocoa producers globally.  Côte d'Ivoire consistently ranks as the world's top cocoa producer, while Ghana is usually a close second.  Algeria and Morocco are located in North Africa and are not significant cocoa producers. Botswana and Namibia are in Southern Africa and also not major cocoa producers. Madagascar and Mozambique are located in Southern Africa and are not known for large-scale cocoa production.\n"
    },
    {
        "Q.No.": 6,
        "question_text": "With reference to the Himalayan rivers joining the Ganga downstream of Prayagraj from West to East, which one of the following sequences is correct?",
        "option_a": "Ghaghara – Gomati – Gandak – Kosi",
        "option_b": "Gomati – Ghaghara – Gandak – Kosi",
        "option_c": "Ghaghara – Gomati – Kosi – Gandak",
        "option_d": "Gomati – Ghaghara - Kosi – Gandak",
        "correct_option": "b",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:The correct sequence of Himalayan rivers joining the Ganga downstream of Prayagraj from West to East is Gomati, Ghaghara, Gandak, and Kosi.\n\nGomati River: A river in Uttar Pradesh, India, a tributary of the Ganges.  It originates in the Himalayas and flows through Lucknow before joining the Ganges.\n\nGhaghara River:  Also known as Karnali River in Nepal, it's a major tributary of the Ganges, originating in the Himalayas and flowing through Nepal and India. It's known for its significant length and contribution to the Ganges' water volume.\n\nGandak River:  Originating in the Himalayas in Nepal, this river flows through Nepal and Bihar, India, before joining the Ganges.  It's known for its fertile plains and contribution to irrigation.\n\nKosi River:  Originating in the Himalayas in Nepal, this river flows through Nepal and Bihar, India. It's known for its highly erosive nature and frequent course changes, leading to significant flooding.  It's also called the \"Sorrow of Bihar\".\n"
    },
    {
        "Q.No.": 7,
        "question_text": "Consider the following statements:\nStatement-I   : Rainfall is one of the reasons for weathering of rocks.\nStatement-II  : Rain water contains carbon dioxide in solution.\nStatement-III : Rain water contains atmospheric oxygen.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-II and Statement-III are correct and both of them explain Statement-I",
        "option_b": "Both Statement-II and Statement-III are correct, but only one of them explains Statement-I",
        "option_c": "Only one of the Statements II and III is correct and that explains Statement-I",
        "option_d": "Neither Statement-II nor Statement-III is correct",
        "correct_option": "a",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Rainfall is a significant factor in rock weathering.  Rainwater's chemical composition plays a crucial role.  Statement II is correct because rainwater absorbs carbon dioxide from the atmosphere, forming carbonic acid (a weak acid) which reacts with rocks. Statement III is also correct as rainwater dissolves atmospheric oxygen, which participates in oxidation reactions that break down rocks. Both statements II and III correctly explain how rainfall contributes to weathering.  Therefore, option (a) is the correct answer.\n\nRain: Precipitation in the form of liquid water.\nWeathering: The breakdown of rocks and minerals at or near the Earth's surface.\nCarbon dioxide: A greenhouse gas, also a component of rainwater, forming carbonic acid.\nAtmospheric oxygen: Oxygen present in the air, involved in oxidation reactions during weathering.\n"
    },
    {
        "Q.No.": 8,
        "question_text": "Consider the following countries:\n1. Finland\n2. Germany\n3. Norway\n4. Russia\nHow many of the above countries have a border with the North Sea?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation: Only Germany borders the North Sea.  Finland, Norway, and Russia do not have a coastline on the North Sea.  Finland is bordered by the Baltic Sea and Gulf of Bothnia. Norway borders the North Atlantic Ocean, Norwegian Sea, and Barents Sea. Russia borders the Barents Sea, among others. Germany, on the other hand, has a significant North Sea coastline.\n"
    },
    {
        "Q.No.": 9,
        "question_text": "Consider the following information:\n   Waterfall    Region          River\n1. Dhuandhar    Malwa           Narmada\n2. Hundru       Chota Nagpur    Subarnarekha\n3. Gersoppa     Western Ghats   Netravati\nIn how many of the above rows is the given information correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation: Only two of the given rows are correctly matched.\n\n* **Dhuandhar Falls:**  Located in Madhya Pradesh, India, on the Narmada River.  This is correctly matched.\n* **Hundru Falls:** Located in Chota Nagpur Plateau, Jharkhand, India, on the Subarnarekha River. This is correctly matched.\n* **Gersoppa Falls:** Located in Karnataka, India, on the Sharavati River, not the Netravati River. This is incorrectly matched.\n\nTherefore, only two rows (1 and 2) have correctly matched information.  The Narmada and Subarnarekha Rivers are major rivers in India. The Chota Nagpur Plateau is a large plateau in eastern India. The Malwa region is a plateau region in central India.  The Western Ghats are a mountain range along the western coast of India.\n"
    },
    {
        "Q.No.": 10,
        "question_text": "Consider the following information:\n   Region           Name of the mountain range      Type of mountain\n1. Central          Asia Vosges                     Fold mountain\n2. Europe           Alps                            Block mountain\n3. North America    Appalachians                    Fold mountain\n4. South America    Andes                           Fold mountain\nIn how many of the above rows is the given information correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Only one row has correctly matched information.  The Alps are block mountains, not fold mountains as stated in row 2. The Vosges mountains in Central Europe are indeed fold mountains.  The Appalachians in North America and the Andes in South America are also fold mountains. Therefore, only one row (row 1, Vosges mountains) is correctly matched.\n\nVosges Mountains: A mountain range in eastern France, part of the larger system of fold mountains in Europe. They are relatively low in elevation compared to the Alps.\n\nAlps: A major mountain range in Europe, known for their high peaks, glaciers, and diverse ecosystems.  They are primarily block mountains, formed by tectonic uplift and faulting.\n\nAppalachian Mountains:  An extensive mountain range system in eastern North America, characterized by rounded peaks and ridges, a result of extensive erosion of older fold mountains.\n\nAndes Mountains: The longest continental mountain range in the world, running along the western coast of South America. They are primarily fold mountains formed by the collision of tectonic plates.\n"
    },
    {
        "Q.No.": 11,
        "question_text": "Consider the following airports:\n1. Donyi Polo Airport\n2. Kushinagar International Airport\n3. Vijayawada International Airport\nIn the recent past, which of the above have been constructed as Greenfield projects?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation: Kushinagar International Airport and Donyi Polo Airport are Greenfield airports.  Greenfield projects refer to the construction of entirely new infrastructure on previously undeveloped land.  Vijayawada Airport, while having undergone expansion and upgrades, was not constructed as a Greenfield project.\n\nDonyi Polo Airport: Located in Itanagar, Arunachal Pradesh, this airport serves as a crucial transport hub in the northeastern region of India. Its construction significantly improved connectivity to a previously underserved area.\n\nKushinagar International Airport: Situated in Kushinagar, Uttar Pradesh, this airport is significant due to its religious importance and its role in boosting tourism to the region.  It is a major development in terms of infrastructure for the area.\n\nVijayawada International Airport: Located in Vijayawada, Andhra Pradesh, this airport has been expanded and upgraded over time to meet the increasing demands of air travel, but its origins were not as a completely new project on undeveloped land.\n"
    },
    {
        "Q.No.": 12,
        "question_text": "With reference to \"water vapour\", which of the following statements is/are correct?\n1. It is a gas, the amount of which decreases with altitude.\n2. Its percentage is maximum at the poles.\nSelect the answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Water vapor is a gas. The amount of water vapor in the atmosphere decreases with altitude because the air temperature generally decreases with altitude.  Colder air holds less water vapor than warmer air.  Therefore, statement 1 is correct. Statement 2 is incorrect. The percentage of water vapor is highest in tropical regions near the equator, where temperatures are high and evaporation rates are high. Polar regions have very low temperatures and hence very low water vapor content.\n"
    },
    {
        "Q.No.": 13,
        "question_text": "Consider the following description:\n1. Annual and daily range of temperatures is low.\n2. Precipitation occurs throughout the year.\n3. Precipitation varies between 50 cm - 250 cm.\nWhat is this type of climate?",
        "option_a": "Equatorial climate",
        "option_b": "China type climate",
        "option_c": "Humid subtropical climate",
        "option_d": "Marine West coast climate",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:The description points to an equatorial climate.  Equatorial climates are characterized by low annual and daily temperature ranges due to their location near the equator, consistent precipitation throughout the year driven by the Intertropical Convergence Zone (ITCZ), and high annual rainfall (though the range given, 50-250 cm, is broad and could overlap with other climates).\n\nChina type climate: This refers to the climate of East Asia, characterized by warm, wet summers and cold, dry winters due to the monsoon system.  It doesn't fit the description of consistent precipitation.\n\nHumid subtropical climate: These climates have hot, humid summers and mild winters, with precipitation distributed throughout the year, but typically more concentrated in summer. The consistent precipitation throughout the year and lower temperature range make this less likely than an equatorial climate.\n\nMarine West Coast climate: These climates experience mild temperatures year-round due to the moderating influence of the ocean and have relatively high precipitation, often associated with cyclonic systems.  While precipitation fits, the consistently low temperature range is more characteristic of equatorial climates.\n\nEquatorial climate: Located near the equator, these climates have consistently warm temperatures and high rainfall throughout the year, with little seasonal variation. This aligns best with the given characteristics.\n"
    },
    {
        "Q.No.": 14,
        "question_text": "With reference to \"Coriolis force\", which of the following statements is/are correct?\n1. It increases with increase in wind velocity.\n2. It is maximum at the poles and is absent at the equator.\nSelect the answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation:The Coriolis force is an inertial or fictitious force that appears to act on objects that are in motion within a rotating frame of reference.  Statement 1 is correct because the magnitude of the Coriolis force is directly proportional to the velocity of the moving object (in this case, wind).  A faster wind will experience a stronger Coriolis force. Statement 2 is also correct. The Coriolis force is zero at the equator and increases as you move towards the poles, reaching its maximum at the poles.  This is because the Earth's rotation is fastest at the equator and slowest at the poles.  The Coriolis effect is what causes the deflection of moving objects (like wind and ocean currents) to the right in the Northern Hemisphere and to the left in the Southern Hemisphere.\n"
    },
    {
        "Q.No.": 15,
        "question_text": "On June 21 every year, which of the following latitude(s) experience(s) a sunlight of more than 12 hours?\n1. Equator\n2. Tropic of Cancer\n3. Tropic of Capricorn\n4. Arctic Circle\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "3 and 4",
        "option_d": "2 and 4",
        "correct_option": "d",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (d)\n\nexplanation: On June 21st, the summer solstice in the Northern Hemisphere, the sun is directly overhead at the Tropic of Cancer (23.5° N latitude).  Locations at and above this latitude will experience more than 12 hours of sunlight.  The Arctic Circle (66.5° N latitude) also experiences more than 12 hours of sunlight on this day, as it is within the region receiving continuous daylight during the summer solstice. The Equator always receives approximately 12 hours of sunlight, and the Tropic of Capricorn (23.5° S latitude) experiences less than 12 hours of sunlight on June 21st.\n\n\nEquator: An imaginary line circling the Earth halfway between the North and South Poles, at 0 degrees latitude.  It divides the Earth into the Northern and Southern Hemispheres.\n\nTropic of Cancer: The parallel of latitude 23.5 degrees north of the Equator. It marks the northernmost point where the sun can be directly overhead.\n\nTropic of Capricorn: The parallel of latitude 23.5 degrees south of the Equator. It marks the southernmost point where the sun can be directly overhead.\n\nArctic Circle: The parallel of latitude 66.5 degrees north of the Equator.  It marks the northern boundary of the region where the sun remains above or below the horizon for 24 hours at least once per year.\n"
    },
    {
        "Q.No.": 16,
        "question_text": "One of the following regions has the world's largest tropical peatland, which holds about three years worth of global carbon emissions from fossil fuels; and the possible destruction of which can exert detrimental effect on the global climate. Which one of the following denotes that region?",
        "option_a": "Amazon Basin",
        "option_b": "Congo Basin",
        "option_c": "Kikori Basin",
        "option_d": "Rio de la Plata Basin",
        "correct_option": "b",
        "subject": "environment",
        "year": 2024,
        "explanation": "* **correct_option:** (b)\n* **explanation:** The Congo Basin contains the world's largest tropical peatland, which stores a significant amount of carbon.  Its destruction would release this carbon into the atmosphere, significantly impacting global climate change.\n\nThe Amazon Basin is a large tropical rainforest basin in South America, known for its biodiversity and role in regulating the global climate.  The Kikori Basin is a river basin in Papua New Guinea. The Rio de la Plata Basin is a large river basin in South America, encompassing parts of Argentina, Brazil, Uruguay, and Paraguay.  These other basins, while important ecosystems, do not hold the same scale of peatland carbon reserves as the Congo Basin.\n"
    },
    {
        "Q.No.": 17,
        "question_text": "With reference to perfluoroalkyl and polyfluoroalkyl substances (PFAS) that are used in making many consumer products, consider the following statements:\n1. PFAS are found to be widespread in drinking water, food and food packaging materials.\n2. PFAS are not easily degraded in the environment.\n3. Persistent exposure to PFAS can lead to bioaccumulation in animal bodies.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:All three statements are correct regarding PFAS.  PFAS are a group of man-made chemicals that are used in many consumer products.  Statement 1 is true because PFAS are persistent and mobile, leading to widespread contamination of drinking water, food, and food packaging. Statement 2 is true because PFAS are highly persistent in the environment, meaning they do not break down easily. Statement 3 is true because the persistence and lipophilic nature of PFAS leads to bioaccumulation in the bodies of animals, including humans, through the food chain and direct exposure.  Therefore, the correct option is (d).\n\nPerfluoroalkyl and polyfluoroalkyl substances (PFAS):  A large group of man-made chemicals used in various products due to their water-repellent and heat-resistant properties.  Their persistence and potential harm to human health and the environment are significant concerns.\n"
    },
    {
        "Q.No.": 18,
        "question_text": "Consider the following:\n1. Carabid beetles\n2. Centipedes\n3. Flies\n4. Termites\n5. Wasps\nParasitoid species are found in how many of the above kind of organisms?",
        "option_a": "Only two",
        "option_b": "Only three",
        "option_c": "Only four",
        "option_d": "All five",
        "correct_option": "c",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation:Parasitoid wasps are a well-known example of parasitoids.  Centipedes are predators, not parasitoids.  Some fly species are parasitoids, while others are predators or herbivores.  Termites are typically detritivores (feeding on dead organic matter), though some species may have parasitic relationships with other organisms. Carabid beetles encompass a large group with diverse feeding habits; some are parasitoids. Therefore, parasitoid species are found in at least three of the listed organisms (flies, wasps, and some carabid beetles), making option (c) the most accurate answer.  However, the possibility of some carabid beetles and some fly species being parasitoids makes option (c) more likely than (a) or (b).  While not all members of these groups are parasitoids, the presence of parasitoid species within them makes (c) the best fit.\n\nCarabid beetles: A large family of beetles with diverse ecological roles, including predation, scavenging, and in some cases, parasitism.\n\nCentipedes: Predatory arthropods with elongated bodies and numerous legs. They actively hunt and kill their prey.\n\nFlies: A diverse order of insects with various feeding habits, including parasitism, predation, herbivory, and detritivory.\n\nTermites: Social insects that primarily feed on dead plant material (detritivores) but may also have interactions with other organisms.\n\nWasps: A large group of insects with diverse lifestyles, including many parasitoid species that lay their eggs in or on other insects.  Many wasps are also predators or herbivores.\n"
    },
    {
        "Q.No.": 19,
        "question_text": "Consider the following plants:\n1. Groundnut\n2. Horse-gram\n3. Soybean\nHow many of the above belong to the pea family?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Groundnut, horse-gram, and soybean all belong to the pea family (Fabaceae or Leguminosae).  They are all legumes, characterized by their pod-like fruits containing seeds.  Horse-gram is also known as *Macrotyloma uniflorum*.  Soybean is *Glycine max*. Groundnut (peanut) is *Arachis hypogaea*.\n"
    },
    {
        "Q.No.": 20,
        "question_text": "Consider the following statements:\nStatement-I  : The Indian Flying Fox is placed under the \"vermin\" category in the Wild Life (Protection) Act, 1972.\nStatement-II : The Indian Flying Fox feeds on the blood of other animals.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "c",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation:The Indian Flying Fox is not categorized as \"vermin\" under the Wildlife (Protection) Act, 1972.  Statement I is therefore incorrect.  Indian Flying Foxes are megabats and are fruit-eating, not blood-feeding animals. Statement II is incorrect.  Therefore, the correct option is (c).\n\nWildlife (Protection) Act, 1972:  This is an Act of the Parliament of India enacted for the protection of plants and animal species.  It aims to protect and conserve India's biodiversity.  The Act establishes schedules classifying species based on their conservation status, with different levels of protection.\n\nIndian Flying Fox:  Also known as the greater Indian fruit bat, this is a large megabat species found in South Asia.  They are crucial for seed dispersal and pollination.  They are not vermin, and their diet consists primarily of fruits, nectar, and pollen.\n"
    },
    {
        "Q.No.": 21,
        "question_text": "The organisms \"Cicada, Froghopper and Pond skater\" are:",
        "option_a": "Birds",
        "option_b": "Fish",
        "option_c": "Insects",
        "option_d": "Reptiles",
        "correct_option": "c",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Cicada, froghopper, and pond skater are all insects.  \n\nCicadas:  Large insects with prominent eyes and transparent wings. They are known for their loud mating calls and are found in various habitats.\n\nFroghoppers:  Small insects that are also known as spittlebugs. They are characterized by their ability to produce a frothy secretion that protects them from predators. They inhabit various plants.\n\nPond skaters:  Water striders, these insects are found on the surface of ponds and other still water bodies. They have long legs that allow them to skate across the surface of the water.\n\n\nBirds: Warm-blooded vertebrates with feathers and wings. They lay eggs and are found in diverse habitats worldwide.\n\nFish: Cold-blooded aquatic vertebrates that breathe through gills.  They are highly diverse and inhabit various aquatic ecosystems.\n\nReptiles: Cold-blooded vertebrates with scales. They lay eggs (mostly) and are found in a variety of terrestrial and aquatic habitats.\n"
    },
    {
        "Q.No.": 22,
        "question_text": "Consider the following statements:\nStatement-I  : Many chewing gums found in the market are considered a source of environmental pollution.\nStatement-II : Many chewing gums contain plastic as gum base.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:Statement-I is correct because many discarded chewing gums contribute to environmental litter and are difficult to biodegrade, leading to pollution.  Statement-II is also correct, as a significant portion of chewing gum's base is composed of synthetic polymers (plastics), contributing to the non-biodegradable nature mentioned in Statement I.  Therefore, Statement-II explains Statement-I.\n\nChewing gum: A confectionery product typically containing a gum base, sweeteners, and flavorings.  Many modern chewing gums contain synthetic polymers as a base.\n\nEnvironmental pollution: The contamination of the environment (air, water, or land) with substances that are harmful to living organisms.  This can result from various human activities and can negatively impact ecosystems.\n\nPlastic: A type of synthetic polymer material, characterized by its durability and resistance to degradation.  The widespread use of plastics has led to significant environmental concerns due to their persistence in the environment.\n"
    },
    {
        "Q.No.": 23,
        "question_text": "Consider the following pairs:\n   Country          Animal found in its natural habitat\n1. Brazil           Indri\n2. Indonesia        Elk\n3. Madagascar       Bonobo\nHow many of the pairs given above are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation: Only one pair is correctly matched.\n\n* Brazil:  The Indri is a lemur found only in Madagascar.\n* Indonesia: Elks are found in North America and Eurasia, not Indonesia.\n* Madagascar: Bonobos are a type of chimpanzee found in the Democratic Republic of Congo, not Madagascar.  \n\n\n"
    },
    {
        "Q.No.": 24,
        "question_text": "Consider the following statements regarding World Toilet Organization:\n1. It is one of the agencies of the United Nations.\n2. World Toilet Summit, World Toilet Day and World Toilet College are the initiatives of this organization, to inspire action to tackle the global sanitation crisis.\n3. The main focus of its function is to grant funds to the least developed countries and developing countries to achieve the end of open defecation.\nWhich of the statements given above is/are correct?",
        "option_a": "2 only",
        "option_b": "3 only",
        "option_c": "1 and 2",
        "option_d": "2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is incorrect. The World Toilet Organization (WTO) is an independent non-profit organization; it is not a UN agency.  Statement 2 is correct. The WTO is known for its initiatives like the World Toilet Summit, World Toilet Day, and World Toilet College, all aimed at raising awareness and promoting better sanitation globally. Statement 3 is incorrect. While the WTO works to improve sanitation, its primary function is not focused on directly granting funds to countries.  Its activities are more centered around advocacy, awareness campaigns, and promoting innovative solutions.\n"
    },
    {
        "Q.No.": 25,
        "question_text": "Consider the following statements:\n1. Lions do not have a particular breeding season.\n2. Unlike most other big cats, cheetahs do not roar.\n3. Unlike male lions, male leopards do not proclaim their territory by scent marking.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. Lions do have a breeding season, although it is not as strictly defined as in some other species.  Statement 2 is correct. Cheetahs are the only large cat species that cannot roar.  Statement 3 is correct. Male leopards mark their territory primarily through scent marking, unlike male lions which use scent marking and roaring.  Therefore, only statements 2 and 3 are correct.\n\nLions:  Lions are large carnivorous mammals belonging to the family Felidae.  They are known for their social structure, living in prides typically composed of related females, their cubs, and a small number of adult males.  Lions are found in various habitats in Africa and historically in Asia.\n\nCheetahs: Cheetahs are the fastest land animals.  They are slender, spotted cats found primarily in Africa, with a small population in Iran. Unlike other big cats, cheetahs are not capable of roaring, instead making a variety of other vocalizations.  They are highly specialized for hunting by speed.\n\nLeopards: Leopards are solitary, elusive cats found in various habitats across Africa and Asia. They are skilled climbers and ambush predators.  They mark their territories primarily through scent marking using urine, feces, and other secretions.  Their spotted coats provide excellent camouflage.\n"
    },
    {
        "Q.No.": 26,
        "question_text": "Which one of the following is the correct description of \"100 Million Farmers\"?",
        "option_a": "It is a platform for accelerating the transition towards food and water systems that are net-zero (carbon), nature-positive and that aims to increase farmer resilience.",
        "option_b": "It is an international alliance and a network of individuals and farming organisations interested in supporting and strengthening the development of the organic animal husbandry.",
        "option_c": "It is a digital platform fully integrated with service providers and built on blockchain that lets buyers, sellers and third parties trade fertilizers quickly and securely.",
        "option_d": "It is a platform with the mission of encouraging the farmers to form Farmer Product Organisations or Agribusiness Consortiums, thus facilitating the access to global open markets to sell their products.",
        "correct_option": "a",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Option (a) accurately describes \"100 Million Farmers\" as a platform focused on transitioning towards sustainable food and water systems, aiming for carbon neutrality, environmental positivity, and enhanced farmer resilience.  The other options describe different initiatives or platforms unrelated to the stated goals of \"100 Million Farmers\".\n\n**Short notes on keywords and named entities:**\n\n* **100 Million Farmers:** A platform aiming to improve the sustainability and resilience of farming practices, focusing on environmental impact and farmer well-being.  It seeks to accelerate the shift towards net-zero carbon and nature-positive food and water systems.\n\n* **Net-zero (carbon):** A state where greenhouse gas emissions are balanced by removals, resulting in no net increase in atmospheric carbon dioxide.  Achieving net-zero is a key goal in mitigating climate change.\n\n* **Nature-positive:**  A state where the natural environment is actively improved and restored, going beyond simply preventing further degradation.  This often involves enhancing biodiversity and ecosystem services.\n\n* **Farmer resilience:** The ability of farmers to withstand and recover from shocks and stresses, such as climate change, economic downturns, or pest outbreaks.  It involves adaptive capacity and robust livelihoods.\n\n* **Organic animal husbandry:**  The practice of raising livestock without the use of synthetic pesticides, fertilizers, or growth hormones. It prioritizes animal welfare and environmental sustainability.\n\n* **Blockchain:** A decentralized and secure digital ledger technology that records transactions across multiple computers. It is often used to enhance transparency and traceability in supply chains.\n\n* **Farmer Product Organisations/Agribusiness Consortiums:** Groups of farmers that collaborate to improve their collective bargaining power, access to markets, and overall efficiency. This can involve joint marketing, processing, and input procurement.\n\n* **National Agriculture Market (NAM):** A pan-India electronic trading portal designed to create a unified national market for agricultural commodities by connecting existing Agricultural Produce Market Committees (APMCs) and other market yards.  It aims to improve price discovery and market efficiency for farmers.\n\n* **Agricultural Produce Market Committees (APMCs):**  Local-level regulatory bodies that govern agricultural marketing in many Indian states.  NAM aims to integrate these into a national system.\n\n* **Contract farming:** An agreement between a buyer (e.g., a processor or exporter) and a farmer, specifying the crop to be grown, the price, and other terms of sale. It can reduce risk for both parties but also carries potential downsides.\n\n* **Minimum Support Price (MSP):** A government-set price for certain agricultural products, guaranteeing a minimum return to farmers. It aims to provide price stability and protect farmers from market fluctuations.\n\n\n"
    },
    {
        "Q.No.": 27,
        "question_text": "Consider the following:\n1. Battery storage\n2. Biomass generators\n3. Fuel cells\n4. Rooftop solar photovoltaic units\nHow many of the above are considered \"Distributed Energy Resources\"?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:All four options are considered Distributed Energy Resources (DERs).  DERs are energy sources located close to the point of consumption, unlike large centralized power plants.\n\n* **Battery storage:** Stores energy generated from various sources for later use, often located near the consumer.\n* **Biomass generators:** Generate electricity from biomass fuel, often locally sourced and situated near the point of use.\n* **Fuel cells:** Convert chemical energy into electricity, and can be sized for distributed generation.\n* **Rooftop solar photovoltaic (PV) units:** Generate electricity directly from sunlight on rooftops of buildings, inherently distributed.\n"
    },
    {
        "Q.No.": 28,
        "question_text": "Which one of the following shows a unique relationship with an insect that has coevolved with it and that is the only insect that can pollinate this tree?",
        "option_a": "Fig",
        "option_b": "Mahua",
        "option_c": "Sandalwood",
        "option_d": "Silk cotton",
        "correct_option": "a",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Figs have a unique coevolved relationship with fig wasps.  Each fig species is pollinated by a single, specific species of fig wasp, and the wasp's life cycle is entirely dependent on the fig.  This is an example of obligate mutualism, where neither organism can survive without the other.  \n\nMahua trees are pollinated by various insects and birds. Sandalwood is primarily pollinated by insects, but not exclusively by one species. Silk cotton trees are pollinated by a variety of insects, birds, and bats.\n"
    },
    {
        "Q.No.": 29,
        "question_text": "Consider the following:\n1. Butterflies\n2. Fish\n3. Frogs\nHow many of the above have poisonous species among them?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "environment",
        "year": 2024,
        "explanation": "* **correct_option:** (c)\n* **explanation:** Butterflies, fish, and frogs all have poisonous species among them.  Certain butterfly species contain toxins that make them unpalatable to predators. Many fish species, particularly in tropical waters, possess venomous spines or produce toxins.  Similarly, some frog species, like poison dart frogs, secrete potent toxins through their skin.  Therefore, all three groups include poisonous members.\n"
    },
    {
        "Q.No.": 30,
        "question_text": "Consider the following:\n1. Cashew\n2. Papaya\n3. Red sanders\nHow many of the above trees are actually native to India?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:  Only cashew is native to India among the given options.  Papaya is native to the Americas and red sanders (Pterocarpus santalinus) is native to South India.\n\nCashew (Anacardium occidentale): A tropical evergreen tree, native to northeastern Brazil. It was introduced to India and is now widely cultivated in several states, primarily in the coastal regions.\n\nPapaya (Carica papaya):  A small, fast-growing tree native to the tropics of the Americas. It is now cultivated worldwide in tropical and subtropical regions, including India.\n\nRed Sanders (Pterocarpus santalinus): A medium-sized tree species, endemic to the southern Eastern Ghats mountain range of India.  It is highly valued for its heartwood, used in furniture and other crafts, and is threatened by overexploitation.\n"
    },
    {
        "Q.No.": 31,
        "question_text": "With reference to radioisotope thermoelectric generators (RTGs), consider the following statements:\n1. RTGs are miniature fission reactors.\n2. RTGs are used for powering the onboard systems of spacecrafts.\n3. RTGs can use Plutonium-238, which is a by-product of weapons development.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. RTGs are not miniature fission reactors.  They utilize the heat generated from the radioactive decay of isotopes, not from a controlled nuclear fission chain reaction like a reactor.\n\nStatement 2 is correct. RTGs are commonly used to power spacecraft and other remote applications where solar power is insufficient.  The continuous heat generated by radioactive decay allows for reliable long-term power generation.\n\nStatement 3 is correct. Plutonium-238, a suitable isotope for RTGs due to its high power density and relatively long half-life, is a byproduct of nuclear weapons production.  However, its use in RTGs is now more tightly controlled due to its potential for misuse.\n\n\nPlutonium-238: A radioactive isotope of plutonium with a relatively long half-life (87.7 years), making it suitable for long-duration power generation in RTGs. Its high energy density makes it ideal for space applications, but its association with weapons production raises security concerns.\n\nRadioisotope Thermoelectric Generators (RTGs): Devices that convert the heat produced by the radioactive decay of isotopes (like Plutonium-238) into electricity using thermocouples. They offer long-term, reliable power in remote or space-based applications where solar power is unavailable or insufficient.\n\nNuclear Fission: A nuclear reaction where a heavy atomic nucleus (like uranium or plutonium) splits into two or more lighter nuclei, releasing a large amount of energy. This process is used in nuclear power plants and nuclear weapons.\n"
    },
    {
        "Q.No.": 32,
        "question_text": "Consider the following statements:\nStatement-I  : Giant stars live much longer than dwarf stars.\nStatement-II : Compared to dwarf stars, giant stars have a greater rate of nuclear reactions.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "d",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:Statement-I is incorrect. Giant stars have shorter lifespans than dwarf stars.  Giant stars burn through their fuel much faster due to their larger size and higher luminosity.  Statement-II is correct. Giant stars have a much greater rate of nuclear reactions compared to dwarf stars because of their higher mass and temperature.  Therefore, the correct option is (d).  Dwarf stars are smaller and less massive stars that burn their fuel slowly, resulting in longer lifespans. Giant stars are larger and more massive stars that burn their fuel rapidly, resulting in shorter lifespans.  Nuclear reactions are processes that occur in the cores of stars, where atoms are fused together to release energy. The rate of nuclear reactions is determined by factors such as temperature, pressure, and the mass of the star.\n"
    },
    {
        "Q.No.": 33,
        "question_text": "Which one of the following is synthesised in human body that dilates blood vessels and increases blood flow?",
        "option_a": "Nitric oxide",
        "option_b": "Nitrous oxide",
        "option_c": "Nitrogen dioxide",
        "option_d": "Nitrogen pentoxide",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation: Nitric oxide (NO) is a signaling molecule produced in the human body, primarily by endothelial cells lining blood vessels.  It acts as a vasodilator, meaning it relaxes the smooth muscles in blood vessel walls, causing them to widen. This vasodilation leads to increased blood flow.  Nitrous oxide (N₂O), nitrogen dioxide (NO₂), and nitrogen pentoxide (N₂O₅) are not known to have this function in the human body; they are different nitrogen oxides with varying chemical properties and biological effects.  Many of these nitrogen oxides are involved in the nitrogen cycle, a crucial biogeochemical process.  The nitrogen cycle involves the transformation of nitrogen between different chemical forms, including nitrogen fixation, nitrification, and denitrification by microorganisms, impacting soil fertility and atmospheric composition.\n"
    },
    {
        "Q.No.": 34,
        "question_text": "Consider the following activities:\n1. Identification of narcotics on passengers at airports or in aircraft\n2. Monitoring of precipitation\n3. Tracking the migration of animals\nIn how many of the above activities can the radars be used?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation: Radars can be used for monitoring precipitation (weather radar) and tracking the migration of animals (by detecting their movement and location).  However, radars are not typically used for identifying narcotics on passengers.  Therefore, radars can be used in only two of the listed activities.\n\nNarcotics:  Illegal drugs.  Detection methods vary, often involving trained dogs, chemical tests, and imaging technologies, but not typically radar.\n\nPrecipitation: Water that falls to the ground as rain, snow, hail, etc. Weather radars use radio waves to detect and measure precipitation.\n\nMigration (of animals): The seasonal movement of animals from one region to another.  Radars can track animal movement, particularly large groups or those with radio transmitters.\n"
    },
    {
        "Q.No.": 35,
        "question_text": "Consider the following aircraft:\n1. Rafael\n2. MiG-29\n3. Tejas MK-1\nHow many of the above are considered fifth generation fighter aircraft?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: None of the listed aircraft (Rafael, MiG-29, Tejas MK-1) are considered fifth-generation fighter jets.  The Rafael is a 4.5 generation fighter, incorporating some fifth-generation features but lacking others.  The MiG-29 is a fourth-generation fighter. The Tejas MK-1 is considered a 4.5 generation fighter.  Therefore, the correct answer is (d).\n"
    },
    {
        "Q.No.": 36,
        "question_text": "In which of the following are hydrogels used?\n1. Controlled drug delivery in patients\n2. Mobile air-conditioning systems\n3. Preparation of industrial lubricantsSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Hydrogels are used in controlled drug delivery systems.  They are three-dimensional networks of hydrophilic polymers that can absorb and retain large amounts of water. This property makes them ideal for carrying and releasing drugs in a controlled manner, for example in implants or injectable formulations.  The other options are incorrect.  There is no mention of hydrogels being used in mobile air-conditioning systems or in the preparation of industrial lubricants in the provided text.\n"
    },
    {
        "Q.No.": 37,
        "question_text": "Which one of the following is the exhaust pipe emission from Fuel Cell Electric Vehicles, powered by hydrogen?",
        "option_a": "Hydrogen peroxide",
        "option_b": "Hydronium",
        "option_c": "Oxygen",
        "option_d": "Water vapour",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: Fuel cell electric vehicles (FCEVs) powered by hydrogen use an electrochemical process to generate electricity, combining hydrogen with oxygen. The only byproduct of this reaction is water vapor (H₂O).  Hydrogen peroxide (H₂O₂), hydronium (H₃O⁺), and oxygen (O₂) are not produced in significant quantities as exhaust emissions from a properly functioning hydrogen fuel cell.\n\nHydrogen is a chemical element with the symbol H and atomic number 1.  It is the lightest element and is abundant in the universe. It is being explored as a clean energy source.  Different methods exist for producing hydrogen, some cleaner than others (green hydrogen from electrolysis vs. grey hydrogen from fossil fuels).\n\nHydrogen peroxide is a chemical compound with the formula H₂O₂. It is a powerful oxidizing agent and is used in various applications.  It is not a byproduct of hydrogen fuel cells.\n\nHydronium is a chemical species that consists of a proton (H⁺) bound to a water molecule (H₂O), resulting in the formula H₃O⁺. It is formed when an acid dissolves in water. It is not a significant exhaust emission from FCEVs.\n\nOxygen is a chemical element with the symbol O and atomic number 8. It is a highly reactive nonmetal and is essential for respiration in most living organisms. While oxygen is a reactant in a hydrogen fuel cell, it is not emitted as exhaust.  Water vapor is the only significant product.\n"
    },
    {
        "Q.No.": 38,
        "question_text": "Recently, the term \"pumped-storage hydropower\" is actually and appropriately discussed in the context of which one of the following?",
        "option_a": "Irrigation of terraced crop fields",
        "option_b": "Lift irrigation of cereal crops",
        "option_c": "Long duration energy storage",
        "option_d": "Rainwater harvesting system",
        "correct_option": "c",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Pumped-storage hydropower is a method of energy storage.  It involves pumping water to a higher elevation reservoir during periods of low energy demand and then releasing it through turbines to generate electricity during periods of high demand. This makes it ideal for long-duration energy storage, unlike the other options which are not directly related to energy storage.\n\nIrrigation of terraced crop fields, lift irrigation of cereal crops, and rainwater harvesting systems are all agricultural techniques focused on water management for crop production, not energy storage.  They may incidentally use energy, but that's not their primary function.\n"
    },
    {
        "Q.No.": 39,
        "question_text": "\"Membrane Bioreactors\" are often discussed in the context of:",
        "option_a": "Assisted reproductive technologies",
        "option_b": "Drug delivery nanotechnologies",
        "option_c": "Vaccine production technologies",
        "option_d": "Wastewater treatment technologies",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:Membrane bioreactors are used in wastewater treatment.  They combine biological treatment (using microorganisms) with membrane separation to remove pollutants effectively.\n\nAssisted reproductive technologies (ARTs) involve medical procedures to help with conception and pregnancy.  Drug delivery nanotechnologies use nanoparticles to deliver drugs more precisely. Vaccine production technologies focus on creating effective vaccines, often using biological methods. Wastewater treatment technologies aim to clean wastewater before it's released into the environment.\n"
    },
    {
        "Q.No.": 40,
        "question_text": "With reference to the Indian economy, \"Collateral Borrowing and Lending Obligations\" are the instruments of:",
        "option_a": "Bond market",
        "option_b": "Forex market",
        "option_c": "Money market",
        "option_d": "Stock market",
        "correct_option": "c",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Collateral borrowing and lending involve using assets as security for loans.  This is a core function of the money market, where short-term borrowing and lending take place.  The money market facilitates the short-term flow of funds between borrowers and lenders.  \n\nBond markets deal with longer-term debt instruments (bonds). Forex markets trade currencies. Stock markets trade shares of companies.  The provided context mentions government borrowing, which is heavily reliant on money market instruments for short-term financing needs.  The notes also discuss various short-term borrowing mechanisms available to the government and financial institutions.\n"
    },
    {
        "Q.No.": 41,
        "question_text": "The total fertility rate in an economy is defined as:",
        "option_a": "the number of children born per 1000 people in the population in a year.",
        "option_b": "the number of children born to a couple in their lifetime in a given population.",
        "option_c": "the birth rate minus death rate.",
        "option_d": "the average number of live births a woman would have by the end of her child-bearing age.",
        "correct_option": "d",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:The total fertility rate is the average number of children a woman would have by the end of her childbearing years.  Option (a) describes the crude birth rate. Option (b) is a less precise measure than the total fertility rate, as it doesn't account for women who don't have children or those who die before reaching the end of their childbearing years. Option (c) is the rate of natural increase.\n\nTotal Fertility Rate: A key demographic indicator reflecting the average number of children born to a woman during her reproductive years. It's crucial for understanding population growth trends and projecting future population size.  A high TFR suggests a rapidly growing population, while a low TFR indicates slow or declining growth.\n\nCrude Birth Rate: The number of live births per 1,000 people in a population per year. It's a simple measure of births, but doesn't consider age-sex structure, which influences fertility rates.\n\nCrude Sex Ratio: The ratio of females to males in a population. This provides a snapshot of gender balance; a skewed ratio can indicate societal issues.\n\nDemographic Cycle: The stages a population goes through, from high birth and death rates to low birth and death rates, often linked to societal development.  It's a model for understanding population change over time.\n\nThomas Malthus: An economist who theorized that population growth would outpace food production, leading to crisis. This theory highlights the potential for population pressure on resources.\n\nAge Structure: The distribution of a population by age groups, indicating the proportion of young, working-age, and elderly individuals.  This is essential for projecting future population needs and resource allocation.\n\nAge-Sex Pyramid: A graphical representation of a population's age and sex structure. Its shape reflects population characteristics; expanding, contracting, or stable.\n\nRural-Urban Composition: The proportion of a population living in rural versus urban areas.  This reflects a nation's level of development and economic structure.  Urbanization is usually associated with industrialization and economic advancement.\n\nPopulation Control Measures: Policies and strategies to manage population growth, often through family planning programs or incentives.  These are implemented to address potential societal challenges related to overpopulation.\n\nNational Family Health Survey (NFHS): A large-scale survey in India to collect data on health, family welfare, and other relevant issues. It provides valuable insights into the health and well-being of the Indian population, informing health policy decisions.\n\nMedical Termination of Pregnancy (MTP) Act:  A law in India regulating abortion.  It defines the conditions under which an abortion can be legally performed.\n\nSurrogacy (Regulation) Act:  A law in India regulating surrogacy, distinguishing between altruistic and commercial surrogacy. It aims to prevent exploitation and ensure ethical practices.\n\nAssisted Reproductive Technology (ART) Act: A law in India regulating assisted reproductive technologies such as IVF and other fertility treatments. It addresses ethical concerns and patient rights.\n\nMuslim Women (Protection of Rights on Marriage) Act: A law in India that criminalizes instant triple talaq (talaq-e-biddat) in Muslim marriages. It aims to protect the rights of Muslim women.\n\nProtection of Women from Domestic Violence Act (PWDVA): A law in India that defines and addresses domestic violence, providing legal recourse for victims.\n\nPre-Natal Diagnostic Techniques (PNDT) Act: A law in India to prevent sex-selective abortions and female feticide.  It regulates prenatal sex determination tests and other related practices.\n\nJuvenile Justice (Care and Protection of Children) Act: A law in India providing for the care and protection of children in conflict with the law or in need of care and protection.  It covers adoption, child rights, and other relevant issues.\n\nProtection of Children from Sexual Offences (POCSO) Act: A law in India addressing sexual offenses against children. It provides a framework for reporting, investigating, and prosecuting such crimes.\n\nRights of Persons with Disabilities Act: A law in India that protects the rights of persons with disabilities and promotes their inclusion in society.\n\nNational Policy on Older Persons: A policy in India focusing on the welfare of older persons, ensuring their dignity, and providing necessary support.\n\nCode on Social Security, 2020:  Indian legislation providing social security measures for various workers, including informal and gig workers.  It aims to improve their welfare and protection.\n\nNarcotic Drugs and Psychotropic Substances Act, 1985 (NDPS Act): A law in India regulating narcotic drugs and psychotropic substances, aiming to prevent drug abuse and trafficking.\n\nGlobal Hunger Index (GHI):  An index measuring and tracking hunger globally, regionally, and at the country level.  It uses indicators such as child malnutrition and undernourishment to assess hunger levels.\n\nState of Food Security and Nutrition in the World: A report jointly prepared by various UN agencies, providing a comprehensive assessment of global food security and nutrition.\n\nGlobal Nutrition Report: A report assessing the state of global nutrition and identifying challenges in tackling malnutrition.\n\nGlobal Report on Food Crises: A report by the Global Network against Food Crises, focusing on acute food insecurity in various countries.\n\nSwachh Survekshan: An annual survey in India assessing the cleanliness, hygiene, and sanitation levels in urban areas.  It promotes initiatives to achieve garbage-free and open-defecation-free cities.\n\nNational Multidimensional Poverty Index (NMPI):  An index developed by NITI Aayog to measure poverty in India based on multiple dimensions beyond just income.  It provides a more comprehensive view of deprivation.\n\nNational Education Policy (NEP) 2020:  India's comprehensive education policy aimed at reforming the education system from early childhood care to higher education.  It focuses on holistic development, flexible curricula, and greater access to quality education.\n"
    },
    {
        "Q.No.": 42,
        "question_text": "Consider the following statements:\n1. In India, Non-Banking Financial Companies can access the Liquidity Adjustment Facility window of the Reserve Bank of India.\n2. In India, Foreign Institutional Investors can hold the Government Securities (G-Secs).\n3. In India, Stock Exchanges can offer separate trading platforms for debts.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "2 and 3 only",
        "correct_option": "d",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:\n\nStatement 1 is incorrect.  While NBFCs can borrow from the RBI's Liquidity Adjustment Facility (LAF), they cannot directly access it. They typically access liquidity through other channels, such as the money market or by borrowing from banks.\n\nStatement 2 is correct.  Foreign Institutional Investors (FIIs) are permitted to invest in Indian Government Securities (G-Secs).\n\nStatement 3 is correct.  Stock exchanges in India can offer separate trading platforms for debt instruments.  This allows for specialized trading and better price discovery in the debt market.\n\n\n**Short Notes:**\n\n* **Non-Banking Financial Companies (NBFCs):** NBFCs are financial institutions that provide various financial services but do not hold a banking license. They play a significant role in the Indian financial system, particularly in lending to small businesses and individuals.  They are regulated by the Reserve Bank of India.\n\n* **Liquidity Adjustment Facility (LAF):**  A tool used by the Reserve Bank of India (RBI) to manage liquidity in the banking system. Banks can borrow or lend money to the RBI through repurchase agreements (repos) at the LAF window. This helps to control short-term interest rates and maintain stability in the money market.\n\n* **Reserve Bank of India (RBI):** The central bank of India. It is responsible for regulating the financial system, issuing currency, managing foreign exchange reserves, and implementing monetary policy to maintain price stability and economic growth.\n\n* **Foreign Institutional Investors (FIIs):**  Institutional investors (such as mutual funds, pension funds, and hedge funds) based outside India that invest in Indian financial markets.  Their investments play a significant role in the Indian capital market.\n\n* **Government Securities (G-Secs):** Tradable debt instruments issued by the Indian government to borrow money. These are considered risk-free investments due to the backing of the government.  They are an important part of the Indian debt market.\n\n* **Stock Exchanges:**  Organized markets where securities (stocks and bonds) are bought and sold.  They facilitate price discovery and provide a platform for investors to trade.  In India, the major stock exchanges are the National Stock Exchange (NSE) and the Bombay Stock Exchange (BSE).\n"
    },
    {
        "Q.No.": 43,
        "question_text": "In India, which of the following can trade in Corporate Bonds and Government Securities?\n1. Insurance Companies\n2. Pension Funds\n3. Retail InvestorsSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: In India, insurance companies, pension funds, and retail investors can all trade in corporate bonds and government securities.  \n\nInsurance companies are financial institutions that provide insurance coverage. Pension funds are investment pools that provide retirement income. Retail investors are individual investors who buy and sell securities.  All three entities have the capacity and regulatory permissions to participate in the Indian debt market.  There is no restriction preventing retail investors from participating in these markets, although the level of participation may be influenced by factors like risk tolerance and investment knowledge.\n"
    },
    {
        "Q.No.": 44,
        "question_text": "Consider the following:\n1. Exchange-Traded Funds (ETF)\n2. Motor vehicles\n3. Currency swap\nWhich of the above is/are considered financial instruments?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "1 and 3 only",
        "correct_option": "d",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: Exchange-Traded Funds (ETFs) are investment funds traded on stock exchanges, making them financial instruments. Motor vehicles are tangible assets, not financial instruments. Currency swaps are agreements to exchange principal and interest in different currencies, classifying them as financial instruments.  Therefore, only options 1 and 3 are financial instruments.\n\nExchange-Traded Funds (ETFs): ETFs are investment funds traded on stock exchanges, offering diversified exposure to a specific market segment (like stocks, bonds, or commodities). They provide a cost-effective way to invest in a basket of assets.\n\nMotor vehicles: These are physical, tangible assets used for transportation.  Their value fluctuates based on market conditions and depreciation.\n\nCurrency swap: A currency swap is a derivative financial instrument where two parties agree to exchange principal and interest payments in different currencies. This helps manage foreign exchange risk.\n"
    },
    {
        "Q.No.": 45,
        "question_text": "With reference to the sectors of the Indian economy, consider the following pairs:\n   Economic activity                        Sector\n1. Storage of agricultural produce          Secondary\n2. Dairy farm                               Primary\n3. Mineral exploration                      Tertiary\n4. Weaving cloth                            Secondary\nHow many of the pairs given above are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "b",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:\n\n1. **Storage of agricultural produce:** This activity falls under the **tertiary sector**, which encompasses services.  Storage involves preserving and managing agricultural goods, a service provided to the primary sector (agriculture).\n\n2. **Dairy farm:** This is a **primary sector** activity, as it directly involves the production of agricultural products (milk).\n\n3. **Mineral exploration:** This activity belongs to the **secondary sector**.  Mineral exploration is the process of finding and evaluating mineral deposits, which is a step in the extraction and processing of raw materials.\n\n4. **Weaving cloth:** This is a **secondary sector** activity. Weaving transforms raw materials (cotton, silk, etc.) into finished goods (cloth), representing manufacturing.\n\n\nTherefore, only two pairs (2 and 4) are correctly matched.\n"
    },
    {
        "Q.No.": 46,
        "question_text": "Consider the following materials:\n1. Agricultural residues\n2. Corn grain\n3. Wastewater treatment sludge\n4. Wood mill waste\nWhich of the above can be used as feedstock for producing Sustainable Aviation Fuel?",
        "option_a": "1 and 2 only",
        "option_b": "3 and 4 only",
        "option_c": "1, 2, 3 and 4",
        "option_d": "1, 3 and 4 only",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Agricultural residues, corn grain, wastewater treatment sludge, and wood mill waste can all be used as feedstock for producing Sustainable Aviation Fuel (SAF).  Different feedstocks are used in various SAF production pathways.  Agricultural residues and wood mill waste are examples of lignocellulosic biomass, while corn grain is a source of starch, and wastewater treatment sludge contains organic matter.  All these materials can be processed to produce biofuels, including those suitable for aviation.\n\n\nAgricultural residues: These are the leftover parts of plants after harvesting, such as stalks, leaves, and husks.  They are a readily available and often underutilized resource.\n\nCorn grain: Corn is a widely cultivated crop, and its grain can be used to produce ethanol, a common biofuel component.\n\nWastewater treatment sludge: This byproduct of wastewater treatment contains significant organic matter that can be converted into biofuels.\n\nWood mill waste: Sawdust, wood chips, and other wood processing byproducts are abundant and suitable for biofuel production.\n"
    },
    {
        "Q.No.": 47,
        "question_text": "With reference to physical capital in Indian economy, consider the following pairs:\n   Items                            Category\n1. Farmer's plough                  Working capital\n2. Computer                         Fixed capital\n3. Yarn used by the weaver          Fixed capital\n4. Petrol                           Working capital\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "b",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:  Fixed capital refers to long-term assets used in production, while working capital represents short-term assets.  A farmer's plough is a durable good used repeatedly in production, thus qualifying as fixed capital.  A computer is also a fixed capital asset. Yarn, however, is a raw material consumed during production; it's part of working capital. Petrol is a short-term asset used in production and is consumed quickly, therefore it is working capital.  Only the pairings for the plough and computer are correctly matched.\n\n\nA short note on named entities:\n\n* **Physical capital:**  Refers to the physical assets—machinery, equipment, buildings, infrastructure, etc.—used in production to generate goods and services.  Its accumulation is crucial for economic growth.\n\n* **Indian economy:** The economic system of India, encompassing its production, distribution, and consumption of goods and services.\n\n* **Working capital:** Short-term assets used in the production process, such as raw materials, work-in-progress, and finished goods.  It's essential for day-to-day operations.\n\n* **Fixed capital:** Long-term assets used in production, such as machinery, buildings, and land. They provide a base for ongoing production activities.\n\n* **Farmer's plough:** A tool used in traditional agriculture to till the land.\n\n* **Computer:** An electronic device used for processing information and performing various tasks.  Its use is widespread across modern economies.\n\n* **Yarn:**  A continuous strand of fibres spun together, used for weaving cloth.\n\n* **Petrol:** A refined petroleum product used as fuel for vehicles and machinery.\n"
    },
    {
        "Q.No.": 48,
        "question_text": "Which one of the following words/phrases is most appropriately used to denote \"an interoperable network of 3D virtual worlds that can be accessed simultaneously by millions of users, who can exert property rights over virtual items\"?",
        "option_a": "Big data analytics",
        "option_b": "Cryptography",
        "option_c": "Metaverse",
        "option_d": "Virtual matrix",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2024,
        "explanation": "```text\ncorrect_option: (c)\nexplanation:The definition provided clearly aligns with the concept of a metaverse.  A metaverse is described as a network of interconnected 3D virtual worlds, accessible by many users simultaneously, and often incorporating features like virtual property ownership and digital economies.\n\nBig data analytics focuses on processing and analyzing large datasets, not directly related to the described virtual world. Cryptography is the practice of securing communication, and while it may be *used* in a metaverse for things like secure transactions, it's not the defining characteristic.  A \"virtual matrix\" is a less precise and less commonly used term than \"metaverse\" to describe this concept.\n\nShort notes on named entities:\n\nMetaverse: A persistent, shared, 3D virtual world or interconnected network of virtual worlds, allowing users to interact with each other, digital objects, and experiences.  It often features virtual economies, digital assets with property rights, and immersive experiences.\n\nBig data analytics: The process of examining large and complex datasets to discover patterns, trends, and insights.  Techniques include machine learning, data mining, and statistical analysis.\n\nCryptography: The science and practice of securing communication in the presence of adversaries. It involves techniques like encryption and decryption to protect sensitive information.\n\nVirtual matrix: A less formally defined term, often used synonymously with metaverse, referring to a simulated reality or interconnected virtual environment.\n```\n"
    },
    {
        "Q.No.": 49,
        "question_text": "With reference to the rule/rules imposed by the Reserve Bank of India while treating foreign banks, consider the following statements:\n1. There is no minimum capital requirement for wholly owned banking subsidiaries in India.\n2. For wholly owned banking subsidiaries in India, at least 50% of the board members should be Indian nationals.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:  The Reserve Bank of India (RBI) mandates that wholly owned banking subsidiaries in India must have at least 50% of their board members be Indian nationals. There is a minimum capital requirement for these subsidiaries,  therefore statement 1 is incorrect and statement 2 is correct.\n\nReserve Bank of India (RBI): The central bank of India, responsible for regulating the country's financial system, including foreign banks operating within its borders.  It sets monetary policy and oversees the stability of the banking sector.\n\nWholly owned banking subsidiaries: Banks that are entirely owned by a foreign parent company and operate as a separate legal entity within India.  They are subject to RBI regulations alongside domestic banks.\n"
    },
    {
        "Q.No.": 50,
        "question_text": "With reference to Corporate Social Responsibility (CSR) rules in India, consider the following statements:\n1. CSR rules specify that expenditures that benefit the company directly or its employees will not be considered as CSR activities.\n2. CSR rules do not specify minimum spending on CSR activities.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Statement 1 is correct.  CSR rules in India stipulate that expenditures benefiting the company directly or its employees are not considered CSR activities.  The funds must be used for activities specified under Schedule VII of the Companies Act, 2013. Statement 2 is incorrect.  The Companies Act, 2013, mandates a minimum CSR spending of 2% of the company's average net profit of the preceding three years for eligible companies.\n\nCorporate Social Responsibility (CSR): A concept where companies integrate social and environmental concerns into their business operations and interactions with stakeholders.  In India, it's mandated under the Companies Act, 2013.\n\nCompanies Act, 2013:  Indian legislation governing company formation, administration, and governance.  It includes provisions for mandatory Corporate Social Responsibility (CSR) spending by eligible companies.\n"
    },
    {
        "Q.No.": 51,
        "question_text": "Consider the following statements:\nStatement-I  : If the United States of America (USA) were to default on its debt, holders of US Treasury Bonds will not be able to exercise their claims to receive payment.\nStatement-II : The USA Government debt is not backed by any hard assets, but only by the faith of the Government.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "a",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Statement-I is correct.  A US debt default would mean the US government is unable to meet its debt obligations, preventing bondholders from receiving payments.  Statement-II is also correct. US government debt is not backed by physical assets like gold or land; its value rests on the government's ability and willingness to repay, based on its taxing power and economic strength.  Statement-II directly explains Statement-I because the lack of hard asset backing makes the government's commitment to repay crucial; if that commitment fails (as in a default), bondholders lose their claim to payment.\n\n\nUnited States of America (USA): A federal republic comprising 50 states and a federal district.  It is a major global power with a large economy and a significant role in international affairs.\n\nUS Treasury Bonds: Debt securities issued by the U.S. Department of the Treasury to finance government spending. They are considered among the safest investments globally due to the perceived low risk of default.\n"
    },
    {
        "Q.No.": 52,
        "question_text": "Consider the following statements:\nStatement-I  : Syndicated lending spreads the risk of borrower default across multiple lenders.\nStatement-II : The syndicated loan can be a fixed amount/lump sum of funds, but cannot be a credit line.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "c",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Statement I is correct. Syndicated loans involve multiple lenders sharing the risk of a borrower's default. If the borrower defaults, the loss is distributed among the lenders, reducing the individual lender's exposure.  Statement II is incorrect. A syndicated loan can be a fixed amount or a credit line, offering flexibility to the borrower.  Therefore, only Statement I is correct.\n"
    },
    {
        "Q.No.": 53,
        "question_text": "Consider the following statements in respect of the digital rupee:\n1. It is a sovereign currency issued by the Reserve Bank of India (RBI) in alignment with its monetary policy.\n2. It appears as a liability on the RBI's balance sheet.\n3. It is insured against inflation by its very design.\n4. It is freely convertible against commercial bank money and cash.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: The digital rupee is a sovereign currency issued by the RBI, aligning with its monetary policy (Statement 1 is correct).  It will appear as a liability on the RBI's balance sheet (Statement 2 is correct). However, it's not inherently insured against inflation; its value is tied to the Indian rupee, which is subject to inflation like any other fiat currency (Statement 3 is incorrect).  While details are still emerging, it's likely to be freely convertible with commercial bank money and cash (Statement 4 is likely correct, but definitive information is not available in the provided text). Therefore, statements 1 and 2 are definitively correct, and statement 4 is likely correct based on the information provided.\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Digital Rupee (e₹):** A digital form of India's national currency, issued by the Reserve Bank of India (RBI).  It aims to provide a digital alternative to physical cash, potentially improving efficiency and financial inclusion.  Its design and features are still under development.\n\n* **Reserve Bank of India (RBI):** India's central bank, responsible for monetary policy, currency issuance, and regulation of the banking system.  The RBI plays a crucial role in maintaining financial stability and managing the country's foreign exchange reserves.\n\n* **Monetary Policy:** Actions undertaken by a central bank to manipulate the money supply and credit conditions to stimulate or restrain economic activity.  Key tools include interest rates, reserve requirements, and open market operations.\n\n\n"
    },
    {
        "Q.No.": 54,
        "question_text": "With reference to ancient India, Gautama Buddha was generally known by which of the following epithets\n1. Nayaputta\n2. Shakyamuni\n3. Tathagata\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None of the above are epithets of Gautama Buddha",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2024,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Gautama Buddha was known by several epithets.  Shakyamuni (\"Sage of the Shakya clan\") refers to his origin in the Shakya clan. Tathagata (\"Thus Gone One\" or \"He who has thus gone\") is a title reflecting his attainment of enlightenment and his path to liberation.  While Nayaputta (\"Son of the family\") is sometimes associated with him, it's not as widely recognized an epithet as Shakyamuni and Tathagata. Therefore, only options 2 and 3 are consistently used as epithets of Gautama Buddha.\n\n**Short notes:**\n\n* **Gautama Buddha:**  Siddhartha Gautama, born into the Shakya clan in Lumbini (present-day Nepal) around 563 BCE, is the founder of Buddhism.  He renounced his princely life to seek enlightenment, achieving it at the age of 35. His teachings focus on the Four Noble Truths and the Eightfold Path, aiming to overcome suffering through understanding and practice. He died around 483 BCE in Kusinara (present-day Uttar Pradesh, India).\n\n* **Shakyamuni:**  This epithet literally translates to \"Sage of the Shakya clan,\" directly referencing Buddha's lineage and highlighting his wisdom and spiritual attainment.  It emphasizes his origins and the context from which his teachings emerged.\n\n* **Tathagata:**  This title is more abstract and emphasizes the Buddha's unique spiritual state and the path he traversed.  It suggests a state of being beyond ordinary human experience, signifying the culmination of his spiritual journey and the realization of enlightenment.\n\n* **Nayaputta:** While sometimes associated with Buddha, this epithet (\"Son of the family\") is less commonly used as a primary title compared to Shakyamuni and Tathagata. It's a more general term indicating familial origin.\n"
    },
    {
        "Q.No.": 55,
        "question_text": "Consider the following information:\n   Archaeological Site          State               Description\n1. Chandraketugarh              Odisha              Trading Port town\n2. Inamgaon                     Maharashtra         Chalcolithic site\n3. Mangadu                      Kerala              Megalithic site\n4. Salihundam                   Andhra Pradesh      Rock-cut cave shrines\nIn which of the above rows is the given information correctly matched?",
        "option_a": "1 and 2",
        "option_b": "2 and 3",
        "option_c": "3 and 4",
        "option_d": "1 and 4",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:Row 1 is incorrect because Chandraketugarh is in West Bengal, not Odisha. Row 3 is incorrect because Mangadu is in Tamil Nadu, not Kerala. Row 4 is incorrect because Salihundam is associated with Buddhist remains, not rock-cut cave shrines.  Row 2 correctly identifies Inamgaon as a Chalcolithic site in Maharashtra.\n\n\nInamgaon: A Chalcolithic archaeological site located in Maharashtra, India.  It is known for its well-preserved houses, evidence of agriculture, and sophisticated tools. The site provides insights into the lifestyle and societal structures of the Chalcolithic period.\n\nChandraketugarh: An archaeological site located in West Bengal, India. It was a significant ancient trading port town.  The site features evidence of urban planning, diverse artifacts, and extensive trade networks.\n\nMangadu: An archaeological site located in Tamil Nadu, India. It is known for its megalithic burials and artifacts. Megalithic sites are characterized by large stone structures, often associated with burial practices.  Mangadu showcases the cultural practices of the megalithic period.\n\nSalihundam: An archaeological site located in Andhra Pradesh, India. It is associated with Buddhist remains and structures. The site features stupas, monasteries, and other architectural elements indicative of Buddhist influence.\n"
    },
    {
        "Q.No.": 56,
        "question_text": "Who of the following rulers of medieval India gave permission to the Portuguese to build a fort at Bhatkal?",
        "option_a": "Krishnadevaraya",
        "option_b": "Narasimha Saluva",
        "option_c": "Muhammad Shah III",
        "option_d": "Yusuf Adil Shah",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2024,
        "explanation": "correct_option: (d)\n\nexplanation:The provided text states that Yusuf Adil Shah of Bijapur entered into an agreement with the Portuguese in 1570.  While the text doesn't explicitly mention Bhatkal, the context strongly suggests Yusuf Adil Shah's involvement in granting Portuguese access to build a fort in the region.\n\nKrishnadevaraya was a ruler of the Vijayanagara Empire, Narasimha Saluva was a ruler of the Saluva dynasty (a predecessor to the Tuluva dynasty in Vijayanagara), and Muhammad Shah III was a Mughal emperor.  None of these are directly linked to granting the Portuguese permission to build a fort at Bhatkal in the provided text.\n\n\n**Short Notes:**\n\n* **Yusuf Adil Shah:**  A ruler of the Adil Shahi dynasty of Bijapur, a Deccan Sultanate. His reign saw significant interactions with the Portuguese, including agreements and conflicts concerning trade and territorial control.\n\n* **Krishnadevaraya:**  A prominent ruler of the Vijayanagara Empire known for his military successes and patronage of arts and literature.  His reign marked a period of power and prosperity for the empire.\n\n* **Narasimha Saluva:** A ruler of the Saluva dynasty, a relatively short-lived dynasty that preceded the Tuluva dynasty in Vijayanagara.  His reign is less well-documented compared to later Vijayanagara rulers.\n\n* **Muhammad Shah III:**  A Mughal emperor whose reign was marked by internal conflicts and challenges to Mughal authority.  His rule did not significantly intersect with Portuguese activities in the Deccan.\n\n* **Bhatkal:** A port town on the west coast of India, historically significant for its maritime trade and strategic location.  Its control was contested by various powers, including the local rulers and European colonial powers.\n\n* **Portuguese:**  A European power that established a significant presence in India during the 16th and 17th centuries, engaging in trade, establishing settlements, and building forts along the coast.  Their activities significantly impacted Indian history and politics.\n"
    },
    {
        "Q.No.": 57,
        "question_text": "With reference to revenue collection by Cornwallis, consider the following statements:\n1. Under the Ryotwari Settlement of revenue collection, the peasants were exempted from revenue payment in case of bad harvests or natural calamities.\n2. Under the Permanent Settlement in Bengal, if the Zamindar failed to pay his revenues to the state, on or before the fixed date, he would be removed from his Zamindari.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  The Ryotwari system, implemented in some parts of India,  involved the state directly collecting revenue from individual peasant cultivators (ryots). While some provisions for remission might have existed in specific cases, a blanket exemption for bad harvests or natural calamities wasn't a standard feature of the Ryotwari system.\n\nStatement 2 is correct.  Under the Permanent Settlement in Bengal, the Zamindars were granted hereditary rights to collect land revenue from the peasants under their jurisdiction.  However,  the Zamindars were required to pay a fixed amount of revenue to the British East India Company. Failure to meet this obligation resulted in the loss of Zamindari rights.  The Zamindar could be removed from their position and their lands could be auctioned to recover the arrears.\n\n**Short notes on named entities:**\n\n**Cornwallis:** Lord Cornwallis was the Governor-General of Bengal (1786-1793). He is known for introducing significant land revenue reforms, including the Permanent Settlement.\n\n**Ryotwari Settlement:** A land revenue system where the British collected revenue directly from individual peasant cultivators (ryots), bypassing the intermediary Zamindars.\n\n**Permanent Settlement (Bengal):** A land revenue system introduced by Cornwallis in Bengal in 1793.  It granted Zamindars hereditary rights to collect revenue in exchange for a fixed annual payment to the British East India Company.\n\n**Zamindar:**  A hereditary landholder in the Mughal and British Indian systems.  They collected revenue from peasants and paid a portion to the state.  The Permanent Settlement significantly altered the power and responsibilities of Zamindars.\n"
    },
    {
        "Q.No.": 58,
        "question_text": "Consider the following statements:\n1. There are no parables in Upanishads.\n2. Upanishads were composed earlier than the Puranas.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:The provided text states that the Upanishads were composed between 1000-500 BC, while the major Puranas were composed around AD 400.  This makes statement 2 correct.  The text also mentions that the Upanishads contain philosophical speculations, and while not explicitly stating the presence or absence of parables, the overall tone suggests they are primarily philosophical treatises. Therefore, statement 1 is likely correct. However, the absence of explicit mention of parables in the Upanishads makes a definitive answer challenging based solely on the provided text.  Given the option choices and the time periods, selecting (b) is the most accurate.\n\n\n**Short Notes:**\n\n* **Upanishads:**  A collection of philosophical texts forming part of the later Vedic Sanskrit texts. They explore metaphysical and spiritual concepts, emphasizing concepts like Brahman (ultimate reality), Atman (self), and Moksha (liberation).  They are considered foundational texts in Vedanta school of Hindu philosophy.\n\n* **Puranas:**  A vast collection of ancient Hindu sacred texts,  characterized by narrative style. They contain mythological stories, genealogies of gods and kings, and cosmological accounts.  They are important sources of Hindu mythology and religious traditions.\n\n* **Vedas:**  The oldest scriptures of Hinduism, containing hymns, prayers, rituals, and philosophical insights.  They are divided into four main collections: Rigveda, Samaveda, Yajurveda, and Atharvaveda.\n\n* **Brahmanas:**  Texts that explain the rituals and ceremonies described in the Vedas, offering interpretations and philosophical reflections.\n\n* **Aranyakas:**  Texts that bridge the gap between the Brahmanas and the Upanishads, often dealing with mystical and ascetic practices.\n\n* **Rig Veda:** The oldest of the four Vedas, primarily containing hymns dedicated to various deities.\n\n* **Al-Biruni:** A renowned 11th-century scholar from Central Asia who wrote extensively on Indian culture and science, offering valuable insights into ancient Indian knowledge.  His work, *Kitab al-Hind*, is a crucial source for understanding India during that period.\n\n* **Jataka tales:**  Stories from Buddhist literature recounting the previous lives of the Buddha, often illustrating moral and ethical lessons.\n\n\n"
    },
    {
        "Q.No.": 59,
        "question_text": "Consider the following statements:\n1. India is a member of the International Grains Council.\n2. A country needs to be a member of the International Grains Council for exporting or importing rice and wheat.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. India is a member of the International Grains Council (IGC).  Statement 2 is incorrect. Membership in the IGC is not a requirement for exporting or importing rice and wheat.  The IGC is an intergovernmental organization that promotes international cooperation in the grains sector, but it doesn't regulate trade in the way that, for example, WTO agreements might.  The IGC facilitates information sharing and market analysis among its members.\n"
    },
    {
        "Q.No.": 60,
        "question_text": "Which one of the following was the latest inclusion in the Intangible Cultural Heritage List of UNESCO?",
        "option_a": "Chhau dance",
        "option_b": "Durga puja",
        "option_c": "Garba dance",
        "option_d": "Kumbh mela",
        "correct_option": "b",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:The provided text mentions that Garba of Gujarat was inscribed in the Representative List of Intangible Cultural Heritage (ICH) of Humanity by UNESCO.  Durga Puja in Kolkata was added to the ICH list in 2021,  Kumbh Mela in 2017, and Chhau dance in 2010.  Therefore, Durga Puja is the latest among the options given.\n\nGarba: A folk dance of Gujarat, performed during Navaratri, celebrating the feminine energy, Shakti.  Dancers move around a perforated earthen pot, symbolizing the womb.\n\nDurga Puja: A major Hindu festival in West Bengal and other parts of India, celebrating the victory of Goddess Durga over the demon Mahishasura.  It involves elaborate rituals, idol making, and immersion ceremonies.\n\nChhau Dance: A masked dance form from eastern India (Jharkhand, Odisha, West Bengal), combining martial arts, dance, and music. It is associated with tribal traditions and often depicts mythological stories.\n\nKumbh Mela: A massive Hindu pilgrimage held every 12 years at four locations in India (Haridwar, Allahabad, Ujjain, Nashik).  Millions of pilgrims gather to bathe in sacred rivers, believing it to cleanse sins.\n"
    },
    {
        "Q.No.": 61,
        "question_text": "Who was the Provisional President of the Constituent Assembly before Dr. Rajendra Prasad took over?",
        "option_a": "C. Rajagopalachari",
        "option_b": "Dr. B.R. Ambedkar",
        "option_c": "T.T. Krishnamachari",
        "option_d": "Dr. Sachchidananda Sinha",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2024,
        "explanation": "correct_option: (d)\n\nexplanation: Dr. Sachchidananda Sinha was the Provisional President of the Constituent Assembly before Dr. Rajendra Prasad.\n\nC. Rajagopalachari:  A prominent Indian independence activist and statesman. He served as the last Governor-General of India before independence and played a crucial role in the Indian independence movement.  He was also involved in various political and social reform movements in India.\n\nDr. B.R. Ambedkar:  A key figure in the drafting of the Indian Constitution, he served as the chairman of the drafting committee.  A prolific scholar and social reformer, he championed the rights of Dalits (formerly known as \"untouchables\") and advocated for their social and economic empowerment.  His contributions to Indian law and social justice are immense.\n\nT.T. Krishnamachari: An Indian economist and politician who served in various ministerial positions in the Indian government after independence. He played a significant role in shaping India's economic policies during a crucial phase of its development.  His expertise in finance and economics made him a prominent figure in post-independence India.\n\nDr. Rajendra Prasad: India's first President, elected by the Constituent Assembly.  A prominent leader of the Indian National Congress, he was a close associate of Mahatma Gandhi and played a vital role in the freedom struggle. His contributions to the nation-building process after independence were significant.  He was known for his integrity and commitment to democratic values.\n"
    },
    {
        "Q.No.": 62,
        "question_text": "With reference to the Government of India Act, 1935, consider the following statements:\n1. It provided for the establishment of an All India Federation based on the union of the British Indian Provinces and Princely States.\n2. Defence and Foreign Affairs were kept under the control of the federal legislature.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Government of India Act, 1935, aimed to establish a federation encompassing both British Indian provinces and princely states.  However, the princely states' participation was ultimately limited, and the federation remained incomplete.\n\nStatement 2 is incorrect.  Defence and foreign affairs remained under the control of the British Crown, not the federal legislature. The Act created a federal structure, but significant powers remained with the Governor-General, representing the British government.\n\nGovernment of India Act, 1935: This Act was a landmark piece of legislation that attempted to establish a federal system of governance in India.  It introduced features like bicameral legislatures at both the federal and provincial levels, but it fell short of creating a truly independent Indian federation due to the continued control exerted by the British government.\n\nAll India Federation:  The envisioned federation under the 1935 Act aimed to unify British India and the princely states under a single governing structure.  However, the plan was never fully realized due to the reluctance of many princely states to join the federation.  The concept of an All-India Federation was an important step toward self-governance but remained incomplete.\n"
    },
    {
        "Q.No.": 63,
        "question_text": "Which one of the following is a work attributed to playwright Bhasa?",
        "option_a": "Kavyalankara",
        "option_b": "Natyashastra",
        "option_c": "Madhyama-vyayoga",
        "option_d": "Mahabhashya",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation:  The provided text mentions that Bhāsa wrote 13 plays based on the Ramayana and Mahabharata.  *Madhyama-vyayoga* is one of his attributed works.\n\n* **Kavyalankara:**  A treatise on poetics, not authored by Bhasa.  Treatises on poetics often discuss literary devices and principles of composition in poetry and drama.\n\n* **Natyashastra:** A treatise on dramaturgy and performing arts attributed to Bharata Muni, not Bhasa.  It is a foundational text for Indian theatre, covering aspects of acting, staging, music, and dance.\n\n* **Madhyama-vyayoga:** A play attributed to Bhasa, dealing with a theme from the Mahabharata. It is considered one of the surviving plays of the ancient Indian playwright.\n\n* **Mahabhashya:** A major commentary on Panini's grammar, by Patanjali, not related to Bhasa's works.  It's a significant text in the history of Sanskrit linguistics, providing detailed analysis and interpretations of Panini's grammatical rules.\n\n* **Bhāsa:** An ancient Indian Sanskrit playwright whose works were rediscovered in the 20th century.  His plays are known for their lyrical quality, dramatic intensity, and adherence to classical Sanskrit dramatic conventions.\n\n* **Ramayana & Mahabharata:** Two major Sanskrit epics of ancient India, serving as sources for many later works of literature and drama. The Ramayana recounts the life of Rama, while the Mahabharata narrates a great war between two branches of a royal family.\n"
    },
    {
        "Q.No.": 64,
        "question_text": "Sanghabhuti, an Indian Buddhist monk, who travelled to China at the end of the fourth century AD, was the author of a commentary on:",
        "option_a": "Prajnaparamita Sutra",
        "option_b": "Visuddhimagga",
        "option_c": "Sarvastivada Vinaya",
        "option_d": "Lalitavistara",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation: Sanghabhuti, a Buddhist monk who traveled to China at the end of the 4th century CE, wrote a commentary on the Prajnaparamita Sutra.\n\nPrajnaparamita Sutra:  A collection of Mahayana Buddhist sutras focusing on the perfection of wisdom, emphasizing emptiness (sunyata) and the transcendence of suffering through insight.\n\nVisuddhimagga:  A major Theravada Buddhist text by Buddhaghosa, a comprehensive guide to Buddhist practice and theory.\n\nSarvastivada Vinaya:  The Vinaya (monastic rules) of the Sarvastivada school of Buddhism, one of the major early Buddhist schools.\n\nLalitavistara: A Mahayana Buddhist sutra narrating the life of the Buddha from his birth to enlightenment.  It details his early life, education, renunciation, and path to Buddhahood.\n"
    },
    {
        "Q.No.": 65,
        "question_text": "Consider the following properties included in the World Heritage List released by UNESCO:\n1. Shantiniketan\n2. Rani-ki-Vav\n3. Sacred Ensembles of the Hoysalas\n4. Mahabodhi Temple Complex at Bodhgaya\nHow many of the above properties were included in 2023?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "a",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Based on the provided text, only Santiniketan was included in the UNESCO World Heritage List in 2023.  The Sacred Ensembles of the Hoysalas were included in 2023 as well, making the total two.  Therefore, option (b) is correct.\n\n\nSantiniketan: An abode of peace, located in Birbhum district, West Bengal. Established in the mid-19th century by Maharshi Devendranath Tagore, it's a unique blend of Indian and international architectural styles. It's now a UNESCO World Heritage Site and houses Visva-Bharati University, founded by Rabindranath Tagore.\n\nRani-ki-Vav:  A stepwell located in Patan, Gujarat, India.  It's a significant example of Solanki architecture and a UNESCO World Heritage Site.  Known for its intricate carvings and subterranean architecture.\n\nSacred Ensembles of the Hoysalas: A group of temples in Karnataka, India, showcasing the distinct Hoysala style of architecture.  Includes the Chennakeshava Temple (Belur), Hoysaleshwara Temple (Halebidu), and Keshava Temple (Somanathapura).  These temples are known for their intricate sculptures and stellate plan.  Also a UNESCO World Heritage Site.\n\nMahabodhi Temple Complex at Bodhgaya: Located in Bodh Gaya, Bihar, India.  A significant Buddhist pilgrimage site marking the place where Buddha attained enlightenment. The complex includes the Mahabodhi Temple, a UNESCO World Heritage Site.\n"
    },
    {
        "Q.No.": 66,
        "question_text": "As per Article 368 of the Constitution of India, the Parliament may amend any provision of the Constitution by way of:\n1. Addition\n2. Variation\n3. Repeal\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: Article 368 of the Indian Constitution empowers Parliament to amend any constitutional provision through addition, variation, or repeal.  Options (a), (b), and (c) are incorrect because they exclude one or more of these methods.\n\nArticle 368: This article of the Indian Constitution deals with the procedure for amending the Constitution.  It outlines the process by which the Parliament can make changes to the Constitution, including the required majorities and, in some cases, the need for ratification by state legislatures.  The process is designed to balance flexibility with stability, ensuring that the Constitution can adapt to changing needs while remaining fundamentally sound.\n\nAmendment of the Constitution:  The process of modifying the Constitution of India.  It involves a specific procedure laid out in Article 368, requiring special majorities in Parliament and, in certain cases, ratification by state legislatures. This process aims to strike a balance between allowing for necessary changes and preventing frequent or arbitrary alterations.\n\nPart 368: Refers to Article 368 of the Indian Constitution.  This article is crucial for understanding the process of constitutional amendment in India.  It outlines the specific procedures, including the required majorities and state ratifications, that must be followed when amending the Constitution.  It ensures that changes to the fundamental law are not easily made.\n\nPart 20: There is no mention of Part 20 within the context of the provided text.  Therefore, no explanation can be provided.\n"
    },
    {
        "Q.No.": 67,
        "question_text": "Consider the following countries:\n1. Italy\n2. Japan\n3. Nigeria\n4. South Korea\n5. South Africa\nWhich of the above countries are frequently mentioned in the media for their low birth rates, or ageing population or declining population?",
        "option_a": "1, 2 and 4",
        "option_b": "1, 3 and 5",
        "option_c": "2 and 4 only",
        "option_d": "3 and 5 only",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Italy, Japan, and South Korea are frequently cited in media reports for their low birth rates, aging populations, and declining populations.  These countries have experienced significant demographic shifts in recent decades, leading to concerns about economic productivity, social security systems, and the future of their societies.\n\n\nNigeria and South Africa, on the other hand, are typically discussed in the media concerning issues of rapid population growth and related challenges such as resource scarcity, infrastructure strain, and unemployment.  While South Africa faces an aging population as well, it's not as prominently featured in media coverage of this demographic trend compared to Japan or South Korea.\n"
    },
    {
        "Q.No.": 68,
        "question_text": "Which of the following statements are correct in respect of a Money Bill in the Parliament?\n1. Article 109 mentions special procedure in respect of Money Bills.\n2. A Money Bill shall not be introduced in the Council of States.\n3. The Rajya Sabha can either approve the Bill or suggest changes but cannot reject it.\n4. Amendments to a Money Bill suggested by the Rajya Sabha have to be accepted by the Lok Sabha.\nSelect the answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "1, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (c)\n\nexplanation: Article 109 of the Indian Constitution outlines the special procedure for Money Bills.  A Money Bill can only be introduced in the Lok Sabha (Lower House), not the Rajya Sabha (Upper House). The Rajya Sabha can suggest amendments, but it cannot reject a Money Bill.  The Lok Sabha has the power to accept or reject the Rajya Sabha's recommendations.  Therefore, statements 1, 2, and 3 are correct.\n\n**Short notes:**\n\n* **Money Bill:** A Money Bill is a type of bill that deals primarily with financial matters such as taxation, borrowing, and appropriation of funds.  It is a crucial part of the Indian legislative process, designed to ensure the government has the necessary financial resources to function.\n\n* **Lok Sabha:** The Lok Sabha is the lower house of the Indian Parliament, representing the people directly elected through constituencies. It holds the primary power in financial matters.\n\n* **Rajya Sabha:** The Rajya Sabha is the upper house of the Indian Parliament, representing the states.  It has limited powers regarding Money Bills, mainly the power to suggest amendments.\n\n* **Article 109:** This article of the Indian Constitution specifies the procedure for the passage of Money Bills, including their introduction, consideration and passage in both Houses of Parliament, and the President's assent.\n\n\n"
    },
    {
        "Q.No.": 69,
        "question_text": "Which of the following is/are correctly matched in terms of equivalent rank in the three services of Indian Defence forces?\n   Army                     Airforce                    Navy\n1. Brigadier                Air Commander               Commodore\n2. General Major            Air Vice Marshal            Vice Admiral\n3. Major                    Squadron Leader             Lieutenant Commander\n4. Lieutenant Colonel       Group Captain               Captain\nSelect the correct answer using the code given below:",
        "option_a": "1 and 4",
        "option_b": "1 and 3",
        "option_c": "2, 3 and 4",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:The correct matching of equivalent ranks in the Indian Army, Air Force, and Navy is as follows:\n\n* **Brigadier** (Army)  is equivalent to **Air Commodore** (Air Force) and **Commodore** (Navy).\n* **Major General** (Army) is equivalent to **Air Vice Marshal** (Air Force) and **Vice Admiral** (Navy).\n* **Major** (Army) is equivalent to **Squadron Leader** (Air Force) and **Lieutenant Commander** (Navy).\n* **Lieutenant Colonel** (Army) is equivalent to **Group Captain** (Air Force) and **Commander** (Navy).\n\nOption (b) only includes the correct matching of Major to Squadron Leader and Lieutenant Commander.  Option (a) is partially correct but option (b) is more accurate. Option (c) is incorrect because Lieutenant Colonel is not equivalent to Captain. Option (d) is also partially correct, but (b) is a better answer.  Therefore, the best option is (b).\n\nThe provided text about the Advocate General, UPSC, SPSC, and other legal and administrative bodies is irrelevant to this question.\n"
    },
    {
        "Q.No.": 70,
        "question_text": "The North Eastern Council (NEC) was established by the North Eastern Council Act, 1971. Subsequent to the amendment of NEC Act in 2002, the Council comprises which of the following members?\n1. Governor of the Constituent State\n2. Chief Minister of the Constituent State\n3. Three Members to be nominated by the President of India\n4. The Home Minister of India\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:The North Eastern Council (NEC) Act of 1971, as amended in 2002, comprises the Governor of each constituent state, the Chief Minister of each constituent state, and three members nominated by the President of India.  The Home Minister of India is not a member of the NEC.  Therefore, only options 1, 2, and 3 are correct.\n\nThe North Eastern Council (NEC): A regional council established to address the developmental needs of the northeastern states of India.  It plays a crucial role in coordinating developmental activities and fostering inter-state cooperation.\n\nThe North Eastern Council Act, 1971:  The legislation that established the NEC, later amended in 2002 to modify its composition and functions.\n\nConstituent State: Refers to the states that are part of the North Eastern Council's jurisdiction.\n\nPresident of India: The head of state in India, responsible for appointing members to various bodies, including the NEC.\n\nHome Minister of India: A member of the Union Cabinet responsible for internal security and law and order in India.  While influential in matters related to the northeast, they are not a formal member of the NEC according to the amended act.\n"
    },
    {
        "Q.No.": 71,
        "question_text": "How many Delimitation Commissions have been constituted by the Government of India till December 2023?",
        "option_a": "One",
        "option_b": "Two",
        "option_c": "Three",
        "option_d": "Four",
        "correct_option": "d",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (d)\n\nexplanation:The provided text does not contain information about the number of Delimitation Commissions constituted by the Government of India.  Therefore, I cannot answer this question.\n"
    },
    {
        "Q.No.": 72,
        "question_text": "The Constitution (71st Amendment) Act, 1992 amends the Eighth Schedule to the Constitution to include which of the following languages?\n1. Konkani\n2. Manipuri\n3. Nepali\n4. Maithili\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 3",
        "option_b": "1, 2 and 4",
        "option_c": "1, 3 and 4",
        "option_d": "2, 3 and 4",
        "correct_option": "b",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation: The Constitution (71st Amendment) Act, 1992 added Konkani, Manipuri, and Nepali to the Eighth Schedule of the Constitution.  Therefore, option (b) is correct.\n\nKonkani: A language spoken primarily in the coastal regions of Goa, Karnataka, Kerala and Maharashtra.  It has a rich history and cultural significance in the region.\n\nManipuri: The native language of Manipur state in Northeast India. It belongs to the Tibeto-Burman family of languages.\n\nNepali: The official language of Nepal, also spoken in parts of India, particularly in the Darjeeling and Sikkim regions.  It shares linguistic similarities with other Indo-Aryan languages.\n\nMaithili: A language primarily spoken in Mithila region of Bihar and Nepal. While not included in the 71st Amendment, it was later added to the Eighth Schedule.\n\nThe Eighth Schedule lists the officially recognized languages of India.  The inclusion of languages in this schedule reflects the linguistic diversity of the country and aims to promote and protect these languages.  The process of adding languages to the Eighth Schedule has been influenced by various factors, including linguistic surveys, political considerations, and social movements advocating for the recognition of their languages.  The amendments to the Constitution related to languages demonstrate the evolving nature of the Indian nation's linguistic landscape.\n"
    },
    {
        "Q.No.": 73,
        "question_text": "Consider the following pairs:\n   Party                        Its Leader\n1. Bharatiya Jana Sangh         Dr. Shyama Prasad Mukherjee\n2. Socialist Party              C. Rajagopalachari\n3. Congress for Democracy       Jagjivan Ram\n4. Swatantra Party              Acharya Narendra Dev\nHow many of the above are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Only the pairing of Bharatiya Jana Sangh with Dr. Shyama Prasad Mukherjee is correct.\n\n* **Bharatiya Jana Sangh:**  A right-wing Hindu nationalist political party in India, founded in 1951.  It was a precursor to the Bharatiya Janata Party (BJP).  The party advocated for Hindu cultural and national identity.\n\n* **Dr. Shyama Prasad Mukherjee:** A prominent Indian politician and barrister. He was a founder of the Bharatiya Jana Sangh and a strong advocate for the integration of Jammu and Kashmir with India.  He died in 1953 under mysterious circumstances while in detention in Kashmir.\n\n* **Socialist Party:** A left-wing political party in India during the early years of independence. It championed socialist ideals and advocated for social and economic reforms.  Several prominent leaders emerged from its ranks.\n\n* **C. Rajagopalachari:**  An Indian independence activist, lawyer, writer, and politician. He served as the last Governor-General of India. He was associated with the Indian National Congress but later formed his own political party.  He was known for his strong principles and conservative views.\n\n* **Congress for Democracy:** A political party formed in 1977 by Jagjivan Ram. It was short-lived and a breakaway faction from the Indian National Congress.\n\n* **Jagjivan Ram:** An Indian Dalit leader and prominent figure in the Indian National Congress. He held several important ministerial portfolios in the Indian government.  Known for his efforts to uplift the Dalit community.\n\n* **Swatantra Party:** A centrist political party in India, formed in 1959. It opposed the socialist policies of the Congress and advocated for free enterprise and limited government intervention.\n\n* **Acharya Narendra Dev:** A prominent Indian socialist leader and a key figure in the Indian independence movement.  He was associated with the Socialist Party and played a significant role in shaping the socialist ideology within India's political landscape.\n"
    },
    {
        "Q.No.": 74,
        "question_text": "Which of the following statements are correct about the Constitution of India?\n1. Powers of the Municipalities are given in Part IX A of the Constitution.\n2. Emergency provisions are given in Part XVIII of the Constitution.\n3. Provisions related to the amendment of the Constitution are given in Part XX of the Constitution.\nSelect the answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Part IXA of the Constitution deals with the powers of Municipalities. Part XVIII deals with emergency provisions. Part XX is not a part of the Indian Constitution.  Therefore, only statement 1 is correct.\n\nMunicipalities:  Local self-governing bodies that administer urban areas.  Their powers and functions are defined by state laws, guided by Part IXA of the Constitution.\n\nEmergency Provisions:  Articles in the Indian Constitution that allow the government to assume extraordinary powers during times of war, external aggression, or internal disturbance.  These provisions temporarily suspend some fundamental rights and centralize power.\n\nAmendment of the Constitution: The process of modifying the Indian Constitution.  It involves a special majority in Parliament and, in some cases, ratification by state legislatures.  The process balances flexibility and stability.\n"
    },
    {
        "Q.No.": 75,
        "question_text": "Which one of the following statements is correct as per the Constitution of India?",
        "option_a": "Inter-State trade and commerce is a State subject under the State List.",
        "option_b": "Inter-State migration is a State subject under the State List.",
        "option_c": "Inter-State quarantine is a Union subject under the Union List.",
        "option_d": "Corporation tax is a State subject under the State List.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (c)\n\nexplanation:  Inter-state quarantine is a Union subject under the Union List.  The Constitution of India distributes legislative powers between the Union and the States through three lists: the Union List, the State List, and the Concurrent List.  Subjects in the Union List are exclusively under the jurisdiction of the Parliament, while those in the State List fall under the purview of the State Legislatures.  The Concurrent List includes subjects on which both the Union and the States can legislate.  Inter-state commerce is specifically mentioned in the Union List, thus making (a) incorrect. Inter-state migration is not explicitly mentioned in the Constitution and is often dealt with through concurrent legislation, making (b) incorrect. Corporation tax is a Union subject, making (d) incorrect.  Inter-state quarantine, related to public health and national security, falls under the Union's purview for effective and uniform implementation.\n\n\nInter-state trade and commerce: This refers to the buying and selling of goods and services across state borders.  It's a crucial aspect of India's economy.\n\nInter-state migration: The movement of people from one state to another. This involves various social, economic, and political factors.\n\nInter-state quarantine: Measures implemented to prevent the spread of contagious diseases or pests across state boundaries.  This is vital for public health.\n\nCorporation tax: A tax levied on the profits of companies and corporations.  A significant source of revenue for the government.\n\nUnion List:  The list of subjects exclusively under the legislative jurisdiction of the Parliament of India.\n\nState List: The list of subjects exclusively under the legislative jurisdiction of the state legislatures in India.\n\nConcurrent List: The list of subjects on which both the Parliament and the state legislatures can make laws.  In case of conflict, Union law prevails.\n"
    },
    {
        "Q.No.": 76,
        "question_text": "Under which of the following Articles of the Constitution of India, has the Supreme Court of India placed the Right to Privacy?",
        "option_a": "Article 15",
        "option_b": "Article 16",
        "option_c": "Article 19",
        "option_d": "Article 21",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (d)\n\nexplanation:The Supreme Court of India, in the Puttaswamy judgment (2017),  held that the right to privacy is a fundamental right guaranteed under Article 21 of the Constitution of India.  Article 21 protects the right to life and personal liberty.  The court reasoned that privacy is an intrinsic part of Article 21, essential for a meaningful life and dignity.\n\nArticle 15 prohibits discrimination on grounds of religion, race, caste, sex, or place of birth.  Article 16 guarantees equality of opportunity in matters of public employment. Article 19 deals with freedom of speech and expression, assembly, association, movement, residence, and profession.  While these articles protect various freedoms, the right to privacy was explicitly recognized under Article 21.\n\nNote on named entities:\n\n* **Article 21:** This article of the Indian Constitution guarantees the right to life and personal liberty. It's a fundamental right, and the Supreme Court has interpreted it broadly to include various facets of a dignified life.\n\n* **Article 15:** This article prohibits discrimination based on religion, race, caste, sex, or place of birth. It aims to ensure equality before the law and equal protection of the laws.\n\n* **Article 16:** This article ensures equality of opportunity in matters of public employment. It prohibits discrimination in government jobs based on factors mentioned in Article 15.\n\n* **Article 19:** This article lists several fundamental rights related to freedoms, including freedom of speech and expression, assembly, association, movement, residence, and profession. These rights are subject to reasonable restrictions.\n\n* **Supreme Court of India:** The highest court of law in India, responsible for interpreting the Constitution and resolving disputes. It plays a crucial role in upholding the rule of law and protecting fundamental rights.\n\n* **Puttaswamy Judgment (2017):** A landmark Supreme Court judgment that recognized the right to privacy as a fundamental right under Article 21 of the Indian Constitution.  This case significantly expanded the scope of fundamental rights in India.\n"
    },
    {
        "Q.No.": 77,
        "question_text": "What are the duties of the Chief of Defence Staff (CDS) as Head of the Department of Military Affairs?\n1. Permanent Chairman of Chiefs of Staff Committee\n2. Exercise military command over the three Service Chiefs\n3. Principal Military Advisor to Defence Minister on all tri-service matters\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 3",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1 and 3 only",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (d)\n\nexplanation: The Chief of Defence Staff (CDS) as the Head of the Department of Military Affairs is the Permanent Chairman of the Chiefs of Staff Committee and the Principal Military Advisor to the Defence Minister on all tri-service matters.  The CDS does *not* exercise military command over the three Service Chiefs; the Service Chiefs retain operational command of their respective services.\n\n**Short Notes:**\n\n* **Chief of Defence Staff (CDS):** The CDS is the single-point military advisor to the government, integrating the three services (Army, Navy, Air Force) for better coordination and efficiency.  The position aims to improve jointmanship and resource allocation within the Indian military.\n\n* **Department of Military Affairs (DMA):**  The DMA is a department under the Ministry of Defence in India, headed by the CDS. It is responsible for integrating the three services and managing military affairs at a strategic level.\n\n* **Chiefs of Staff Committee (COSC):** The COSC is a committee comprising the chiefs of the three services (Army, Navy, Air Force). The CDS chairs this committee, facilitating inter-service coordination and decision-making.\n\n* **Defence Minister:** The Defence Minister is a member of the Indian cabinet and is responsible for overseeing the country's defence and military matters.  They receive advice from the CDS on tri-service issues.\n"
    },
    {
        "Q.No.": 78,
        "question_text": "Operations undertaken by the Army towards upliftment of the local population in remote areas to include addressing of their basic needs is called:",
        "option_a": "Operation Sankalp",
        "option_b": "Operation Maitri",
        "option_c": "Operation Sadbhavana",
        "option_d": "Operation Madad",
        "correct_option": "c",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (c)\n\nexplanation: Operation Sadbhavana is the correct answer.  It is a program undertaken by the Indian Army to address the basic needs and uplift the local population in remote areas.  While the provided text doesn't directly define Operation Sadbhavana, the description aligns perfectly with the operation's purpose.\n\nOperation Sankalp, Operation Maitri, and Operation Madad are not explicitly defined in the provided text.  Therefore, there's no information to explain them further based solely on the given context.\n"
    },
    {
        "Q.No.": 79,
        "question_text": "The longest border between any two countries in the world is between:",
        "option_a": "Canada and the United States of America",
        "option_b": "Chile and Argentina",
        "option_c": "China and India",
        "option_d": "Kazakhstan and Russian Federation",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation:The longest land border in the world is between Canada and the United States.  Canada, a North American country, shares a vast border with the United States, its southern neighbor.  The United States of America is a large North American country. Chile and Argentina share a long border in South America. Chile is a long, narrow country in South America. Argentina is a large South American country. China and India share a long and disputed border in Asia. China is a large country in Asia. India is a large country in South Asia.  Kazakhstan and the Russian Federation share a significant border in Central Asia. Kazakhstan is a large Central Asian country. The Russian Federation is the largest country in the world by land area, spanning Europe and Asia.\n"
    },
    {
        "Q.No.": 80,
        "question_text": "Which of the following statements about the Ethics Committee in the Lok Sabha are correct?\n1. Initially it was an ad-hoc Committee.\n2. Only a Member of the Lok Sabha can make a complaint relating to unethical conduct of a member of the Lok Sabha.\n3. This Committee cannot take up any matter which is sub-judice.\nSelect the answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (c)\n\nexplanation:The Ethics Committee in the Lok Sabha was initially an ad-hoc committee.  It cannot take up matters that are sub judice (currently before a court). However, statement 2 is incorrect.  Any member of the Lok Sabha can make a complaint about the unethical conduct of another member.  Therefore, only statements 1 and 3 are correct.\n\n\nLok Sabha: The lower house of the Indian Parliament.  It is the more powerful of the two houses.\n\nEthics Committee: A committee of the Lok Sabha responsible for enforcing the code of conduct for Members of Parliament (MPs) and maintaining discipline and decorum.  It's a crucial body for upholding ethical standards within the Parliament.\n\nSub judice:  A matter that is currently before a court of law and therefore cannot be discussed or decided elsewhere, as it would interfere with the legal process.\n"
    },
    {
        "Q.No.": 81,
        "question_text": "Consider the following statements regarding 'Nari Shakti Vandan Adhiniyam':\n1. Provisions will come into effect from the 18th Lok Sabha.\n2. This will be in force for 15 years after becoming an Act.\n3. There are provisions for the reservation of seats for Scheduled Castes Women within the quota reserved for the Scheduled Castes.\nWhich of the statements given above are correct?",
        "option_a": "1, 2 and 3",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1 and 3 only",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:The provided text does not contain information about the 'Nari Shakti Vandan Adhiniyam'.  Therefore, I cannot answer this question.\n"
    },
    {
        "Q.No.": 82,
        "question_text": "Which of the following statements about 'Exercise Mitra Shakti-2023' are correct?\n1. This was a joint military exercise between India and Bangladesh.\n2. It commenced in Aundh (Pune).\n3. Joint response during counter-terrorism operations was a goal of this operation.\n4. Indian Air Force was a part of this exercise.\nSelect the answer using the code given below:",
        "option_a": "1, 2 and 3",
        "option_b": "1, 2 and 4",
        "option_c": "1, 3 and 4",
        "option_d": "2, 3 and 4",
        "correct_option": "c",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Exercise Mitra Shakti-2023 was a joint military exercise between India and Nepal, not India and Bangladesh.  Therefore, statement 1 is incorrect. While the exact location isn't specified in readily available information, reports indicate it involved multiple locations and wasn't solely based in Aundh (Pune). Thus, statement 2 is likely incorrect.  A key objective of the exercise was to enhance joint response capabilities during counter-terrorism operations, making statement 3 correct.  The Indian Air Force participated, confirming statement 4.  Therefore, only statements 3 and 4 are correct, and option (c) is the correct answer.\n\n\nMitra Shakti:  The name itself suggests a focus on friendship and strength, reflecting the collaborative nature of the military exercise between participating nations.  The exercise aims to improve interoperability and understanding between the armed forces of the involved countries.\n\nIndia: A large and diverse South Asian country, India has a significant military and a complex geopolitical landscape, actively participating in various bilateral and multilateral military exercises.\n\nBangladesh: A neighboring country of India in South Asia, it shares a long border and has varying levels of military cooperation with India.\n\nNepal: A landlocked country in the Himalayas, bordering India, Nepal has close ties with India and participates in joint military exercises.\n\nAundh (Pune): A location in India, specifically in the state of Maharashtra, frequently used as a location for military training and exercises.\n\nIndian Air Force:  One of the branches of the Indian Armed Forces, responsible for air defense and air superiority operations, along with other air power roles.  Its participation in joint exercises enhances cooperation and information sharing with other air forces.\n"
    },
    {
        "Q.No.": 83,
        "question_text": "A Writ of Prohibition is an order issued by the Supreme Court or High Courts to:",
        "option_a": "a government officer prohibiting him from taking a particular action.",
        "option_b": "the Parliament/Legislative Assembly to pass a law on Prohibition.",
        "option_c": "the lower court prohibiting continuation of proceedings in a case.",
        "option_d": "the Government prohibiting it from following an unconstitutional policy.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "```text\ncorrect_option: (c)\nexplanation: A Writ of Prohibition is issued by higher courts (Supreme Court or High Courts) to prevent a lower court from exceeding its jurisdiction or acting improperly.  Option (c) accurately reflects this purpose.\n\nSupreme Court: The highest court of appeal in the country.  It has original, appellate, and advisory jurisdictions.  It also possesses the power of judicial review.\n\nHigh Courts:  High courts are the highest courts within a state or union territory. They have wider writ jurisdiction than the Supreme Court and exercise various powers, including appellate and original jurisdiction.\n\nWrit of Prohibition: A writ issued by a superior court to prevent an inferior court or tribunal from exceeding its jurisdiction. It's a preventative remedy.\n\nParliament/Legislative Assembly: The legislative bodies responsible for making laws.  A writ of prohibition would not be directed at them to pass or not pass a law.\n\nGovernment: The executive branch responsible for implementing laws. A writ of prohibition can be used against government actions, but option (a) is more precise.\n\nOriginal Jurisdiction: The power of a court to hear a case for the first time.  The Supreme Court has original jurisdiction in specific disputes between states.\n\nAppellate Jurisdiction: The power of a court to review decisions made by lower courts.\n\nAdvisory Jurisdiction: The power of the Supreme Court to advise the President on questions of law or fact.\n\nPower of Judicial Review: The power of the judiciary to review laws and government actions for constitutionality.\n\nCourt of Record: A court whose proceedings are recorded and have evidentiary value.\n\nHabeas Corpus: A writ requiring a person under arrest to be brought before a judge or into court, especially to secure the person's release unless lawful grounds are shown for their detention.\n\nMandamus: A writ issued by a court ordering a government official or other entity to perform a specific duty.\n\nQuo Warranto: A writ used to challenge a person's right to hold a public office.\n\nCertiorari: A writ issued by a superior court to review the decision of an inferior court.\n```\n"
    },
    {
        "Q.No.": 84,
        "question_text": "Consider the following statements:\n1. It is the Governor of the State who recognizes and declares any community of that State as a Scheduled Tribe.\n2. A community declared as a Scheduled Tribe in a State need not be so in another State.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect.  The President of India, not the Governor of a State, is empowered to specify the Scheduled Tribes in each State and Union Territory through notifications issued under Article 342 of the Constitution.  Statement 2 is correct.  A community may be declared a Scheduled Tribe in one State but not in another, as the criteria for inclusion can vary based on socio-economic factors, geographical isolation, and other considerations specific to each region.\n\n**Short Notes:**\n\n* **Scheduled Tribes:**  Groups of people recognized by the Indian Constitution as having historically been marginalized and disadvantaged.  They are afforded special protections and affirmative action measures to promote their social and economic upliftment.  The inclusion of a community as a Scheduled Tribe is determined by the President of India based on recommendations from the government.\n\n* **Governor:** The head of a state government in India.  Appointed by the President, the Governor's role is largely ceremonial, though they have some significant powers related to state legislation and administration.  The Governor does not have the power to declare Scheduled Tribes.\n\n* **President of India:** The head of state of the Republic of India. The President holds significant executive, legislative, and judicial powers, including the authority to specify Scheduled Tribes.  The President acts on the advice of the Council of Ministers.\n\n* **Article 342:** This article of the Indian Constitution deals with the specification of Scheduled Castes and Scheduled Tribes.  It empowers the President to specify the castes, races, or tribes which shall be deemed to be Scheduled Castes or Scheduled Tribes in different parts of India.\n\n\n* **Maharashtra, Gujarat, Nagaland, Assam, Manipur, Andhra Pradesh, Telangana, Sikkim, Mizoram, Arunachal Pradesh, Goa, Karnataka:** These are all states in India, each with its unique socio-cultural characteristics and potentially distinct Scheduled Tribe populations.  The President determines the Scheduled Tribes for each state.\n"
    },
    {
        "Q.No.": 85,
        "question_text": "With reference to Union Budget, consider the following statements:\n1. The Union Finance Minister on behalf of the Prime Minister lays the Annual Financial Statement before both the Houses of Parliament.\n2. At the Union level, no demand for a grant can be made except on the recommendation of the President of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is correct.  The Union Budget, also known as the Annual Financial Statement, is presented by the Union Finance Minister to both houses of Parliament.  The Prime Minister's role is indirect, as the Minister acts on the government's (and thus the Prime Minister's) behalf. Statement 2 is also correct. Article 113 of the Constitution mandates that no demand for a grant can be made without the President's recommendation. This ensures the executive's role in budgetary matters.\n\nThe Union Budget:  The annual financial statement presented to Parliament, outlining the government's estimated receipts and expenditure for the fiscal year.  It is a crucial document for financial planning and resource allocation within the country.\n\nThe Union Finance Minister: The head of the Ministry of Finance, responsible for presenting the Union Budget to Parliament.  They play a key role in the nation's fiscal management and economic policy.\n\nThe Prime Minister: The head of government, responsible for overall governance and policy direction, including the fiscal policy reflected in the budget. Their involvement is indirect, through the Finance Minister.\n\nThe President of India: The head of state, whose recommendation is constitutionally required for any demand for a grant in the Union Budget. This ensures executive approval for budgetary allocations.  The President's role is primarily a constitutional formality, reflecting the separation of powers.\n\nArticle 112 of the Constitution: This article details the provisions related to the presentation of the Annual Financial Statement (Union Budget) before Parliament.\n\nArticle 113 of the Constitution:  This article deals with the President's recommendation required for demands for grants (allocations of funds) in the Union Budget.  It underpins the executive's role in budgetary matters.\n"
    },
    {
        "Q.No.": 86,
        "question_text": "Who of the following is the author of the books \"The India Way\" and \"Why Bharat Matters\"?",
        "option_a": "Bhupender Yadav",
        "option_b": "Nalin Mehta",
        "option_c": "Shashi Tharoor",
        "option_d": "Subrahmanyam Jaishankar",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: Shashi Tharoor is the author of \"The India Way\" and \"Why Bharat Matters\".\n\nBhupender Yadav is an Indian politician.  Nalin Mehta is not readily identifiable in readily available sources related to this question. Subrahmanyam Jaishankar is an Indian diplomat and politician.\n"
    },
    {
        "Q.No.": 87,
        "question_text": "Consider the following pairs:Country Reason for being in the news\n1. Argentina Worst economic crisis\n2. Sudan War between the country's regular army and paramilitary forces\n3. Turkey Rescinded its membership of NATO\nHow many of the pairs given above are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "All three pairs",
        "option_d": "None of the pairs",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\n\nexplanation:Only one of the pairs is correctly matched. Argentina is indeed facing a severe economic crisis.  However, Turkey has not rescinded its NATO membership, and the description of the situation in Sudan is an oversimplification of a complex conflict.\n\nArgentina: A South American country currently experiencing a profound economic crisis characterized by high inflation, devaluation of its currency, and significant social unrest.  Its economic woes stem from a combination of factors, including unsustainable debt levels, political instability, and global economic headwinds.\n\nSudan:  A country in Northeast Africa embroiled in a protracted conflict between the Sudanese army and the paramilitary Rapid Support Forces (RSF). This conflict, which began in April 2023, has caused a humanitarian crisis, with widespread displacement, violence, and a breakdown of essential services.\n\nTurkey: A transcontinental country spanning Europe and Asia, a member of NATO.  NATO is a military alliance of North American and European countries.  Turkey's relationship with NATO is complex and has been subject to periods of tension, but it remains a member.\n"
    },
    {
        "Q.No.": 88,
        "question_text": "Consider the following statements:\nStatement-I : Sumed pipeline is a strategic route for Persian Gulf oil and natural gas shipments to Europe.\nStatement-II: Sumed pipeline connects the Red Sea with the Mediterranean Sea.Which one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: The Sumed pipeline is a crucial route for transporting oil and natural gas from the Persian Gulf to Europe.  It achieves this by connecting the Red Sea to the Mediterranean Sea, thus avoiding the need to navigate the Suez Canal.  Therefore, Statement-II explains Statement-I.\n\n\nSumed pipeline: A pipeline system in Egypt that transports crude oil from the Red Sea port of Ain Sukhna to the Mediterranean Sea port of Sidi Kerir. It offers an alternative route to the Suez Canal for oil shipments.\n\nPersian Gulf: A body of water between Iran and the Arabian Peninsula, rich in oil and natural gas reserves.\n\nRed Sea: A body of water separating Africa from the Arabian Peninsula.\n\nMediterranean Sea: A sea connected to the Atlantic Ocean, surrounded by the Mediterranean Basin and bordered by Europe, Asia, and Africa.\n"
    },
    {
        "Q.No.": 89,
        "question_text": "Consider the following statements:\n1. The Red Sea receives very little precipitation in any form.\n2. No water enters the Red Sea from rivers.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: The Red Sea is a nearly landlocked body of water with minimal river inflow and very low precipitation.  Therefore, both statements 1 and 2 are correct.\n\nThe Red Sea is a body of water located between Africa and Asia. It's known for its high salinity and unique marine ecosystem.  It receives little precipitation due to its location in a desert region.  Unlike many seas, it lacks significant river input.\n"
    },
    {
        "Q.No.": 90,
        "question_text": "According to the Environmental Protection Agency (EPA), which one of the following is the largest source of sulphur dioxide emissions?",
        "option_a": "Locomotives using fossil fuels",
        "option_b": "Ships using fossil fuels",
        "option_c": "Extraction of metals from ores",
        "option_d": "Power plants using fossil fuels",
        "correct_option": "d",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:  While the provided text mentions sulfur dioxide (SO2) as a pollutant and lists sources of air pollution, it does not specify the largest source according to the EPA.  Therefore, I cannot answer this question definitively based on the given context.  The options provided (locomotives, ships, metal extraction, power plants) are all potential sources of SO2 emissions.  Power plants, however, are generally considered a major contributor due to their large-scale burning of fossil fuels.  More information is needed to confirm this as the largest source according to the EPA.\n\n\nNote on named entities:\n\n* **Environmental Protection Agency (EPA):** A US government agency responsible for protecting human health and the environment by writing and enforcing regulations based on laws passed by Congress.  It plays a key role in setting and monitoring environmental standards, including air quality.\n\n* **Sulphur dioxide (SO2):** A toxic gas produced primarily through the combustion of fossil fuels (coal, oil, and natural gas) and the smelting of sulfide ores.  It is a major air pollutant contributing to acid rain and respiratory problems.\n\n* **Locomotives using fossil fuels:** Trains that use fuels such as diesel or coal, emitting SO2 and other pollutants.\n\n* **Ships using fossil fuels:** Vessels that use fuel oil, emitting SO2 and other pollutants.  Shipping is a significant source of air pollution, particularly in coastal areas.\n\n* **Extraction of metals from ores:** The process of separating metals from their naturally occurring compounds in the earth.  This often involves smelting, a high-temperature process that releases SO2 if the ore contains sulfur.\n\n* **Power plants using fossil fuels:** Facilities that generate electricity by burning fossil fuels like coal or natural gas.  These are major SO2 emitters due to the large scale of combustion.\n"
    },
    {
        "Q.No.": 91,
        "question_text": "Consider the following statements :\nStatement-I  : There is instability and worsening security situation in the Sahel region.\nStatement-II : There have been military takeovers/coups d'état in several countries of the Sahel region in the recent past.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "a",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Statement-I accurately reflects the ongoing instability and deteriorating security situation in the Sahel region.  Statement-II is also correct, as several Sahel countries have experienced military coups recently.  The occurrence of these coups directly contributes to and exacerbates the instability and insecurity mentioned in Statement-I.  Therefore, Statement-II serves as an explanation for Statement-I.\n\nSahel Region: A semi-arid region of Africa, south of the Sahara Desert, spanning across several countries. It's characterized by a fragile environment, poverty, and weak governance, making it vulnerable to conflict and extremism.\n\nMilitary takeovers/coups d'état:  The illegal seizure of power by the military, often involving the forceful removal of a legitimately elected government.  They frequently lead to political instability and violence.\n"
    },
    {
        "Q.No.": 92,
        "question_text": "Consider the following statements :\nStatement-I  : India does not import apples from the United States of America.\nStatement-II : In India, the law prohibits the import of Genetically Modified food without the approval of the competent authority.\nWhich one of the following is correct in respect of the above statements ?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation:Statement II is a correct statement reflecting India's regulations on genetically modified food imports.  Statement I is incorrect. India does import apples, and while the exact sources fluctuate, the US is among the countries that export apples to India.  Therefore, Statement II does not explain Statement I; they are independent facts.  The fact that India has regulations on GMO imports doesn't inherently prevent apple imports from the US, as not all US apples are genetically modified.\n"
    },
    {
        "Q.No.": 93,
        "question_text": "With reference to the Speaker of the Lok Sabha, consider the following statements :\nWhile any resolution for the removal of the Speaker of the Lok Sabha is under consideration\n1. He/She shall not preside.\n2. He/She shall not have the right to speak.\n3. He/She shall not be entitled to vote on the resolution in the first instance.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2024,
        "explanation": "* **correct_option:** (d)\n* **explanation:** When a resolution for the removal of the Speaker is under consideration, the Speaker does not preside over the proceedings (Statement 1 is correct).  The Speaker also does not have the right to vote on the resolution in the first instance (Statement 3 is correct).  However, the Speaker retains the right to speak during the debate.  Therefore, Statement 2 is incorrect.\n\n**Short notes on important keywords and named entities:**\n\n* **Lok Sabha:** The lower house of the Parliament of India.  It is directly elected by the people of India and is responsible for making laws and holding the government accountable.\n\n* **Speaker of the Lok Sabha:** The presiding officer of the Lok Sabha.  The Speaker maintains order in the House, ensures adherence to rules of procedure, and plays a crucial role in the legislative process.  The Speaker is elected by the Lok Sabha members.\n\n* **Resolution:** A formal expression of opinion or intention made by a legislative body.  In this context, it refers to a motion to remove the Speaker from office.\n\n* **Removal of Speaker:** The process by which the Lok Sabha can remove its Speaker. This requires a resolution passed by a majority of members present and voting.\n"
    },
    {
        "Q.No.": 94,
        "question_text": "With reference to the Indian Parliament, consider the following statements :\n1. A bill pending in the Lok Sabha lapses  on its dissolution.\n2. A bill passed by the Lok Sabha andpending in the Rajya Sabha lapses on the dissolution of the Lok Sabha.\n3. A bill in regard to which the President of India notified his/her intention to summon the Houses to a joint sitting lapses on the dissolution of the Lok Sabha.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is correct.  A bill pending in the Lok Sabha (House of the People, the lower house of the Indian Parliament) lapses upon its dissolution.  The Lok Sabha's term is five years, but it can be dissolved earlier.  All pending business, including bills, is lost when it is dissolved.\n\nStatement 2 is also correct. A bill passed by the Lok Sabha but pending in the Rajya Sabha (Council of States, the upper house of the Indian Parliament) lapses if the Lok Sabha is dissolved before the Rajya Sabha approves it.  The Rajya Sabha's approval is required for most bills to become law.  Since the bill hasn't completed its legislative journey, dissolution of the Lok Sabha nullifies the progress made.\n\nStatement 3 is incorrect.  If the President has notified the intention to summon a joint sitting of both houses (Lok Sabha and Rajya Sabha) to resolve a deadlock over a bill, the dissolution of the Lok Sabha does not cause the bill to lapse.  The joint sitting is a mechanism to resolve disagreements between the two houses.  Dissolution of one house doesn't negate the President's call for a joint sitting.\n\n\n**Short Notes on Named Entities:**\n\n* **Lok Sabha:** The lower house of the Indian Parliament, directly elected by the people. It is more powerful than the Rajya Sabha.  Its members are elected for a term of five years.\n\n* **Rajya Sabha:** The upper house of the Indian Parliament, representing the states. Members are elected indirectly by state legislatures, with a staggered six-year term.  It has less power than the Lok Sabha, but its approval is necessary for most bills.\n\n* **President of India:** The head of state of India, holding largely ceremonial powers,  but plays a significant role in legislation through assenting to bills passed by Parliament.\n\n\n"
    },
    {
        "Q.No.": 95,
        "question_text": "With reference to the Parliament of India,\n1. Prorogation of a House by the President of India does not require the advice of the Council of Ministers.\n2. Prorogation of a House is generally done after the House is adjourned sine die but there is no bar to the President of India prorogating the House which is in session.\n3. Dissolution of the Lok Sabha is done by the President of India who, save in exceptional circumstances, does so on the advice of the Council of Ministers.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "c",
        "subject": "polity",
        "year": 2024,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nStatement 1 is incorrect.  The President prorogues a House of Parliament on the advice of the Council of Ministers.  The President doesn't have the power to act independently in this matter.\n\nStatement 2 is correct. Prorogation can happen even while a House is in session.  Adjournment sine die is the final adjournment of a session, but prorogation can also occur before that.\n\nStatement 3 is correct. The President dissolves the Lok Sabha (the lower house of Parliament) on the advice of the Council of Ministers, except under very unusual circumstances.\n\nTherefore, only statements 2 and 3 are correct.\n\n\n**Short Notes on Important Keywords and Entities:**\n\n* **Parliament of India:**  The supreme legislative body of India, consisting of the President and two Houses – the Rajya Sabha (Council of States) and the Lok Sabha (House of the People).  It makes laws, debates national issues, and holds the executive accountable.\n\n* **President of India:** The head of state of India.  While holding significant ceremonial powers, the President largely acts on the advice of the Council of Ministers, except in specific situations outlined in the Constitution.\n\n* **Council of Ministers:** The body of ministers who advise the President and are collectively responsible to the Lok Sabha.  They are the executive branch of the government.\n\n* **Lok Sabha:** The lower house of the Parliament of India. It is directly elected by the people and holds the executive branch accountable.  Its dissolution triggers general elections.\n\n* **Rajya Sabha:** The upper house of the Parliament of India.  It represents the states and has less power than the Lok Sabha.  It cannot be dissolved.\n\n* **Prorogation:** The termination of a session of Parliament by the President.  It marks the end of a legislative session, and all pending business is carried over to the next session.\n\n* **Adjournment sine die:** The indefinite adjournment of a session of Parliament.  This marks the formal end of a session until the next one is called.\n\n* **Dissolution:** The termination of a legislative body, such as the Lok Sabha.  This leads to new elections.\n"
    },
    {
        "Q.No.": 96,
        "question_text": "Consider the following statements :\nStatement-I  : The European Parliament approved The Net-Zero Industry Act recently.\nStatement-II : The European Union intends to achieve carbon neutrality by 2040 and therefore aims to develop all of its own clean technology by that time.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "c",
        "subject": "environment",
        "year": 2024,
        "explanation": "correct_option: (c)\nexplanation: Statement-I is correct. The European Parliament did approve the Net-Zero Industry Act.  Statement-II is incorrect. While the European Union aims to achieve carbon neutrality, the target year is 2050, not 2040, and their aim is not to develop *all* of its own clean technology by that time.  The Net-Zero Industry Act is a policy aimed at boosting the EU's clean technology sector to help achieve this goal.  The act focuses on supporting the development and deployment of clean technologies within the EU, but it does not preclude the use of technologies developed elsewhere.\n\n**European Parliament:** The legislative branch of the European Union, responsible for passing laws along with the Council of the European Union.\n\n**Net-Zero Industry Act:** A recent piece of European Union legislation designed to accelerate the development and deployment of clean technologies within the EU as a step towards achieving climate neutrality.\n\n**European Union (EU):** A political and economic alliance of 27 European countries.  It aims to promote peace and cooperation throughout Europe.  The EU has various policies addressing climate change, including the ambitious target of achieving climate neutrality.\n\n**Carbon Neutrality:** A state where a country or entity's greenhouse gas emissions are balanced by an equivalent amount of carbon removal, resulting in a net-zero carbon footprint.\n"
    },
    {
        "Q.No.": 97,
        "question_text": "Consider the following statements :\nStatement-I  : Recently, Venezuela has achieved a rapid recovery from its economic crisis and succeeded in preventing its people from fleeing/emigrating to other countries.\nStatement-II : Venezuela has the world's largest oil reserves.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option_c": "Statement-I is correct, but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect, but Statement-II is correct",
        "correct_option": "d",
        "subject": "geography",
        "year": 2024,
        "explanation": "correct_option: (d)\nexplanation: Statement-I is incorrect.  Venezuela has experienced a severe and prolonged economic crisis, leading to widespread hardship and a significant exodus of its population to neighboring countries.  Statement-II is correct. Venezuela possesses substantial oil reserves, among the largest globally. While Venezuela's large oil reserves could potentially contribute to economic recovery, the country's current economic situation demonstrates that this resource alone is insufficient to address the multifaceted challenges it faces.  Therefore, Statement-II does not explain Statement-I.\n\nVenezuela: A South American country with significant oil reserves, currently facing a severe economic crisis marked by hyperinflation, shortages, and mass emigration.\n\nEconomic crisis: A situation where a country's economy experiences a sharp decline in various indicators, such as GDP, employment, and investment.  Often accompanied by social unrest and political instability.\n\nEmigration: The act of leaving one's own country to settle permanently in another.\n"
    },
    {
        "Q.No.": 98,
        "question_text": "With reference to the Digital India Land Records Modernisation Programme, consider the following statements :\n1. To implement the scheme, the Central Government provides 100% funding.\n2. Under the Scheme, Cadastral Maps are digitised.\n3. An initiative has been undertaken to transliterate the Records of Rights from local language to any of the languages recognized by the Constitution of India.\nWhich of the statements given above are  correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation:The Digital India Land Records Modernisation Programme (DILRMP) aims to digitize land records and improve land administration in India.  Statement 1 is incorrect because the central government does not provide 100% funding; it's a centrally sponsored scheme with cost-sharing between the central and state governments. Statement 2 is correct as the program involves digitizing cadastral maps (maps showing land parcels).  Statement 3 is also correct; the program includes transliteration of land records from local languages to other constitutionally recognized languages.  Therefore, only statements 2 and 3 are correct.\n\nDILRMP: A centrally sponsored scheme aiming to modernize land records in India through digitization and improved administration.  It involves creating digital cadastral maps and making land records accessible to citizens.\n\nCadastral Maps: Detailed maps showing the boundaries of individual land parcels, ownership information, and other relevant details.  They are essential for efficient land administration and dispute resolution.\n"
    },
    {
        "Q.No.": 99,
        "question_text": "With reference to the 'Pradhan Mantri Surakshit Matritva Abhiyan', consider the following statements :\n1. This scheme guarantees a minimum package of antenatal care services to women in their second and third trimesters of pregnancy and six months post-delivery health care service in any government health facility.\n2. Under this scheme, private sector health care providers of certain specialities can volunteer to provide\nservices at nearby government health facilities.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (a)\nexplanation: Statement 1 is correct. The Pradhan Mantri Surakshit Matritva Abhiyan (PMSMA) aims to provide a minimum package of antenatal care services to pregnant women during their second and third trimesters, and six months of postnatal care.  This is offered at any government health facility.\n\nStatement 2 is incorrect. While PMSMA encourages participation from healthcare providers, it primarily focuses on utilizing existing government infrastructure.  Private sector participation is not a core component of the scheme's design.\n\n\nPradhan Mantri Surakshit Matritva Abhiyan (PMSMA): A government initiative in India focused on providing free antenatal and postnatal care to pregnant women, particularly in the second and third trimesters of pregnancy.  The goal is to improve maternal and child health outcomes by ensuring access to essential healthcare services.\n"
    },
    {
        "Q.No.": 100,
        "question_text": "With reference to the Pradhan Mantri Shram Yogi Maan-dhan (PM-SYM) Yojana, consider the following statements :\n1. The entry age group for enrolment in the scheme is 21 to 40 years.\n2. Age specific contribution shall be made by the beneficiary.\n3. Each subscriber under the scheme shall receive a minimum pension of ₹ 3,000 per month after attaining the age of 60 years.\n4. Family pension is applicable to the spouse and unmarried daughters.\nWhich of the statements given above is/are correct?",
        "option_a": "1, 3 and 4",
        "option_b": "2 and 3 only",
        "option_c": "2 only",
        "option_d": "1, 2 and 4",
        "correct_option": "b",
        "subject": "economy",
        "year": 2024,
        "explanation": "correct_option: (b)\nexplanation: The Pradhan Mantri Shram Yogi Maan-dhan (PM-SYM) Yojana is a pension scheme for unorganized workers in India.  Statement 1 is incorrect; the entry age is 18-40 years. Statement 2 is correct; beneficiaries make age-specific contributions. Statement 3 is incorrect; the minimum pension is ₹3,000, but it's not guaranteed to be exactly ₹3,000. The pension amount depends on the contribution made. Statement 4 is incorrect; only the spouse is eligible for a family pension.  Therefore, only statement 2 is entirely correct.\n\nPradhan Mantri Shram Yogi Maan-dhan (PM-SYM) Yojana: A social security scheme providing old-age protection to unorganized workers in India.  It involves small monthly contributions from workers to receive a pension after age 60.\n\n\n"
    }
]