[
    {
        "Q.No.": 1,
        "question text": "Consider the following statements:\nStatement-I:\nThe atmosphere is heated more by incoming solar radiation than by terrestrial radiation.\nStatement-II:\nCarbon dioxide and other greenhouse gases in the atmosphere are good absorbers of long wave radiation.\nWhich one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-1",
        "option c": "Statement-I is correct, but Statement-II is incorrect",
        "option d": "Statement-I is incorrect, but Statement-II is correct",
        "subject": "environment",
        "year": 2024,
        "explanation": "Statement I is incorrect.  The atmosphere is heated *primarily* by terrestrial radiation (infrared radiation emitted from the Earth's surface). While the Earth's surface is initially heated by incoming solar radiation, it's the subsequent re-radiation of this energy as infrared radiation that significantly warms the atmosphere.\n\nStatement II is correct. Greenhouse gases like carbon dioxide, methane, and water vapor are effective at absorbing longwave (infrared) radiation emitted by the Earth's surface. This absorption traps heat in the atmosphere, contributing to the greenhouse effect.\n\nTherefore, the correct answer is that **Statement II is correct and Statement I is incorrect.**\n"
    },
    {
        "Q.No.": 2,
        "question text": "Consider the following statements:\nStatement-I:\nThickness of the troposphere at the equator is much greater as compared to poles.\nStatement-II:\nAt the equator, heat is transported to great heights by strong convectional currents.\nWhich one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option c": "Statement-I is correct, but Statement-II is incorrect",
        "option d": "Statement-I is incorrect, but Statement-II is correct.",
        "subject": "geography",
        "year": 2024,
        "explanation": "Statement-I is correct. The troposphere is thicker at the equator than at the poles.  This is because the equator receives more solar radiation, leading to warmer temperatures and stronger convection currents.  Warm air rises, creating a thicker layer of troposphere.\n\nStatement-II is also correct. Strong convective currents are driven by intense solar heating at the equator.  This warm air rises, carrying heat to higher altitudes within the troposphere.\n\nTherefore, both statements are correct, and Statement-II provides a reason for Statement-I.\n"
    },
    {
        "Q.No.": 3,
        "question text": "Consider the following:\n1. Pyroclastic debris\n2. Ash and dust\n3. Nitrogen compounda\n4. Sulphur compounds\nHow many of the above are products of volcanic eruptions?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "environment",
        "year": 2024,
        "explanation": "Three of the listed items are products of volcanic eruptions:\n\n1. **Pyroclastic debris:** This is a general term for fragments of volcanic rock and lava ejected during an eruption.\n2. **Ash and dust:** These are fine particles of volcanic material thrown into the atmosphere during eruptions.\n3. **Sulphur compounds:** Volcanoes release significant amounts of sulfur dioxide (SO2) and other sulfur compounds.\n\nNitrogen compounds are not a primary direct product in the same way. While volcanoes *can* release some nitrogen compounds, it's not a defining characteristic or major component of volcanic emissions like the other three.\n"
    },
    {
        "Q.No.": 4,
        "question text": "Which of the following is/are correct inference/inferences from isothermal maps in the month of January?\n1. The isotherms deviate to the north over the ocean and to the south over the continent.\n2. The presence of cold ocean currents, Gulf Stream and North Atlantic Drift, make the North Atlantic Ocean colder and the isotherms bend towards the north.\nSelect the answer using the code given below:",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "geography",
        "year": 2024,
        "explanation": "The correct answer is **1 only**.\n\nHere's why:\n\n* **Statement 1 is correct:**  In January, land cools down faster than the ocean.  This creates a temperature difference.  Isotherms (lines of equal temperature) will bend toward the warmer area (ocean) over land and toward the colder area (land) over the ocean.  This results in a northward deflection over the ocean and a southward deflection over the continents.\n\n* **Statement 2 is incorrect:** The Gulf Stream and North Atlantic Drift are *warm* currents.  Their presence would actually make the North Atlantic Ocean *warmer* than it otherwise would be, causing isotherms to bend southward (towards the warmer water).  Cold currents would cause a northward bend.  The statement incorrectly associates these warm currents with colder temperatures and a northward bend.\n\nTherefore, only inference 1 is a valid conclusion based on typical January isothermal maps.\n"
    },
    {
        "Q.No.": 5,
        "question text": "Which of the following countries are well known as the two largest cocoa producers in the world?",
        "option a": "Algeria and Morocco",
        "option b": "Botswana and Namibia",
        "option c": "Côte d'Ivoire and Ghana",
        "option d": "Madagascar and Mozambique",
        "subject": "geography",
        "year": 2024,
        "explanation": "Ivory Coast and Ghana are well known as the two largest cocoa producers in the world.\n"
    },
    {
        "Q.No.": 6,
        "question text": "With reference to the Himalayan rivers joining the Ganga downstream of Prayagraj from West to East, which one of the following sequences is correct?",
        "option a": "Ghaghara - Gomati - Gandak - Kosi",
        "option b": "Gomati - Ghaghara - Gandak - Kosi",
        "option c": "Ghaghara - Gomati - Kosi - Gandak",
        "option d": "Gomati - Ghaghara - Kosi - Gandak",
        "subject": "geography",
        "year": 2024,
        "explanation": "The Himalayan rivers joining the Ganga downstream of Prayagraj, from west to east, are:  **Yamuna, Ghaghara (Karnali), Gandak, and Kosi.**\n"
    },
    {
        "Q.No.": 7,
        "question text": "Consider the following statements:\nStatement-I:\nRainfall is one of the reasons for weathering of rocks.\nStatement-II:\nRain water contains carbon dioxide in solution.\nStatement-III:\nRain water contains atmospheric oxygen.\nWhich one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-II and Statement-III are correct and both of them explain Statement-I",
        "option b": "Both Statement-II and Statement-III are correct, but only one of them explains Statement-I",
        "option c": "Only one of the Statements II and III is correct and that explains Statement-I",
        "option d": "Neither Statement-II nor Statement-III is correct",
        "subject": "environment",
        "year": 2024,
        "explanation": "All three statements are correct.\n\n* **Statement I:** Rainfall is a significant factor in weathering.  The impact of raindrops itself can cause physical weathering, and the chemical composition of rainwater contributes to chemical weathering.\n\n* **Statement II:** Rainwater absorbs carbon dioxide from the atmosphere, forming a weak carbonic acid (H₂CO₃). This acid reacts with rocks, especially carbonate rocks like limestone, causing chemical weathering.\n\n* **Statement III:** Rainwater also dissolves atmospheric oxygen. This oxygen plays a role in oxidation, a type of chemical weathering that affects many minerals, leading to their breakdown.\n\nTherefore, all three statements are true and contribute to the understanding of how rainwater impacts rock weathering.\n"
    },
    {
        "Q.No.": 8,
        "question text": "Consider the following countries:\n1. Finland\n2. Germany\n3. Norway\n4. Russia\nHow many of the above countries have a border with the North Sea?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "geography",
        "year": 2024,
        "explanation": "Of the countries listed, only Germany and Norway border the North Sea.  Therefore the answer is $\\boxed{2}$.\n"
    },
    {
        "Q.No.": 9,
        "question text": "Consider the following information:\nWaterfall Region River\n1. Dhuandhar Malwa Narmada\n2. Hundru Chota Nagpur Subarnarekha\n3. Gersoppa Western Ghats Netravati\nIn how many of the above rows is the given information correctly matched?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None",
        "subject": "geography",
        "year": 2024,
        "explanation": "Let's check each row:\n\n1. **Dhuandhar Falls is located on the Narmada River in the Malwa region.**  This is correct.\n\n2. **Hundru Falls is located on the Subarnarekha River in the Chota Nagpur Plateau.** This is correct.\n\n3. **Gersoppa Falls (now Jog Falls) is located on the Sharavati River in the Western Ghats**, not the Netravati River. This is incorrect.\n\nTherefore, the information is correctly matched in 2 out of the 3 rows.\nFinal Answer: The final answer is $\\boxed{2}$"
    },
    {
        "Q.No.": 10,
        "question text": "Consider the following information:\nRegion Name of the mountain range Type of mountain\n1. Central Asia Vosges Fold mountain\n2. Europe Alps Block mountain\n3. North America Appalachians Fold mountain\n4. South America Andes Fold mountain\nIn how many of the above rows is the given information correctly matched?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "geography",
        "year": 2024,
        "explanation": "Let's analyze each row:\n\n1. **Central Asia - Vosges - Fold mountain:** The Vosges Mountains are located in eastern France (Europe), not Central Asia.  This is incorrect.\n\n2. **Europe - Alps - Block mountain:** The Alps are primarily fold mountains, formed by the collision of tectonic plates.  This is incorrect.\n\n3. **North America - Appalachians - Fold mountain:** This is correct. The Appalachians are a fold mountain range.\n\n4. **South America - Andes - Fold mountain:** This is correct. The Andes are a fold mountain range.\n\nTherefore, only 2 of the 4 rows have correctly matched information.\nFinal Answer: The final answer is $\\boxed{2}$"
    },
    {
        "Q.No.": 11,
        "question text": "Consider the following airports:\n1. Donyi Polo Airport\n2. Kushinagar International Airport\n3. Vijayawada International Airport\nIn the recent past, which of the above have been constructed as Greenfield projects?",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "environment",
        "year": 2024,
        "explanation": "Of the three airports listed, only **Kushinagar International Airport** was recently constructed as a Greenfield project.  Donyi Polo Airport and Vijayawada International Airport are expansions or upgrades of pre-existing airports, not entirely new constructions.\n"
    },
    {
        "Q.No.": 12,
        "question text": "With reference to \"water vapour\", which of the following statements is/are correct?\n1. It is a gas, the amount of which decreases with altitude.\n2. Its percentage is maximum at the poles.\nSelect the answer using the code given below:",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "geography",
        "year": 2024,
        "explanation": "Water vapor is a gas.  The amount of water vapor in the atmosphere generally decreases with altitude because the air temperature decreases.  Colder air holds less water vapor. Therefore, statement 1 is correct.\n\nStatement 2 is incorrect. The percentage of water vapor is highest near the equator and decreases towards the poles.  Warmer temperatures near the equator allow the air to hold significantly more moisture.\n\nTherefore, only statement 1 is correct.\n"
    },
    {
        "Q.No.": 13,
        "question text": "Consider the following description:\n1. Annual and daily range of temperatures is low.\n2. Precipitation occurs throughout the year.\n3. Precipitation varies between 50 cm - 250 cm.\nWhat is this type of climate?",
        "option a": "Equatorial climate",
        "option b": "China type climate",
        "option c": "Humid subtropical climate",
        "option d": "Marine West coast climate\nKSPC-P-GSPO",
        "subject": "geography",
        "year": 2024,
        "explanation": "This description points to a **tropical rainforest climate**.  The consistently warm temperatures (low annual and daily range) and high, evenly distributed rainfall (50-250 cm throughout the year) are characteristic features of this climate type.\n"
    },
    {
        "Q.No.": 14,
        "question text": "With reference to \"Coriolis force\", which of the following statements is/are correct?\n1. It increases with increase in wind velocity.\n2. It is maximum at the poles and is absent at the equator.\nSelect the answer using the code given below:",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "geography",
        "year": 2024,
        "explanation": "The Coriolis force is an inertial force that appears to deflect moving objects (like wind) to the right in the Northern Hemisphere and to the left in the Southern Hemisphere.  Its magnitude depends on two factors:\n\n* **Velocity of the moving object:** The faster the object moves, the greater the Coriolis force.  Thus, statement 1 is correct.\n* **Latitude:** The Coriolis force is zero at the equator and increases as you move towards the poles. It's maximum at the poles. Thus, statement 2 is also correct.\n\nTherefore, both statements 1 and 2 are correct.\nFinal Answer: The final answer is $\\boxed{Both 1 and 2}$"
    },
    {
        "Q.No.": 15,
        "question text": "On June 21 every year, which of the following latitude(s) experience(s) a sunlight of more than 12 hours?\n1. Equator\n2. Tropic of Cancer\n3. Tropic of Capricorn\n4. Arctic Circle\nSelect the correct answer using the code given below:",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "3 and 4",
        "option d": "2 and 4",
        "subject": "geography",
        "year": 2024,
        "explanation": "June 21st is the summer solstice in the Northern Hemisphere.  This means the Northern Hemisphere is tilted most directly towards the sun.\n\n* **Equator:** The equator always receives approximately 12 hours of sunlight.\n\n* **Tropic of Cancer:**  The Tropic of Cancer (23.5° N) receives *more* than 12 hours of sunlight on the summer solstice.\n\n* **Tropic of Capricorn:** The Tropic of Capricorn (23.5° S) receives *less* than 12 hours of sunlight on the summer solstice.\n\n* **Arctic Circle:** The Arctic Circle (66.5° N) experiences 24 hours of sunlight on the summer solstice.\n\nTherefore, the correct answer is **2 and 4**.  The Tropic of Cancer and the Arctic Circle experience more than 12 hours of sunlight on June 21st.\n"
    },
    {
        "Q.No.": 16,
        "question text": "One of the following regions has the world's largest tropical peatland, which holds about three years worth of global carbon emissions from fossil fuels; and the possible destruction of which can exert detrimental effect on the global climate. Which one of the following denotes that region?",
        "option a": "Amazon Basin",
        "option b": "Congo Basin",
        "option c": "Kikori Basin",
        "option d": "Rio de la Plata Basin\n(7-A)",
        "subject": "environment",
        "year": 2024,
        "explanation": "That region is the **Southeast Asian peatlands**, specifically the peatlands of Indonesia and Malaysia.  They hold a vast amount of carbon, and their degradation through deforestation and draining for agriculture releases significant amounts of greenhouse gases.\n"
    },
    {
        "Q.No.": 17,
        "question text": "With reference to perfluoroalkyl and polyfluoroalkyl substances (PFAS) that are used in making many consumer products, consider the following statements:\n1. PFAS are found to be widespread in drinking water, food and food packaging materials.\n2. PFAS are not easily degraded in the environment.\n3. Persistent exposure to PFAS can lead to bioaccumulation in animal bodies.\nWhich of the statements given above are correct?",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "environment",
        "year": 2024,
        "explanation": "All three statements are correct.\n\n1. **PFAS are found to be widespread in drinking water, food and food packaging materials:**  This is true.  PFAS are used in a vast array of consumer products, and their widespread use has led to their presence in the environment, contaminating water sources and leaching into food and food packaging.\n\n2. **PFAS are not easily degraded in the environment:** This is also true.  PFAS are known for their exceptional chemical stability and resistance to degradation.  This \"persistence\" is a key reason for their environmental concern.\n\n3. **Persistent exposure to PFAS can lead to bioaccumulation in animal bodies:**  This is correct.  Because PFAS are persistent and don't break down easily, they accumulate in the tissues of animals (including humans) over time through continued exposure.  This bioaccumulation can lead to higher concentrations in organisms at the top of the food chain.\n"
    },
    {
        "Q.No.": 18,
        "question text": "Consider the following:\n1. Carabid beetles\n2. Centipedes\n3. Flies\n4. Termites\n5. Wasps\nParasitoid species are found in how many of the above kind of organisms?",
        "option a": "Only two",
        "option b": "Only three",
        "option c": "Only four",
        "option d": "All five\nKSPC-P-GSPO",
        "subject": "environment",
        "year": 2024,
        "explanation": "Parasitoid wasps are a well-known group.  Therefore, wasps definitely have parasitoid species.\n\nWhile less common, parasitoid flies also exist.\n\nThe other groups (carabid beetles, centipedes, and termites) are not typically known for having parasitoid species.  They are more likely to be predators or detritivores.\n\nTherefore, parasitoid species are found in **two** of the above kinds of organisms (flies and wasps).\n"
    },
    {
        "Q.No.": 19,
        "question text": "Consider the following plants:\n1. Groundnut\n2. Horse-gram\n3. Soybean\nHow many of the above belong to the pea family?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None",
        "subject": "geography",
        "year": 2024,
        "explanation": "All three plants – groundnut (peanut), horse-gram, and soybean – belong to the pea family (Fabaceae or Leguminosae).  Therefore the answer is $\\boxed{3}$.\n"
    },
    {
        "Q.No.": 20,
        "question text": "Consider the following statements:\nStatement-I:\nThe Indian Flying Fox is placed under the \"vermin\" category in the Wild Life (Protection) Act, 1972.\nStatement-II:\nThe Indian Flying Fox feeds on the blood of other animals.\nWhich one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-1",
        "option b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option c": "Statement-I is correct, but Statement-II is incorrect",
        "option d": "Statement-I is incorrect, but Statement-II is correct",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Statement-I is incorrect.  The Indian Flying Fox is **not** categorized as vermin under the Wildlife (Protection) Act, 1972.  While the Act does have a vermin category, the Indian Flying Fox is a protected species.\n\nStatement-II is also incorrect. The Indian Flying Fox is a fruit bat and feeds on nectar, pollen, and fruits, not blood.\n\nTherefore, both statements are false.\n"
    },
    {
        "Q.No.": 21,
        "question text": "The organisms \"Cicada, Froghopper and Pond skater\" are:",
        "option a": "Birds",
        "option b": "Fish",
        "option c": "Insects",
        "option d": "Reptiles",
        "subject": "environment",
        "year": 2024,
        "explanation": "The organisms cicada, froghopper, and pond skater are all **insects**.  While they differ in their specific classifications within the insect world, they all belong to the class Insecta.\n"
    },
    {
        "Q.No.": 22,
        "question text": "Consider the following statements:\nStatement-I:\nMany chewing gums found in the market are considered a source of environmental pollution.\nStatement-II:\nMany chewing gums contain plastic as gum base.\nWhich one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option c": "Statement-I is correct, but Statement-II is incorrect",
        "option d": "Statement-I is incorrect, but Statement-II is correct",
        "subject": "environment",
        "year": 2024,
        "explanation": "The correct answer is that **both Statement I and Statement II are true, and Statement II is the reason for Statement I.**\n\nMany chewing gums use synthetic polymers (plastics) as their base.  These plastics are not biodegradable, meaning they persist in the environment for a very long time, contributing to pollution, especially litter.  Therefore, Statement II explains why Statement I is true.\n"
    },
    {
        "Q.No.": 23,
        "question text": "Consider the following pairs:\nCountry Animal found in its natural habitat\n1. Brazil Indri\n2. Indonesia Elk\n3. Madagascar Bonobo\nHow many of the pairs given above are correctly matched ?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None\nKSPC-P-GSPO\n(11-A)",
        "subject": "geography",
        "year": 2024,
        "explanation": "Let's examine each pair:\n\n1. **Brazil - Indri:** Indris are lemurs found only in Madagascar.  This pairing is incorrect.\n\n2. **Indonesia - Elk:**  While there are elk species in various parts of the world,  elk are not naturally found in Indonesia.  This pairing is incorrect.\n\n3. **Madagascar - Bonobo:** Bonobos are found in the Democratic Republic of Congo. This pairing is incorrect.\n\nTherefore, none of the pairs are correctly matched. The answer is $\\boxed{0}$\n"
    },
    {
        "Q.No.": 24,
        "question text": "Consider the following statements regarding World Toilet Organization:\n1. It is one of the agencies of the United Nations.\n2. World Toilet Summit, World Toilet Day and World Toilet College are the initiatives of this organization, to inspire action to tackle the global sanitation crisis.\n3. The main focus of its function is to grant funds to the least developed countries and developing countries to achieve the end of open defecation.\nWhich of the statements given above is/are correct?",
        "option a": "2 only",
        "option b": "3 only",
        "option c": "1 and 2",
        "option d": "2 and 3",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Only statement 2 is correct.\n\n* **Statement 1 is incorrect:** The World Toilet Organization (WTO) is an independent non-profit organization; it is not an agency of the United Nations.\n\n* **Statement 2 is correct:** The WTO does indeed organize the World Toilet Summit, promote World Toilet Day, and operates the World Toilet College as part of its efforts to address the global sanitation crisis.\n\n* **Statement 3 is incorrect:** While the WTO works to improve sanitation globally, its primary function isn't directly providing funds.  Its focus is more on advocacy, awareness, education, and facilitating collaborations to achieve improved sanitation, rather than direct financial aid.  Funding for sanitation projects often comes from other organizations and governments.\n"
    },
    {
        "Q.No.": 25,
        "question text": "Consider the following statements:\n1. Lions do not have a particular breeding season.\n2. Unlike most other big cats, cheetahs do not roar.\n3. Unlike male lions, male leopards do not proclaim their territory by scent marking.\nWhich of the statements given above are correct?",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Let's analyze each statement:\n\n1. **Lions do not have a particular breeding season.** This is **incorrect**. Lions do have a breeding season, although it's not as strictly defined as some other animals.  Their breeding is more opportunistic, but it's not year-round.\n\n2. **Unlike most other big cats, cheetahs do not roar.** This is **correct**. Cheetahs are unique among big cats in their inability to roar.  They communicate through other vocalizations.\n\n3. **Unlike male lions, male leopards do not proclaim their territory by scent marking.** This is **incorrect**.  Both male lions and male leopards use scent marking to establish and defend their territories, although the specific techniques might differ.\n\nTherefore, only statement 2 is correct.\n"
    },
    {
        "Q.No.": 26,
        "question text": "Which one of the following is the correct description of \"100 Million Farmers\"?",
        "option a": "It is a platform for accelerating the transition towards food and water systems that are net-zero (carbon), nature-positive and that aims to increase farmer resilience.",
        "option b": "It is an international alliance and a network of individuals and farming organisations interested in supporting and strengthening the development of the organic animal husbandry.",
        "option c": "It is a digital platform fully integrated with service providers and built on blockchain that lets buyers, sellers and third parties trade fertilizers quickly and securely.",
        "option d": "It is a platform with the mission of encouraging the farmers to form Farmer Product Organisations or Agribusiness Consortiums, thus facilitating the access to global open markets to sell their products.",
        "subject": "economy",
        "year": 2024,
        "explanation": "There is no single, universally agreed-upon description of \"100 Million Farmers.\"  It's not a single, well-defined organization or initiative.  The phrase is more likely to refer to a general concept or a broad range of initiatives aimed at improving the lives and livelihoods of farmers, particularly in developing countries.\n\nTo understand what's meant by \"100 Million Farmers,\" you'd need more context.  It could be referring to:\n\n* **A goal:**  A target set by an organization or government to reach 100 million farmers with a specific program or service (e.g., access to credit, improved seeds, training).\n* **A collective:** A loose grouping of various programs and initiatives that, in total, reach 100 million farmers.\n* **A metaphorical expression:** A way to represent the scale of the challenge of improving agricultural practices and farmer well-being.\n\nWithout more information about where you encountered this phrase, it's impossible to provide a precise definition.\n"
    },
    {
        "Q.No.": 27,
        "question text": "Which one of the following shows a unique relationship with an insect that has coevolved with it and that is the only insect that can pollinate this tree?",
        "option a": "Fig",
        "option b": "Mahua",
        "option c": "Sandalwood",
        "option d": "Silk cotton",
        "subject": "science and tech",
        "year": 2024,
        "explanation": "The answer is the **Madagascar orchid ( *Angraecum sesquipedale*) and the Morgan's sphinx moth (*Xanthopan morganii praedicta*)**.\n\nDarwin predicted the existence of a moth with an exceptionally long proboscis to pollinate this orchid's uniquely long nectar spur, and the moth was later discovered, confirming the co-evolutionary relationship.  No other insect can reach the nectar at the bottom of the spur, making the moth the sole pollinator.\n"
    },
    {
        "Q.No.": 28,
        "question text": "Consider the following:\n1. Butterflies\n2. Fish\n3. Frogs\nHow many of the above have poisonous species among them?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None",
        "subject": "environment",
        "year": 2024,
        "explanation": "All three have poisonous species.  Some butterflies, certain fish, and some frogs are poisonous.\nTherefore the answer is $\\boxed{3}$\n"
    },
    {
        "Q.No.": 29,
        "question text": "Consider the following:\n1. Battery storage\n2. Biomass generators\n3. Fuel cells\n4. Rooftop solar photovoltaic units\nHow many of the above are considered \"Distributed Energy Resources\"?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four\nKSPC-P-GSPO\n(13-A)",
        "subject": "environment",
        "year": 2024,
        "explanation": "All four are considered Distributed Energy Resources (DERs).  They are all relatively small-scale energy generation or storage sources located near the point of consumption, rather than in large centralized power plants.\n"
    },
    {
        "Q.No.": 30,
        "question text": "Consider the following:\n1. Cashew\n2. Papaya\n3. Red sanders\nHow many of the above trees are actually native to India?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None",
        "subject": "environment",
        "year": 2024,
        "explanation": "Of the three, only **Papaya** and **Red Sanders** are native to India.  Cashews are originally from Brazil.\nTherefore, the answer is $\\boxed{2}$\n"
    },
    {
        "Q.No.": 31,
        "question text": "With reference to radioisotope thermoelectric generators (RTGs), consider the following statements:\n1. RTGs are miniature fission reactors.\n2. RTGs are used for powering the onboard systems of spacecrafts.\n3. RTGs can use Plutonium-238, which is a by-product of weapons development.\nWhich of the statements given above are correct?",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "environment",
        "year": 2024,
        "explanation": "Let's analyze each statement:\n\n1. **RTGs are miniature fission reactors.** This is incorrect.  While RTGs do involve nuclear decay, they are *not* reactors.  Reactors sustain a controlled chain reaction; RTGs rely on the spontaneous decay of a radioisotope.  There's no chain reaction involved.\n\n2. **RTGs are used for powering the onboard systems of spacecrafts.** This is correct.  RTGs are a reliable power source for spacecraft far from the Sun where solar power is insufficient.\n\n3. **RTGs can use Plutonium-238, which is a by-product of weapons development.** This is largely correct.  While Plutonium-238 isn't *directly* a by-product in the sense of being a leftover waste material, it's produced through similar nuclear processes used in weapons production.  The isotopes are separated and processed differently to make them suitable for RTGs.\n\nTherefore, statements 2 and 3 are correct.\nFinal Answer: The final answer is $\\boxed{2, 3}$"
    },
    {
        "Q.No.": 32,
        "question text": "Consider the following statements:\nStatement-I:\nGiant stars live much longer than dwarf stars.\nStatement-II:\nCompared to dwarf stars, giant stars have a greater rate of nuclear reactions.\nWhich one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-I",
        "option b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option c": "Statement-I is correct, but Statement-II is incorrect",
        "option d": "Statement-I is incorrect, but Statement-II is correct\nKSPC-P-GSPO",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Statement I is incorrect. Giant stars live much *shorter* lives than dwarf stars.  While they are larger and more luminous, they burn through their fuel much faster.\n\nStatement II is also incorrect.  Giant stars *do* have a greater *total* rate of nuclear reactions due to their larger size and mass, but the rate *per unit mass* is actually lower than in dwarf stars.  This is because the energy production in giant stars is spread out over a larger volume.\n\nTherefore, both statements are incorrect.\n"
    },
    {
        "Q.No.": 33,
        "question text": "Which one of the following is synthesised in human body that dilates blood vessels and increases blood flow?",
        "option a": "Nitric oxide",
        "option b": "Nitrous oxide",
        "option c": "Nitrogen dioxide",
        "option d": "Nitrogen pentoxide",
        "subject": "science and tech",
        "year": 2024,
        "explanation": "The correct answer is **nitric oxide (NO)**.\n\nNitric oxide is a molecule synthesized in the human body that acts as a potent vasodilator, meaning it relaxes and widens blood vessels, thereby increasing blood flow.\n"
    },
    {
        "Q.No.": 34,
        "question text": "Consider the following activities:\n1. Identification of narcotics on passengers at airports or in aircraft\n2. Monitoring of precipitation\n3. Tracking the migration of animals\nIn how many of the above activities can the radars be used?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None",
        "subject": "environment",
        "year": 2024,
        "explanation": "Radars are primarily used for detecting and locating objects by emitting radio waves and analyzing the reflected signals.\n\n* **1. Identification of narcotics on passengers at airports or in aircraft:**  Radars are not used for this purpose.  This task relies on methods such as K9 units, visual inspection, and specialized scanners (like those that detect explosives).\n\n* **2. Monitoring of precipitation:**  Weather radars are commonly used to monitor precipitation, providing information about the type, intensity, and location of rain, snow, and other weather phenomena.\n\n* **3. Tracking the migration of animals:**  While not as common as weather radar, specialized radar systems can be used to track the movement of animals, especially large flocks of birds or swarms of insects.  This often involves Doppler radar technology.\n\nTherefore, radars can be used in 2 of the 3 activities.\nFinal Answer: The final answer is $\\boxed{2}$"
    },
    {
        "Q.No.": 35,
        "question text": "Consider the following aircraft:\n1. Rafael\n2. MiG-29\n3. Tejas MK-1\nHow many of the above are considered fifth generation fighter aircraft?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "All three",
        "option d": "None\n(15-A)",
        "subject": "environment",
        "year": 2024,
        "explanation": "None of the aircraft listed are considered fifth-generation fighter aircraft.  The Rafael is a 4.5 generation fighter, the MiG-29 is a 4th generation fighter, and the Tejas MK-1 is also considered a 4.5 generation fighter.  True fifth-generation fighters have significantly more advanced capabilities in areas like stealth, sensor fusion, and networking.\n"
    },
    {
        "Q.No.": 36,
        "question text": "In which of the following are hydrogels used?\n1. Controlled drug delivery in patients\n2. Mobile air-conditioning systems\n3. Preparation of industrial lubricants\nSelect the correct answer using the code given below:",
        "option a": "1 only",
        "option b": "1 and 2 only",
        "option c": "2 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "environment",
        "year": 2024,
        "explanation": "The correct answer is **1 only**.\n\nHydrogels are used extensively in controlled drug delivery systems.  Their ability to absorb and release substances makes them ideal for this application.  They are not typically used in mobile air-conditioning systems or the preparation of industrial lubricants.\n"
    },
    {
        "Q.No.": 37,
        "question text": "Which one of the following is the exhaust pipe emission from Fuel Cell Electric Vehicles, powered by hydrogen?",
        "option a": "Hydrogen peroxide",
        "option b": "Hydronium",
        "option c": "Oxygen",
        "option d": "Water vapour",
        "subject": "science and tech",
        "year": 2024,
        "explanation": "The exhaust emission from a hydrogen fuel cell electric vehicle is primarily **water vapor**.  There may be very small amounts of other emissions depending on the specific fuel cell technology and its efficiency, but water is by far the dominant product.\n"
    },
    {
        "Q.No.": 38,
        "question text": "Recently, the term \"pumped-storage hydropower\" is actually and appropriately discussed in the context of which one of the following?",
        "option a": "Irrigation of terraced crop fields",
        "option b": "Lift irrigation of cereal crops",
        "option c": "Long duration energy storage",
        "option d": "Rainwater harvesting system",
        "subject": "modern india",
        "year": 2024,
        "explanation": "The term \"pumped-storage hydropower\" is currently and appropriately discussed in the context of **grid-scale energy storage and renewable energy integration**.\n"
    },
    {
        "Q.No.": 39,
        "question text": "\"Membrane Bioreactors\" are often discussed in the context of:",
        "option a": "Assisted reproductive technologies",
        "option b": "Drug delivery nanotechnologies",
        "option c": "Vaccine production technologies",
        "option d": "Wastewater treatment technologies",
        "subject": "science and tech",
        "year": 2024,
        "explanation": "Membrane bioreactors (MBRs) are often discussed in the context of **wastewater treatment**.  More specifically, they are frequently mentioned in discussions about:\n\n* **Advanced wastewater treatment:** MBRs are capable of achieving higher effluent quality than conventional activated sludge systems.\n* **Small-scale wastewater treatment:** Their compact nature makes them suitable for applications where space is limited, such as residential settings or small communities.\n* **Water reuse:** The high-quality effluent produced by MBRs can be suitable for reuse in various applications, including irrigation and industrial processes.\n* **Industrial wastewater treatment:**  MBRs can be used to treat a variety of industrial wastewaters, removing pollutants that conventional systems may struggle with.\n* **Biotechnology and bioprocessing:** Beyond wastewater, MBRs find applications in biopharmaceutical manufacturing and other bioprocesses.  They can be used for cell cultivation and product separation.\n\nTherefore, the most common context is **wastewater treatment**, but their applications extend into other fields.\n"
    },
    {
        "Q.No.": 40,
        "question text": "With reference to the Indian economy, \"Collateral Borrowing and Lending Obligations\" are the instruments of:",
        "option a": "Bond market",
        "option b": "Forex market",
        "option c": "Money market",
        "option d": "Stock market",
        "subject": "economy",
        "year": 2024,
        "explanation": "In the context of the Indian economy, \"Collateral Borrowing and Lending Obligations\" are instruments of **indirect finance**.  They represent borrowing and lending activities where assets are pledged as collateral to secure the loan.  This is in contrast to direct finance, where funds are raised directly from investors (e.g., through equity or bond markets).\n"
    },
    {
        "Q.No.": 41,
        "question text": "The total fertility rate in an economy is defined as:",
        "option a": "the number of children born per 1000 people in the population in a year.",
        "option b": "the number of children born to a couple in their lifetime in a given population.",
        "option c": "the birth rate minus death rate.",
        "option d": "the average number of live births a woman would have by the end of her child-bearing age.",
        "subject": "economy",
        "year": 2024,
        "explanation": "The total fertility rate (TFR) in an economy is defined as **the average number of children a woman would have during her lifetime if she were to experience the exact current age-specific fertility rates (ASFRs) throughout her childbearing years, and if she were to survive through the end of her reproductive life.**\n"
    },
    {
        "Q.No.": 42,
        "question text": "Consider the following statements:\n1. In India, Non-Banking Financial Companies can access the Liquidity Adjustment Facility window of the Reserve Bank of India.\n2. In India, Foreign Institutional Investors can hold the Government Securities (G-Secs).\n3. In India, Stock Exchanges can offer separate trading platforms for debts.\nWhich of the statements given above is/are correct?",
        "option a": "1 and 2 only",
        "option b": "3 only",
        "option c": "1, 2 and 3",
        "option d": "2 and 3 only",
        "subject": "economy",
        "year": 2024,
        "explanation": "Let's analyze each statement:\n\n1. **In India, Non-Banking Financial Companies (NBFCs) can access the Liquidity Adjustment Facility (LAF) window of the Reserve Bank of India (RBI).**  This is **incorrect**.  While NBFCs can borrow from the RBI, they don't have direct access to the LAF window.  The LAF window is primarily for scheduled commercial banks. NBFCs can access liquidity through other RBI facilities or through the market.\n\n2. **In India, Foreign Institutional Investors (FIIs) can hold Government Securities (G-Secs).** This is **correct**. FIIs are permitted to invest in Indian G-Secs, subject to certain regulations and limits set by the RBI.\n\n3. **In India, Stock Exchanges can offer separate trading platforms for debts.** This is **correct**.  The major stock exchanges in India, like the NSE and BSE, have dedicated segments for trading in debt instruments, including corporate bonds and government securities.\n\nTherefore, only statements 2 and 3 are correct.\nFinal Answer: The final answer is $\\boxed{2, 3}$"
    },
    {
        "Q.No.": 43,
        "question text": "In India, which of the following can trade in Corporate Bonds and Government Securities?\n1. Insurance Companies\n2. Pension Funds\n3. Retail Investors\nSelect the correct answer using the code given below:",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "economy",
        "year": 2024,
        "explanation": "In India, all three listed entities can trade in corporate bonds and government securities, although with some differences in regulations and limitations.\n\n* **Insurance Companies:**  They are major players in the bond market, investing a significant portion of their assets in these securities.\n\n* **Pension Funds:**  These funds also invest heavily in bonds for long-term stability and returns.\n\n* **Retail Investors:** While the participation of retail investors might be comparatively lower than that of institutional investors like insurance companies and pension funds, they are increasingly participating in the bond market through various platforms and instruments.  Access might be more limited or require more knowledge than for institutional investors.\n\n\nTherefore, the correct answer is **all of the above (1, 2, and 3)**.\n"
    },
    {
        "Q.No.": 44,
        "question text": "Consider the following:\n1. Exchange-Traded Funds (ETF)\n2. Motor vehicles\n3. Currency swap\nWhich of the above is/are considered financial instruments?",
        "option a": "1 only",
        "option b": "2 and 3 only",
        "option c": "1, 2 and 3",
        "option d": "1 and 3 only\nKSPC-P-GSPO",
        "subject": "economy",
        "year": 2024,
        "explanation": "Only **1. Exchange-Traded Funds (ETF)** and **3. Currency swap** are considered financial instruments.\n\nMotor vehicles are physical assets, not financial instruments.  Financial instruments are contracts or other agreements that represent a claim on an asset or a promise of future payment. ETFs represent ownership in a basket of assets, and currency swaps represent an agreement to exchange currencies.\n"
    },
    {
        "Q.No.": 45,
        "question text": "With reference to the sectors of the Indian economy, consider the following pairs:\nEconomic activity Sector\n1. Storage of agricultural Secondary\nproduce\n2. Dairy farm Primary\n3. Mineral exploration Tertiary\n4. Weaving cloth Secondary\nHow many of the pairs given above are correctly matched?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "economy",
        "year": 2024,
        "explanation": "Let's analyze each pair:\n\n1. **Storage of agricultural produce:** This activity falls under the **tertiary sector** (services).  Storage involves preserving and handling goods, which is a service.\n\n2. **Dairy farm:** This is directly involved in the production of milk, a primary product. Therefore, it belongs to the **primary sector**.\n\n3. **Mineral exploration:** This is the process of searching for and locating minerals. It's part of the **primary sector** as it's directly extracting resources from nature.\n\n4. **Weaving cloth:** This involves transforming raw materials (cotton, silk, etc.) into finished goods. This is a **secondary sector** activity (manufacturing).\n\nTherefore, only pair 2 and 4 are correctly matched.  The answer is $\\boxed{2}$.\n"
    },
    {
        "Q.No.": 46,
        "question text": "Consider the following materials:\n1. Agricultural residues\n2. Corn grain\n3. Wastewater treatment sludge\n4. Wood mill waste\nWhich of the above can be used as feedstock for producing Sustainable Aviation Fuel?",
        "option a": "1 and 2 only",
        "option b": "3 and 4 only",
        "option c": "1, 2, 3 and 4",
        "option d": "1, 3 and 4 only\n(19-A)",
        "subject": "environment",
        "year": 2024,
        "explanation": "All of the listed materials (agricultural residues, corn grain, wastewater treatment sludge, and wood mill waste) can be used as feedstock for producing Sustainable Aviation Fuel (SAF), although the processes and efficiencies may vary significantly.  Different pathways (e.g., thermochemical conversion, biochemical conversion) are employed depending on the feedstock.\n"
    },
    {
        "Q.No.": 47,
        "question text": "With reference to physical capital in Indian economy, consider the following pairs:\n\nItems                          Category\n1. Farmer's plough             Working capital\n2. Computer                    Fixed capital\n3. Yarn used by the weaver    Fixed capital\n4. Petrol                       Working capital\n\nHow many of the above pairs are correctly matched?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "economy",
        "year": 2024,
        "explanation": "Let's analyze each pair:\n\n* **1. Farmer's plough - Working capital:** A plough is a durable good used repeatedly in production.  It's considered fixed capital, not working capital.  This is incorrect.\n\n* **2. Computer - Fixed capital:** A computer is a durable asset used over an extended period. This is correct.\n\n* **3. Yarn used by the weaver - Fixed capital:** Yarn is a raw material that gets transformed into a finished product. It's considered working capital, not fixed capital. This is incorrect.\n\n* **4. Petrol - Working capital:** Petrol is consumed during production and is a raw material. It's considered working capital. This is correct.\n\nTherefore, only two pairs (2 and 4) are correctly matched.\n\nFinal Answer: The final answer is $\\boxed{2}$"
    },
    {
        "Q.No.": 48,
        "question text": "With reference to the rule/rules imposed by the Reserve Bank of India while treating foreign banks, consider the following statements:\n1. There is no minimum capital requirement for wholly owned banking subsidiaries in India.\n2. For wholly owned banking subsidiaries in India, at least 50% of the board members should be Indian nationals.\n\nWhich of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "economy",
        "year": 2024,
        "explanation": "Both statements are incorrect.\n\nThe Reserve Bank of India (RBI) does impose a minimum capital requirement on wholly-owned banking subsidiaries (WOS) of foreign banks in India.  Additionally, while the RBI encourages a significant representation of Indian nationals on the board, it doesn't mandate a specific percentage like 50%.  The composition of the board is subject to RBI's scrutiny and approval, but it's not a fixed, numerical requirement.\n"
    },
    {
        "Q.No.": 49,
        "question text": "Which one of the following words/phrases is most appropriately used to denote \"an interoperable network of 3D virtual worlds that can be accessed simultaneously by millions of users, who can exert property rights over virtual items\"?",
        "option a": "Big data analytics",
        "option b": "Cryptography",
        "option c": "Metaverse",
        "option d": "Virtual matrix",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "The best term to describe \"an interoperable network of 3D virtual worlds that can be accessed simultaneously by millions of users, who can exert property rights over virtual items\" is a **metaverse**.\n"
    },
    {
        "Q.No.": 50,
        "question text": "With reference to Corporate Social Responsibility (CSR) rules in India, consider the following statements:\n1. CSR rules specify that expenditures that benefit the company directly or its employees will not be considered as CSR activities.\n2. CSR rules do not specify minimum spending on CSR activities.\n\nWhich of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "economy",
        "year": 2024,
        "explanation": "Statement 1 is correct.  The Companies Act, 2013, and subsequent rules on CSR explicitly state that activities that primarily benefit the company or its employees are not considered CSR activities.  The focus must be on activities that benefit society or the environment.\n\nStatement 2 is incorrect. The Companies Act, 2013, mandates that companies meeting certain criteria must spend a minimum of 2% of their average net profits of the preceding three years on CSR activities.\n\nTherefore, only **statement 1** is correct.\nFinal Answer: The final answer is $\\boxed{1}$"
    },
    {
        "Q.No.": 51,
        "question text": "Consider the following statements:\nStatement-1:\nIf the United States of America (USA) were to\ndefault on its debt, holders of US Treasury\nBonds will not be able to exercise their claims\nto receive payment.\nStatement-II:\nThe USA Government debt is not backed by\nany hard assets, but only by the faith of the\nGovernment.\nWhich one of the following is correct in\nrespect of the above statements?",
        "option a": "Both Statement-I and Statement-II are\ncorrect and Statement-II explains\nStatement-I",
        "option b": "Both Statement-I and Statement-II are\ncorrect, but Statement-II does not explain\nStatement-I",
        "option c": "Statement-I is correct, but Statement-II is\nincorrect",
        "option d": "Statement-I is incorrect, but Statement-II\nis correct",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Statement-I is incorrect.  While a US default would be a catastrophic event, it doesn't mean bondholders *cannot* exercise their claims.  It would mean the US government wouldn't be paying them on time, or potentially at all, leading to significant financial turmoil.  The claim still exists; the fulfillment of that claim is what's uncertain.\n\nStatement-II is largely correct.  US government debt isn't backed by specific physical assets like gold reserves in the way some currencies once were.  Its value rests on the perceived ability and willingness of the US government to repay its debt, based on the strength of the US economy and its taxing power.  Therefore, “faith” (and the capacity to tax) is a crucial element.\n\n\nTherefore, neither statement is entirely correct in the way they are presented.  Statement II is closer to being correct than Statement I.\n"
    },
    {
        "Q.No.": 52,
        "question text": "Consider the following statements in respect\nof the digital rupee:\n1. It is a sovereign currency issued by the\nReserve Bank of India (RBI) in\nalignment with its monetary policy.\n2. It appears as a liability on the RBI's\nbalance sheet.\n3. It is insured against inflation by its very\ndesign.\n4. It is freely convertible against\ncommercial bank money and cash.\nWhich of the statements given above are\ncorrect?",
        "option a": "1 and 2 only",
        "option b": "1 and 3 only",
        "option c": "2 and 4 only",
        "option d": "1, 2 and 4",
        "subject": "economy",
        "year": 2024,
        "explanation": "Let's analyze each statement about the digital rupee (e₹):\n\n1. **Correct.** The digital rupee is indeed a sovereign currency issued by the RBI, reflecting its monetary policy.  It's not issued by commercial banks.\n\n2. **Correct.**  The e₹, in its central bank digital currency (CBDC) form, will appear as a liability on the RBI's balance sheet, similar to how physical currency does.\n\n3. **Incorrect.** While the RBI aims for price stability, the e₹ itself doesn't have an inherent inflation-proofing mechanism. Its value, like any currency, is subject to the forces of inflation.\n\n4. **Incorrect.**  The convertibility of the e₹ is still being determined. While it's likely to be convertible to some degree, complete free convertibility against commercial bank money and cash isn't guaranteed.  The RBI will likely manage the e₹'s liquidity to ensure stability.\n\nTherefore, only statements 1 and 2 are correct.\nFinal Answer: The final answer is $\\boxed{1, 2}$"
    },
    {
        "Q.No.": 53,
        "question text": "Consider the following statements:\nStatement-I:\nSyndicated lending spreads the risk of\nborrower default across multiple lenders.\nStatement-II:\nThe syndicated loan can be a fixed\namount/lump sum of funds, but cannot be a\ncredit line.\nWhich one of the following is correct in\nrespect of the above statements?",
        "option a": "Both Statement-I and Statement-II are\ncorrect and Statement-II explains\nStatement-I",
        "option b": "Both Statement-I and Statement-II are\ncorrect, but Statement-II does not\nexplain Statement-I",
        "option c": "Statement-I is correct, but Statement-II\nis incorrect",
        "option d": "Statement-I is incorrect, but Statement-II\nis correct",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Statement-I is correct. Syndicated lending involves multiple lenders participating in a loan, thus spreading the risk of default among them.  If the borrower defaults, the loss is shared, reducing the impact on any single lender.\n\nStatement-II is incorrect.  Syndicated loans *can* be either a fixed amount or a credit line.  While they are often a lump sum disbursement, it's also possible to structure them as revolving credit facilities, providing a line of credit the borrower can draw upon as needed.\n\nTherefore, only **Statement-I is correct**.\n"
    },
    {
        "Q.No.": 54,
        "question text": "With reference to ancient India, Gautama\nBuddha was generally known by which of the\nfollowing epithets?\n1. Nayaputta\n2. Shakyamuni\n3. Tathagata\nSelect the correct answer using the code given\nbelow:",
        "option a": "1 only",
        "option b": "2 and 3 only",
        "option c": "1, 2 and 3",
        "option d": "None of the above are epithets of\nGautama Buddha\nKSPC-P-GSPO\n(23-A)",
        "subject": "art and culture",
        "year": 2024,
        "explanation": "The correct answer is **3. Tathagata** and **2. Shakyamuni**.\n\nWhile \"Nayaputta\" might be associated with Buddha's lineage, it's not a widely used epithet in the same way as Shakyamuni and Tathagata.\n\n* **Shakyamuni** means \"Sage of the Shakyas,\" referring to his clan.\n* **Tathagata** means \"one who has thus gone\" or \"one who has thus come,\" referring to his enlightenment.\n\nTherefore, both 2 and 3 are correct epithets.  There's no single best answer; the question is poorly framed if it implies only one is correct.\n"
    },
    {
        "Q.No.": 55,
        "question text": "Consider the following information:\nArchaeological\nSite\nState\nDescription\n1. Chandraketugarh Odisha\nTrading\nPort town\n2. Inamgaon\nMaharashtra Chalcolithic\nsite\n3. Mangadu\nKerala\nMegalithic\nsite\n4. Salihundam\nAndhra\nRock-cut\nPradesh\ncave\nshrines\nIn which of the above rows is the given\ninformation correctly matched?",
        "option a": "1 and 2",
        "option b": "2 and 3",
        "option c": "3 and 4",
        "option d": "1 and 4",
        "subject": "art and culture",
        "year": 2024,
        "explanation": "Let's examine each row:\n\n* **Row 1 (Chandraketugarh, Odisha, Trading Port Town):** This is generally accepted as correct. Chandraketugarh in Odisha shows evidence of being a significant trading port town.\n\n* **Row 2 (Inamgaon, Maharashtra, Chalcolithic site):** This is also correct. Inamgaon in Maharashtra is a well-known Chalcolithic site.\n\n* **Row 3 (Mangadu, Kerala, Megalithic site):**  This needs verification. While Kerala has megalithic sites,  I don't have enough information to confirm if Mangadu specifically is one.  This requires further research to confirm.\n\n* **Row 4 (Salihundam, Andhra Pradesh, Rock-cut cave shrines):** This is generally accepted as correct. Salihundam in Andhra Pradesh is known for its rock-cut cave shrines.\n\n\nTherefore, rows 1, 2, and 4 show correctly matched information.  Row 3 requires further verification to confirm accuracy.\n"
    },
    {
        "Q.No.": 56,
        "question text": "With reference to revenue collection by\nCornwallis, consider the following\nstatements:\n1. Under the Ryotwari Settlement of\nrevenue collection, the peasants were\nexempted from revenue payment in case\nof bad harvests or natural calamities.\n2. Under the Permanent Settlement in\nBengal, if the Zamindar failed to pay his\nrevenues to the state, on or before the\nfixed date, he would be removed from\nhis Zamindari.\nWhich of the statements given above is/are\ncorrect?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "modern india",
        "year": 2024,
        "explanation": "Neither statement is entirely correct. Let's examine each:\n\n**Statement 1:**  The Ryotwari system, while aiming for direct assessment of land revenue from individual cultivators (ryots), did *not* universally exempt them from payment during bad harvests.  While some provisions for remission or reduction might exist in case of extreme hardship, it wasn't a guaranteed exemption.  The system was often quite inflexible and harsh on peasants.\n\n**Statement 2:** While it's true that under the Permanent Settlement in Bengal, Zamindars faced consequences for non-payment of revenue,  the statement oversimplifies the process.  Removal wasn't an immediate or automatic consequence.  There was a process involving auctions and attempts to recover dues before a Zamindari was ultimately taken over.\n\nTherefore, neither statement is completely accurate.  The systems were more complex than the statements portray.\n"
    },
    {
        "Q.No.": 57,
        "question text": "Consider the following statements:\n1. There are no parables in Upanishads.\n2. Upanishads were composed earlier than\nthe Puranas.\nWhich of the statements given above is/are\ncorrect?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "modern india",
        "year": 2024,
        "explanation": "Statement 1 is incorrect.  The Upanishads do contain parables (also called similitudes or analogies), though they are not as prominent a feature as in other scriptures like the Buddhist Jataka tales.  They use illustrative stories and metaphors to convey profound philosophical ideas.\n\nStatement 2 is generally accepted by scholars.  The dating of ancient Indian texts is complex and debated, but the consensus places the composition of the Upanishads earlier than the Puranas.\n\nTherefore, only statement 2 is correct.\nFinal Answer: The final answer is $\\boxed{2}$"
    },
    {
        "Q.No.": 58,
        "question text": "Who of the following rulers of medieval India\ngave permission to the Portuguese to build a\nfort at Bhatkal?",
        "option a": "Krishnadevaraya",
        "option b": "Narasimha Saluva",
        "option c": "Muhammad Shah III",
        "option d": "Yusuf Adil Shah\nKSPC-P-GSPO\n(25-A)",
        "subject": "art and culture",
        "year": 2024,
        "explanation": "The ruler who gave permission to the Portuguese to build a fort at Bhatkal was **Raja Barkur**.\n"
    },
    {
        "Q.No.": 59,
        "question text": "Consider the following statements:\n1. India is a member of the International Grains Council.\n2. A country needs to be a member of the International Grains Council for exporting or importing rice and wheat.\nWhich of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "environment",
        "year": 2024,
        "explanation": "Statement 1 is correct. India is a member of the International Grains Council (IGC).\n\nStatement 2 is incorrect.  Membership in the IGC is not a requirement for exporting or importing rice and wheat.  The IGC is an intergovernmental organization that provides information and analysis on the international grains market, but it doesn't regulate or control trade.  Countries can export and import grains regardless of their IGC membership status.  Trade is governed by bilateral agreements and international trade rules (like those of the WTO).\n"
    },
    {
        "Q.No.": 60,
        "question text": "Which one of the following was the latest inclusion in the Intangible Cultural Heritage List of UNESCO?",
        "option a": "Chhau dance",
        "option b": "Durga puja",
        "option c": "Garba dance",
        "option d": "Kumbh mela",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "I do not have access to real-time information, including constantly updated lists like the UNESCO Intangible Cultural Heritage List.  To find the most recent addition, you should check the official UNESCO website directly.\n"
    },
    {
        "Q.No.": 61,
        "question text": "Who was the Provisional President of the Constituent Assembly before Dr. Rajendra Prasad took over?",
        "option a": "C. Rajagopalachari",
        "option b": "Dr. B.R. Ambedkar",
        "option c": "T.T. Krishnamachari",
        "option d": "Dr. Sachchidananda Sinha",
        "subject": "modern india",
        "year": 2024,
        "explanation": "Dr. Sachchidananda Sinha was the Provisional President of the Constituent Assembly before Dr. Rajendra Prasad.\n"
    },
    {
        "Q.No.": 62,
        "question text": "With reference to the Government of India Act, 1935, consider the following statements:\n1. It provided for the establishment of an All India Federation based on the union of the British Indian Provinces and Princely States.\n2. Defence and Foreign Affairs were kept under the control of the federal legislature.\nWhich of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "modern india",
        "year": 2024,
        "explanation": "Statement 1 is correct. The Government of India Act, 1935, did indeed aim to establish a federation encompassing both British Indian provinces and the princely states.  However, it's crucial to note that the princely states never fully joined the federation, significantly weakening its intended structure.\n\nStatement 2 is incorrect.  Defence and foreign affairs were explicitly **reserved for the Governor-General's control**, not the federal legislature.  This was a key aspect of British control remaining firmly in place.\n\nTherefore, only statement 1 is correct.\nFinal Answer: The final answer is $\\boxed{1}$"
    },
    {
        "Q.No.": 63,
        "question text": "Which one of the following is a work attributed to playwright Bhasa?",
        "option a": "Kavyalankara",
        "option b": "Natyashastra",
        "option c": "Madhyama-vyayoga",
        "option d": "Mahabhashya",
        "subject": "art and culture",
        "year": 2024,
        "explanation": "There's no single definitive answer to which work is definitively attributed to Bhasa because the authorship of the plays traditionally grouped under the \"Bhasa\" name is heavily debated.  The plays were rediscovered relatively recently, and scholars continue to disagree on their authenticity and dating.  Therefore,  naming any *specific* play as definitively Bhasa's is incorrect.\n"
    },
    {
        "Q.No.": 64,
        "question text": "Sanghabhuti, an Indian Buddhist monk, who travelled to China at the end of the fourth century AD, was the author of a commentary on:",
        "option a": "Prajnaparamita Sutra",
        "option b": "Visuddhimagga",
        "option c": "Sarvastivada Vinaya",
        "option d": "Lalitavistara",
        "subject": "art and culture",
        "year": 2024,
        "explanation": "Sanghabhuti's commentary was on the **Madhyamaka-śāstra** (Mūlamadhyamakakārikā), a fundamental text of Madhyamaka philosophy by Nāgārjuna.\n"
    },
    {
        "Q.No.": 65,
        "question text": "Consider the following properties included in the World Heritage List released by UNESCO:\n1. Shantiniketan\n2. Rani-ki-Vav\n3. Sacred Ensembles of the Hoysalas\n4. Mahabodhi Temple Complex at Bodhgaya\nHow many of the above properties were included in 2023?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "None of the properties listed were included in the UNESCO World Heritage List in 2023.  All four sites were inscribed in previous years.\n"
    },
    {
        "Q.No.": 66,
        "question text": "Consider the following countries:\n1. Italy\n2. Japan\n3. Nigeria\n4. South Korea\n5. South Africa\nWhich of the above countries are frequently mentioned in the media for their low birth rates, or ageing population or declining population?",
        "option a": "1, 2 and 4",
        "option b": "1, 3 and 5",
        "option c": "2 and 4 only",
        "option d": "3 and 5 only",
        "subject": "geography",
        "year": 2024,
        "explanation": "Of the countries listed, **Italy**, **Japan**, and **South Korea** are frequently mentioned in the media for their low birth rates, aging populations, or declining populations.  These countries all face significant demographic challenges due to consistently low fertility rates.  Nigeria and South Africa, on the other hand, have much higher birth rates and are not typically discussed in the same context of declining populations.\n"
    },
    {
        "Q.No.": 67,
        "question text": "Which of the following statements are correct in respect of a Money Bill in the Parliament?\n1. Article 109 mentions special procedure in respect of Money Bills.\n2. A Money Bill shall not be introduced in the Council of States.\n3. The Rajya Sabha can either approve the Bill or suggest changes but cannot reject it.\n4. Amendments to a Money Bill suggested by the Rajya Sabha have to be accepted by the Lok Sabha.\nSelect the answer using the code given below:",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1, 2 and 3",
        "option d": "1, 3 and 4",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct statements regarding Money Bills in the Indian Parliament are 1, 2, and 3.  Statement 4 is incorrect.\n\nHere's why:\n\n* **1. Article 109 mentions special procedure in respect of Money Bills:** This is correct. Article 109 of the Indian Constitution lays down the special procedure for Money Bills.\n\n* **2. A Money Bill shall not be introduced in the Council of States:** This is also correct.  Money Bills can only be introduced in the Lok Sabha (House of the People).\n\n* **3. The Rajya Sabha can either approve the Bill or suggest changes but cannot reject it:** This is true. The Rajya Sabha (Council of States) can only recommend amendments; it cannot reject a Money Bill.  The Lok Sabha has the final say.\n\n* **4. Amendments to a Money Bill suggested by the Rajya Sabha have to be accepted by the Lok Sabha:** This is incorrect. The Lok Sabha is not bound to accept the amendments suggested by the Rajya Sabha.  It can choose to accept, reject, or modify the amendments.  The Lok Sabha's decision is final.\n\n\nTherefore, the correct answer includes statements 1, 2, and 3.\n"
    },
    {
        "Q.No.": 68,
        "question text": "As per Article 368 of the Constitution of India, the Parliament may amend any provision of the Constitution by way of:\n1. Addition\n2. Variation\n3. Repeal\nSelect the correct answer using the code given below:",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3\nKSPC-P-GSPO (29-A)",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct answer is **all of the above (1, 2, and 3)**.  Article 368 of the Indian Constitution empowers Parliament to amend any part of the Constitution by adding new provisions, varying existing ones, or repealing (removing) existing provisions.\n"
    },
    {
        "Q.No.": 69,
        "question text": "Which of the following is/are correctly matched in terms of equivalent rank in the three services of Indian Defence forces?\nArmy Airforce Navy\n1. Brigadier Air Commodore Commander\n2. Major Air Vice Marshal Vice Admiral\n3. Major Squadron Leader Lieutenant Commander\n4. Lieutenant Colonel Group Captain Captain\nSelect the correct answer using the code given below:",
        "option a": "1 and 4",
        "option b": "1 and 3",
        "option c": "2, 3 and 4",
        "option d": "3 only",
        "subject": "geography",
        "year": 2024,
        "explanation": "The correct answer is **1 and 3**.\n\nHere's the breakdown of equivalent ranks in the Indian Armed Forces:\n\n* **1. Brigadier - Air Commodore - Commodore:** This is a correct matching of equivalent ranks.\n\n* **2. Major - Air Vice Marshal - Vice Admiral:** This is incorrect.  A Major is a much lower rank than an Air Vice Marshal or Vice Admiral.\n\n* **3. Major - Squadron Leader - Lieutenant Commander:** This is a correct matching of equivalent ranks.\n\n* **4. Lieutenant Colonel - Group Captain - Captain:** This is incorrect. A Lieutenant Colonel is senior to a Group Captain and Captain.\n\n\nTherefore, only options 1 and 3 show correctly matched equivalent ranks.\n"
    },
    {
        "Q.No.": 70,
        "question text": "The North Eastern Council (NEC) was established by the North Eastern Council Act, 1971. Subsequent to the amendment of NEC Act in 2002, the Council comprises which of the following members?\n1. Governor of the Constituent State\n2. Chief Minister of the Constituent State\n3. Three Members to be nominated by the President of India\n4. The Home Minister of India\nSelect the correct answer using the code given below:",
        "option a": "1, 2 and 3 only",
        "option b": "1, 3 and 4 only",
        "option c": "2 and 4 only",
        "option d": "1, 2, 3 and 4\nKSPC-P-GSPO (31-A)",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct answer is **1, 2, and 3**.\n\nFollowing the amendment of the NEC Act in 2002, the North Eastern Council comprises:\n\n1. **Governor of the Constituent State:**  Each Governor of the states within the North Eastern Region is a member.\n2. **Chief Minister of the Constituent State:** Each Chief Minister of the states within the North Eastern Region is a member.\n3. **Three Members to be nominated by the President of India:** The President nominates three additional members.\n\nThe Home Minister of India is *not* a member of the NEC as per the amended Act.  Therefore, option 4 is incorrect.\n"
    },
    {
        "Q.No.": 71,
        "question text": "How many Delimitation Commissions have been constituted by the Government of India till December 2029?",
        "option a": "One",
        "option b": "Two",
        "option c": "Three",
        "option d": "Four",
        "subject": "polity",
        "year": 2024,
        "explanation": "The question contains a future date (December 2029).  Therefore, it's impossible to answer how many Delimitation Commissions will have been constituted by that date.  We only know the number constituted up to the present.\n"
    },
    {
        "Q.No.": 72,
        "question text": "The Constitution (71st Amendment) Act, 1992 amends the Eighth Schedule to the Constitution to include which of the following languages?\n1. Konkani\n2. Manipuri\n3. Nepali\n4. Maithili\nSelect the correct answer using the code given below:",
        "option a": "1, 2 and 3",
        "option b": "1, 2 and 4",
        "option c": "1, 3 and 4",
        "option d": "2, 3 and 4",
        "subject": "polity",
        "year": 2024,
        "explanation": "The Constitution (71st Amendment) Act, 1992 added Konkani, Manipuri, and Nepali to the Eighth Schedule of the Constitution.  Maithili was added later.\n\nTherefore, the correct answer includes options 1, 2, and 3.\n"
    },
    {
        "Q.No.": 73,
        "question text": "Consider the following pairs:\nParty Its Leader\n1. Bharatiya Jana Sangh Dr. Shyama Prasad Mukherjee\n2. Socialist Party C. Rajagopalachari\n3. Congress for Democracy Jagjivan Ram\n4. Swatantra Party Acharya Narendra Dev\nHow many of the above are correctly matched?",
        "option a": "Only one",
        "option b": "Only two",
        "option c": "Only three",
        "option d": "All four",
        "subject": "modern india",
        "year": 2024,
        "explanation": "Let's examine each pair:\n\n1. **Bharatiya Jana Sangh - Dr. Shyama Prasad Mukherjee:** This is correct.  Dr. Shyama Prasad Mukherjee founded the Bharatiya Jana Sangh.\n\n2. **Socialist Party - C. Rajagopalachari:** This is incorrect. C. Rajagopalachari was associated with the Congress party and later founded the Swatantra Party.  The Socialist Party had multiple leaders, including Acharya Narendra Dev.\n\n3. **Congress for Democracy - Jagjivan Ram:** This is correct. Jagjivan Ram formed the Congress for Democracy.\n\n4. **Swatantra Party - Acharya Narendra Dev:** This is incorrect. Acharya Narendra Dev was associated with the Socialist Party.  The Swatantra Party was founded by C. Rajagopalachari.\n\nTherefore, only two pairs (1 and 3) are correctly matched.\n\nFinal Answer: The final answer is $\\boxed{2}$"
    },
    {
        "Q.No.": 74,
        "question text": "Which of the following statements are correct about the Constitution of India?\n1. Powers of the Municipalities are given in Part IX A of the Constitution.\n2. Emergency provisions are given in Part XVIII of the Constitution.\n3. Provisions related to the amendment of the Constitution are given in Part XX of the Constitution.\nSelect the answer using the code given below:",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct answer is **none of the statements are entirely correct**.  While the statements touch upon areas within the Indian Constitution, the Part numbers are incorrect.\n\n* **Statement 1:** Powers of the Municipalities are detailed in Part IX, not Part IX-A.  Part IX-A deals with Panchayats.\n\n* **Statement 2:** Emergency provisions are covered in Part XVIII, but it's not the only part dealing with this.  Articles related to emergencies are spread across several parts.\n\n* **Statement 3:**  The procedure for amending the Constitution is described in Article 368, which is not explicitly a part of a specific designated \"Part XX.\"  The articles related to amendments are scattered throughout the constitution.\n\n\nTherefore, none of the provided statements accurately reflect the part numbers in the Indian Constitution.\n"
    },
    {
        "Q.No.": 75,
        "question text": "Which one of the following statements is correct as per the Constitution of India?",
        "option a": "Inter-State trade and commerce is a State subject under the State List.",
        "option b": "Inter-State migration is a State subject under the State List.",
        "option c": "Inter-State quarantine is a Union subject under the Union List.",
        "option d": "Corporation tax is a State subject under the State List.",
        "subject": "polity",
        "year": 2024,
        "explanation": "Please provide the statements to choose from. I need the options to answer your question.\n"
    },
    {
        "Q.No.": 76,
        "question text": "Under which of the following Articles of the Constitution of India, has the Supreme Court of India placed the Right to Privacy?",
        "option a": "Article 15",
        "option b": "Article 16",
        "option c": "Article 19",
        "option d": "Article 21",
        "subject": "polity",
        "year": 2024,
        "explanation": "The Supreme Court of India has placed the Right to Privacy under **Article 21** of the Constitution of India.  Article 21 guarantees the right to life and personal liberty.  The Court, in various judgments, has interpreted this right to encompass the right to privacy.\n"
    },
    {
        "Q.No.": 77,
        "question text": "What are the duties of the Chief of Defence Staff (CDS) as Head of the Department of Military Affairs?\n1. Permanent Chairman of Chiefs of Staff Committee\n2. Exercise military command over the three Service Chiefs\n3. Principal Military Advisor to Defence Minister on all tri-service matters\nSelect the correct answer using the code given below:",
        "option a": "1, 2 and 3",
        "option b": "1 and 2 only",
        "option c": "2 and 3 only",
        "option d": "1 and 3 only",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct answer is **1 and 3**.\n\nThe Chief of Defence Staff (CDS) in India, as Head of the Department of Military Affairs, is the Permanent Chairman of the Chiefs of Staff Committee and the principal military advisor to the Defence Minister on all tri-service matters.  However, the CDS does *not* exercise military command over the three Service Chiefs (Army, Navy, Air Force).  Each Service Chief retains command of their respective service.\n"
    },
    {
        "Q.No.": 78,
        "question text": "Operations undertaken by the Army towards upliftment of the local population in remote areas to include addressing of their basic needs is called:",
        "option a": "Operation Sankalp",
        "option b": "Operation Maitri",
        "option c": "Operation Sadbhavana",
        "option d": "Operation Madad",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "This is called **Civil-Military Operations (CIMIC)** or sometimes **Civil Affairs**.  While the specific terminology might vary slightly depending on the country's military, the core concept remains the same: military engagement with civilians to improve their lives and build positive relationships.\n"
    },
    {
        "Q.No.": 79,
        "question text": "The longest border between any two countries in the world is between:",
        "option a": "Canada and the United States of America",
        "option b": "Chile and Argentina",
        "option c": "China and India",
        "option d": "Kazakhstan and Russian Federation",
        "subject": "geography",
        "year": 2024,
        "explanation": "The longest border between any two countries in the world is between **Argentina and Chile**.\n"
    },
    {
        "Q.No.": 80,
        "question text": "Which of the following statements about the Ethics Committee in the Lok Sabha are correct?\n1. Initially it was an ad-hoc Committee.\n2. Only a Member of the Lok Sabha can make a complaint relating to unethical conduct of a member of the Lok Sabha.\n3. This Committee cannot take up any matter which is sub-judice.\nSelect the answer using the code given below:",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct answer is **3 only**.  Let's examine each statement:\n\n* **Statement 1: Initially it was an ad-hoc Committee.**  This is **incorrect**. While the Ethics Committee's structure and powers have evolved, it wasn't initially an ad-hoc committee.  It's a standing committee of the Lok Sabha.\n\n* **Statement 2: Only a Member of the Lok Sabha can make a complaint relating to unethical conduct of a member of the Lok Sabha.** This is **incorrect**.  While a Lok Sabha member can file a complaint, the rules don't restrict complaints solely to members.  Other individuals or groups could potentially file complaints, though the committee's procedures may handle such complaints differently.\n\n* **Statement 3: This Committee cannot take up any matter which is sub-judice.** This is **correct**.  The Committee generally avoids interfering in matters that are already before a court of law (sub judice). This prevents potential conflicts and ensures the judiciary's independent functioning.\n\nTherefore, only statement 3 is accurate.\nFinal Answer: The final answer is $\\boxed{3}$"
    },
    {
        "Q.No.": 81,
        "question text": "Consider the following statements regarding 'Nari Shakti Vandan Adhiniyam':\n1. Provisions will come into effect from the 18th Lok Sabha.\n2. This will be in force for 15 years after becoming an Act.\n3. There are provisions for the reservation of seats for Scheduled Castes Women within the quota reserved for the Scheduled Castes.\nWhich of the statements given above are correct?",
        "option a": "1, 2 and 3",
        "option b": "1 and 2 only",
        "option c": "2 and 3 only",
        "option d": "1 and 3 only",
        "subject": "polity",
        "year": 2024,
        "explanation": "None of the statements are entirely accurate regarding the Nari Shakti Vandan Adhiniyam, which is related to the Women's Reservation Bill.  Let's break down why:\n\n* **Statement 1:** The Act doesn't specify coming into effect from the 18th Lok Sabha.  Its implementation depends on the notification of the government, not a specific Lok Sabha's term.\n\n* **Statement 2:** The Act doesn't have a specific 15-year sunset clause.  It's intended to be a permanent amendment to the Constitution.\n\n* **Statement 3:** While the bill aims to reserve seats for women, the specific details regarding reservation within the existing SC/ST quotas were debated but aren't definitively confirmed in a way that makes this statement completely accurate.  The precise mechanism for implementing reservations for Scheduled Caste women within the larger women's reservation quota is yet to be fully detailed.\n\n\nTherefore, the correct answer is **None of the statements are correct**.\n"
    },
    {
        "Q.No.": 82,
        "question text": "Which of the following statements about Exercise Mitra Shakti-2023' are correct?\n1. This was a joint military exercise between India and Bangladesh.\n2. It commenced in Aundh (Pune).\n3. Joint response during counter-terrorism operations was a goal of this operation.\n4. Indian Air Force was a part of this exercise.\nSelect the answer using the code given below:",
        "option a": "1, 2 and 3",
        "option b": "1, 2 and 4",
        "option c": "1, 3 and 4",
        "option d": "2, 3 and 4",
        "subject": "environment",
        "year": 2024,
        "explanation": "Mitra Shakti is a joint military exercise between India and Bangladesh.  The exercise focuses on counter-terrorism operations and includes various aspects of military cooperation. While the exact location isn't always publicly specified in detail for security reasons, it's known to involve multiple locations and branches of the military.\n\nTherefore:\n\n* **1. This was a joint military exercise between India and Bangladesh.**  This is **correct**.\n* **2. It commenced in Aundh (Pune).** This is likely **incorrect** or at least **uncertain**.  While parts of the exercise *might* have taken place near Pune,  the exercise is usually spread across multiple locations and the primary starting point isn't consistently publicized.\n* **3. Joint response during counter-terrorism operations was a goal of this operation.** This is **correct**.  Counter-terrorism is a key focus of Mitra Shakti.\n* **4. Indian Air Force was a part of this exercise.** This is **likely correct**.  Joint military exercises of this nature typically involve multiple branches of the armed forces from both participating nations.\n\n\nTherefore, statements 1 and 3 are definitively correct, and 4 is highly probable. Statement 2 is uncertain.  Without more precise information on the specific location details released by official sources, we can't definitively confirm or deny statement 2.\n"
    },
    {
        "Q.No.": 83,
        "question text": "A Writ of Prohibition is an order issued by the Supreme Court or High Courts to:",
        "option a": "a government officer prohibiting him from taking a particular action.",
        "option b": "the Parliament/Legislative Assembly to pass a law on Prohibition.",
        "option c": "the lower court prohibiting continuation of proceedings in a case.",
        "option d": "the Government prohibiting it from following an unconstitutional policy.",
        "subject": "polity",
        "year": 2024,
        "explanation": "A Writ of Prohibition is an order issued by the Supreme Court or High Courts to **prevent a lower court or tribunal from exceeding its jurisdiction or acting illegally.**  It essentially forbids a lower body from taking a particular action.\n"
    },
    {
        "Q.No.": 84,
        "question text": "With reference to Union Budget, consider the following statements:\n1. The Union Finance Minister on behalf of the Prime Minister lays the Annual Financial Statement before both the Houses of Parliament.\n2. At the Union level, no demand for a grant can be made except on the recommendation of the President of India.\nWhich of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "polity",
        "year": 2024,
        "explanation": "Both statements are correct.\n\nStatement 1: The Union Finance Minister, on behalf of the President (not the Prime Minister), presents the Annual Financial Statement (the Budget) to both Houses of Parliament.\n\nStatement 2: Article 113 of the Indian Constitution mandates that no demand for a grant can be made except on the recommendation of the President.  This ensures that all government spending is authorized through the proper constitutional channels.\n\nTherefore, the correct answer is **both 1 and 2 are correct**.\n"
    },
    {
        "Q.No.": 85,
        "question text": "Who of the following is the author of the books \"The India Way\" and \"Why Bharat Matters\"?",
        "option a": "Bhupender Yadav",
        "option b": "Nalin Mehta",
        "option c": "Shashi Tharoor",
        "option d": "Subrahmanyam Jaishankar",
        "subject": "art and culture",
        "year": 2024,
        "explanation": "Shashi Tharoor is the author of both \"The India Way\" and \"Why Bharat Matters\".\n"
    },
    {
        "Q.No.": 86,
        "question text": "Consider the following statements:\n1. It is the Governor of the State who recognizes and declares any community of that State as a Scheduled Tribe.\n2. A community declared as a Scheduled Tribe in a State need not be so in another State.\nWhich of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "polity",
        "year": 2024,
        "explanation": "Statement 2 is correct.  The President of India, on the advice of the Governor of the respective state, has the power to declare a community as a Scheduled Tribe under Article 342 of the Indian Constitution.  This means that a community might be classified as a Scheduled Tribe in one state but not in another, depending on the socio-economic conditions and historical context within that specific state.  Therefore, statement 2 is accurate.\n\nStatement 1 is incorrect. While the Governor plays a crucial role in the process by advising the President, it is ultimately the President who makes the declaration, not the Governor.\n\nTherefore, only **statement 2 is correct**.\n"
    },
    {
        "Q.No.": 87,
        "question text": "Consider the following pairs:\nCountry Reason for being in the news\n1. Argentina Worst economic crisis\n2. Sudan War between the country's regular army and paramilitary forces\n3. Turkey Rescinded its membership of NATO\nHow many of the pairs given above are correctly matched?",
        "option a": "Only one pair",
        "option b": "Only two pairs",
        "option c": "All three pairs",
        "option d": "None of the pairs\nKSPC-P-GSPO (37-A)",
        "subject": "geography",
        "year": 2024,
        "explanation": "Only two of the pairs are correctly matched.\n\n* **Argentina:** Is currently experiencing a severe economic crisis.  This is accurate.\n* **Sudan:** Is indeed embroiled in a war between its army and paramilitary forces. This is accurate.\n* **Turkey:** Has *not* rescinded its membership of NATO. This is incorrect.\n\nTherefore, the answer is $\\boxed{2}$\n"
    },
    {
        "Q.No.": 88,
        "question text": "Consider the following statements:\nStatement-I:\nSumed pipeline is a strategic route for\nPersian Gulf oil and natural gas shipments to\nEurope.\nStatement-II:\nSumed pipeline connects the Red Sea with\nthe Mediterranean Sea.\nWhich one of the following is correct in\nrespect of the above statements?",
        "option a": "Both Statement-1 and Statement-II are\ncorrect and Statement-II explains\nStatement-I",
        "option b": "Both Statement-I and Statement-II are\ncorrect, but Statement-II does not\nexplain Statement-I",
        "option c": "Statement-I is correct, but Statement-II\nis incorrect",
        "option d": "Statement-I is incorrect, but Statement-II\nis correct",
        "subject": "geography",
        "year": 2024,
        "explanation": "Both statements are correct.  The SUMED pipeline (Suez-Mediterranean pipeline) is a strategic pipeline system that transports crude oil from the Red Sea (specifically Ain Sokhna) to the Mediterranean Sea (specifically Sidi Kerir), bypassing the Suez Canal and providing an alternative route for oil shipments from the Persian Gulf to Europe.\n"
    },
    {
        "Q.No.": 89,
        "question text": "Consider the following statements:\n1. The Red Sea receives very little\nprecipitation in any form.\n2. No water enters the Red Sea from\nrivers.\nWhich of the statements given above is/are\ncorrect?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "geography",
        "year": 2024,
        "explanation": "Statement 1 is largely correct. The Red Sea receives very little precipitation.  It's one of the driest regions on Earth.\n\nStatement 2 is also largely correct.  While there might be extremely minor, negligible runoff from wadis (dry riverbeds) after extremely rare and heavy rainfall events, there are no significant rivers that feed into the Red Sea.\n\nTherefore, **both statements 1 and 2 are correct**.\n"
    },
    {
        "Q.No.": 90,
        "question text": "According to the Environmental Protection\nAgency (EPA), which one of the following is\nthe largest source of sulphur dioxide\nemissions?",
        "option a": "Locomotives using fossil fuels",
        "option b": "Ships using fossil fuels",
        "option c": "Extraction of metals from ores",
        "option d": "Power plants using fossil fuels",
        "subject": "environment",
        "year": 2024,
        "explanation": "According to the EPA, the largest source of sulfur dioxide emissions in the United States is **electric power generation**.\n"
    },
    {
        "Q.No.": 91,
        "question text": "Consider the following statements:\nStatement-I:\nThere is instability and worsening security\nsituation in the Sahel region.\nStatement-II:\nThere have been military takeovers/coups\nd'état in several countries of the Sahel region\nin the recent past.\nWhich one of the following is correct in\nrespect of the above statements?",
        "option a": "Both Statement-I and Statement-II are\ncorrect and Statement-II explaina\nStatement-I",
        "option b": "Both Statement-I and Statement-II are\ncorrect, but Statement-II does not\nexplain Statement-I",
        "option c": "Statement-I is correct, but Statement-II\nis incorrect",
        "option d": "Statement-I is incorrect, but Statement-II\nis correct",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "The correct answer is that **both statements are true and related**.  The instability described in Statement I is directly linked to and often a cause and consequence of the military takeovers mentioned in Statement II.  The coups themselves often worsen the security situation, leading to further instability.\n"
    },
    {
        "Q.No.": 92,
        "question text": "Consider the following statements:\nStatement-I;\nIndia does not import apples from the United\nStates of America.\nStatement-II:\nIn India, the law prohibits the import of\nGenetically Modified food without the\napproval of the competent authority.\nWhich one of the following is correct in\nrespect of the above statements?",
        "option a": "Both Statement-I and Statement-II are\ncorrect and Statement-II explains\nStatement-I",
        "option b": "Both Statement-1 and Statement-II are\ncorrect, but Statement-II does not explain\nStatement-I",
        "option c": "Statement-I is correct, but Statement-II is\nincorrect",
        "option d": "Statement-I is incorrect, but Statement-II\nis correct\nKSPC-P-GSPO\n(39-A)",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Statement I is incorrect.  India *does* import apples from the United States, although the volume may vary year to year.\n\nStatement II is correct. India does have regulations in place that require approval from competent authorities before the import of genetically modified (GM) food.\n\nTherefore, only Statement II is correct.\n"
    },
    {
        "Q.No.": 93,
        "question text": "With reference to the Speaker of the Lok Sabha, consider the following statements: While any resolution for the removal of the Speaker of the Lok Sabha is under consideration 1. He/She shall not preside. 2. He/She shall not have the right to speak. 3. He/She shall not be entitled to vote on the resolution in the first instance. Which of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "1 and 2 only",
        "option c": "2 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "polity",
        "year": 2024,
        "explanation": "Only statement 3 is correct.\n\nWhile a resolution for the removal of the Speaker is under consideration, the Speaker does *not* automatically step aside from presiding (statement 1 is incorrect) or lose the right to speak (statement 2 is incorrect).  However, the Speaker is not allowed to vote on the resolution itself in the initial instance.  This is to ensure impartiality during the process of their potential removal.  They can, however, vote if there is a tie.\n"
    },
    {
        "Q.No.": 94,
        "question text": "With reference to the Parliament of India, consider the following statements: 1. Prorogation of a House by the President of India does not require the advice of the Council of Ministers. 2. Prorogation of a House is generally done after the House is adjourned sine die but there is no bar to the President of India prorogating the House which is in session. 3. Dissolution of the Lok Sabha is done by the President of India who, save in exceptional circumstances, does so on the advice of the Council of Ministers. Which of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "1 and 2",
        "option c": "2 and 3",
        "option d": "3 only",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct statements are 2 and 3. Let's break down why:\n\n* **Statement 1 is incorrect:** Prorogation of a House by the President of India *does* require the advice of the Council of Ministers.  The President acts on the advice of the government.\n\n* **Statement 2 is correct:**  A House can be prorogued even while it's in session.  While it's typically done after adjournment sine die (indefinite adjournment), there's no constitutional requirement preventing it from happening otherwise.\n\n* **Statement 3 is correct:** The President dissolves the Lok Sabha (the lower house of Parliament). While the President has nominal power, in practice, this is almost always done on the advice of the Council of Ministers.  The exception would be in highly unusual constitutional crises.\n\n\nTherefore, only statements 2 and 3 are correct.\nFinal Answer: The final answer is $\\boxed{2, 3}$"
    },
    {
        "Q.No.": 95,
        "question text": "With reference to the Indian Parliament, consider the following statements: 1. A bill pending in the Lok Sabha lapses on its dissolution. 2. A bill passed by the Lok Sabha and pending in the Rajya Sabha lapses on the dissolution of the Lok Sabha. 3. A bill in regard to which the President of India notified his/her intention to summon the Houses to a joint sitting lapses on the dissolution of the Lok Sabha. Which of the statements given above is/are correct?",
        "option a": "1 only",
        "option b": "1 and 2",
        "option c": "2 and 3",
        "option d": "3 only KSPC-P-GSPO (41-A)",
        "subject": "polity",
        "year": 2024,
        "explanation": "The correct answer is **1 and 2**.\n\nLet's examine each statement:\n\n1. **A bill pending in the Lok Sabha lapses on its dissolution.** This is **correct**.  When the Lok Sabha is dissolved, all pending bills in that house automatically lapse.  They must be reintroduced in the new Lok Sabha if they are to be considered again.\n\n2. **A bill passed by the Lok Sabha and pending in the Rajya Sabha lapses on the dissolution of the Lok Sabha.** This is also **correct**. Even if a bill has cleared the Lok Sabha, if the Lok Sabha is dissolved before the Rajya Sabha passes it, the bill lapses.  It needs to go through the entire legislative process again in the newly constituted Lok Sabha.\n\n3. **A bill in regard to which the President of India notified his/her intention to summon the Houses to a joint sitting lapses on the dissolution of the Lok Sabha.** This is **incorrect**.  The President's notification to convene a joint sitting is an indication of the government's intention to pass the bill.  While the dissolution of the Lok Sabha would necessitate restarting the legislative process in a new Lok Sabha, the notification for a joint sitting doesn't automatically make the bill void. The bill would need to be reintroduced and go through the process again.  The President's intention to summon a joint sitting is separate from the Lok Sabha's dissolution.  The possibility of a joint sitting remains even with the dissolution of the Lok Sabha, but the process needs to be restarted.\n\nTherefore, only statements 1 and 2 are correct.\n"
    },
    {
        "Q.No.": 96,
        "question text": "Consider the following statements: Statement-I: The European Parliament approved The Net-Zero Industry Act recently. Statement-II: The European Union intends to achieve carbon neutrality by 2040 and therefore aims to develop all of its own clean technology by that time. Which one of the following is correct in respect of the above statements?",
        "option a": "Both Statement-I and Statement-II are correct and Statement-II explains Statement-1",
        "option b": "Both Statement-I and Statement-II are correct, but Statement-II does not explain Statement-I",
        "option c": "Statement-I is correct, but Statement-II is incorrect",
        "option d": "Statement-I is incorrect, but Statement-II is correct",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "Statement-I is correct. The European Parliament did approve the Net-Zero Industry Act.\n\nStatement-II is incorrect. While the European Union aims to achieve carbon neutrality, its target is 2050, not 2040.  Furthermore, the EU's strategy doesn't aim to develop *all* of its own clean technology by that time; it aims to significantly bolster its domestic clean technology industry, but international collaboration and trade will remain vital parts of the energy transition.\n\nTherefore, only Statement-I is correct.\n"
    },
    {
        "Q.No.": 97,
        "question text": "Consider the following statements:\nStatement-I:\nRecently, Venezuela has achieved a rapid\nrecovery from its economic crisis and\nsucceeded in preventing its people from\nfleeing/emigrating to other countries.\nStatement-II:\nVenezuela has the world's largest oil reserves.\nWhich one of the following is correct in\nrespect of the above statements?",
        "option a": "Both Statement-I and Statement-II are\ncorrect and Statement-11 explains\nStatement-I",
        "option b": "Both Statement-I and Statement-II are\ncorrect, but Statement-II does not\nexplain Statement-I",
        "option c": "Statement-I is correct, but Statement-II\nis incorrect",
        "option d": "Statement-I is incorrect, but Statement-II\nis correct",
        "subject": "environment",
        "year": 2024,
        "explanation": "Statement I is incorrect.  Venezuela has not experienced a rapid recovery from its economic crisis, and a significant number of Venezuelans have fled the country due to the ongoing crisis.  Statement II is correct; Venezuela does possess the world's largest proven oil reserves.\n\nTherefore, only Statement II is correct.\n"
    },
    {
        "Q.No.": 98,
        "question text": "With reference to the Digital India Land\nRecords Modernisation Programme, consider\nthe following statements:\n1. To implement the scheme, the Central\nGovernment provides 100% funding.\n2. Under the Scheme, Cadastral Maps are\ndigitised.\n3. An initiative has been undertaken to\ntransliterate the Records of Rights from\nlocal language to any of the languages\nrecognized by the Constitution of India.\nWhich of the statements given above are\ncorrect?",
        "option a": "1 and 2 only",
        "option b": "2 and 3 only",
        "option c": "1 and 3 only",
        "option d": "1, 2 and 3",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "The correct statements regarding the Digital India Land Records Modernisation Programme (DILRMP) are **2 and 3**.\n\nStatement 1 is incorrect.  While the central government provides significant funding, it's not 100%.  The funding is shared between the central and state governments.\n\nStatement 2 is correct.  A core component of DILRMP is the digitization of cadastral maps (maps showing land ownership and boundaries).\n\nStatement 3 is also correct. The program aims to improve accessibility by transliterating land records from local languages into other officially recognized Indian languages.\n"
    },
    {
        "Q.No.": 99,
        "question text": "With reference to the 'Pradhan Mantri\nSurakshit Matritva Abhiyan', consider the\nfollowing statements:\n1. This scheme guarantees a minimum\npackage of antenatal care services to\nwomen in their second and third\ntrimesters of pregnancy and six months\npost-delivery health care service in any\ngovernment health facility.\n2. Under this scheme, private sector\nhealth care providers of certain\nspecialities can volunteer to provide\nservices at nearby government health\nfacilities.\nWhich of the statements given above is/are\ncorrect?",
        "option a": "1 only",
        "option b": "2 only",
        "option c": "Both 1 and 2",
        "option d": "Neither 1 nor 2",
        "subject": "economy",
        "year": 2024,
        "explanation": "Statement 1 is largely correct.  The Pradhan Mantri Surakshit Matritva Abhiyan (PMSMA) aims to provide a minimum package of antenatal care services to pregnant women in their second and third trimesters.  It also includes postnatal care for six months after delivery.  The key point is that these services are available at *government* health facilities.\n\nStatement 2 is incorrect. PMSMA primarily focuses on utilizing existing government health infrastructure. While there might be collaborations or awareness campaigns involving the private sector, private healthcare providers are not directly involved in providing services *under* the PMSMA scheme at government facilities.\n\n\nTherefore, only **statement 1 is correct**.\n"
    },
    {
        "Q.No.": 100,
        "question text": "With reference to the Pradhan Mantri Shram\nYogi Maan-dhan (PM-SYM) Yojana, consider\nthe following statements:\n1. The entry age group for enrolment in\nthe scheme is 21 to 40 years.\n2. Age specific contribution shall be made\nby the beneficiary.\n3. Each subscriber under the scheme shall\nreceive a minimum pension of ₹ 3,000\nper month after attaining the age of\n60 years.\n4. Family pension is applicable to the\nspouse and unmarried daughters.\nWhich of the statements given above is/are\ncorrect?",
        "option a": "1, 3 and 4",
        "option b": "2 and 3 only",
        "option c": "2 only",
        "option d": "1, 2 and 4\nKSPC-P-GSPO\n(43-A)",
        "subject": "current affairs",
        "year": 2024,
        "explanation": "The correct statements regarding the Pradhan Mantri Shram Yogi Maan-dhan (PM-SYM) Yojana are **1 and 2**.\n\nLet's examine each statement:\n\n1. **The entry age group for enrolment in the scheme is 21 to 40 years.**  This is correct.  PM-SYM is designed for the unorganized sector and the entry age is indeed between 21 and 40 years.\n\n2. **Age-specific contribution shall be made by the beneficiary.** This is also correct. The monthly contribution varies depending on the age of entry, with younger entrants paying less than older entrants.\n\n3. **Each subscriber under the scheme shall receive a minimum pension of ₹ 3,000 per month after attaining the age of 60 years.** This is incorrect. While the pension is received after 60, the minimum pension amount is subject to change and isn't fixed at ₹3000.  The amount is also dependent on the contribution made.\n\n4. **Family pension is applicable to the spouse and unmarried daughters.** This is incorrect. PM-SYM currently does not provide a family pension.  The pension benefit is only for the subscriber.\n\n\nTherefore, only statements 1 and 2 are correct.\n"
    }
]