[
    {
        "Q.No.": 1,
        "question_text": "\"Rapid Financing Instrument\" and \"Rapid Credit Facility\" are related to the provisions of lending by which one of the following?",
        "option_a": "Asian Development Bank",
        "option_b": "International Monetary Fund",
        "option_c": "United Nations Environment Programme Finance Initiative",
        "option_d": "World Bank",
        "correct_option": "b",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: The Rapid Financing Instrument (RFI) and the Rapid Credit Facility (RCF) are both lending mechanisms of the International Monetary Fund (IMF).  The IMF provides loans to member countries facing balance of payment problems.  The RFI and RCF are designed to provide rapid financial assistance to countries experiencing urgent balance of payment needs, often in response to crises such as natural disasters or global economic shocks.  These facilities offer quicker disbursement than other IMF programs.\n\n\nThe Asian Development Bank (ADB) is a regional development bank that provides loans and technical assistance to its developing member countries in Asia and the Pacific.  The United Nations Environment Programme Finance Initiative (UNEP FI) is a partnership between UNEP and the global financial sector to promote sustainable finance.  The World Bank is an international financial institution that provides loans and grants to the governments of low- and middle-income countries for a wide array of development projects.\n"
    },
    {
        "Q.No.": 2,
        "question_text": "With reference to the Indian economy, consider the following statements:\n1. An increase in Nominal Effective Exchange Rate (NEER) indicates the appreciation of rupee.\n2. An increase in the Real Effective Exchange Rate (REER) indicates an improvement in trade competitiveness.\n3. An increasing trend in domestic inflation relative to inflation in other countries is likely to cause an increasing divergence between NEER and REER.\nWhich of the above statements are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nStatement 1 is incorrect.  An increase in the Nominal Effective Exchange Rate (NEER) indicates a depreciation of the rupee, not appreciation. NEER measures the value of a currency against a basket of other currencies, weighted by their relative importance in trade.  An increase signifies that the rupee has become cheaper relative to the basket.\n\nStatement 2 is incorrect. An increase in the Real Effective Exchange Rate (REER) indicates a *decrease* in trade competitiveness. REER adjusts NEER for inflation differences between countries.  An increase means the country's goods and services are relatively more expensive compared to its trading partners, making them less competitive.\n\nStatement 3 is correct.  If domestic inflation rises faster than inflation in other countries, the REER will increase more than the NEER. This is because REER accounts for inflation, while NEER does not.  The divergence reflects the impact of differing inflation rates on relative price competitiveness.\n\n\nShort notes on keywords and named entities:\n\n* **Nominal Effective Exchange Rate (NEER):** A weighted average of a country's currency against a basket of other currencies. It shows the overall value of the currency relative to its trading partners, without considering inflation.\n\n* **Real Effective Exchange Rate (REER):**  Similar to NEER but adjusted for inflation differences between the country and its trading partners. It provides a more accurate measure of a country's competitiveness in international trade.\n\n* **Domestic Inflation:** The rate at which the general level of prices for goods and services is rising within a country.\n\n"
    },
    {
        "Q.No.": 3,
        "question_text": "With reference to the Indian economy, consider the following statements:\n1. If the inflation is too high, Reserve Bank of India (RBI) is likely to buy government securities.\n2. If the rupee is rapidly depreciating, RBI is likely to sell dollars in the market.\n3. If interest rates in the USA or European Union were to fall, that is likely to induce RBI to buy dollars.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  If inflation is too high, the Reserve Bank of India (RBI) is likely to *sell* government securities to reduce the money supply, thus curbing inflation.  Buying securities would increase the money supply, exacerbating inflation.\n\nStatement 2 is correct. If the rupee is rapidly depreciating, the RBI is likely to sell dollars from its foreign exchange reserves to increase the demand for rupees and support its value.\n\nStatement 3 is incorrect. If interest rates in the USA or European Union fall, investors are likely to move their funds to countries with higher interest rates. This would lead to an *inflow* of dollars into India, and the RBI would likely *sell* dollars to manage the exchange rate.\n\n\nShort notes on named entities:\n\n* **Reserve Bank of India (RBI):** India's central bank, responsible for monetary policy, managing foreign exchange reserves, and regulating financial institutions.  Its primary goal is maintaining price stability and supporting economic growth.\n\n* **Government securities:** Debt instruments issued by the government to borrow money from the public or financial institutions.  These are used to finance government spending.\n\n* **Rupee:** The official currency of India. Its value fluctuates against other currencies based on market forces, influenced by factors like trade balances and interest rates.\n\n* **Dollars:** The currency of the United States, frequently used in international trade and finance.\n\n* **USA/European Union:** Major global economies whose monetary policies significantly influence global financial markets and exchange rates.  Interest rate changes in these regions impact capital flows to and from other countries.\n"
    },
    {
        "Q.No.": 4,
        "question_text": "With reference to the \"G20 Common Framework\", consider the following statements:\n1. It is an initiative endorsed by the G20 together with the Paris Club.\n2. It is an initiative to support Low Income Countries with unsustainable debt.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation: The G20 Common Framework is an initiative to support low-income countries with unsustainable debt.  It is endorsed by the G20, but the Paris Club, an informal group of official creditors, plays a significant role in its implementation.  Therefore, statement 2 is correct, and statement 1 is partially correct as the Paris Club is involved but not as an endorser in the same way as the G20.\n\nG20:  The Group of Twenty is an intergovernmental forum comprising 19 countries and the European Union.  It aims to address major issues related to the global economy, financial stability, and international trade.  Its members represent a significant portion of the world's population and economic output.\n\nParis Club: An informal group of mostly Western creditor countries, primarily members of the Organisation for Economic Co-operation and Development (OECD). It coordinates debt-relief solutions for countries facing difficulties in repaying their bilateral loans.  The club's decisions are not legally binding but carry significant weight due to the influence of its members.\n"
    },
    {
        "Q.No.": 5,
        "question_text": "With reference to the Indian economy, what are the advantages of \"Inflation-Indexed Bonds (IIBs)\"?\n1. Government can reduce the coupon rates on its borrowing by way of IIBs.\n2. IIBs provide protection to the investors from uncertainty regarding inflation.\n3. The interest received as well as capital gains on IIBs are not taxable.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Inflation-Indexed Bonds (IIBs) in the Indian context offer several advantages.  Statement 1 is correct: By indexing the coupon payments to inflation, the government can reduce the nominal coupon rate it offers on its borrowings, as the real return is protected. Statement 2 is also correct: IIBs offer investors protection against inflation risk; their returns adjust with changes in the price level, preserving the real value of their investment. Statement 3 is incorrect:  Interest earned and capital gains on IIBs are generally taxable, unlike some other investment instruments. Therefore, only statements 1 and 2 are correct.\n\nInflation-Indexed Bonds (IIBs):  These are bonds where the principal and/or interest payments are adjusted periodically based on a measure of inflation (like the Consumer Price Index or Wholesale Price Index). This protects investors from the erosion of purchasing power due to inflation.\n\nConsumer Price Index (CPI): A measure that tracks changes in the price level of a basket of consumer goods and services. It's used to calculate inflation.\n\nWholesale Price Index (WPI): A measure that tracks changes in the price level of goods traded in bulk at the wholesale level. It's also used to calculate inflation.\n\n\n"
    },
    {
        "Q.No.": 6,
        "question_text": "With reference to foreign-owned e-commerce firms operating in India, which of the following statements is/are correct?\n1. They can sell their own goods in addition to offering their platforms as market-places.\n2. The degree to which they can own big sellers on their platforms is limited.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2.",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:  The provided text does not directly address the regulations regarding foreign-owned e-commerce firms in India and their ownership of sellers.  Therefore, a definitive answer cannot be provided based solely on this document.  More information is needed to accurately determine the correctness of statements 1 and 2.\n"
    },
    {
        "Q.No.": 7,
        "question_text": "(d) Neither 1 nor 2\n\n7. Which of the following activities constitute real sector in the economy?\n1. Farmers harvesting their crops\n2. Textile mills converting raw cotton into fabrics\n3. A commercial bank lending money to a trading company\n4. A corporate body issuing Rupee Denominated Bonds overseas\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Activities 1 and 2 involve the production and transformation of goods, which are core activities of the real sector.  Activity 3 involves financial transactions within the financial sector (not the real sector).  Activity 4 involves the issuance of bonds, a financial activity, also outside the real sector.\n\nCommercial bank: A financial institution that accepts deposits and provides loans to individuals and businesses.\n\nRupee Denominated Bonds: Bonds issued in Indian Rupees.\n\nReal sector: The part of the economy concerned with the production and distribution of goods and services.  It excludes financial transactions.\n\nFarmers harvesting their crops: Agricultural production, a key part of the real sector.\n\nTextile mills converting raw cotton into fabrics: Manufacturing, another core real sector activity.\n"
    },
    {
        "Q.No.": 8,
        "question_text": "Which one of the following situations best reflects \"Indirect Transfers\" often talked about in media recently with reference to India?",
        "option_a": "An Indian company investing in a foreign enterprise and paying taxes to the foreign country on the profits arising out of its investment",
        "option_b": "A foreign company investing in India and paying taxes to the country of its base on the profits arising out of its investment",
        "option_c": "An Indian company purchases tangible assets in a foreign country and sells such assets after their value increases and transfers the proceeds to India",
        "option_d": "A foreign company transfers shares and such shares derive their substantial value from assets located in India",
        "correct_option": "d",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation: Indirect transfers, in the context of India, refer to situations where the substantial value of assets is derived from India, even if the transfer of ownership happens outside India.  Option (d) perfectly captures this scenario: a foreign company transferring shares whose value is significantly linked to Indian assets.  This triggers tax implications in India, as the profits derived from those assets are essentially Indian-sourced.\n\n(a) This describes direct foreign investment by an Indian company, where taxes are paid in the foreign country.  This is not an indirect transfer.\n\n(b) This describes direct foreign investment in India, with taxes paid in the foreign country (the investor's home country).  This is also not an indirect transfer.\n\n(c) This is a direct transfer of assets and proceeds.  The profits are realized and repatriated directly, not indirectly.\n\n\nShort notes on important keywords and named entities:\n\n**Indirect Transfers:**  A transaction where the ownership of assets located in a country is transferred indirectly, often through the transfer of shares or other ownership structures. This can lead to tax implications in the country where the assets are located, even if the transfer itself occurs elsewhere.  It's a significant issue in international taxation, especially for countries trying to prevent tax avoidance.\n\n**India:** A large, diverse South Asian country with a rapidly growing economy and significant foreign investment. Its tax laws are increasingly focused on preventing tax evasion through indirect transfers.\n\n**Foreign company:** A company based outside of India that may invest in or conduct business within India.  Such companies' activities are subject to Indian tax laws, especially concerning indirect transfers of assets located in India.\n\n**Shares:**  Units of ownership in a company. The transfer of shares, especially those derived from assets in a particular country, can be subject to indirect transfer regulations.\n\n**Assets located in India:** Any property, tangible or intangible, that is situated within the geographical boundaries of India.  The value of these assets is crucial in determining tax liability under indirect transfer rules.\n"
    },
    {
        "Q.No.": 9,
        "question_text": "With reference to the expenditure made by an organisation or a company, which of the following statements is/are correct?\n1. Acquiring new technology is capital expenditure.\n2. Debt financing is considered capital expenditure, while equity financing is considered revenue expenditure.\nSelect the correct answer using the code given below:",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation:Acquiring new technology is a capital expenditure because it involves the purchase of a long-term asset that will benefit the organization for years to come.  Debt financing and equity financing are both methods of raising capital, but they are not themselves considered expenditures.  Debt financing involves borrowing money, while equity financing involves selling ownership shares.  Neither is a direct expenditure in the sense of acquiring goods or services. Therefore, only statement 1 is correct.\n"
    },
    {
        "Q.No.": 10,
        "question_text": "With reference to the Indian economy, consider the following statements:\n1. A share of the household financial savings goes towards government borrowings.\n2. Dated securities issued at market-related rates in auctions form a large component of internal debt.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2022,
        "explanation": "```text\ncorrect_option: (c)\nexplanation:Statement 1 is correct.  A portion of household financial savings is channeled into government borrowings through various investment avenues like government securities and small savings schemes.  Statement 2 is also correct.  Dated securities, issued at market-related rates through auctions, constitute a significant portion of India's internal debt.  These securities are a major source of funding for the government's fiscal deficit.\n\nhousehold financial savings (HFS):  The total savings of households in a country, encompassing various forms of financial assets such as bank deposits, debt securities, mutual funds, insurance policies, and investments in small savings schemes.  HFS plays a crucial role in national savings and economic growth.\n\ngovernment borrowings: Funds raised by the government through various means like issuing government securities, borrowing from banks, and raising money from the capital markets.  These borrowings are essential for financing government expenditure and developmental projects.\n\ndated securities:  Long-term debt instruments issued by the government with a fixed maturity date and interest rate. They are a key component of government's internal debt and are usually sold through auctions to investors.\n\ninternal debt:  The portion of a government's total debt that is owed to domestic creditors, including individuals, banks, and other financial institutions within the country.\n```\n"
    },
    {
        "Q.No.": 11,
        "question_text": "Consider the following statements:\n1. Pursuant to the report of H.N. Sanyal Committee, the Contempt of Courts Act, 1971 was passed.\n2. The Constitution of India empowers the Supreme Court and the High Courts to punish for contempt of themselves.\n3. The Constitution of India defines Civil Contempt and Criminal Contempt.\n4. In India, the Parliament is vested with the powers to make laws on Contempt of Court.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "1, 2 and 4",
        "option_c": "3 and 4 only",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. While the H.N. Sanyal Committee's report did influence the enactment of the Contempt of Courts Act, 1971, it wasn't solely based on that report.  The Act aimed to codify the law relating to contempt of court.\n\nStatement 2 is correct.  The Constitution of India grants the Supreme Court and High Courts the power to punish for contempt of court. This is inherent in their power to maintain their authority and dignity.\n\nStatement 3 is incorrect. The Constitution doesn't explicitly define civil and criminal contempt.  These categories have evolved through judicial interpretation and practice.\n\nStatement 4 is correct. The Parliament has the power to make laws on contempt of court, although the power to punish for contempt resides with the courts themselves.\n\n\n**Short notes on named entities:**\n\n**H.N. Sanyal Committee:** A committee that submitted a report which influenced the creation of the Contempt of Courts Act, 1971 in India.  The exact details of its recommendations and the extent of its influence are not provided in the given context.\n\n**Contempt of Courts Act, 1971:** An Act of the Parliament of India that codifies the law relating to contempt of court.  It defines what constitutes contempt and lays down the procedures for dealing with such cases.\n\n**Supreme Court of India:** The highest court of law in India, having the power of judicial review and the authority to punish for contempt.\n\n**High Courts:**  High Courts are state-level courts of appeal with significant jurisdiction and power to maintain their own dignity and punish for contempt.\n\n**Constitution of India:** The supreme law of India, which lays down the fundamental rights, the structure of the government, and the powers of various institutions, including the judiciary.  It implicitly grants the power to punish for contempt to the Supreme Court and High Courts.\n\n**Parliament of India:** The legislative body of India, responsible for making laws on various subjects, including matters related to contempt of court.\n"
    },
    {
        "Q.No.": 12,
        "question_text": "With reference to India, consider the following statements:\n1. Government law officers and legal firms are recognised as advocates, but corporate lawyers and patent attorneys are excluded from recognition as advocates.\n2. Bar Councils have the power to lay down the rules relating to legal education and recognition of law colleges.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. In India, government law officers and legal firms are recognized as advocates, but corporate lawyers and patent attorneys are not included in this recognition.  Statement 2 is incorrect.  While Bar Councils play a significant role in legal education and the recognition of law colleges, they do not have the sole power to lay down all such rules.  The regulatory framework involves multiple stakeholders, including state governments and the central government.\n\n\nAdvocates:  Legal professionals authorized to represent clients in court. In India, the Advocates Act governs their registration and practice.\n\nCorporate Lawyers: Legal professionals specializing in corporate law, advising businesses on legal matters.\n\nPatent Attorneys: Legal professionals specializing in patent law, handling applications and disputes related to intellectual property rights.\n\nBar Councils:  State-level bodies in India responsible for regulating the legal profession and maintaining professional standards for advocates within their respective states.  They have a significant role in legal education but do not have absolute authority over its regulation.\n\nArticle 14:  Guarantees equality before the law and equal protection of the laws within India.  It allows for reasonable classification of persons, objects, and transactions but requires such classifications to be based on intelligible differentiations and substantial distinctions.  The provided text gives examples of exceptions to this principle.\n\nRule of Law: A principle of governance where all persons, institutions, and entities, public and private, including the State itself, are accountable under the law.  The text mentions A.V. Dicey's definition, highlighting the absence of arbitrary power and equality before the law, but notes that the Indian context differs.\n"
    },
    {
        "Q.No.": 13,
        "question_text": "Consider the following statements:\n1. A bill amending the Constitution requires a prior recommendation of the President of India.\n2. When a Constitution Amendment Bill is presented to the President of India, it is obligatory for the President of India to give his/her assent.\n3. A Constitution Amendment Bill must be passed by both the Lok Sabha and the Rajya Sabha by a special majority and there is no provision for joint sitting.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation:\n\nStatement 1 is incorrect.  A bill amending the Constitution does not require a prior recommendation from the President of India.  It can be introduced in either house of Parliament by a minister or a private member.\n\nStatement 2 is incorrect. While the President must receive the Constitution Amendment Bill, they are not obligated to give assent.  They must give assent to the bill once it has been passed by both houses of Parliament with a special majority.\n\nStatement 3 is correct. A Constitution Amendment Bill requires passage by both the Lok Sabha and the Rajya Sabha by a special majority (two-thirds of the members present and voting, and a majority of the total membership of each House). There's no provision for a joint sitting in case of disagreement.\n\n\nShort notes on keywords and named entities:\n\n* **Constitution Amendment Bill:** A bill proposed to change the Constitution of India.  It requires a special majority in both houses of Parliament for passage and the President's assent to become law.\n\n* **President of India:** The head of state of India, primarily a ceremonial role.  The President's assent is required for bills to become law but the President's powers are constrained by the advice of the Council of Ministers.\n\n* **Lok Sabha:** The lower house of the Indian Parliament, directly elected by the people. It is the more powerful house, holding the primary legislative power.\n\n* **Rajya Sabha:** The upper house of the Indian Parliament, representing the states. Its powers are generally less than the Lok Sabha's.\n\n* **Special Majority:**  A specific threshold of votes required for certain legislative actions in Parliament, such as passing constitutional amendments. It is higher than a simple majority.\n\n* **Joint Sitting:** A process in some parliamentary systems where both houses of Parliament meet together to resolve disagreements on a bill.  This mechanism is not available for constitutional amendments in India.\n"
    },
    {
        "Q.No.": 14,
        "question_text": "Consider the following statements:\n1. The Constitution of India classifies the ministers into four ranks viz. Cabinet Minister, Minister of State with Independent Charge, Minister of State and Deputy Minister.\n2. The total number of ministers in the Union Government, including the Prime Minister, shall not exceed 15 percent of the total number of members in the Lok Sabha.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  The Constitution of India mentions Cabinet Ministers and Ministers of State, but doesn't explicitly classify them into four ranks as stated.  The ranks mentioned (Cabinet Minister, Minister of State with Independent Charge, Minister of State, and Deputy Minister) are conventions and practices, not constitutional mandates.\n\nStatement 2 is correct. Article 75(1)A of the Constitution of India states that the total number of ministers, including the Prime Minister, in the Union Council of Ministers shall not exceed 15% of the total number of members of the Lok Sabha.\n\n\n**Short notes on important keywords and named entities:**\n\n* **Constitution of India:** The supreme law of India, outlining the framework of government, fundamental rights, and directive principles of state policy.  It establishes a parliamentary system with a President as head of state and a Prime Minister as head of government.\n\n* **Lok Sabha:** The lower house of the Parliament of India. It is directly elected by the people of India and is the more powerful of the two houses.\n\n* **Cabinet Minister:** A member of the Union Council of Ministers who holds a significant portfolio and is a key decision-maker in the government.\n\n* **Minister of State:** A minister who assists a Cabinet Minister, often with responsibility for a specific area within a larger ministry.  A Minister of State with Independent Charge has more autonomy.\n\n* **Deputy Minister:**  A less common rank, assisting a Minister of State or Cabinet Minister.  Their role is primarily to assist and not to exercise independent authority.\n\n* **Prime Minister:** The head of government in India.  The Prime Minister is appointed by the President and is usually the leader of the party or coalition that commands a majority in the Lok Sabha.  The Prime Minister heads the Council of Ministers and is responsible for the overall functioning of the government.\n\n* **Union Government:** Refers to the central government of India, as opposed to the state governments.\n\n\n"
    },
    {
        "Q.No.": 15,
        "question_text": "Which of the following is/are the exclusive power(s) of Lok Sabha?\n1. To ratify the declaration of Emergency\n2. To pass a motion of no-confidence against the Council of Ministers\n3. To impeach the President of India\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:The Lok Sabha has the exclusive power to pass a motion of no-confidence against the Council of Ministers.  The Lok Sabha can initiate impeachment proceedings against the President, but the Rajya Sabha also plays a crucial role in the process.  Both houses must participate in the process.  Ratification of the declaration of emergency is done by both houses.\n\n\nLok Sabha: The lower house of the Indian Parliament, also known as the House of the People. It is directly elected by the people of India and holds greater power than the Rajya Sabha.  Its primary functions include enacting laws, controlling the government's finances, and holding the executive accountable.\n\nCouncil of Ministers: The body of ministers who collectively advise the President or Governor and are responsible for executing the laws passed by the Parliament.  The Council of Ministers is headed by the Prime Minister.  In India, the Council of Ministers is collectively responsible to the Lok Sabha.\n\nImpeachment of the President: A process by which the President can be removed from office for violating the Constitution or committing misconduct.  It involves a two-stage process, with both the Lok Sabha and Rajya Sabha playing a part.\n\n\nDeclaration of Emergency:  A provision in the Indian Constitution that allows the President to declare an emergency under certain circumstances, such as war, external aggression, or internal disturbance.  Both houses of Parliament must approve the declaration.\n"
    },
    {
        "Q.No.": 16,
        "question_text": "With reference to anti-defection law in India, consider the following statements:\n1. The law specifies that a nominated legislator cannot join any political party within six months of being appointed to the House.\n2. The law does not provide any time-frame within which the presiding officer has to decide a defection case.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is incorrect.  The anti-defection law states that a nominated legislator cannot join any other political party for six months from the date of such nomination.  Statement 2 is correct. The law doesn't prescribe a specific timeframe for the presiding officer to decide on a defection case.  This has led to criticism and delays in resolving such matters.\n\n\nAnti-defection law:  Enacted in 1985 (52nd Amendment) and added to the Constitution as the Tenth Schedule, it aims to prevent legislators from changing parties for personal gain, thereby promoting political stability.  It allows for the disqualification of legislators who switch parties.  The presiding officer (Speaker in Lok Sabha, Chairman in Rajya Sabha) decides on defection cases.  The law has been criticized for being open to interpretation and giving excessive discretionary power to presiding officers.\n\nPresiding Officer: The Speaker of the Lok Sabha or the Chairman of the Rajya Sabha has the authority to decide on defection cases under the anti-defection law.  Their decisions are subject to judicial review.\n\nNominated Legislator: A person appointed to the legislature by the President or Governor, not elected by the people.  The anti-defection law has specific provisions regarding when they can join a political party.\n"
    },
    {
        "Q.No.": 17,
        "question_text": "Consider the following statements:\n1. Attorney General of India and Solicitor General of India are the only officers of the Government who are allowed to participate in the meetings of the Parliament of India.\n2. According to the Constitution of India, the Attorney General of India submits his resignation when the Government which appointed him resigns.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. While the Attorney General of India can participate in Parliament proceedings,  the Solicitor General of India cannot.  Both can participate in the proceedings of both houses of Parliament but do not have voting rights.\n\nStatement 2 is correct.  The Attorney General of India holds office during the pleasure of the President, implying resignation upon the government's resignation.\n\n\n**Attorney General of India:** The highest law officer of the country. Appointed by the President and holds office during the President's pleasure.  Advises the government on legal matters, represents the government in the Supreme Court, and can participate in Parliament proceedings (but cannot vote).\n\n\n**Solicitor General of India:**  The second highest law officer of the country, assisting the Attorney General.  Appointed by the government.  Their role is primarily to assist the Attorney General in court and government legal matters.\n\n\n**Parliament of India:** The bicameral legislature of India, consisting of the Rajya Sabha (Council of States) and the Lok Sabha (House of the People).  The Attorney General can participate in the proceedings of both houses.\n\n"
    },
    {
        "Q.No.": 18,
        "question_text": "With reference to the writs issued by the Courts in India, consider the following statements:\n1. Mandamus will not lie against a private organisation unless it is entrusted with a public duty.\n2. Mandamus will not lie against a Company even though it may be a Government Company.\n3. Any public minded person can be a petitioner to move the Court to obtain the writ of Quo Warranto.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nStatement 1 is correct.  Mandamus, a writ directing a public authority to perform its public duty,  cannot be issued against a purely private entity unless that entity is performing a public function or has been entrusted with a public duty.\n\nStatement 2 is correct.  A government company, while having government shareholding, is still essentially a corporate entity. Mandamus typically does not lie against private entities, including government companies, unless they are performing a specific public duty.\n\nStatement 3 is correct.  Quo warranto, a writ challenging the right of a person to hold a public office, can be initiated by any public-spirited individual, not just someone directly affected.  The petitioner need only demonstrate a sufficient public interest in the matter.\n\n\n**Short Notes:**\n\n* **Mandamus:** A writ issued by a court ordering a government official or other entity to perform a public duty. It is a remedy for ensuring that public authorities act within the bounds of their legal authority and fulfill their obligations.\n\n* **Quo Warranto:** A writ issued to challenge a person's right to hold a public office. It is used to investigate the legality of a person's claim to an office and to remove them if their claim is found to be invalid.\n\n* **Government Company:**  A company in which the government holds a majority of shares.  While it has government involvement, it's still legally distinct from the government and operates as a corporate entity.  Its actions are not automatically considered actions of the state.\n\n* **Public Duty:** A duty that is owed to the public at large, rather than to a specific individual.  It is often associated with the exercise of governmental power or authority.  The determination of whether a duty is \"public\" is a matter of legal interpretation and context.\n"
    },
    {
        "Q.No.": 19,
        "question_text": "With reference to Ayushman Bharat Digital Mission, consider the following statements:\n1. Private and public hospitals must adopt it.\n2. As it aims to achieve universal health coverage, every citizen of India should be part of it ultimately.\n3. It has seamless portability across the country.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is correct.  The Ayushman Bharat Digital Mission (ABDM) encourages both private and public hospitals to participate.  While participation isn't mandatory for all, the mission aims for widespread adoption.\n\nStatement 2 is correct. The ultimate goal of ABDM is to achieve universal health coverage in India, implying that every citizen would ideally be part of the digital health ecosystem.\n\nStatement 3 is correct.  A key feature of ABDM is seamless portability of health records across the country, allowing individuals to access their health information regardless of location.\n\nTherefore, all three statements are correct.\n\n\nAyushman Bharat Digital Mission (ABDM): A government initiative to create a digital health ecosystem in India.  It aims to improve healthcare access, efficiency, and quality by connecting various stakeholders through a digital platform.  Key features include digital health IDs, health records, and doctor registries.\n\nUniversal Health Coverage: The goal of providing affordable and accessible healthcare services to all citizens of a nation.  It ensures everyone can receive the healthcare they need without facing financial hardship.\n"
    },
    {
        "Q.No.": 20,
        "question_text": "With reference to Deputy Speaker of Lok Sabha, consider the following statements:\n1. As per the Rules of Procedure and Conduct of Business in Lok Sabha, the election of Deputy Speaker shall be held on such date as the Speaker may fix.\n2. There is a mandatory provision that the election of a candidate as Deputy Speaker of Lok Sabha shall be from either the principal opposition party or the ruling party.\n3. The Deputy Speaker has the same power as of the Speaker when presiding over the sitting of the House and no appeal lies against his rulings.\n4. The well established parliamentary practice regarding the appointment of Deputy Speaker is that the motion is moved by the Speaker and duly seconded by the Prime Minister.\nWhich of the statements given above are correct?",
        "option_a": "1 and 3 only",
        "option_b": "1, 2 and 3",
        "option_c": "3 and 4 only",
        "option_d": "2 and 4 only",
        "correct_option": "a",
        "subject": "polity",
        "year": 2022,
        "explanation": "```text\ncorrect_option: (a)\nexplanation:Statement 1 is correct.  The Rules of Procedure and Conduct of Business in Lok Sabha stipulate that the Speaker decides the date of the Deputy Speaker's election.\n\nStatement 2 is incorrect. There's no mandatory provision specifying the Deputy Speaker must be from either the ruling or principal opposition party. While it's a common practice, it's not a rule.\n\nStatement 3 is incorrect.  The Deputy Speaker has the same powers as the Speaker when presiding, but appeals against their rulings can be made to the House.\n\nStatement 4 is incorrect. The motion for the Deputy Speaker's election is typically moved by a member of the ruling party, not necessarily the Speaker, and seconded by another member, not necessarily the Prime Minister.\n\n\n**Short Notes:**\n\n* **Lok Sabha:** The lower house of the Indian Parliament.  It is directly elected by the people of India and is responsible for making laws.  Its members are called Members of Parliament (MPs).\n\n* **Deputy Speaker of Lok Sabha:** The second-highest ranking officer in the Lok Sabha.  They preside over the House in the absence of the Speaker and perform other duties as assigned by the Speaker.\n\n* **Speaker of Lok Sabha:** The presiding officer of the Lok Sabha.  They are responsible for maintaining order in the House, ensuring rules of procedure are followed, and ruling on points of order.  They are elected by the Lok Sabha members.\n\n* **Rules of Procedure and Conduct of Business in Lok Sabha:**  A set of rules governing the functioning of the Lok Sabha, including rules related to elections, debates, voting, and other parliamentary procedures.\n\n* **Principal Opposition Party:** The largest political party in the Lok Sabha that is not part of the ruling coalition government.  They play a crucial role in holding the government accountable.\n\n* **Ruling Party:** The political party or coalition that holds a majority of seats in the Lok Sabha and forms the government.\n```\n"
    },
    {
        "Q.No.": 21,
        "question_text": "Among the following crops, which one is the most important anthropogenic source of both methane and nitrous oxide?",
        "option_a": "Cotton",
        "option_b": "Rice",
        "option_c": "Sugarcane",
        "option_d": "Wheat",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Rice cultivation is a significant anthropogenic source of both methane (CH₄) and nitrous oxide (N₂O).  Flooded paddy fields create anaerobic conditions ideal for methanogenic archaea to produce methane.  The use of nitrogen fertilizers in rice production leads to the release of nitrous oxide, a potent greenhouse gas.  While other crops may contribute to these gases, rice cultivation's unique water management practices make it the most important anthropogenic source among the options provided.\n\nCotton is a significant crop but its greenhouse gas emissions are primarily related to the energy-intensive processes of its production and processing rather than direct emissions from the plant itself. Sugarcane and wheat, while requiring fertilizers and contributing to some greenhouse gas emissions, do not have the same scale of methane production associated with flooded rice paddies.\n"
    },
    {
        "Q.No.": 22,
        "question_text": "\"System of Rice Intensification\" of cultivation, in which alternate wetting and drying of rice fields is practised, results in:\n1. Reduced seed requirement\n2. Reduced methane production\n3. Reduced electricity consumption\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation: The System of Rice Intensification (SRI) involves alternate wetting and drying of rice paddies. This practice leads to several benefits:\n\n1. **Reduced seed requirement:** SRI uses fewer seeds per hectare compared to traditional methods because seedlings are transplanted at a younger age and with greater spacing.  This results in better aeration and nutrient uptake for individual plants, leading to higher yields despite lower plant density.\n\n\n2. **Reduced methane production:**  Flooded rice paddies are a significant source of methane, a potent greenhouse gas.  The alternate wetting and drying in SRI reduces the anaerobic conditions in the soil, thus decreasing methane emissions.  The reduced waterlogging minimizes the activity of methanogenic archaea responsible for methane production.\n\n\n3. **Reduced electricity consumption:** SRI's water management strategy decreases the need for frequent irrigation, especially with pump-based irrigation systems. This results in less electricity consumption for pumping water.  The improved water use efficiency also contributes to this reduction.\n\nTherefore, all three statements are correct.  A short note on named entities is not possible as the provided context does not contain sufficient information to describe them.\n"
    },
    {
        "Q.No.": 23,
        "question_text": "Which one of the following lakes of West Africa has become dry and turned into a desert?",
        "option_a": "Lake Victoria",
        "option_b": "Lake Faguibine",
        "option_c": "Lake Oguta",
        "option_d": "Lake Volta",
        "correct_option": "b",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: Lake Faguibine, located in Mali, West Africa, has significantly shrunk and dried up due to desertification and changes in rainfall patterns.  It is now largely a desert.\n\nLake Victoria is the largest lake in Africa, located in East Africa and is not dry. Lake Oguta is located in Nigeria and remains a lake. Lake Volta is an artificial lake in Ghana, created by a dam, and is not a naturally dried-up lake.\n"
    },
    {
        "Q.No.": 24,
        "question_text": "Gandikota canyon of South India was created by which one of the following rivers?",
        "option_a": "Cauvery",
        "option_b": "Manjira",
        "option_c": "Pennar",
        "option_d": "Tungabhadra",
        "correct_option": "c",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation: The Gandikota canyon in South India was formed by the Pennar River.  The Pennar River is a major river in South India, originating in the Eastern Ghats and flowing through Andhra Pradesh and Tamil Nadu before emptying into the Bay of Bengal.  The Cauvery, Manjira, and Tungabhadra rivers are also significant rivers in South India, but they are not associated with the formation of the Gandikota canyon.  The Cauvery River flows primarily through Karnataka and Tamil Nadu. The Manjira River is a tributary of the Godavari River. The Tungabhadra River is a tributary of the Krishna River.\n"
    },
    {
        "Q.No.": 25,
        "question_text": "Consider the following pairs:\n   Peak            Mountains\n1. Namcha Barwa    Garhwal Himalaya\n2. Nanda Devi      Kumaon Himalaya\n3. Nokrek          Sikkim Himalaya\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: Nanda Devi peak is located in the Kumaon Himalayas.  Namcha Barwa is located in the Eastern Himalayas, not the Garhwal Himalayas. Nokrek peak is located in Meghalaya, which is not part of the Sikkim Himalayas.\n\nNamcha Barwa:  A prominent peak in the Eastern Himalayas, located in Tibet near the India-China border.  It's known for its steep slopes and challenging terrain.\n\nNanda Devi:  A major peak in the Kumaon Himalayas, located in Uttarakhand, India.  It's a significant peak in the Garhwal-Kumaon region, known for its challenging climbs.\n\nNokrek:  The highest peak in the Garo Hills of Meghalaya, India. It's part of the Eastern Himalayas and is known for its biodiversity.\n\nGarhwal Himalayas: A section of the Himalayas in Uttarakhand, India, known for its high peaks, glaciers, and diverse flora and fauna.\n\nKumaon Himalayas: Another section of the Himalayas in Uttarakhand, India, known for its picturesque valleys, dense forests, and many peaks including Nanda Devi.\n\nSikkim Himalayas: The Himalayan range in Sikkim, India.  Known for its unique biodiversity and high altitude landscapes.\n"
    },
    {
        "Q.No.": 26,
        "question_text": "The term \"Levant\" often heard in the news roughly corresponds to which of the following regions?",
        "option_a": "Region along the eastern Mediterranean shores",
        "option_b": "Region along North African shores stretching from Egypt to Morocco",
        "option_c": "Region along Persian Gulf and Horn of Africa",
        "option_d": "The entire coastal areas of Mediterranean Sea",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:The Levant refers to the eastern Mediterranean region.  This area includes parts of modern-day Lebanon, Syria, Jordan, Israel, and Palestine.  The term historically encompassed a larger area, but its contemporary usage primarily focuses on the eastern Mediterranean coast.\n\nOption (b) describes North Africa. Option (c) describes the Persian Gulf and Horn of Africa regions. Option (d) is too broad, encompassing the entire Mediterranean coastline.\n"
    },
    {
        "Q.No.": 27,
        "question_text": "Consider the following countries:\n1. Azerbaijan\n2. Kyrgyzstan\n3. Tajikistan\n4. Turkmenistan\n5. Uzbekistan\nWhich of the above have borders with Afghanistan?",
        "option_a": "1, 2 and 5 only",
        "option_b": "1, 2, 3 and 4 only",
        "option_c": "3, 4 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:  Tajikistan, Turkmenistan, and Uzbekistan share borders with Afghanistan.  \n\nAzerbaijan: A transcontinental country in the Caucasus region, bordering Russia, Georgia, Armenia, Iran, and Turkey.\n\nKyrgyzstan: A landlocked country in Central Asia, bordering Kazakhstan, Uzbekistan, Tajikistan, and China.\n\nTajikistan: A landlocked country in Central Asia, bordering Afghanistan, China, Kyrgyzstan, and Uzbekistan.\n\nTurkmenistan: A landlocked country in Central Asia, bordering Afghanistan, Iran, Kazakhstan, and Uzbekistan.\n\nUzbekistan: A landlocked country in Central Asia, bordering Afghanistan, Kazakhstan, Kyrgyzstan, Tajikistan, and Turkmenistan.\n"
    },
    {
        "Q.No.": 28,
        "question_text": "With reference to India, consider the following statements:\n1. Monazite is a source of rare earths.\n2. Monazite contains thorium.\n3. Monazite occurs naturally in the entire Indian coastal sands in India.\n4. In India, Government bodies only can process or export monazite.\nWhich of the statements given above are correct?",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 2 and 4 only",
        "option_c": "3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is correct. Monazite is a phosphate mineral containing significant amounts of rare earth elements.\n\nStatement 2 is correct. Monazite also contains thorium, a radioactive element.\n\nStatement 3 is incorrect.  Monazite is found in coastal sands, but not across the entire Indian coastline.  Its distribution is concentrated in specific areas.\n\nStatement 4 is correct. In India, the processing and export of monazite are largely under government control due to its strategic importance and radioactive content.  This is primarily managed by the Department of Atomic Energy.\n\n\n**Short notes on named entities:**\n\n* **Monazite:** A phosphate mineral that is a primary source of rare earth elements and thorium.  Its radioactive nature necessitates strict government regulation regarding its extraction and processing.\n\n* **Rare earths:** A group of 17 chemically similar metallic elements that are crucial for various high-tech applications, including electronics, magnets, and lasers.  India possesses significant rare earth reserves, primarily in monazite sands.\n\n* **Thorium:** A naturally occurring radioactive element found in monazite. It is a potential fuel for nuclear reactors and is also used in other applications.  Its radioactivity necessitates careful handling and management.\n"
    },
    {
        "Q.No.": 29,
        "question_text": "In the northern hemisphere, the longest day of the year normally occurs in the:",
        "option_a": "First half of the month of June",
        "option_b": "Second half of the month of June",
        "option_c": "First half of the month of July",
        "option_d": "Second half of the month of July",
        "correct_option": "a",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: The summer solstice, the longest day of the year in the Northern Hemisphere, occurs around June 21st.  Therefore, the longest day falls in the first half of June.\n\nJune: The sixth month of the year in the Gregorian calendar.  It's known for its association with the summer solstice in the Northern Hemisphere.\n\nJuly: The seventh month of the year.  It follows June and precedes August.  It is not the month in which the summer solstice occurs in the Northern Hemisphere.\n\nNorthern Hemisphere: The half of Earth that is north of the equator. It experiences summer during June, July, and August.\n\nSummer Solstice: The day of the year with the most sunlight in the Northern Hemisphere, occurring around June 21st.  It marks the beginning of summer.\n"
    },
    {
        "Q.No.": 30,
        "question_text": "Consider the following pairs:\n   Wetland/Lake         Location\n1. Hokera Wetland       Punjab\n2. Renuka Wetland       Himachal Pradesh\n3. Rudrasagar Lake      Tripura\n4. Sasthamkotta Lake    Tamil Nadu\nHow many pairs given above are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "Only three pairs",
        "option_d": "All four pairs",
        "correct_option": "a",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Only Hokera Wetland in Punjab is correctly matched.  Renuka Wetland is in Himachal Pradesh, Rudrasagar Lake is in Tripura, and Sasthamkotta Lake is in Kerala, not Tamil Nadu.\n\nHokera Wetland: A wetland located in Punjab, India.  Wetlands are areas where water covers the soil, or is present either at or near the surface of the soil all year or for varying periods of time during the year, including during the growing season.\n\nRenuka Wetland: A wetland located in Himachal Pradesh, India.  It's known for its scenic beauty and is often visited by tourists.\n\nRudrasagar Lake: A lake located in Tripura, India. It's a significant water body in the region, potentially supporting local ecosystems and communities.\n\nSasthamkotta Lake: A lake located in Kerala, India.  It's a large freshwater lake and an important source of water for the region.\n"
    },
    {
        "Q.No.": 31,
        "question_text": "Consider the following:\n1. Aarogya Setu\n2. COWIN\n3. DigiLocker\n4. DIKSHA\nWhich of the above are built on top of open-source digital platforms?",
        "option_a": "1 and 2 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation: COWIN, DigiLocker, and DIKSHA are built on open-source digital platforms.  Aarogya Setu, while leveraging some open-source technologies, is not entirely built on open-source platforms.\n\n\nAarogya Setu: A contact tracing mobile application developed by the Indian government to help track and control the spread of COVID-19.  It uses Bluetooth technology and location data.\n\nCOWIN:  The CoWIN platform is an online portal and mobile application used for managing and scheduling COVID-19 vaccinations in India.  It's based on open-source technology, allowing for scalability and transparency.\n\nDigiLocker: A digital locker service provided by the Indian government, allowing citizens to store and manage their digital documents securely. It leverages open-source technologies for its infrastructure.\n\nDIKSHA:  A national platform for teachers, providing access to educational resources and training. It is built using open-source technologies to ensure accessibility and collaboration.\n"
    },
    {
        "Q.No.": 32,
        "question_text": "With reference to Web 3.0, consider the following statements:\n1. Web 3.0 technology enables people to control their own data.\n2. In Web 3.0 world, there can be blockchain based social networks.\n3. Web 3-0 is operated by users collectively rather than a corporation.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (d)\n\nexplanation:All three statements align with the core tenets of Web 3.0.  Web 3.0 aims for decentralization, placing control of data back in the hands of users (statement 1). Blockchain technology, a key component of Web 3.0, facilitates the creation of decentralized social networks, eliminating reliance on central authorities (statement 2). The collective governance model envisioned for Web 3.0 contrasts with the corporate control prevalent in Web 2.0 (statement 3).\n\n**Short notes on named entities:**\n\n* **Web 1.0:** The first generation of the World Wide Web, characterized by static content and limited user interaction.  Users primarily consumed content; there was little to no user-generated content.\n\n* **Web 2.0:** The second generation of the World Wide Web, characterized by increased user interaction, dynamic content, and social media platforms.  It emphasized user-generated content and interaction.\n\n* **Web 3.0:** The envisioned next generation of the World Wide Web, emphasizing decentralization, user ownership of data, and the use of technologies such as blockchain and artificial intelligence.  It aims to create a more open, transparent, and user-centric internet experience.\n\n* **Blockchain:** A distributed ledger technology that records and verifies transactions across multiple computers.  This ensures transparency, security, and immutability of data.  It is used in cryptocurrencies and other decentralized applications.\n\n* **Cambridge Analytica:** A British political consulting firm that harvested the personal data of millions of Facebook users without their consent, highlighting the vulnerability of user data in Web 2.0.\n\n\n"
    },
    {
        "Q.No.": 33,
        "question_text": "With reference to \"Software as a Service\" (SaaS), consider the following statements:\n1. SaaS buyers can customize the user interface and change data fields.\n2. SaaS users can access their data through their mobile devices.\n3. Outlook, Hotmail and Yahoo! Mail are forms of SaaS.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  While some SaaS platforms offer customization options, it's not a universal feature.  Many SaaS applications provide a pre-defined user interface and data fields to maintain consistency and ease of use for all users.  Customization is often limited or requires additional costs.\n\nStatement 2 is correct. A key benefit of SaaS is accessibility.  SaaS applications are typically designed to be accessed through web browsers, making them accessible from various devices, including mobile phones and tablets.\n\nStatement 3 is correct. Outlook, Hotmail, and Yahoo! Mail are all examples of SaaS. Users access these email services over the internet, without needing to install and maintain software on their own computers. The providers manage the servers, software updates, and data storage.\n\nTherefore, only statements 2 and 3 are correct.\n\n\nSoftware as a Service (SaaS):  A software licensing and delivery model in which software is licensed on a subscription basis and is centrally hosted.  Users access the software over the internet, eliminating the need for local installation and maintenance.\n\nOutlook: Microsoft's email client, available as a web application (SaaS) and desktop application.\n\nHotmail:  Microsoft's web-based email service (SaaS).\n\nYahoo! Mail: Yahoo's web-based email service (SaaS).\n"
    },
    {
        "Q.No.": 34,
        "question_text": "Which one of the following statements best reflects the idea behind the often talked about \"Orbital Bombardment System\" of fractional orbitals?",
        "option_a": "A hypersonic missile is launched into space to counter and explode asteroid approaching the Earth",
        "option_b": "A spacecraft lands on another planet after making several orbital moves.",
        "option_c": "A missile is put into a stable orbit around the Earth and detonates over its target on the Earth.",
        "option_d": "A spacecraft moves along a comet with the same speed and places a probe on its surface.",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "* **correct_option:** (c)\n* **explanation:** An orbital bombardment system, as the name suggests, involves placing a missile into a stable orbit around the Earth.  From this orbit, the missile is then targeted and detonated over a specific location on the Earth's surface.  Option (a) describes a different scenario – an asteroid deflection system. Option (b) describes a spacecraft's maneuver, not a bombardment system. Option (d) involves a cometary probe, not an Earth-based weapon system.\n\nHypersonic missiles are high-speed missiles capable of exceeding Mach 5.  Asteroids are rocky bodies orbiting the Sun.  Spacecraft are vehicles designed for space travel.  A comet is a celestial body of ice and dust.  Stable orbits are predictable paths around a celestial body.\n"
    },
    {
        "Q.No.": 35,
        "question_text": "Which one of the following is the context in which the term \"qubit\" is mentioned?",
        "option_a": "Cloud Services",
        "option_b": "Quantum Computing",
        "option_c": "Visible Light Communication Technologies",
        "option_d": "Wireless Communication Technologies",
        "correct_option": "b",
        "subject": "environment",
        "year": 2022,
        "explanation": "* **correct_option:** (b)\n* **explanation:** A qubit is the basic unit of information in quantum computing.  Unlike a classical bit, which represents either a 0 or a 1, a qubit can exist in a superposition, representing both 0 and 1 simultaneously. This allows quantum computers to perform calculations in a fundamentally different and potentially more powerful way than classical computers.\n\nCloud services refer to the on-demand availability of computer system resources, especially data storage (cloud storage) and computing power, without direct active management by the user.  Visible light communication technologies use visible light to transmit data, while wireless communication technologies use radio waves for data transmission.  Neither of these are directly related to qubits.\n"
    },
    {
        "Q.No.": 36,
        "question_text": "Consider the following communication technologies:\n1. Radio-frequency Identification\n2. Closed-circuit Television\n3. Wireless Local Area Network\nWhich of the above are considered Short-Range devices/technologies?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:  Radio-frequency Identification (RFID) uses radio waves to identify and track tags attached to objects.  This is typically a short-range technology, with the range depending on the power of the RFID reader and the type of tag. Closed-circuit television (CCTV) is a video surveillance system that uses cameras to monitor a specific area.  It's inherently a short-range technology, as the cameras have a limited field of view. Wireless Local Area Network (WLAN) technologies like Wi-Fi provide network connectivity over a relatively short distance, typically within a building or a small geographical area.  Therefore, RFID and WLAN are considered short-range technologies.  CCTV, while having a limited range of view for each camera, is not typically classified as short-range in the same way as the others, as it can be implemented to cover larger areas with multiple cameras. However, given the options, (c) is the most accurate.\n\nRFID:  Radio-frequency identification uses radio waves to automatically identify and track tags attached to objects. The system comprises a tag (transponder) and a reader (interrogator) that communicates with the tag wirelessly.  Applications include inventory management, access control, and animal tracking.\n\nCCTV: Closed-circuit television is a video surveillance system used for monitoring activities in a specific area. It utilizes cameras to capture and transmit video signals to a monitor or recording device. Applications range from security monitoring to traffic management.\n\nWLAN: A wireless local area network is a network that uses radio frequencies to provide local area network connectivity to devices such as computers and smartphones.  WLANs use standards such as Wi-Fi to enable wireless communication, offering convenience and mobility within a limited range.\n"
    },
    {
        "Q.No.": 37,
        "question_text": "Consider the following statements:\n1. Biofilms can form on medical implants within human tissues.\n2. Biofilms can form on food and food processing surfaces.\n3. Biofilms can exhibit antibiotic resistance.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation:All three statements are correct.\n\n* Biofilms are communities of microorganisms that adhere to surfaces and are encased in a self-produced extracellular matrix.  They can form on various surfaces, including medical implants within human tissues (statement 1), leading to infections that are difficult to treat.  They also readily form on food and food processing surfaces (statement 2), contributing to food spoilage and contamination.  The structure and nature of biofilms provide a degree of protection from antibiotics and disinfectants, resulting in antibiotic resistance (statement 3).  This resistance is a major concern in healthcare and other settings.\n"
    },
    {
        "Q.No.": 38,
        "question_text": "Consider the following statements in respect of probiotics:\n1. Probiotics are made of both bacteria and yeast.\n2. The organisms in probiotics are found in foods we ingest but they do not naturally occur in our gut.\n3. Probiotics help in the digestion of milk sugars.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation: Probiotics are live microorganisms intended to provide health benefits when consumed or applied to the body.  Statement 1 is incorrect because while some probiotics contain yeast, most are composed of bacteria. Statement 2 is incorrect because many probiotic organisms are naturally found in the human gut.  Statement 3 is correct; some probiotic strains aid in the digestion of lactose (milk sugar). Therefore, only statement 3 is correct.\n"
    },
    {
        "Q.No.": 39,
        "question_text": "In the context of vaccines manufactured to prevent COVID-19 pandemic, consider the following statements:\n1. The Serum Institute of India produced COVID-19 vaccine named Covishield using mRNA platform.\n2. Sputnik V vaccine is manufactured using vector based platform.\n3. COVAXIN is an inactivated pathogen based vaccine.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. Covishield, manufactured by the Serum Institute of India, uses a viral vector platform (ChAdOx1), not the mRNA platform.  Statement 2 is correct. Sputnik V is a viral vector-based vaccine. Statement 3 is correct. COVAXIN is an inactivated virus vaccine.\n\nCovishield: A COVID-19 vaccine developed by Oxford University and AstraZeneca, manufactured by the Serum Institute of India. It uses a chimpanzee adenovirus vector to deliver the SARS-CoV-2 spike protein gene into cells, triggering an immune response.\n\nSputnik V: A COVID-19 vaccine developed by the Gamaleya Research Institute in Russia. It uses two different adenovirus vectors (Ad26 and Ad5) for the first and second doses, respectively, to deliver the SARS-CoV-2 spike protein gene.\n\nCOVAXIN: A COVID-19 vaccine developed by Bharat Biotech in India. It is an inactivated virus vaccine, meaning the virus is killed but retains its ability to trigger an immune response without causing disease.\n"
    },
    {
        "Q.No.": 40,
        "question_text": "If a major solar storm (solar flare) reaches the Earth, which of the following are the possible effects on the Earth?\n1. GPS and navigation systems could fail.\n2. Tsunamis could occur at equatorial regions.\n3. Power grids could be damaged.\n4. Intense auroras could occur over much of the Earth.\n5. Forest fires could take place over much of the planet.\n6. Orbits of the satellites could be disturbed.\n7. Shortwave radio communication of the aircraft flying over polar regions could be interrupted.\nSelect the correct answer using the code given below:",
        "option_a": "1, 2, 4 and 5 only",
        "option_b": "2, 3, 5, 6 and 7 only",
        "option_c": "1, 3, 4, 6 and 7 only",
        "option_d": "1, 2, 3, 4, 5, 6 and 7",
        "correct_option": "c",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation: A major solar storm, also known as a solar flare, can significantly impact Earth's technological systems and atmosphere.  GPS and navigation systems rely on radio signals that can be disrupted by the influx of charged particles from a solar storm (1). Power grids can be overloaded and damaged by the induced currents caused by these particles (3).  The increased charged particles interacting with the Earth's magnetic field can cause intense auroras visible over a much wider area than usual (4). Satellite orbits can be altered due to atmospheric drag changes caused by the increased solar activity (6). Shortwave radio communication, particularly in polar regions where the magnetic field lines are closer to the surface, is highly susceptible to disruption (7).\n\nTsunamis are caused by seismic activity, not solar flares (2). Forest fires are not directly caused by solar flares (5).  While a solar storm can indirectly affect weather patterns over time, it does not directly cause widespread forest fires.\n"
    },
    {
        "Q.No.": 41,
        "question_text": "“Climate Action Tracker” which monitors the emission reduction pledges of different countries is a:",
        "option_a": "Database created by coalition of research organisations",
        "option_b": "Wing of “International Panel of Climate Change”",
        "option_c": "Committee under “United Nations Framework Convention on Climate Change”",
        "option_d": "Agency promoted and financed by United Nations Environment Programme and World Bank",
        "correct_option": "a",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:Climate Action Tracker is an independent organization that assesses the emission reduction pledges of different countries.  It's not a part of the IPCC (Intergovernmental Panel on Climate Change), which is a scientific body assessing the science related to climate change, nor is it a UN agency or committee.  Instead, it's a collaborative project of several research organizations.  The International Panel on Climate Change (IPCC) is a United Nations body for assessing the science related to climate change. The United Nations Framework Convention on Climate Change (UNFCCC) is an international environmental treaty adopted in 1992 to combat climate change. The United Nations Environment Programme (UNEP) is a leading global environmental authority that sets the global environmental agenda. The World Bank is an international financial institution that provides loans and grants to the governments of low- and middle-income countries for the purpose of pursuing capital projects.\n"
    },
    {
        "Q.No.": 42,
        "question_text": "Consider the following statements:\n1. “The Climate Group” is an international non-profit organization that drives climate action by building large networks and runs them.\n2. The International Energy Agency in partnership with the Climate Group launched a global initiative “EP100”.\n3. EP100 brings together leading companies committed to driving innovation in energy efficiency and increasing competitiveness while delivering on emission reduction goals.\n4. Some Indian companies are members of EP100.\n5. The International Energy Agency is the Secretariat to the “Under2 Coalition”.\nWhich of the statements given above are correct?",
        "option_a": "1, 2, 4 and 5",
        "option_b": "1, 3 and 4 only",
        "option_c": "2, 3 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "a",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:\n\nStatement 1 is correct. The Climate Group is an international non-profit organization that works to accelerate climate action by building and supporting large networks of businesses, governments, and other organizations.\n\nStatement 2 is correct. The International Energy Agency (IEA) partnered with The Climate Group to launch the EP100 initiative.\n\nStatement 3 is correct. EP100 is a global initiative that brings together leading companies committed to using energy more efficiently and reducing their carbon emissions.  Membership demonstrates a commitment to innovation and competitiveness through energy efficiency.\n\nStatement 4 is correct.  The provided text confirms that some Indian companies are members of EP100.\n\nStatement 5 is correct. The International Energy Agency serves as the secretariat for the Under2 Coalition.\n\n\nShort notes on named entities:\n\n**The Climate Group:** An international non-profit organization focused on driving climate action through collaborative networks and initiatives involving businesses, governments, and other stakeholders.  Their work centers on accelerating the transition to a low-carbon economy.\n\n**International Energy Agency (IEA):** An intergovernmental organization that provides data, analysis, and policy recommendations on global energy markets and energy security. It plays a significant role in international energy cooperation and the development of sustainable energy policies.\n\n**EP100:** A global corporate initiative launched by the IEA and The Climate Group. It aims to encourage companies to commit to ambitious energy efficiency targets, driving innovation and competitiveness while reducing their environmental impact.\n\n**Under2 Coalition:** A global coalition of state and regional governments committed to limiting global warming to well below 2°C. The IEA provides support and coordination for this group's activities.\n"
    },
    {
        "Q.No.": 43,
        "question_text": "“If rainforests and tropical forests are the lungs of the Earth, then surely wetlands function as its kidneys.” Which one of the following functions of wetlands best reflects the above statement?",
        "option_a": "The water cycle in wetlands involves surface runoff, subsoil percolation and evaporation.",
        "option_b": "Algae form the nutrient base upon which fish, crustaceans, molluscs, birds, reptiles and mammals thrive.",
        "option_c": "Wetlands play a vital role in maintaining sedimentation balance and soil stabilization.",
        "option_d": "Aquatic plants absorb heavy metals and excess nutrients.",
        "correct_option": "d",
        "subject": "environment",
        "year": 2022,
        "explanation": "* **correct_option:** (d)\n* **explanation:** The statement likens rainforests/tropical forests to the lungs (respiration) and wetlands to kidneys (filtration/purification). Option (d) best reflects this analogy because it describes how aquatic plants in wetlands remove harmful substances (heavy metals and excess nutrients) from the water, thus purifying it, similar to how kidneys filter waste from blood.\n\nRainforests and tropical forests are characterized by high biodiversity and significant roles in carbon sequestration and oxygen production.  Wetlands are areas where water covers the soil, or is present either at or near the surface of the soil all year or for varying periods of time during the year, including during the growing season.  They support a diverse range of flora and fauna and play vital roles in water purification, flood control, and nutrient cycling.  Algae are photosynthetic organisms forming the base of many aquatic food webs.  The water cycle involves the continuous movement of water between the earth's surface and the atmosphere. Heavy metals are toxic metals that can accumulate in organisms and the environment.\n"
    },
    {
        "Q.No.": 44,
        "question_text": "In the context of WHO Air Quality Guidelines, consider the following statements:\n1. The 24-hour mean of PM2.5 should not exceed 15 µg/m³ and annual mean of PM2.5 should not exceed 5 µg/m³.\n2. In a year, the highest levels of ozone pollution occur during the periods of inclement weather.\n3. PM10 can penetrate the lung barrier and enter the bloodstream.\n4. Excessive ozone in the air can trigger asthma.\nWhich of the statements given above are correct?",
        "option_a": "1, 3 and 4",
        "option_b": "1 and 4 only",
        "option_c": "2, 3 and 4",
        "option_d": "1 and 2 only",
        "correct_option": "a",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is incorrect.  WHO Air Quality Guidelines recommend a 24-hour mean PM2.5 level not exceeding 15 µg/m³, but the annual mean should not exceed 5 µg/m³.  Statement 2 is incorrect; ozone pollution peaks during periods of high sunlight and stagnant air, not inclement weather.  Statement 3 is correct; PM10 particles can penetrate lung barriers and enter the bloodstream.  Statement 4 is correct; ozone can trigger asthma attacks.  Therefore, only statements 3 and 4 are correct.\n\n\nPM2.5:  Fine inhalable particles with a diameter of 2.5 micrometers or less.  They are a major air pollutant, posing significant health risks due to their ability to penetrate deep into the lungs.\n\nPM10: Inhalable particles with a diameter of 10 micrometers or less.  While larger than PM2.5, they still pose respiratory health risks.\n\nOzone (O3): A gas found in both the stratosphere (good ozone) and troposphere (bad ozone).  Tropospheric ozone is a harmful pollutant formed through chemical reactions involving sunlight, nitrogen oxides, and volatile organic compounds.\n\nWHO Air Quality Guidelines:  Recommendations from the World Health Organization to protect human health from the harmful effects of air pollution.  They set limits for various pollutants, including PM2.5, PM10, and ozone.\n"
    },
    {
        "Q.No.": 45,
        "question_text": "With reference to \"Gucchi\" sometimes mentioned in the news, consider the following statements:\n1. It is a fungus.\n2. It grows in some Himalayan forest areas.\n3. It is commercially cultivated in the Himalayan foothills of north-eastern India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "3 only",
        "option_c": "1 and 2",
        "option_d": "2 and 3",
        "correct_option": "c",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation:The provided text does not contain information about \"Gucchi\".  Therefore, I cannot answer this question based on the given context.\n"
    },
    {
        "Q.No.": 46,
        "question_text": "With reference to polyethylene terephthalate, the use of which is so widespread in our daily lives, consider the following statements:\n1. Its fibres can be blended with wool and cotton fibres to reinforce their properties.\n2. Containers made of it can be used to store any alcoholic beverage.\n3. Bottles made of it can be recycled into other products.\n4. Articles made of it can be easily disposed of by incineration without causing greenhouse gas emissions.\nWhich of the statements given above are correct?",
        "option_a": "1 and 3",
        "option_b": "2 and 4",
        "option_c": "1 and 4",
        "option_d": "2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. Polyethylene terephthalate (PET) fibers are used in blends with wool and cotton to enhance their strength and durability.  Statement 2 is incorrect.  PET containers are not suitable for all alcoholic beverages, especially those that react with the plastic or require specific barrier properties. Statement 3 is correct. PET bottles are recyclable and commonly recycled into other products like fleece jackets or carpet fibers. Statement 4 is incorrect. While PET can be incinerated, it does release greenhouse gases. Therefore, only statements 1 and 3 are correct.\n\n\nPolyethylene terephthalate (PET): A thermoplastic polymer resin of the polyester family used in synthetic fibers, plastic bottles, and food packaging.  Known for its strength, clarity, and barrier properties.  \n\nWool: A natural fiber obtained from sheep or other animals, known for its warmth, softness, and breathability.\n\nCotton: A natural fiber from the cotton plant, prized for its softness, absorbency, and comfort.  Widely used in clothing and textiles.\n"
    },
    {
        "Q.No.": 47,
        "question_text": "Which of the following is not a bird?",
        "option_a": "Golden Mahseer",
        "option_b": "Indian Nightjar",
        "option_c": "Spoonbill",
        "option_d": "White Ibis",
        "correct_option": "a",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: The Golden Mahseer is a fish, not a bird.  The Indian Nightjar, Spoonbill, and White Ibis are all types of birds.  The Indian Nightjar is a nocturnal bird belonging to the Caprimulgidae family, known for its cryptic plumage and insect diet. Spoonbills are wading birds characterized by their broad, spatulate bills used for filter feeding. White Ibises are also wading birds, distinguished by their entirely white plumage and long, down-curved bills.\n"
    },
    {
        "Q.No.": 48,
        "question_text": "Which of the following are nitrogen-fixing plants?\n1. Alfalfa\n2. Amaranth\n3. Chickpea\n4. Clover\n5. Purslane (Kulfa)\n6. Spinach\nSelect the correct answer using the code given below:",
        "option_a": "1, 3 and 4 only",
        "option_b": "1, 3, 5 and 6 only",
        "option_c": "2, 4, 5 and 6 only",
        "option_d": "1, 2, 4, 5 and 6",
        "correct_option": "a",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Alfalfa, chickpea, and clover are legumes. Legumes have a symbiotic relationship with nitrogen-fixing bacteria (Rhizobium) in their root nodules.  These bacteria convert atmospheric nitrogen into ammonia, which the plants can then use.  Amaranth, purslane, and spinach are not legumes and do not fix nitrogen.\n\nAlfalfa (Medicago sativa): A perennial legume widely cultivated as forage for livestock.  Known for its high protein content and ability to improve soil fertility.\n\nAmaranth (Amaranthus): A genus of flowering plants, some species are grown as grain crops or leafy vegetables.  They are not known for nitrogen fixation.\n\nChickpea (Cicer arietinum): An annual legume and important pulse crop globally, valued for its nutritional content.  Like other legumes, it contributes to soil nitrogen.\n\nClover (Trifolium): A genus of flowering plants in the legume family, many species are used as forage or cover crops due to their nitrogen-fixing properties.\n\nPurslane (Portulaca oleracea): A succulent annual plant often considered a weed but also used as a leafy vegetable. It does not fix nitrogen.\n\nSpinach (Spinacia oleracea): An annual leafy vegetable rich in nutrients, but not a nitrogen-fixing plant.\n"
    },
    {
        "Q.No.": 49,
        "question_text": "\"Biorock technology\" is talked about in which one of the following situations?",
        "option_a": "Restoration of damaged coral reefs",
        "option_b": "Development of building materials using plant residues",
        "option_c": "Identification of areas for exploration/extraction of shale gas",
        "option_d": "Providing salt licks for wild animals in forests/protected areas",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Biorock technology is a method used for coral reef restoration.  It involves passing a small electric current through electrodes placed in seawater, causing minerals to precipitate and accrete onto existing coral structures, promoting coral growth and reef regeneration.\n\nCoral reefs are underwater ecosystems characterized by reef-building corals.  Damage to coral reefs can occur due to various factors, including climate change, pollution, and destructive fishing practices.  Restoration efforts aim to reverse this damage and help reefs recover.  The International Coral Reef Initiative, Global coral reef monitoring network, International Coral Reef Action Network, and Coral Triangle Initiative are examples of global efforts focused on coral reef conservation.  In India, initiatives like Coastal Zone Management and Integrated coastal & marine area regulation (ICMAM) contribute to coral reef protection.\n\nShale gas is a natural gas extracted from shale rock formations. Its extraction often involves hydraulic fracturing (\"fracking\").  Building materials using plant residues involve utilizing agricultural waste for construction purposes. Salt licks are mineral deposits providing essential minerals to wild animals.\n"
    },
    {
        "Q.No.": 50,
        "question_text": "The \"Miyawaki method\" is well known for the:",
        "option_a": "Promotion of commercial farming in arid and semi-arid areas",
        "option_b": "Development of gardens using genetically modified flora",
        "option_c": "Creation of mini forests in urban areas",
        "option_d": "Harvesting wind energy on coastal areas and on sea surfaces",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "* **correct_option:** (c)\n* **explanation:** The Miyawaki method is a technique for creating dense, native forests in small spaces, typically urban areas.  It involves planting a high density of native tree saplings, using specific techniques to accelerate growth and biodiversity. Options (a), (b), and (d) describe different agricultural and energy-related practices.\n\n  * **Miyawaki method:** A Japanese forestry technique focused on creating highly biodiverse, miniature forests in urban environments using densely packed native species.  It prioritizes rapid growth and ecological restoration in limited spaces.\n\n  * **Commercial farming:**  Large-scale agricultural production primarily focused on profit maximization, often employing intensive methods and monoculture practices.\n\n  * **Genetically modified flora:** Plants whose genetic material has been altered using biotechnology techniques, often to enhance traits such as pest resistance or yield.\n\n  * **Wind energy:** Energy derived from harnessing the kinetic energy of moving air using wind turbines.  It's a renewable energy source often used in areas with consistent wind patterns.\n"
    },
    {
        "Q.No.": 51,
        "question_text": "In the Government of India Act 1919, the functions of Provincial Government were divided into \"Reserved\" and \"Transferred\" subjects. Which of the following were treated as \"Reserved\" subjects?\n1. Administration of Justice\n2. Local Self-Government\n3. Land Revenue\n4. Police\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 3",
        "option_b": "2, 3 and 4",
        "option_c": "1, 3 and 4",
        "option_d": "1, 2 and 4",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:The Government of India Act of 1919, also known as the Montagu-Chelmsford Reforms, introduced dyarchy in the provinces.  This system divided subjects into \"reserved\" and \"transferred.\"  Reserved subjects remained under the direct control of the Governor and his executive council, while transferred subjects were administered by ministers responsible to the provincial legislature.\n\nAdministration of Justice, Land Revenue, and Police were considered reserved subjects because they were deemed crucial for maintaining law and order and the stability of the British Raj.  Local Self-Government was a transferred subject, allowing for some degree of Indian participation in local administration.\n\n\nShort notes on keywords and named entities:\n\n* **Government of India Act 1919 (Montagu-Chelmsford Reforms):**  A landmark act in British India that introduced significant reforms, including dyarchy in the provinces, aiming to gradually introduce self-governance while retaining British control over key areas.  It represented a step towards Indian autonomy but fell short of full self-rule.\n\n* **Reserved Subjects:**  Areas of governance in British India under the 1919 Act that remained under the direct control of the Governor and his executive council, primarily concerning law and order and revenue collection.  These were considered vital for maintaining British authority.\n\n* **Transferred Subjects:**  Areas of governance in British India under the 1919 Act that were given to Indian ministers responsible to the provincial legislature. This represented a limited form of self-government and was a crucial step in the evolution of Indian autonomy.\n\n* **Dyarchy:** A system of dual government introduced in British India's provinces by the 1919 Act. It divided administrative powers between the Governor (reserved subjects) and ministers responsible to the provincial legislature (transferred subjects). It aimed to gradually introduce self-governance while maintaining British control over key areas.\n\n* **Administration of Justice:** The system of courts and legal processes for resolving disputes and enforcing laws. Under the 1919 Act, it remained a reserved subject, reflecting the British desire to maintain control over the judicial system.\n\n* **Local Self-Government:** The administration of local areas by elected bodies.  Under the 1919 Act, it was a transferred subject, representing an early attempt to involve Indians in governance at a local level.\n\n* **Land Revenue:** The revenue collected by the government from land ownership. It was a crucial source of revenue for the British Indian government and remained a reserved subject to ensure control over this vital resource.\n\n* **Police:** The law enforcement agency responsible for maintaining public order and security.  Under the 1919 Act, it was a reserved subject, demonstrating the British government's focus on maintaining law and order through its own agencies.\n"
    },
    {
        "Q.No.": 52,
        "question_text": "In medieval India, the term \"Fanam\" referred to:",
        "option_a": "Clothing",
        "option_b": "Coins",
        "option_c": "Ornaments",
        "option_d": "Weapons",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: The provided text mentions the use of gold coins in medieval India, and the term \"Fanam\" was a type of coin used during that period.  While the text doesn't explicitly define \"Fanam,\" the context strongly suggests it was a monetary unit.  The other options are not supported by the provided text.\n\nMedieval India: Refers to the historical period in India spanning roughly from the 8th century to the 18th century.  It's characterized by a diverse range of kingdoms, empires, and cultural interactions.\n\nFanam: A type of coin used in medieval South India. Its value varied over time and across different regions.  It was commonly used in trade and transactions.\n\nClothing:  The text mentions clothing styles of certain groups (e.g.,  Turkic tunic, trousers, and coat), but doesn't connect these to the term \"Fanam\".\n\nOrnaments:  The text doesn't directly relate ornaments to the term \"Fanam\".\n\nWeapons: The text details weaponry and warfare but doesn't link this to \"Fanam\".\n"
    },
    {
        "Q.No.": 53,
        "question_text": "Consider the following freedom fighters:\n1. Barindra Kumar Ghosh\n2. Jogesh Chandra Chatterjee\n3. Rash Behari Bose\nWho of the above was/were actively associated with the Ghadar Party?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation: Rash Behari Bose was actively involved with the Ghadar Party.  The provided text does not contain information about the Ghadar Party's association with Barindra Kumar Ghosh or Jogesh Chandra Chatterjee.\n\nBarindra Kumar Ghosh:  A key figure in the early Indian revolutionary movement, associated with the Anushilan Samiti in Bengal.  He was involved in revolutionary activities, including conspiracies and attempts at armed rebellion against British rule. His activities were largely confined to Bengal.\n\nJogesh Chandra Chatterjee:  Another member of the Anushilan Samiti, involved in the early revolutionary movement in Bengal.  The provided text doesn't detail his specific activities, but places him within the context of extremist nationalist groups in Bengal.\n\nRash Behari Bose: A prominent Indian revolutionary and independence activist.  He played a significant role in the Ghadar Party, a transnational organization aiming for an armed revolt against British rule in India. He was involved in planning and organizing revolutionary activities, particularly among Indian immigrants in North America.  He later played a role in the Berlin Committee for Indian Independence during World War I.\n"
    },
    {
        "Q.No.": 54,
        "question_text": "With reference to the proposals of Cripps Mission, consider the following statements:\n1. The Constituent Assembly would have members nominated by the Provincial Assemblies as well as the Princely States.\n2. Any Province, which is not prepared to accept the new Constitution would have the right to sign a separate agreement with Britain regarding its future status.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:The Cripps Mission proposals did not include the nomination of members to the Constituent Assembly by Princely States.  Statement 1 is incorrect. The Cripps proposals did, however, grant any province the right to opt out of the new Constitution and negotiate a separate agreement with Britain regarding its future status. Statement 2 is correct.  Therefore, only statement 2 is correct.\n\n\nCripps Mission:  A mission sent to India in 1942 by the British government to negotiate a new constitutional framework for India during World War II.  Its proposals, while offering dominion status after the war, failed to satisfy the demands of the Indian National Congress and the Muslim League, ultimately leading to its rejection.\n\nConstituent Assembly: A body elected to draft a constitution for independent India.  The composition and powers of the Constituent Assembly were a major point of contention during the independence negotiations.\n\nPrincely States:  Hundreds of independent states ruled by princes under British paramountcy. Their integration into the Indian Union was a complex process after independence.\n\nProvincial Assemblies:  Legislative bodies in the British Indian provinces.  Their role in the formation of the Constituent Assembly was a key element of the constitutional proposals.\n"
    },
    {
        "Q.No.": 55,
        "question_text": "With reference to Indian history, consider the following texts:\n1. Nettipakarana\n2. Parishishtaparvan\n3. Avadanashataka\n4. Trishashtilakshana Mahapurana\nWhich of the above are Jaina texts?",
        "option_a": "1, 2 and 3",
        "option_b": "2 and 4 only",
        "option_c": "1, 3 and 4",
        "option_d": "2, 3 and 4",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:  The Nettipakarana, Avadanashataka, and Trishashtilakshana Mahapurana are Jaina texts.  The Parishishtaparvan is a part of the Mahabharata, a Hindu epic.\n\nNettipakarana: A Jaina text focusing on the principles of Jain philosophy and ethics.  It offers insights into Jain epistemology and metaphysics.\n\nParishishtaparvan:  A supplementary section of the Mahabharata, a major Hindu epic narrating the story of the Kuru dynasty and the Pandavas and Kauravas.  It contains various supplementary narratives and genealogical information.\n\nAvadanashataka: A collection of Jaina stories and legends, showcasing the lives and teachings of various Jaina figures and illustrating moral and spiritual lessons.\n\nTrishashtilakshana Mahapurana: A major Jaina text, a part of the larger Mahapurana tradition, which details the lives and teachings of the Tirthankaras.\n"
    },
    {
        "Q.No.": 56,
        "question_text": "With reference to Indian history, consider the following pairs:\n   Historical person        Known as\n1. Aryadeva                 Jaina scholar\n2. Dignaga                  Buddhist scholar\n3. Nathamuni                Vaishnava scholar\nHow many pairs given above are correctly matched?",
        "option_a": "None of the pairs",
        "option_b": "Only one pair",
        "option_c": "Only two pairs",
        "option_d": "All three pairs",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation: Aryadeva was a prominent Buddhist scholar, not a Jaina scholar. Dignaga was indeed a renowned Buddhist scholar, known for his contributions to Buddhist logic. Nathamuni was a significant Vaishnava scholar and philosopher. Therefore, only two pairs (Dignaga-Buddhist scholar and Nathamuni-Vaishnava scholar) are correctly matched.\n\nAryadeva: A major figure in the development of Mahayana Buddhism, Aryadeva's works significantly influenced Buddhist philosophy and practice.  His teachings emphasized the importance of emptiness (sunyata) and the Bodhisattva path.\n\nDignaga: A highly influential Buddhist logician and epistemologist, Dignaga revolutionized Buddhist philosophy with his rigorous system of logic and analysis of knowledge. His work profoundly impacted the development of Indian philosophical thought.\n\nNathamuni: A revered Vaishnava scholar, Nathamuni played a crucial role in systematizing and preserving the Vaishnava tradition, particularly the Sri Vaishnava school. He is known for his commentaries on the works of Alvars and for his contributions to Vaishnava theology and ritual.\n"
    },
    {
        "Q.No.": 57,
        "question_text": "With reference to Indian history, consider the following statements:\n1. The first Mongol invasion of India happened during the reign of Jalal-ud-din Khalji.\n2. During the reign of Ala-ud-din Khalji, one Mongol assault marched up to Delhi and besieged the city.\n3. Muhammad-bin-Tughlaq temporarily lost portions of north-west of his kingdom to Mongols.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. The first Mongol invasion of India occurred during the reign of Iltutmish, not Jalaluddin Khalji.  Jalaluddin Khalji, the first Khalji ruler of the Delhi Sultanate, faced a Mongol invasion, but it wasn't the first to hit India.\n\nStatement 2 is correct. During Alauddin Khalji's reign, a Mongol army reached Delhi and besieged the city.  Alauddin Khalji successfully repelled several Mongol incursions, showcasing his military prowess.\n\nStatement 3 is correct.  Muhammad bin Tughlaq, a ruler known for his ambitious but often disastrous policies, lost parts of the northwest of his kingdom to Mongol incursions.  His reign saw continued pressure from Mongol forces.\n\n\n**Short notes on named entities:**\n\n* **Jalaluddin Khalji:** The first ruler of the Khalji dynasty in the Delhi Sultanate. His reign was relatively short, but he implemented some significant administrative reforms.  He also faced Mongol incursions.\n\n* **Alauddin Khalji:**  A powerful and ambitious ruler of the Delhi Sultanate, known for his military victories, including repelling Mongol invasions and expanding the empire.  He implemented strict economic policies.\n\n* **Muhammad bin Tughlaq:** A controversial ruler of the Tughlaq dynasty, known for his ambitious but often impractical and disastrous schemes, including currency reforms and relocation of the capital. His reign saw continued Mongol pressure on the northwest frontier.\n\n* **Mongols:** A nomadic group originating from Central Asia, known for their extensive empire under Genghis Khan and subsequent leaders. Their military prowess and devastating campaigns led to significant impacts across Eurasia, including incursions into India.\n\n* **Delhi Sultanate:** A series of Turkic and other dynasties that ruled over much of northern India from the 13th to 16th centuries. The Sultanate saw a succession of rulers, periods of expansion and consolidation, and continual challenges from external and internal forces.  The Mongol invasions were a significant challenge during this period.\n\n* **Iltutmish:**  A powerful ruler of the Delhi Sultanate, who consolidated the power of the Mamluk dynasty and expanded the empire's control. His reign also saw the first Mongol incursions into India.\n"
    },
    {
        "Q.No.": 58,
        "question_text": "With reference to Indian history, who of the following were known as \"Kulah-Daran\"?",
        "option_a": "Arab merchants",
        "option_b": "Qalandars",
        "option_c": "Persian calligraphists",
        "option_d": "Sayyids",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:The provided text does not explicitly state who were known as \"Kulah-Daran\".  Therefore, I cannot definitively answer this question based solely on the given context.  The provided text focuses on various aspects of Indian history, including language, literature, politics, and culture, but it does not contain the answer to this specific question.\n\nFurther information is needed to accurately identify who were known as \"Kulah-Daran\" in Indian history.\n\nShort notes on named entities:\n\n* **Qalandars:**  Sufi ascetics known for their wandering lifestyle and ecstatic practices. They often rejected conventional societal norms and lived a life of poverty and devotion. Their influence spread across various regions of the Islamic world, including India.\n\n* **Sayyids:** Descendants of the Prophet Muhammad through his lineage. They held a position of high religious and social prestige in many Muslim societies, including India.  Their influence extended to various aspects of life, including politics and religious leadership.\n\n* **Arab merchants:**  Arab traders played a crucial role in the economic and cultural exchange between India and the Middle East. Their maritime trade networks connected various regions, facilitating the flow of goods, ideas, and religious beliefs.\n\n* **Persian calligraphists:**  Calligraphy held a significant position in Persian art and culture.  Skilled calligraphers were highly respected for their artistic abilities and mastery of the Persian script.  Their work adorned manuscripts, architectural features, and other objects of cultural significance.\n\n* **Sultan Zani-VIII. Abidin:**  A ruler whose name appears in the context, likely relating to a specific historical period or event in Kashmir. More information is needed to provide a detailed account.\n\n* **Rajtarangini:** A historical chronicle of Kashmir written by Kalhana. It provides valuable insights into the political, social, and cultural history of the region.\n\n* **Mahabharata:** One of the two major Sanskrit epics of ancient India. It narrates a complex narrative involving the Kurukshetra War and explores themes of dharma, karma, and human nature.\n\n* **Amir Khusrau:** A renowned poet, musician, and writer of the Delhi Sultanate period. He is credited with blending Persian and Hindi musical traditions and is considered a pioneer of Urdu language.\n\n* **Ziauddin Barani:**  A prominent historian of the Delhi Sultanate period. His works provide valuable information about the political and social dynamics of the time.\n\n* **Aurangzeb:** A Mughal emperor known for his religious conservatism and administrative reforms. His reign witnessed both significant achievements and periods of conflict.\n\n* **Fatwa-i-Alamgiri:** A comprehensive legal manual compiled during the reign of Aurangzeb. It aimed to codify Islamic law and serve as a guide for legal decisions.  \n\nThe other names and terms mentioned require more context from the original source to provide accurate short notes.\n"
    },
    {
        "Q.No.": 59,
        "question_text": "With reference to Indian history, consider the following statements:\n1. The Dutch established their factories/warehouses on the east coast on lands granted to them by Gajapati rulers.\n2. Alfonso de Albuquerque captured Goa from the Bijapur Sultanate.\n3. The English East India Company established a factory at Madras on a plot of land leased from a representative of the Vijayanagara empire.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1: The Dutch initially established trading posts on the Coromandel Coast, but they received land grants from the Vijayanagara Empire, not the Gajapati rulers.  The Gajapati rulers controlled Odisha, while the Dutch presence was primarily in the south.\n\nStatement 2:  Alfonso de Albuquerque, a Portuguese admiral, captured Goa from the Bijapur Sultanate in 1510.\n\nStatement 3: The English East India Company established a factory at Madras in 1639.  They leased the land from a representative of the Vijayanagara Empire.\n\n\n**Short Notes on Named Entities:**\n\n* **Gajapati rulers:**  A dynasty that ruled parts of eastern India (present-day Odisha) from the 15th century onwards. Known for their powerful empire and patronage of art and culture.\n\n* **Alfonso de Albuquerque:** A Portuguese admiral and governor of Portuguese India.  He played a crucial role in establishing Portuguese dominance in the Indian Ocean. His military strategies and conquests were instrumental in shaping the early history of European colonization in India.\n\n* **Bijapur Sultanate:** One of the five Deccan Sultanates, a powerful independent kingdom in the Deccan region of India during the medieval period.  Known for its advanced architecture and sophisticated administration.\n\n* **Vijayanagara empire:** A powerful South Indian empire that flourished from the 14th to the 16th centuries.  Its administration, trade, architecture and cultural influence were significant in South India and beyond.\n\n* **English East India Company:** A powerful British trading company that played a major role in the colonization of India. Initially focused on trade, it gradually expanded its political influence, eventually becoming a dominant force in India.\n\n* **Madras:**  A major port city on the Coromandel Coast of India, established by the British East India Company. It grew to become a significant center of trade and administration.\n\n* **Dutch:**  The Dutch East India Company (VOC) was a major player in the early stages of European trade in Asia, including India.  They competed with the Portuguese, English, and French for control of trade routes and territories.\n"
    },
    {
        "Q.No.": 60,
        "question_text": "According to Kautilya's Arthashastra, which of the following are correct?\n1. A person could be a slave as a result of a judicial punishment.\n2. If a female slave bore her master a son, she was legally free.\n3. If a son born to a female slave was fathered by her master, the son was entitled to the legal status of the master's son.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation: According to Kautilya's Arthashastra, a person could become a slave as a result of judicial punishment (statement 1).  If a female slave bore her master a son, she did *not* automatically gain freedom (statement 2 is incorrect). However, if the son was fathered by the master, the son was entitled to the legal status of the master's son (statement 3 is correct).  Therefore, only statements 1 and 3 are correct.\n\nKautilya's Arthashastra:  A treatise on statecraft, economics, and military strategy written by Kautilya (also known as Chanakya) in ancient India.  It provides insights into the social and legal systems of the time, including laws related to slavery.\n\nSlavery:  The practice of owning another human being as property.  In ancient India, slavery existed and was regulated by law, as described in the Arthashastra.  Various ways of becoming a slave existed, including judicial punishments.\n"
    },
    {
        "Q.No.": 61,
        "question_text": "Consider the following statements:\n1. Tight monetary policy of US Federal Reserve could lead to capital flight.\n2. Capital flight may increase the interest cost of firms with existing External Commercial Borrowings (ECBs).\n3. Devaluation of domestic currency decreases the currency risk associated with ECBs.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1: A tight monetary policy by the US Federal Reserve (the central bank of the US) typically involves raising interest rates.  Higher US interest rates make US assets more attractive to foreign investors, leading to capital outflow from other countries, including a potential capital flight from those countries.  Therefore, statement 1 is correct.\n\nStatement 2: Capital flight increases the demand for the US dollar.  This strengthens the dollar, making it more expensive for firms in other countries to repay their External Commercial Borrowings (ECBs), which are loans denominated in foreign currencies (often US dollars). The higher exchange rate increases the cost of repayment in the domestic currency. Therefore, statement 2 is correct.\n\nStatement 3: Devaluation of the domestic currency makes the domestic currency weaker relative to the foreign currency in which the ECB is denominated.  This reduces the amount of domestic currency needed to repay the loan, thereby decreasing the currency risk for the firm. Therefore, statement 3 is incorrect.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **US Federal Reserve:** The central bank of the United States, responsible for monetary policy, including setting interest rates and managing the money supply.  Its actions significantly impact global financial markets.\n\n* **Tight monetary policy:** A policy aimed at reducing inflation by decreasing the money supply and raising interest rates. This can curb economic growth.\n\n* **Capital flight:** A large-scale movement of capital out of a country, often due to economic or political instability. It can negatively impact the exchange rate and economic growth.\n\n* **External Commercial Borrowings (ECBs):** Loans raised by domestic entities from foreign lenders, usually in foreign currencies.  They provide access to cheaper funding but expose borrowers to currency risk.\n\n* **Currency risk:** The risk that the value of a currency will change, affecting the value of assets or liabilities denominated in that currency.  It is a major concern for international transactions.\n\n* **Devaluation:** A deliberate downward adjustment of a country's currency value relative to other currencies. It can make exports cheaper but also increase import costs.\n"
    },
    {
        "Q.No.": 62,
        "question_text": "Consider the following States:\n1. Andhra Pradesh\n2. Kerala\n3. Himachal Pradesh\n4. Tripura\nHow many of the above are generally known as tea-producing States?",
        "option_a": "Only one State",
        "option_b": "Only two States",
        "option_c": "Only three States",
        "option_d": "All four States",
        "correct_option": "b",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:Based on the provided text, only two of the listed states are explicitly mentioned as tea-producing states.  Assam is noted for tea production in the context discussing tea's climate and soil requirements (\"norm - eastern part / Deep + fertile well drained soils / Norm + moist climate all throughout year / Frequent showers well distributed over the year. → Asian, W.B, Nilgiris\").  While the text mentions Andhra Pradesh, it's in relation to sugarcane and other crops, not tea.  The text does not provide information about the tea production in Kerala, Himachal Pradesh, or Tripura. Therefore, only two states among the given options are generally known for tea production.\n\nAndhra Pradesh: A state in southern India known for its diverse agricultural production, including rice, sugarcane, and other crops.\n\nKerala: A state on the southwestern coast of India, famous for its spices, rubber, and coconut plantations.\n\nHimachal Pradesh: A state in the Himalayas known for its hill stations, apple orchards, and tourism.\n\nTripura: A state in northeastern India known for its tea and rubber production.\n"
    },
    {
        "Q.No.": 63,
        "question_text": "Consider the following statements:\n1. In India, credit rating agencies are regulated by Reserve Bank of India.\n2. The rating agency popularly known as ICRA is a public limited company.\n3. Brickwork Ratings is an Indian credit rating agency.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  Credit rating agencies in India are regulated by the Securities and Exchange Board of India (SEBI), not the Reserve Bank of India (RBI).  The RBI primarily focuses on monetary policy and banking regulation. SEBI is the regulator for the securities market, which includes credit rating agencies.\n\nStatement 2 is correct. ICRA (Investment Information and Credit Rating Agency of India Limited) is a public limited company.\n\nStatement 3 is correct. Brickwork Ratings is an Indian credit rating agency.\n\n\n**Short notes on named entities:**\n\n* **Reserve Bank of India (RBI):** The central bank of India, responsible for maintaining monetary stability, managing currency, and regulating the banking system.  Its actions significantly impact the Indian economy.\n\n* **ICRA:** A leading credit rating agency in India, providing ratings on debt instruments and other financial products.  It plays a crucial role in assessing creditworthiness and informing investment decisions.\n\n* **Brickwork Ratings:** An Indian credit rating agency that provides credit ratings and research services to various sectors.  It contributes to the overall credit rating landscape in India.\n\n* **Securities and Exchange Board of India (SEBI):**  The regulatory body for the securities market in India, responsible for protecting investor interests and ensuring the orderly functioning of the market.  Its role is crucial for market integrity and transparency.\n"
    },
    {
        "Q.No.": 64,
        "question_text": "With reference to the 'Banks Board Bureau (BBB)', which of the following statements are correct?\n1. The Governor of RBI is the Chairman of BBB.\n2. BBB recommends for the selection of heads for Public Sector Banks.\n3. BBB helps the Public Sector Banks in developing strategies and capital raising plans.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation: The Banks Board Bureau (BBB) is an Indian institution that plays a crucial role in the governance of public sector banks.  Statement 1 is incorrect; the Governor of the Reserve Bank of India (RBI) is not the Chairman of the BBB.  Statement 2 is correct; a key function of the BBB is to recommend the selection of heads for Public Sector Banks (PSBs). Statement 3 is also correct; the BBB assists PSBs in formulating strategies and developing plans for raising capital.  Therefore, only statements 2 and 3 are correct.\n\nReserve Bank of India (RBI): The central bank of India, responsible for monetary policy, regulating banks, and maintaining financial stability.\n\nBanks Board Bureau (BBB):  An institution established by the Indian government to improve the governance and performance of public sector banks.  It recommends appointments of top management and advises on strategies.\n\nPublic Sector Banks (PSBs): Banks owned and controlled by the Indian government.  They play a significant role in the country's financial system.\n"
    },
    {
        "Q.No.": 65,
        "question_text": "With reference to Convertible Bonds, consider the following statements:\n1. As there is an option to exchange the bond for equity, Convertible Bonds pay a lower rate of interest.\n2. The option to convert to equity affords the bondholder a degree of indexation to rising consumer prices.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:Convertible bonds offer the bondholder the option to convert the bond into equity shares of the issuing company at a predetermined price or conversion ratio.  This option reduces the risk for the bondholder, as they have a potential upside if the company's stock price rises.  Because of this reduced risk, convertible bonds typically offer a lower interest rate than comparable non-convertible bonds. Statement 1 is correct.\n\nStatement 2 is incorrect. While rising stock prices benefit the bondholder through the conversion option, convertible bonds do not inherently offer indexation to rising consumer prices.  Indexation protects against inflation, which affects the purchasing power of money, not necessarily the value of a company's stock.  Stock prices are influenced by a multitude of factors beyond just inflation.\n\n\nConvertible Bonds:  A type of debt security that can be converted into a company's equity at a specified price and time. They combine features of both debt and equity.\n\nEquity: Ownership stake in a company, represented by shares of stock.  Equity holders have a claim on the company's assets and earnings, but also bear the risk of losses.\n\nIndexation:  Adjusting a financial instrument's value to account for inflation. This maintains the instrument's real value over time.\n"
    },
    {
        "Q.No.": 66,
        "question_text": "Consider the following:\n1. Asian Infrastructure Investment Bank\n2. Missile Technology Control Regime\n3. Shanghai Cooperation Organisation\nIndia is a member of which of the above?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation: India is a member of the Asian Infrastructure Investment Bank (AIIB),  the Shanghai Cooperation Organisation (SCO), but not the Missile Technology Control Regime (MTCR).\n\nAIIB: A multilateral development bank established in 2015 with the aim of financing infrastructure projects in Asia.  India is a founding member and the second-largest shareholder after China.  The bank's projects cover various sectors, including transportation, energy, and telecommunications.\n\nMTCR: An informal and voluntary regime established in 1987 to limit the proliferation of missiles and related technologies capable of delivering weapons of mass destruction.  Membership requires adherence to strict guidelines on the export of missile technologies.  India joined the MTCR in 2016.\n\nSCO: A Eurasian political, economic, and security organization founded in 2001.  It aims to promote cooperation among its member states on various issues, including security, trade, and culture. India became a full member in 2017.\n"
    },
    {
        "Q.No.": 67,
        "question_text": "Consider the following statements:\n1. Vietnam has been one of the fastest growing economies in the world in the recent years.\n2. Vietnam is led by a multi-party political system.\n3. Vietnam's economic growth is linked to its integration with global supply chains and focus on exports.\n4. For a long time Vietnam's low labour costs and stable exchange rates have attracted global manufacturers.\n5. Vietnam has the most productive e-service sector in the Indo-Pacific region.\nWhich of the statements given above are correct?",
        "option_a": "2 and 4",
        "option_b": "3 and 5",
        "option_c": "1, 3 and 4",
        "option_d": "1 and 2",
        "correct_option": "c",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation:\n\nStatement 1: Vietnam's rapid economic growth in recent years is widely documented.\n\nStatement 2: Vietnam operates under a one-party system, not a multi-party system.  The Communist Party of Vietnam holds sole power.\n\nStatement 3: Vietnam's economic success is strongly tied to its participation in global supply chains and export-oriented strategy.\n\nStatement 4: Low labor costs and exchange rate stability have been significant factors attracting foreign manufacturers to Vietnam for a considerable period.\n\nStatement 5:  The provided text does not contain information to support or refute this statement regarding Vietnam's e-service sector productivity.\n\n\nTherefore, statements 1, 3, and 4 are correct.  Option (c) is the correct answer.\n\n\nVietnam: A Southeast Asian nation that has experienced remarkable economic growth, driven by its integration into global manufacturing and export markets.  Its political system is a one-party state ruled by the Communist Party of Vietnam.\n\nIndo-Pacific Region: A vast geographical area encompassing the Indian and Pacific Oceans, including their bordering lands and seas.  It's a region of increasing geopolitical significance.\n\nMulti-party political system: A system where multiple political parties compete for power, typically through elections.  This contrasts with one-party or authoritarian systems.\n\nGlobal supply chains: The interconnected networks of businesses involved in the production and distribution of goods across international borders.\n\nLow labor costs: Wages paid to workers in a country are comparatively low compared to other nations, making it attractive for businesses seeking to reduce production costs.\n\nStable exchange rates:  A currency's value remains relatively constant against other currencies, reducing uncertainty for businesses involved in international trade.\n"
    },
    {
        "Q.No.": 68,
        "question_text": "In India, which one of the following is responsible for maintaining price stability by controlling inflation?",
        "option_a": "Department of Consumer Affairs",
        "option_b": "Expenditure Management Commission",
        "option_c": "Financial Stability and Development Council",
        "option_d": "Reserve Bank of India",
        "correct_option": "d",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation:The Reserve Bank of India (RBI) is primarily responsible for maintaining price stability in India by controlling inflation.  It does this through monetary policy tools such as setting interest rates, managing the money supply, and influencing credit conditions.\n\nThe Department of Consumer Affairs is involved in consumer protection and welfare, but not directly in controlling inflation. The Expenditure Management Commission is not a recognized entity related to inflation control. The Financial Stability and Development Council coordinates financial sector regulation and development, but the primary responsibility for inflation control rests with the RBI.\n"
    },
    {
        "Q.No.": 69,
        "question_text": "With reference to Non-Fungible Tokens (NFTs), consider the following statements:\n1. They enable the digital representation of physical assets.\n2. They are unique cryptographic tokens that exist on a blockchain.\n3. They can be traded or exchanged at equivalency and therefore can be used as a medium of commercial transactions.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. NFTs can represent physical assets through digital tokens, linking a unique digital identifier to a physical item.  Statement 2 is also correct. NFTs are unique cryptographic tokens residing on a blockchain, making them verifiable and non-interchangeable. Statement 3 is incorrect.  NFTs are *not* fungible; their value and uniqueness prevent them from being used as a medium of exchange at equivalency like traditional currency.  Therefore, only statements 1 and 2 are correct.\n\nNon-Fungible Tokens (NFTs):  Unique digital assets verifiable on a blockchain, representing ownership of something.  Their value is derived from scarcity and perceived worth.\n\nBlockchain: A distributed, immutable ledger recording transactions across a network of computers, ensuring transparency and security.  Cryptography secures the blockchain.\n"
    },
    {
        "Q.No.": 70,
        "question_text": "Consider the following pairs:\n   Reservoirs           States\n1. Ghataprabha          Telangana\n2. Gandhi Sagar         Madhya Pradesh\n3. Indira Sagar         Andhra Pradesh\n4. Maithon              Chhattisgarh\nHow many pairs given above are not correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "Only three pairs",
        "option_d": "All four pairs",
        "correct_option": "c",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:  The correct matching of reservoirs and states are as follows:\n\n* Ghataprabha Reservoir is located in Karnataka, not Telangana.\n* Gandhi Sagar Dam is located in Madhya Pradesh.\n* Indira Sagar Dam is located in Madhya Pradesh, not Andhra Pradesh.\n* Maithon Dam is located in Jharkhand, not Chhattisgarh.\n\nTherefore, three out of the four pairs are incorrectly matched.\n\nShort notes on named entities:\n\nGhataprabha Reservoir: A reservoir in Karnataka, India, created by the Ghataprabha Dam on the Ghataprabha River, a tributary of the Krishna River.  It is a significant source of irrigation in the region.\n\nGandhi Sagar Dam: A dam located on the Chambal River in Madhya Pradesh, India. It forms a large reservoir and is a crucial part of the Chambal Valley Project, providing irrigation and hydropower.\n\nIndira Sagar Dam: A dam in Madhya Pradesh, India, also situated on the Narmada River. Part of the Narmada Valley Project, it is a major source of irrigation and hydroelectric power.\n\nMaithon Dam: A dam located in Jharkhand, India, on the Barakar River, a tributary of the Damodar River. It is primarily used for irrigation and power generation.  It is associated with the Damodar Valley Corporation (DVC).\n"
    },
    {
        "Q.No.": 71,
        "question_text": "In India, which one of the following compiles information on industrial relations, employment and lay-off in factories employing workers?",
        "option_a": "Central Statistics Office",
        "option_b": "Labour Bureau",
        "option_c": "Department for Promotion of Industry and Internal Trade",
        "option_d": "National Technical Manpower Information System",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation:The Labour Bureau in India compiles information on industrial relations, employment, and layoffs in factories employing workers.  The Central Statistics Office (CSO) primarily focuses on broader economic statistics. The Department for Promotion of Industry and Internal Trade (DPIIT) promotes industrial growth and trade. The National Technical Manpower Information System (NTMIS) deals with technical manpower data.\n\nShort notes on keywords and named entities:\n\n* **Labour Bureau:** A governmental organization under the Ministry of Labour & Employment, responsible for collecting, compiling, and publishing labor statistics in India, including data on wages, earnings, industrial relations, and employment.\n\n* **Central Statistics Office (CSO):**  The primary agency responsible for collecting, compiling, analyzing, and disseminating official statistical data related to various aspects of the Indian economy, covering a wide range of sectors.\n\n* **Department for Promotion of Industry and Internal Trade (DPIIT):** A department under the Ministry of Commerce and Industry, responsible for formulating and implementing policies related to industrial development, internal trade, and investment promotion in India.\n\n* **National Technical Manpower Information System (NTMIS):** A database system aimed at providing information on the availability and utilization of technical manpower in India.  It helps track skills, qualifications, and employment trends in the technical workforce.\n"
    },
    {
        "Q.No.": 72,
        "question_text": "In India, what is the role of the Coal Controller's Organization (CCO) of India?\n1. CCO is the major source of Coal Statistics in Government of India.\n2. It monitors any objection relating to Government's auction of coal mines.\n3. It ensures progress of development of coal mines and timely coal acquisition to coal-bearing companies.\n4. It ensures that coal mining users in the delivery of coal to end users.\nSelect the correct answer using the code given below:",
        "option_a": "1, 2 and 3",
        "option_b": "2, 3 and 4",
        "option_c": "1, 2 and 4",
        "option_d": "1, 3 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation:The Coal Controller's Organization (CCO) in India plays a crucial role in the coal sector.  Its primary function is to collect and maintain coal statistics for the Indian government (statement 1).  The CCO also monitors objections related to government coal mine auctions (statement 2).  Furthermore, it oversees the development progress of coal mines and ensures timely coal acquisition by coal-bearing companies (statement 3). Statement 4 is incorrect; the CCO's role doesn't directly involve ensuring coal delivery to end-users.  That's handled by the coal companies and transportation networks.  Therefore, only statements 1, 2, and 3 accurately describe the CCO's functions.\n\nThere is no information provided in the context to explain the other named entities.\n"
    },
    {
        "Q.No.": 73,
        "question_text": "If a particular area is brought under the Fifth Schedule of the Constitution of India, which of the following statements best reflects the consequence of such a notification?",
        "option_a": "This would prevent the transfer of land of the tribal people to non-tribal people.",
        "option_b": "This would convert that area into a local self-governing body in that area.",
        "option_c": "This would create a local self-governing body in that area.",
        "option_d": "The State having such area would be declared a Special Category State.",
        "correct_option": "a",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Bringing an area under the Fifth Schedule of the Constitution of India grants the state government special powers to regulate the administration and land ownership in tribal areas.  This primarily aims to protect the rights of tribal communities and prevent the exploitation of their land.  Option (a) directly reflects this consequence by preventing land transfer from tribal people to non-tribal people.  Options (b), (c), and (d) are incorrect; the Fifth Schedule doesn't automatically create local self-governing bodies or declare a state a Special Category State.  The Fifth Schedule focuses on the administration of Scheduled Areas and the protection of tribal communities.\n"
    },
    {
        "Q.No.": 74,
        "question_text": "Consider the following statements:\n1. The India Sanitation Coalition is a government-led platform for accelerating sanitation and funded by the World Health Organization.\n2. The Apex Body of the Ministry of Housing and Urban Affairs in the Government of India provides leadership to the Swachh Bharat Mission - Urban and addresses the challenges of urban India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. The India Sanitation Coalition is a multi-stakeholder platform, not solely government-led, and its funding sources are diverse, not limited to the World Health Organization.  Statement 2 is correct. The Apex Body of the Ministry of Housing and Urban Affairs guides the Swachh Bharat Mission-Urban.\n\nIndia Sanitation Coalition: A platform involving government, NGOs, private sector, and international organizations to accelerate sanitation improvements in India.  Funding comes from multiple sources.\n\nSwachh Bharat Mission - Urban: A flagship program of the Indian government's Ministry of Housing and Urban Affairs aimed at improving sanitation in urban areas.\n\nMinistry of Housing and Urban Affairs:  A ministry of the Government of India responsible for housing, urban development, and sanitation policies and programs.\n"
    },
    {
        "Q.No.": 75,
        "question_text": "Which one of the following has been constituted under the Environment (Protection) Act, 1986?",
        "option_a": "Central Ground Water Board",
        "option_b": "Central Water Commission",
        "option_c": "National River Conservation Authority",
        "option_d": "National Water Development Agency",
        "correct_option": "c",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation: The National River Conservation Authority (NRCA) was constituted under the Environment (Protection) Act, 1986.  The NRCA is responsible for the conservation of rivers in India.\n\nThe Central Ground Water Board (CGWB) is an organization under the Ministry of Jal Shakti, Government of India. It is responsible for the groundwater management in the country.\n\nThe Central Water Commission (CWC) is an organization under the Ministry of Jal Shakti, Government of India. It is responsible for the planning, development, and management of water resources in the country.\n\nThe National Water Development Agency (NWDA) is an organization under the Ministry of Jal Shakti, Government of India. It is responsible for the planning and implementation of national-level water projects.\n"
    },
    {
        "Q.No.": 76,
        "question_text": "With reference to the “United Nations Framework Convention on Climate Change”, consider the following statements:\n1. It is a Committee set up by the UN Security Council and meets in March, June and September every year.\n2. It traditionally works under its Secretariat.\n3. It assesses the credentials of all UN Members before submitting a report to the General Assembly for approval.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: The United Nations Framework Convention on Climate Change (UNFCCC) is an international treaty, not a committee.  Statement 1 is incorrect because it's not a committee of the UN Security Council and its meeting schedule isn't specified in the provided text.  Statement 2 is correct; the UNFCCC operates under its Secretariat based in Bonn, Germany.  Statement 3 is incorrect; the UNFCCC doesn't assess UN member credentials; that's the role of the UN General Assembly.  Therefore, only statement 2 is correct.\n\n\nUnited Nations Framework Convention on Climate Change (UNFCCC): An international environmental treaty adopted in 1992 at the Earth Summit in Rio de Janeiro. Its objective is to stabilize greenhouse gas concentrations to prevent dangerous anthropogenic interference with the climate system.  It has 197 Parties (countries and the European Union).  The UNFCCC Secretariat supports the implementation of the Convention and its related agreements.\n\nUN Security Council: One of the six principal organs of the United Nations, with primary responsibility for the maintenance of international peace and security.  It consists of fifteen members: five permanent (China, France, Russia, the United Kingdom, and the United States) and ten non-permanent members elected for two-year terms.\n\nGeneral Assembly: The main deliberative, policymaking and representative organ of the United Nations.  It's composed of all UN Member States, each with one vote.  It considers and acts upon a broad range of matters, including the admission of new members, the maintenance of international peace and security, and the coordination of the economic, social, and humanitarian work of the United Nations.\n"
    },
    {
        "Q.No.": 77,
        "question_text": "Which one of the following statements best describes the 'Polar Code'?",
        "option_a": "It is the international code of safety for ships operating in polar waters.",
        "option_b": "It is the agreement of the countries around the North Pole regarding the demarcation of their territories in the polar region.",
        "option_c": "It is a set of norms to be followed by the countries whose scientists undertake research studies in the North Pole and South Pole.",
        "option_d": "It is a trade and security agreement of the member countries of the Arctic Council.",
        "correct_option": "a",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation: The Polar Code is the international code for ships operating in polar waters, focusing on safety.  It addresses the unique challenges of navigating and operating vessels in these harsh environments.\n\nThe Arctic Council is an intergovernmental forum promoting cooperation on Arctic issues.  UNCLOS (United Nations Convention on the Law of the Sea) is a treaty establishing a legal framework for marine and ocean activities.  The Svalbard Treaty governs the Svalbard archipelago, including research activities.  NCAOR (National Centre for Antarctic and Ocean Research) is an Indian research organization.  Ny-Ålesund is a research settlement in Svalbard.  The other options are incorrect; there's no single agreement defining polar territories or research norms across all polar regions.\n"
    },
    {
        "Q.No.": 78,
        "question_text": "With reference to the United Nations General Assembly, consider the following statements:\n1. The UN General Assembly can grant observer status to the non-member States.\n2. Inter-governmental organisations can seek observer status in the UN General Assembly.\n3. Permanent Observers in the UN General Assembly can maintain missions at the UN headquarters.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation:The UN General Assembly can grant observer status to non-member states (Statement 1 is correct).  Intergovernmental organizations can also seek observer status in the UN General Assembly (Statement 2 is correct). Permanent observers can maintain missions at UN headquarters (Statement 3 is correct). Therefore, all three statements are correct.\n\nUnited Nations General Assembly: The main deliberative, policymaking and representative organ of the UN. It consists of all member states, each with one vote.  Its powers include making recommendations on any matter within the scope of the UN Charter.\n\nNon-member States: States that are not members of the UN but can participate in its work in various capacities, including having observer status.\n\nIntergovernmental Organizations: Organizations composed of sovereign states that cooperate on matters of common interest.  Examples include the World Health Organization (WHO) and the International Monetary Fund (IMF).  Many have observer status at the UNGA.\n\nPermanent Observers: Entities granted permanent observer status by the UN General Assembly, allowing for continuous representation and participation in its work.  They often maintain permanent missions at UN headquarters.\n"
    },
    {
        "Q.No.": 79,
        "question_text": "With reference to the \"Tea Board\" in India, consider the following statements:\n1. The Tea Board is a statutory body.\n2. It is a regulatory body attached to the Ministry of Agriculture and Farmers Welfare.\n3. The Tea Board's Head Office is situated in Bengaluru.\n4. The Board has overseas offices at Dubai and Moscow.\nWhich of the statements given above are correct?\n",
        "option_a": "1 and 3",
        "option_b": "2 and 4",
        "option_c": "3 and 4",
        "option_d": "1 and 4",
        "correct_option": "d",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (d)\n\nexplanation:The Tea Board in India is a statutory body,  meaning it's established by an act of Parliament. It falls under the Ministry of Commerce and Industry, not the Ministry of Agriculture and Farmers Welfare. Its head office is in Kolkata, West Bengal, not Bengaluru.  It does have overseas offices, but the locations mentioned (Dubai and Moscow) may not be entirely accurate or up-to-date. Therefore, only statement 1 is definitively correct.  Statement 4 might be partially correct depending on the current status of overseas offices.\n\n\nTea Board: A statutory body in India responsible for the regulation and promotion of the tea industry.  Its functions include quality control, export promotion, and research and development.\n\nMinistry of Agriculture and Farmers Welfare: An Indian government ministry responsible for policies related to agriculture, farmers' welfare, and related sectors.\n\nBengaluru:  The capital city of the Indian state of Karnataka, a major center for technology and industry.\n\nDubai: A city and emirate in the United Arab Emirates, a major global hub for trade and tourism.\n\nMoscow: The capital city of Russia, a major political and economic center.\n"
    },
    {
        "Q.No.": 80,
        "question_text": "Which one of the following best describes the term \"greenwashing\"?",
        "option_a": "Conveying a false impression that a company's products are eco-friendly and environmentally sound",
        "option_b": "Non-inclusion of ecological/environmental costs in the Annual Financial Statements of a country",
        "option_c": "Ignoring the disastrous ecological consequences while undertaking infrastructure development",
        "option_d": "Making mandatory provisions for environmental costs in a government project/programme",
        "correct_option": "a",
        "subject": "polity",
        "year": 2022,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Greenwashing is the practice of making an unsubstantiated or misleading claim about the environmental benefits of a product, service, technology, or company practice. Option (a) accurately reflects this definition.  Option (b) describes a different accounting practice. Option (c) refers to a disregard for environmental consequences, not a deceptive marketing strategy. Option (d) describes a responsible environmental practice, the opposite of greenwashing.\n\n**Short notes on keywords and named entities:**\n\n* **Greenwashing:**  The deceptive practice of making a product or company appear more environmentally friendly than it actually is through marketing and advertising.  It's a form of false advertising that exploits consumer concerns about environmental issues.\n\n* **IPCC:** The Intergovernmental Panel on Climate Change, a UN body that assesses the science related to climate change.  Their reports synthesize scientific findings on climate change impacts, mitigation, and adaptation.\n\n* **COP:** The Conference of the Parties, an annual meeting of the nations that are party to the United Nations Framework Convention on Climate Change (UNFCCC). COP meetings aim to advance international climate action.\n\n* **UNFCCC:** The United Nations Framework Convention on Climate Change, an international environmental treaty adopted in 1992.  Its goal is to stabilize greenhouse gas concentrations to prevent dangerous anthropogenic interference with the climate system.\n\n* **Nationally Determined Contributions (NDCs):**  Commitments made by countries under the Paris Agreement to reduce their greenhouse gas emissions.  They represent countries' individual contributions to the global effort to tackle climate change.\n\n* **UNEP:** The United Nations Environment Programme, a leading global environmental authority that sets global environmental standards, assesses environmental conditions, and promotes international cooperation on environmental issues.\n\n* **Ramsar Convention:** The Convention on Wetlands, an intergovernmental treaty for the conservation and wise use of wetlands.  It designates wetlands of international importance (Ramsar sites) to protect their biodiversity.\n\n* **CITES:** The Convention on International Trade in Endangered Species of Wild Fauna and Flora, an international agreement between governments to regulate international trade in species threatened with extinction.\n\n* **Biodiversity:** The variety of life in the world or in a particular habitat or ecosystem.  It encompasses the diversity of genes, species, and ecosystems.\n\n* **Extended Producer Responsibility (EPR):** A policy approach that holds producers of products responsible for the environmental impacts of their products throughout their life cycle, including end-of-life management.\n\n* **Sustainable Development:** Development that meets the needs of the present without compromising the ability of future generations to meet their own needs.  It balances economic growth, social equity, and environmental protection.\n\n* **Mission LiFE:**  A global mass movement initiated by India to promote individual and collective action for environmental protection through lifestyle changes.  It encourages sustainable consumption and production patterns.\n\n* **National Clean Air Programme (NCAP):** An Indian government initiative to reduce air pollution in major cities.  It sets targets for reducing particulate matter concentrations and promotes various mitigation strategies.\n\n* **National Tiger Conservation Authority (NTCA):**  A statutory body in India responsible for overseeing the conservation of tigers and their habitats.  It implements Project Tiger, a flagship conservation program.\n\n* **Project Tiger:** A centrally sponsored scheme of the Indian government for the in-situ conservation of tigers in designated tiger reserves.\n\n\n"
    },
    {
        "Q.No.": 81,
        "question_text": "Consider the following statements:\n1. High clouds primarily reflect solar radiation and cool the surface of the Earth.\n2. Low clouds have a high absorption of infrared radiation emanating from the Earth's surface and thus cause warming effect.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: High clouds, being primarily composed of ice crystals, are more reflective of solar radiation (albedo effect), leading to a cooling effect on the Earth's surface.  Low clouds, on the other hand, are more effective at absorbing infrared radiation emitted from the Earth's surface, resulting in a warming effect.  Therefore, statement 1 is incorrect, and statement 2 is correct.  Hence, option (b) is the correct answer.\n\nHigh clouds:  These clouds are typically found at altitudes above 6 km and are composed mainly of ice crystals. Their high altitude means they interact more with incoming solar radiation.\n\nLow clouds: These are clouds found at altitudes below 2 km and are generally composed of water droplets. They interact more with outgoing infrared radiation from the Earth's surface.\n\nInfrared radiation:  A type of electromagnetic radiation emitted by the Earth's surface and absorbed by greenhouse gases in the atmosphere.\n\nSolar radiation: Electromagnetic radiation emitted by the Sun.  A significant portion of this radiation reaches the Earth's surface.\n"
    },
    {
        "Q.No.": 82,
        "question_text": "Consider the following statements:\n1. Bidibidi is a large refugee settlement in north-western Kenya.\n2. Some people who fled from South Sudan civil war live in Bidibidi.\n3. Some people who fled from civil war in Somalia live in Dadaab refugee complex in Kenya.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is incorrect because Bidibidi is a large refugee settlement in north-western Uganda, not Kenya.  Statement 2 is correct as Bidibidi houses many refugees who fled the South Sudanese civil war. Statement 3 is also correct; Dadaab refugee complex in Kenya hosts refugees who escaped the Somali civil war. Therefore, only statements 2 and 3 are correct.\n\nBidibidi: A large refugee settlement in northwestern Uganda, primarily housing South Sudanese refugees who fled the country's civil war.  It's known for its large population and humanitarian challenges.\n\nSouth Sudan: A country in East Africa that experienced a devastating civil war resulting in a large-scale refugee crisis, with many fleeing to neighboring countries like Uganda.\n\nDadaab refugee complex: A refugee camp in northeastern Kenya that houses a significant number of Somali refugees who have fled conflict and drought in their homeland. It is one of the largest refugee camps globally and faces significant challenges.\n\nSomalia: A country in the Horn of Africa that has experienced prolonged periods of conflict, instability, and drought, leading to mass displacement and refugee flows.\n"
    },
    {
        "Q.No.": 83,
        "question_text": "Consider the following countries:\n1. Armenia\n2. Azerbaijan\n3. Croatia\n4. Romania\n5. Uzbekistan\nWhich of the above are members of the Organization of Turkic States?",
        "option_a": "1, 2 and 4",
        "option_b": "1 and 3",
        "option_c": "2 and 5",
        "option_d": "3, 4 and 5",
        "correct_option": "c",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:The Organization of Turkic States (OTS) currently comprises Turkey, Azerbaijan, Kazakhstan, Kyrgyzstan, Uzbekistan, and  Hungary.  Therefore, only Azerbaijan (2) and Uzbekistan (5) from the given list are members.\n\nArmenia (1) is a country in the Caucasus region, historically and culturally linked to both the Iranian and Turkic worlds, but not a member of the OTS.  Croatia (3) is a country in southeastern Europe, and Romania (4) is located in southeastern Europe, neither are Turkic states.\n"
    },
    {
        "Q.No.": 84,
        "question_text": "Consider the following statements:\n1. Gujarat has the largest solar park in India.\n2. Kerala has a fully solar powered International Airport.\n3. Goa has the largest floating solar photovoltaic project in India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (b)\n\nexplanation:Based on the provided text, only statement 2 is definitively correct.  The document mentions Kerala having a fully solar-powered international airport.  While the document discusses large solar parks in India, it doesn't specify Gujarat as having the largest.  Similarly, there's no mention of Goa's floating solar project.  Therefore, only statement 2 aligns with the information given.\n\nKerala: A state in southern India known for its backwaters, beaches, and spice plantations.  It's also making strides in renewable energy adoption, as evidenced by its solar-powered airport.\n\nGujarat: A state in western India known for its industrial development and coastline.  It has significant solar energy potential, and while it may have large solar parks, the provided text doesn't confirm it has the largest in India.\n\nGoa: A state in western India known for its beaches and tourism.  The text doesn't provide information to confirm or deny the statement about its floating solar project.\n\nBhadla Solar Park: A large solar power plant in Rajasthan, India.  It's a significant example of India's investments in solar energy.\n\nRewa Solar Power Park: Another large solar power plant in India, highlighting the country's efforts in renewable energy.\n\nNational Solar Mission: A government initiative aimed at promoting solar energy development and deployment in India.  It's a key driver of India's renewable energy progress.\n\nInternational Solar Alliance: An intergovernmental organization headquartered in India that promotes the use of solar energy globally.  It works to facilitate cooperation and technology sharing among its member countries.\n"
    },
    {
        "Q.No.": 85,
        "question_text": "With reference to the United Nations Convention on the Law of Sea, consider the following statements:\n1. A coastal state has the right to establish the breadth of its territorial sea up to a limit not exceeding 12 nautical miles, measured from baseline determined in accordance with the convention.\n2. Ships of all states, whether coastal or land-locked, enjoy the right of innocent passage through the territorial sea.\n3. The Exclusive Economic Zone shall not extend beyond 200 nautical miles from the baseline from which the breadth of the territorial sea is measured.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (d)\n\nexplanation:All three statements accurately reflect provisions of the United Nations Convention on the Law of the Sea (UNCLOS).\n\n1. **Territorial Sea:** UNCLOS allows coastal states to claim a territorial sea extending up to 12 nautical miles from their baselines.  The baseline is the low-water line along the coast.\n\n2. **Innocent Passage:**  UNCLOS grants all ships (coastal and landlocked) the right of innocent passage through the territorial sea.  \"Innocent passage\" means passage that is not prejudicial to the peace, good order, or security of the coastal state.\n\n3. **Exclusive Economic Zone (EEZ):** UNCLOS establishes the EEZ, giving coastal states sovereign rights over resources (fishing, mining, etc.) within 200 nautical miles of their baselines.  This does not grant sovereignty over the waters themselves, but exclusive rights to the resources.\n\nThe UN Convention on the Law of the Sea (UNCLOS) is a treaty that establishes a legal framework for the use of the world's oceans, encompassing navigation, marine resources, and environmental protection.  It defines various maritime zones, including the territorial sea, contiguous zone, exclusive economic zone (EEZ), and continental shelf.  It aims to balance the interests of coastal states with the principle of freedom of the seas for all nations.\n"
    },
    {
        "Q.No.": 86,
        "question_text": "Which one of the following statements best reflects the issue with Senkaku Islands, sometimes mentioned in the news?",
        "option_a": "It is generally believed that they are artificial islands made by a country around South China Sea.",
        "option_b": "China and Japan engage in maritime disputes over these islands in East China Sea.",
        "option_c": "A permanent American military base has been set up there to help Taiwan to increase its defence capabilities.",
        "option_d": "Though International Court of Justice declared them as no man's land, some South-East Asian countries claim them.",
        "correct_option": "b",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation: The Senkaku Islands (also known as Diaoyu Islands by China) are a group of uninhabited islands in the East China Sea.  A major point of contention between China and Japan, the dispute centers on sovereignty claims over these islands and the surrounding waters, rich in fishing resources and potentially containing valuable oil and gas reserves.  Option (b) accurately reflects this ongoing maritime dispute.\n\nOption (a) is incorrect; the Senkaku Islands are not artificial islands.  Artificial islands are created by land reclamation, as seen in some areas of the South China Sea.\n\nOption (c) is incorrect; there is no permanent American military base on the Senkaku Islands.  The US has a strong military presence in the region, but it doesn't have a base specifically on these islands.\n\nOption (d) is incorrect; the International Court of Justice has not declared the islands as \"no man's land,\" and there is no claim by South-East Asian countries (other than the claims of China, which is not a Southeast Asian country, and Japan).  The dispute is primarily between China and Japan.\n\n\n**Short Notes on Named Entities:**\n\n**Senkaku Islands/Diaoyu Islands:**  A group of uninhabited islands in the East China Sea claimed by both Japan and China.  The dispute involves territorial sovereignty, fishing rights, and potential resources in the surrounding waters.  It is a major source of tension in the region.\n\n**East China Sea:** A marginal sea of the western Pacific Ocean, located east of China, south of the Yellow Sea, and north of Taiwan.  It is a strategically important area with significant maritime traffic and resources.\n\n**China:** A large country in East Asia, with a long history and a significant role in global affairs. Its claim to the Senkaku/Diaoyu Islands is a key aspect of its assertive foreign policy.\n\n**Japan:** An island nation in East Asia, known for its advanced economy and technology. Its claim to the Senkaku Islands is rooted in its historical control and current administration of the islands.\n\n**South China Sea:** A marginal sea of the western Pacific Ocean, south of China. It is a region of significant geopolitical importance due to its strategic location and abundant resources.  Many countries have overlapping claims in the area, often leading to disputes.  It is not directly relevant to the Senkaku Islands dispute, which is located in the East China Sea.\n\n**International Court of Justice (ICJ):** The principal judicial organ of the United Nations.  While the ICJ deals with disputes between states, it has not directly ruled on the Senkaku/Diaoyu Islands sovereignty issue.\n"
    },
    {
        "Q.No.": 87,
        "question_text": "Consider the following pairs:\n   Country                                      Important reason for being in the news recently\n1. Chad                                         Setting up of permanent military base by China\n2. Guinea                                       Suspension of Constitution and Government by military\n3. Lebanon                                      Severe and prolonged economic depression\n4. Tunisia                                      Suspension of Parliament by President\nHow many pairs given above are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "Only three pairs",
        "option_d": "All four pairs",
        "correct_option": "c",
        "subject": "polity",
        "year": 2022,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nLet's examine each pair:\n\n1. **Chad - Setting up of a permanent military base by China:**  While China's growing influence in Africa, including Chad, is a significant geopolitical development, there's no definitive evidence from the provided text confirming the establishment of a *permanent* Chinese military base in Chad.  This pairing is likely incorrect.\n\n2. **Guinea - Suspension of the Constitution and Government by military:** The text explicitly mentions a military coup in Guinea leading to the dissolution of the government. This pairing is correct.\n\n3. **Lebanon - Severe and prolonged economic depression:** The text notes Lebanon's economic troubles and mentions protests related to this issue. This pairing is correct.\n\n4. **Tunisia - Suspension of Parliament by President:** The text confirms that Tunisia's president suspended Parliament amidst economic and COVID-19 related protests. This pairing is correct.\n\n\nTherefore, three pairs (Guinea, Lebanon, and Tunisia) are correctly matched.\n\n**Short Notes on Named Entities:**\n\n* **Chad:** A landlocked country in Central Africa, known for its diverse geography and history of political instability.  It's strategically located near other conflict-prone regions.\n\n* **Guinea:** A West African country with a coastline on the Atlantic Ocean.  It's rich in natural resources but has experienced periods of political turmoil and instability.\n\n* **Lebanon:** A Middle Eastern country on the eastern Mediterranean coast. It has a complex history and a fragile political system, recently grappling with severe economic crisis.\n\n* **Tunisia:** A North African country bordering the Mediterranean Sea. It was a key player in the Arab Spring uprisings and has since faced political and economic challenges.\n\n* **China:** A major global power with a rapidly growing economy and expanding geopolitical influence. Its activities in Africa and other regions are closely watched.\n\n* **Military (in context of Guinea and elsewhere):**  The armed forces of a nation.  Military coups and interventions in politics are a recurring theme in many countries, especially those with weak governance.\n\n* **Constitution:** A set of fundamental principles or established precedents according to which a state or other organization is acknowledged to be governed.  Its suspension signifies a major breach of democratic norms.\n\n* **Government:** The group of people with the authority to govern a country or state; a system or form of rule by which a state, community, etc. is governed.\n\n* **Economic depression:** A sustained, long-term downturn in economic activity in one or more economies.  It's characterized by high unemployment, falling incomes, and reduced investment.\n\n* **Parliament:** The highest legislature, typically bicameral, in many countries. Its suspension indicates a significant shift in power dynamics.\n\n* **President:** The highest-ranking official in a republic.  Their actions often have profound implications for the country's political landscape.\n"
    },
    {
        "Q.No.": 88,
        "question_text": "Consider the following pairs:\n   Region often mentioned in the news           Country\n1. Anatolia                                     Turkey\n2. Amhara                                       Ethiopia\n3. Cabo Delgado                                 Spain\n4. Catalonia                                    Italy\nHow many pairs given above are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "Only three pairs",
        "option_d": "All four pairs",
        "correct_option": "b",
        "subject": "geography",
        "year": 2022,
        "explanation": "correct_option: (b)\nexplanation:Only Anatolia (Turkey) and Amhara (Ethiopia) are correctly matched.  Cabo Delgado is a province in Mozambique, not Spain. Catalonia is an autonomous community in Spain, not Italy.\n\nAnatolia: A historical name for the Asian part of Turkey, encompassing a large plateau and surrounding coastal regions.  It's known for its rich history and diverse geography, playing a crucial role in multiple civilizations.\n\nAmhara: One of the largest ethnic groups in Ethiopia, concentrated in the central and northern highlands. The Amhara region is significant for its historical and cultural importance within the country.\n\nCabo Delgado: A northern province of Mozambique known for its rich natural gas reserves and, tragically, recent history of violent conflict and insurgency.\n\nCatalonia: An autonomous community in northeastern Spain with a distinct culture and language (Catalan). It has a history of advocating for greater self-governance, sometimes leading to political tensions with the Spanish central government.\n"
    },
    {
        "Q.No.": 89,
        "question_text": "With reference to Indian laws about wildlife protection, consider the following statements:\n1. Wild animals are the sole property of the government.\n2. When a wild animal is declared protected, such animal is entitled for equal protection whether it is found in protected areas or outside.\n3. Apprehension of a protected wild animal becoming a danger to human life is sufficient ground for its capture or killing.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "c",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is incorrect. While the government has significant control over wild animals under the Wildlife Protection Act, 1972,  it doesn't imply sole ownership.  The Act focuses on conservation and regulation, not outright ownership.\n\nStatement 2 is correct. The Wildlife Protection Act, 1972, provides for the protection of scheduled animals irrespective of their location – within or outside protected areas. The law aims to protect these animals throughout their range.\n\nStatement 3 is correct. The Act allows for the capture or killing of protected animals if they pose a danger to human life. This is a provision to address human-wildlife conflict situations.  However, such actions are subject to specific regulations and procedures.\n\n\nWildlife Protection Act, 1972: This Act is the primary legislation in India for protecting wild animals and their habitats.  It schedules various species according to their conservation status and regulates activities related to them.\n\nPrevention of Cruelty to Animals Act, 1960: This Act aims to prevent the infliction of unnecessary pain or suffering on animals.  It is relevant to wildlife protection insofar as it prohibits cruelty during capture, handling, or other interactions with wild animals.\n\nHuman-Animal Conflict: This refers to conflicts arising from interactions between humans and wild animals, often stemming from habitat encroachment, resource competition, or animal attacks.  The Wildlife Protection Act addresses this issue through provisions for dealing with dangerous animals.\n\nProtected Areas: These are designated areas where wildlife is afforded special protection. Examples include National Parks and Wildlife Sanctuaries.  The legal framework ensures stricter enforcement within these areas but also extends protection to animals outside them.\n"
    },
    {
        "Q.No.": 90,
        "question_text": "Certain species of which one of the following organisms are well known as cultivators of fungi?",
        "option_a": "Ant",
        "option_b": "Cockroach",
        "option_c": "Crab",
        "option_d": "Spider",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation: Certain species of ants, specifically leafcutter ants (Atta and Acromyrmex genera), are well-known for cultivating fungi.  They harvest leaves and other plant material, which they use to cultivate a specific type of fungus in their nests. This fungus serves as their primary food source.  Cockroaches, crabs, and spiders do not exhibit this type of fungal cultivation.\n\nAnts:  Ants are social insects belonging to the family Formicidae.  They exhibit complex social structures, division of labor, and communication systems. Many ant species are important components of their ecosystems, playing roles in seed dispersal, nutrient cycling, and predation.\n\nCockroaches: Cockroaches are insects belonging to the order Blattodea. They are known for their adaptability and ability to survive in diverse environments.  Many species are considered pests due to their association with human dwellings and their potential to spread diseases.\n\nCrabs: Crabs are decapod crustaceans, characterized by their laterally compressed bodies and ten legs. They inhabit a wide range of aquatic and terrestrial habitats, playing various ecological roles.\n\nSpiders: Spiders are arachnids belonging to the order Araneae. They are characterized by their eight legs, the presence of spinnerets for silk production, and their predatory nature.  They are important predators in many ecosystems, controlling insect populations.\n"
    },
    {
        "Q.No.": 91,
        "question_text": "Consider the following pairs:\n   Site of Ashoka's major rock edicts           Location in the State of\n1. Dhauli                                       Odisha\n2. Erragudi                                     Andhra Pradesh\n3. Jaugada                                      Madhya Pradesh\n4. Kalsi                                        Karnataka\nHow many pairs given above are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "Only three pairs",
        "option_d": "All four pairs",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation: Only the pair Dhauli (Odisha) is correctly matched.  The other locations are incorrect:\n\n* **Dhauli:**  A site in Odisha, India, famous for its Ashokan rock edict.  The edicts at Dhauli are significant for their emphasis on the Buddhist principles of non-violence and dharma.\n\n* **Erragudi:** Located in Andhra Pradesh, but not a primary site of Ashoka's major rock edicts. While some minor inscriptions might exist, Erragudi is not as prominently associated with Ashoka's edicts as Dhauli or other locations.\n\n* **Jaugada:** Located in Odisha, not Madhya Pradesh.  Jaugada is known for its Ashokan rock edict, showcasing his administrative and religious policies.\n\n* **Kalsi:** Located in Uttarakhand, not Karnataka.  The Kalsi inscription is one of the earliest and most important Ashokan rock edicts, providing insights into his reign and policies.\n\n"
    },
    {
        "Q.No.": 92,
        "question_text": "Consider the following pairs:\n    King             Dynasty\n1. Nannuka          Chandela\n2. Jayashakti       Paramara\n3. Nagabhata II     Gurjara-Pratihara\n4. Bhoja            Rashtrakuta\nHow many pairs given above are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "Only three pairs",
        "option_d": "All four pairs",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation: Only one pair, Nannuka and Chandela dynasty, is correctly matched.  Jayashakti belonged to the Chandela dynasty, not the Paramara. Nagabhata II was a Gurjara-Pratihara ruler. Bhoja was a Paramara king, not a Rashtrakuta.\n\nNannuka: A Chandela king.  The Chandelas were a significant dynasty of central India known for their patronage of art and architecture, especially at Khajuraho.\n\nJayashakti: A Chandela king. The Chandelas were a significant dynasty of central India known for their patronage of art and architecture, especially at Khajuraho.\n\nNagabhata II: A prominent Gurjara-Pratihara ruler. The Gurjara-Pratiharas were a powerful dynasty that controlled a large part of north-western India.\n\nBhoja: A Paramara king. The Paramaras were a significant dynasty of Malwa region in central India, known for their patronage of learning and art.\n"
    },
    {
        "Q.No.": 93,
        "question_text": "Which one of the following statements about Sangam literature in ancient South India is correct?",
        "option_a": "Sangam poems are devoid of any reference to material culture.",
        "option_b": "The social classification of Varna was known to Sangam poets.",
        "option_c": "Sangam poems have no reference to warrior ethic.",
        "option_d": "Sangam literature refers to magical forces as irrational.",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Sangam literature, a collection of Tamil poems from ancient South India, does reflect the social classification of the Varna system.  While the poems don't solely focus on this aspect, the existence of social hierarchies and their impact on society are evident in various works.  Option (a) is incorrect as Sangam poems frequently refer to material culture, including descriptions of landscapes, clothing, weaponry, and daily life. Option (c) is also incorrect; the warrior ethic and heroic deeds are central themes in many Sangam poems. Option (d) is incorrect because Sangam literature does reference magical forces, but their portrayal isn't solely framed as irrational; instead, their integration into the worldview of the time is depicted.\n\n**Sangam literature:** A body of Tamil literature from ancient South India, composed over several centuries and compiled around the 6th century AD. It comprises poems, which offer insights into the social, economic, and political life of the period.\n\n**Varna:** The fourfold social classification system in ancient India, consisting of Brahmins (priests), Kshatriyas (warriors), Vaishyas (merchants and traders), and Shudras (laborers).\n\n**Madurai:**  An ancient city in Tamil Nadu, India, which served as a significant center of learning and culture during the Sangam period.  It was a major political and economic hub, and royal patronage played a role in the flourishing of Sangam literature.\n\n**Tolkappiyam:** An early Tamil grammatical treatise, considered a foundational text for Tamil language and literature. It provides insights into the linguistic conventions and poetic forms of the Sangam age.  It's a significant text for understanding the structure and conventions of Sangam poetry.\n\n**Prakrit:** A group of Middle Indo-Aryan languages spoken in ancient India, often used in drama, literature, and inscriptions.  Prakrit languages, in contrast to Sanskrit, were more common amongst the general populace.\n\n**Sanskrit:**  The classical language of Hinduism, Buddhism, and Jainism, used for religious texts, literature, and administration. It was an elite language, not spoken by the general population.\n\n**Brahman:**  In the context of the provided text, it refers to members of the priestly class in the Varna system. Their role in society and their influence on social structures are touched upon in the provided notes.\n\n\n"
    },
    {
        "Q.No.": 94,
        "question_text": "\"Yogavāsistha\" was translated into Persian by Nizamuddin Panipati during the reign of:",
        "option_a": "Akbar",
        "option_b": "Humayun",
        "option_c": "Shahjahan",
        "option_d": "Aurangzeb",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation:Nizamuddin Panipati translated the Yogavāsistha into Persian during the reign of Akbar.\n\n**Akbar:**  Akbar (1542-1605) was the third Mughal emperor, known for his religious tolerance and administrative reforms.  His reign saw a flourishing of arts, literature, and architecture.  He promoted a syncretic culture, incorporating elements from various religious and cultural traditions.\n\n**Humayun:** Humayun (1508-1556) was the second Mughal emperor. His reign was marked by instability and conflict, and he spent much of it in exile.\n\n**Shahjahan:** Shah Jahan (1592-1666) was the fifth Mughal emperor, known for his magnificent architectural achievements like the Taj Mahal. His reign was relatively peaceful and prosperous.\n\n**Aurangzeb:** Aurangzeb (1618-1707) was the sixth Mughal emperor. His reign was characterized by religious conservatism and expansionist policies.  He reversed some of Akbar's policies of religious tolerance and implemented stricter Islamic laws.  He is associated with the *Fatwa-i-Alamgiri*, a legal digest.\n\n**Yogavāsistha:**  A significant Hindu philosophical text, part of the larger *Vāsistha Samhitā*. It's a long and complex work that explores various philosophical, spiritual, and psychological themes through a dialogue between the sage Vasistha and Rama.  Its translation into Persian reflects the cultural exchange during the Mughal era.\n\n**Nizamuddin Panipati:** A translator during the Mughal period known for his work in translating the Yogavāsistha into Persian.  Further details on his life and other works are needed for a complete note.\n"
    },
    {
        "Q.No.": 95,
        "question_text": "The world's second tallest statue in sitting pose of Ramanuja was inaugurated by the Prime Minister of India at Hyderabad recently. Which one of the following statements correctly represents the teachings of Ramanuja?",
        "option_a": "The best means of salvation was devotion.",
        "option_b": "Vedas are eternal, self-existent and wholly authoritative.",
        "option_c": "Logical arguments were essential means for the highest bliss.",
        "option_d": "Salvation was to be obtained through meditation.",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (a)\n\nexplanation: Ramanuja's philosophy centers on the concept of bhakti, or devotion, as the primary path to salvation (moksha).  While he acknowledged the importance of the Vedas, his emphasis was on a personal, loving relationship with the divine, achieved through devotion rather than solely through ritual or intellectual pursuits.  Therefore, option (a) accurately reflects his teachings.\n\nRamanuja: A prominent Hindu philosopher and theologian who lived in 11th-12th century South India. He is known for his influential contributions to the Vishishtadvaita school of Vedanta, emphasizing the qualified non-dualism between the individual soul (jīva) and the supreme being (Brahman).  His teachings focused on the importance of bhakti (devotion) as a means of attaining liberation.\n\nHyderabad: A major city in the state of Telangana, India.  It is known for its rich history, diverse culture, and significant contributions to Indian arts, technology, and economy.\n\nPrime Minister of India: The head of the Indian government.  The office is responsible for overseeing the executive branch of the government.\n\n(b) While Ramanuja respected the Vedas, he didn't consider them entirely self-existent or wholly authoritative in the same way as some other schools of thought.\n\n(c)  Ramanuja's philosophy emphasized devotion over rigorous logical arguments as the primary means to salvation.\n\n(d)  Meditation is a part of spiritual practice, but Ramanuja primarily highlighted devotion as the most effective path.\n"
    },
    {
        "Q.No.": 96,
        "question_text": "The Prime Minister recently inaugurated the new Circuit House near Somnath Temple at Veraval. Which of the following statements are correct regarding Somnath Temple?\n1. Somnath Temple is one of the Jyotirlinga shrines.\n2. A description of Somnath Temple was given by Al-Biruni.\n3. Pran Pratishtha of Somnath Temple (installation of the present day temple) was done by President S. Radhakrishnan.\nSelect the correct answer using the code given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2022,
        "explanation": "correct_option: (a)\nexplanation: Somnath Temple is one of the twelve Jyotirlinga shrines dedicated to Lord Shiva.  Al-Biruni, a renowned 11th-century scholar, did describe the temple in his writings. However, the Pran Pratishtha (installation of the present-day temple) was not performed by President S. Radhakrishnan.  Therefore, only statements 1 and 2 are correct.\n\nSomnath Temple:  An ancient Hindu temple dedicated to Lord Shiva, located in Veraval, Gujarat. It's considered one of the holiest sites in Hinduism and has a rich history, having been destroyed and rebuilt multiple times.\n\nJyotirlinga:  A sacred place where Lord Shiva manifested himself in the form of a fiery column of light. Twelve such sites are revered throughout India.\n\nAl-Biruni: A prominent scholar from Central Asia who lived during the 11th century. He made significant contributions to various fields of knowledge, including mathematics, astronomy, and geography, and wrote extensively about the Indian subcontinent.\n\nS. Radhakrishnan:  A prominent Indian philosopher and statesman who served as the first Vice-President and second President of India.  He was a renowned scholar of comparative religion and philosophy.\n"
    },
    {
        "Q.No.": 97,
        "question_text": "Which one of the following statements best describes the role of B cells and T cells in the human body?",
        "option_a": "They protect the body from environmental allergens.",
        "option_b": "They alleviate the body's pain and inflammation.",
        "option_c": "They act as immunosuppressants in the body.",
        "option_d": "They protect the body from the diseases caused by pathogens.",
        "correct_option": "d",
        "subject": "polity",
        "year": 2022,
        "explanation": "* **correct_option:** (d)\n* **explanation:** B cells and T cells are types of lymphocytes, which are white blood cells crucial to the adaptive immune system.  B cells produce antibodies that neutralize pathogens, while T cells directly kill infected cells or help regulate the immune response.  Therefore, they are vital in protecting the body from diseases caused by pathogens.\n\n(a) is incorrect because while the immune system plays a role in allergic reactions, B and T cells are not solely responsible for protecting against environmental allergens.  Allergic reactions involve other immune cells and mediators.\n\n(b) is incorrect because pain and inflammation are complex processes involving various systems, not just B and T cells. B and T cells might be involved in inflammatory responses, but they don't directly alleviate pain.\n\n(c) is incorrect because B and T cells are key components of the immune system; they don't act as immunosuppressants. Immunosuppressants are drugs or treatments that suppress the immune system.\n\n\n**Short notes on named entities:**\n\n* **B cells:**  A type of lymphocyte that matures in the bone marrow.  They produce antibodies, which are proteins that bind to specific antigens (foreign substances) on pathogens, marking them for destruction.\n\n* **T cells:** A type of lymphocyte that matures in the thymus.  They have various roles, including directly killing infected cells (cytotoxic T cells) and helping to regulate the immune response (helper T cells).\n\n* **Pathogens:**  Biological agents that cause disease, including bacteria, viruses, fungi, and parasites.\n\n* **Lymphocytes:** A type of white blood cell that is a key component of the adaptive immune system, including B cells and T cells.  They are responsible for targeted immune responses against specific pathogens.\n\n* **Adaptive immune system:** The part of the immune system that provides long-lasting, targeted immunity against specific pathogens.  It involves B cells and T cells.  This contrasts with the innate immune system, which provides a more general, immediate response.\n"
    },
    {
        "Q.No.": 98,
        "question_text": "Consider the following statements:\n1. Other than those made by humans, nanoparticles do not exist in nature.\n2. Nanoparticles of some metallic oxides are used in the manufacture of some cosmetics.\n3. Nanoparticles of some commercial products which enter the environment are unsafe for humans.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "3 only",
        "option_c": "1 and 2",
        "option_d": "2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2022,
        "explanation": "correct_option: (d)\n\nexplanation:\n\nStatement 1 is incorrect.  Nanoparticles do exist in nature, though not as commonly manufactured by humans.  Natural processes like volcanic eruptions and forest fires can produce nanoparticles.\n\nStatement 2 is correct.  Nanoparticles of certain metallic oxides are used in some cosmetics for their properties such as UV protection or enhanced pigment dispersion.\n\nStatement 3 is correct.  The safety of nanoparticles in commercial products that enter the environment is a subject of ongoing research and debate.  Some nanoparticles have shown potential toxicity to humans and the environment, while others appear relatively benign.  The effects depend on factors including nanoparticle size, composition, and route of exposure.\n\nTherefore, only statements 2 and 3 are correct.  The provided text does not directly support or refute these statements, but the information is based on common scientific knowledge.\n"
    },
    {
        "Q.No.": 99,
        "question_text": "Consider the following statements:\nDNA Barcoding can be a tool to:\n1. assess the age of a plant or animal.\n2. distinguish among species that look alike.\n3. identify undesirable animal or plant materials in processed foods.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "3 only",
        "option_c": "1 and 2",
        "option_d": "2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2022,
        "explanation": "correct_option: (d)\nexplanation: DNA barcoding uses short genetic markers to identify species.  Statement 1 is incorrect because DNA barcoding doesn't directly determine the age of an organism. Statement 2 is correct because it can differentiate between species with similar appearances. Statement 3 is correct as it can detect the presence of unwanted plant or animal material in processed foods.  Therefore, only statements 2 and 3 are correct.\n\nDNA barcoding: A technique that uses a short standardized gene sequence to identify species.  It's useful for species identification and monitoring biodiversity.\n\nProcessed foods: Foods that have undergone some form of processing, such as cooking, canning, or packaging.  They often contain multiple ingredients and may have undergone significant changes in their original properties.\n"
    },
    {
        "Q.No.": 100,
        "question_text": "Consider the following:\n1. Carbon monoxide\n2. Nitrogen oxide\n3. Ozone\n4. Sulphur dioxide\nExcess of which of the above in the environment is/are cause(s) of acid rain?",
        "option_a": "1, 2 and 3",
        "option_b": "2 and 4 only",
        "option_c": "4 only",
        "option_d": "1, 3 and 4",
        "correct_option": "b",
        "subject": "environment",
        "year": 2022,
        "explanation": "```text\ncorrect_option: (b)\nexplanation: Acid rain is caused by the presence of certain pollutants in the atmosphere that react with water to form acidic compounds.  Sulphur dioxide (SO2) and nitrogen oxides (NOx) are the primary contributors.  SO2 reacts with water to form sulfuric acid (H2SO4), and NOx reacts with water to form nitric acid (HNO3). Both are strong acids.  While ozone (O3) is a pollutant and contributes to various environmental problems, it does not directly contribute to acid rain in the same way as SO2 and NOx. Carbon monoxide (CO) is a toxic gas but doesn't contribute to acid rain. Therefore, only SO2 and NOx are directly responsible for acid rain among the given options.\n\nCarbon monoxide (CO): A colorless, odorless, and highly toxic gas produced by incomplete combustion of carbon-containing materials. It binds to hemoglobin in blood, reducing oxygen transport. Sources include vehicle exhaust, industrial emissions, and incomplete burning of fuels.\n\nNitrogen oxides (NOx):  A group of gases including nitrogen monoxide (NO) and nitrogen dioxide (NO2), formed during high-temperature combustion processes.  They contribute to acid rain, smog formation, and respiratory problems. Sources include vehicle exhaust, power plants, and industrial processes.\n\nOzone (O3): A highly reactive gas found in both the stratosphere (good ozone) and the troposphere (bad ozone). Stratospheric ozone protects us from harmful UV radiation, while tropospheric ozone is a major component of smog and respiratory irritant.  It is formed by reactions involving NOx and volatile organic compounds (VOCs).\n\nSulphur dioxide (SO2): A pungent, colorless gas produced during the combustion of sulfur-containing fuels, such as coal and oil, and in industrial processes. It contributes significantly to acid rain and respiratory problems.  It is a major air pollutant.\n```\n"
    }
]