[
    {
        "Q.No.": 1,
        "question_text": "In the areas covered under the Panchayat (Extension to the Scheduled Areas) Act, 1996, what is the role/power of Gram Sabha?\n1. Gram Sabha has the power to prevent alienation of land in the Scheduled Areas.\n2. Gram Sabha has the ownership of minor forest produce.\n3. Recommendation of Gram Sabha is required for granting prospecting licence or mining lease, for any mineral in the Scheduled Areas.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:The Panchayat (Extension to the Scheduled Areas) Act, 1996 (PESA) grants significant powers to Gram Sabhas in Scheduled Areas.  Statement 1 is correct as PESA empowers Gram Sabhas to prevent the alienation of land in Scheduled Areas.  Statement 2 is also correct; Gram Sabhas have ownership rights over minor forest produce.  Finally, statement 3 is correct because PESA mandates that the Gram Sabha's recommendation is necessary for granting prospecting licenses or mining leases for any mineral within Scheduled Areas.  Therefore, all three statements are accurate.\n\nGram Sabha:  A Gram Sabha is a body consisting of persons registered in the electoral rolls relating to a village comprised within the area of a Panchayat at the village level. It's a crucial institution for local self-governance, particularly in Scheduled Areas.\n\nScheduled Areas: These are areas designated under the Fifth Schedule of the Indian Constitution, primarily inhabited by tribal populations, requiring special protection and governance mechanisms.\n\nPanchayat (Extension to the Scheduled Areas) Act, 1996 (PESA): This Act empowers Gram Sabhas in Scheduled Areas, giving them significant control over local resources and development.  It aims to ensure the self-governance of tribal communities.\n\nMinor Forest Produce: This refers to non-timber forest products gathered from forests, such as fruits, roots, medicinal plants, etc.  These products are often crucial for the livelihoods of tribal communities.\n"
    },
    {
        "Q.No.": 2,
        "question_text": "In the Parliament of India, the purpose of an adjournment motion is",
        "option_a": "to allow a discussion on a definite matter of urgent public importance",
        "option_b": "to let opposition members collect information from the ministers",
        "option_c": "to allow a reduction of specific amount in demand for grant",
        "option_d": "to postpone the proceedings to check the inappropriate or violent behaviour on the part of some members",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation: An adjournment motion in the Indian Parliament is used to discuss a matter of urgent public importance.  It requires the support of at least 50 members to be admitted.  The other options are incorrect: (b) is not the primary purpose, (c) relates to budget procedures (reduction of grants), and (d) describes a different parliamentary procedure (postponement due to disruptive behavior).\n\nParliament of India: The bicameral legislature of India, comprising the Rajya Sabha (Council of States) and the Lok Sabha (House of the People).\n\nAdjournment motion: A parliamentary procedure to interrupt the normal business of the house to discuss an urgent matter of public importance.  It needs to be supported by a significant number of members and involves a debate before a decision on adjournment is taken.\n\nLok Sabha: The lower house of the Parliament of India, directly elected by the people.\n\nRajya Sabha: The upper house of the Parliament of India, representing the states.\n\nUrgent public importance: Matters that require immediate attention and discussion due to their significant impact on the public.  Examples could include natural disasters, major policy failures, or significant threats to national security.\n"
    },
    {
        "Q.No.": 3,
        "question_text": "How does National Biodiversity Authority (NBA) help in protecting the Indian agriculture?\n1. NBA checks the biopiracy and protects the indigenous and traditional genetic resources.\n2. NBA directly monitors and supervises the scientific research on genetic modification of crop plants.\n3. Application for Intellectual Property Rights related to genetic/biological resources cannot be made without the approval of NBA.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:The National Biodiversity Authority (NBA) plays a crucial role in protecting India's agricultural biodiversity.  Statement 1 is correct because the NBA's primary function is to prevent biopiracy – the unauthorized appropriation of biological resources and associated traditional knowledge. This directly protects India's indigenous crop varieties and their genetic resources, which are essential for maintaining agricultural diversity and resilience. Statement 2 is incorrect. While the NBA is involved in the overall regulation of access to biological resources, it does not directly monitor and supervise scientific research on genetic modification of crops. This falls under the purview of other regulatory bodies. Statement 3 is correct. The NBA's approval is mandatory before any application for Intellectual Property Rights (IPR) related to genetic or biological resources originating from India can be filed. This prevents the unauthorized patenting of Indian genetic resources and ensures that benefits are shared fairly.  Therefore, only statements 1 and 3 are correct.\n\nNational Biodiversity Authority (NBA):  The NBA is a statutory body established under the Biological Diversity Act, 2002. Its main goal is to regulate access to India's biological resources and associated traditional knowledge, preventing biopiracy and ensuring equitable benefit-sharing.  It plays a vital role in conserving biodiversity and promoting sustainable use of biological resources.\n\nBiopiracy: The unauthorized appropriation of biological resources and associated traditional knowledge, often by multinational corporations, for commercial purposes without providing any benefit to the source country or community.  This can lead to loss of genetic resources and traditional knowledge, impacting food security and cultural heritage.\n\nIntellectual Property Rights (IPR): Legal rights granted to the creators of intellectual works, including inventions, designs, and biological resources.  IPR protection incentivizes innovation, but it is crucial to ensure that these rights do not undermine the rights of indigenous communities or nations over their traditional knowledge and biological resources.  The NBA ensures that this is maintained.\n"
    },
    {
        "Q.No.": 4,
        "question_text": "The National Green Tribunal Act, 2010 was enacted in consonance with which of the following provisions of the Constitution of India?\n1. Right to healthy environment, construed as a part of Right to life under Article 21\n2. Provision of grants for raising the level of administration in the Scheduled Areas for the welfare of Scheduled Tribes under Article 275(1)\n3. Powers and functions of Gram Sabha as mentioned under Article 243(A)\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation:The National Green Tribunal Act, 2010, is primarily based on the Right to a healthy environment, which is considered a part of the Right to Life under Article 21 of the Indian Constitution.  Articles 275(1) and 243(A) deal with grants for Scheduled Areas and Gram Sabha powers respectively, and are not directly related to the NGT's establishment.\n\nArticle 21 (Right to life): This fundamental right guarantees the right to life and personal liberty.  The Supreme Court has interpreted this to include the right to a clean and healthy environment.\n\nArticle 275(1): This article pertains to the provision of grants by the Union government to states for the welfare of Scheduled Tribes in Scheduled Areas.  It is not directly linked to environmental protection.\n\nArticle 243(A): This article deals with the constitution and powers of Gram Sabhas (village assemblies) in Panchayati Raj institutions. It is not directly related to the NGT's function of environmental protection.\n\nNational Green Tribunal (NGT):  The NGT is a specialized environmental court in India established to handle environmental disputes and provide speedy and effective environmental justice.\n"
    },
    {
        "Q.No.": 5,
        "question_text": "If National Water Mission is properly and completely implemented, how will it impact the country?\n1. Part of the water needs of urban areas will be met through recycling of wastewater.\n2. The water requirements of coastal cities with inadequate alternative sources of water will be met by adopting appropriate technologies that allow for the use of ocean water.\n3. All the rivers of Himalayan origin will be linked to the rivers of peninsular India.\n4. The expenses incurred by farmers for digging bore-wells and for installing motors and pump-sets to draw groundwater will be completely reimbursed by the Government.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: The National Water Mission aims to improve water use efficiency, and  augment water availability. Options 1 and 2 align with these goals.  Option 1 focuses on wastewater recycling to meet urban water needs, a key aspect of efficient water management. Option 2 addresses water scarcity in coastal areas through innovative technologies for desalination, another important goal. Option 3, linking Himalayan and peninsular rivers, is a large-scale project not directly part of the National Water Mission's stated objectives. Option 4, complete government reimbursement for groundwater extraction costs, is not a policy of the mission.  Therefore, only options 1 and 2 are directly related to the National Water Mission's aims.\n\nNational Water Mission: A government initiative aimed at conserving water resources and improving water management practices across India.\n\nWastewater recycling:  The process of treating wastewater to remove contaminants and make it reusable for various purposes, including irrigation and industrial uses.\n\nDesalination: The process of removing salt and minerals from saline water (such as seawater) to produce freshwater.  Various technologies exist for desalination, suitable for different contexts.\n\nRiver linking: A large-scale water resources management project involving connecting rivers across different regions to address water scarcity and improve irrigation.  This is a separate initiative, not necessarily within the scope of the National Water Mission.\n\nGroundwater: Water found underground in aquifers, a crucial source of freshwater for many regions, particularly in agriculture.  Over-extraction is a major concern.\n"
    },
    {
        "Q.No.": 6,
        "question_text": "Consider the following provisions under the Directive Principles of State Policy as enshrined in the Constitution of India:\n1. Securing for citizens of India a uniform civil code\n2. Organizing village Panchayats\n3. Promoting cottage industries in rural areas\n4. Securing for all the workers reasonable leisure and cultural opportunities\nWhich of the above are the Gandhian Principles that are reflected in the Directive Principles of State Policy?",
        "option_a": "1, 2 and 4 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (b)\n\nexplanation:  The Directive Principles of State Policy in the Indian Constitution draw inspiration from various sources, including Gandhian philosophy.  Options 2 and 3, \"Organizing village Panchayats\" and \"Promoting cottage industries in rural areas,\" directly reflect Gandhi's emphasis on decentralized governance, rural self-sufficiency, and the empowerment of villages through local institutions and small-scale industries.  While Gandhi advocated for a uniform civil code in principle, it's not as central to his philosophy as the other two. Option 4, \"Securing for all workers reasonable leisure and cultural opportunities,\" aligns with Gandhi's vision of a society that values the well-being of its workers and provides them with opportunities for personal growth and development beyond mere economic sustenance. Therefore, options 2 and 3 most clearly reflect core Gandhian ideals.\n\n**Short Notes on Keywords and Named Entities:**\n\n* **Directive Principles of State Policy:**  Part IV of the Indian Constitution, these are non-justiciable guidelines for the state to follow when making laws and policies. They aim to promote social and economic justice, equality, and welfare.\n\n* **Gandhian Principles:** The philosophy of Mahatma Gandhi, emphasizing non-violence, truth, self-sufficiency, rural development, decentralization of power, and social justice.\n\n* **Uniform Civil Code:** A common set of laws governing personal matters (marriage, divorce, inheritance, adoption) for all citizens regardless of religion.\n\n* **Village Panchayats:** Local self-governing bodies at the village level, crucial for grassroots democracy and rural development.\n\n* **Cottage Industries:** Small-scale, home-based industries, vital for rural employment and economic self-reliance.  Gandhi championed them as a means to avoid exploitation by large industries.\n\n\nThe provided additional text seems unrelated to the question and answer.  It contains information on various Indian states, articles of the constitution (e.g., Articles 370, 371, 35A), and federalism in India, but it does not offer any clarifying information for this specific question.\n"
    },
    {
        "Q.No.": 7,
        "question_text": "Consider the following statements:\n1. Union Territories are not represented in the Rajya Sabha.\n2. It is within the purview of the Chief Election Commissioner to adjudicate the election disputes.\n3. According to the Constitution of India, the Parliament consists of the Lok Sabha and the Rajya Sabha only.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is correct. Union Territories are not directly represented in the Rajya Sabha.  They are represented indirectly through the nominated members.\n\nStatement 2 is incorrect.  The Election Commission of India (ECI), headed by the Chief Election Commissioner (CEC), is responsible for conducting elections. Election disputes are adjudicated by courts, not the CEC. The CEC is the head of the ECI, which is an independent body responsible for conducting free and fair elections in India.\n\nStatement 3 is incorrect. The Parliament of India consists of the President, the Lok Sabha (House of the People), and the Rajya Sabha (Council of States).  The President is a part of the parliament although the actual legislative work is carried out by the Lok Sabha and Rajya Sabha. The Lok Sabha is the lower house, directly elected by the people, while the Rajya Sabha is the upper house, with members partly elected by state legislatures and partly nominated by the President.\n"
    },
    {
        "Q.No.": 8,
        "question_text": "With reference to consumers' rights/privileges under the provisions of law in India, which of the following statements is/are correct?\n1. Consumers are empowered to take samples for food testing.\n2. When, a consumer files a complaint in any consumer forum, no fee is required to be paid.\n3. In case of death of a consumer, his/her legal heir can file a complaint in the consumer forum on his/her behalf.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is incorrect.  While consumers have the right to seek redressal for defective goods or services, the law doesn't explicitly empower them to independently take samples for testing.  Testing is usually done by authorized agencies or through the consumer forum's process.\n\nStatement 2 is incorrect.  Consumer forums usually charge a fee for filing complaints, although the amount varies depending on the value of the claim and the forum's jurisdiction.\n\nStatement 3 is correct.  The legal heirs of a deceased consumer can file a complaint on their behalf in a consumer forum.  This is a crucial provision ensuring that consumer rights are protected even after the consumer's death.  Therefore, only statement 3 is correct.\n\n\n**Short notes on keywords and entities:**\n\n* **Consumers' rights/privileges in India:**  These are legal protections afforded to consumers under various laws in India, aimed at ensuring fair treatment, product safety, and redressal of grievances. These rights include the right to safety, to be informed, to choose, to be heard, and to seek redressal.\n\n* **Consumer forum:**  These are quasi-judicial bodies established under the Consumer Protection Act in India to resolve consumer disputes.  There are three tiers: District Forum, State Commission, and National Commission.\n\n* **Legal heir:** A legal heir is a person who inherits the property or rights of a deceased individual according to the laws of succession.  In the context of consumer complaints, it refers to the person(s) legally entitled to pursue a case on behalf of the deceased consumer.\n\n* **Consumer Protection Act:** This is a legislation in India that provides legal recourse to consumers who have suffered harm due to unfair trade practices or defective products/services.  It aims to protect consumer rights and promote fair business practices.\n"
    },
    {
        "Q.No.": 9,
        "question_text": "Regarding the office of the Lok Sabha Speaker, consider the following statements:\n1. He/She holds the office during the pleasure of the President.\n2. He/She need not be a member of the House at the time of his/her election but has to become a member of the House within six months from the date of his/her election.\n3. If he/she intends to resign, the letter of his/her resignation has to be addressed to the Deputy Speaker.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Lok Sabha Speaker holds office during the pleasure of the President.  This means the President can remove the Speaker at any time.\n\nStatement 2 is correct. The Speaker need not be a member of the Lok Sabha at the time of election but must become a member within six months.\n\nStatement 3 is incorrect.  The Speaker's resignation is submitted to the Lok Sabha, not the Deputy Speaker.\n\n**Short notes on named entities:**\n\n* **Lok Sabha Speaker:** The presiding officer of the Lok Sabha (Lower House of the Indian Parliament).  The Speaker maintains order during sessions, ensures rules of procedure are followed, and plays a crucial role in the legislative process.  They are elected by the Lok Sabha members.\n\n* **President of India:** The head of state of India, holding a largely ceremonial role.  However, the President has certain powers, including the power to appoint and dismiss the Lok Sabha Speaker.\n\n* **Deputy Speaker:** The second-in-command in the Lok Sabha, who presides over the House in the Speaker's absence.  The Deputy Speaker also assists the Speaker in their duties.\n\n* **Lok Sabha:** The lower house of the bicameral Indian Parliament.  It is directly elected by the people of India and is the more powerful house in terms of legislation.\n\n* **House:** Refers to the Lok Sabha in this context.\n\n* **President:** Refers to the President of India.\n\n\n"
    },
    {
        "Q.No.": 10,
        "question_text": "Which of the following are included in the original jurisdiction of the Supreme Court?\n1. A dispute between the Government of India and one or more States\n2. A dispute regarding elections to either House of the Parliament or that of Legislature of a State\n3. A dispute between the Government of India and a Union Territory\n4. A dispute between two or more States\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2",
        "option_b": "2 and 3",
        "option_c": "1 and 4",
        "option_d": "3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:  The Supreme Court's original jurisdiction, as defined in Article 131 of the Indian Constitution, includes disputes between the Government of India and one or more States, and disputes between two or more States.  Therefore, options 1 and 4 fall under the Supreme Court's original jurisdiction.  Disputes between the Government of India and a Union Territory (option 3) and disputes regarding elections (option 2) are not part of the Supreme Court's original jurisdiction.\n\nGovernment of India: The central government of the Republic of India, responsible for national-level governance and policy-making.\n\nStates:  The constituent units of the Indian federation, each possessing its own government and legislative assembly.\n\nUnion Territory:  Administrative divisions of India directly governed by the central government, unlike states that have their own elected governments.  \n\nElections to either House of the Parliament or that of Legislature of a State: The processes by which members of the Parliament (Lok Sabha and Rajya Sabha) and state legislative assemblies are elected.  These are overseen by the Election Commission of India.\n\nOriginal Jurisdiction: The power of a court to hear a case for the first time, as opposed to appellate jurisdiction where it hears appeals.  The Supreme Court's original jurisdiction is limited to specific types of cases as defined in the Constitution.\n\nAppellate Jurisdiction: The power of a court to review decisions made by lower courts.  The Supreme Court has extensive appellate jurisdiction over various matters.\n"
    },
    {
        "Q.No.": 11,
        "question_text": "Consider the following kinds of organisms:\n1. Bacteria.\n2. Fungi\n3. Flowering plants\nSome species of which of the above kinds of organisms are employed as biopesticides?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Bacteria, fungi, and flowering plants are all used as biopesticides.  Bacteria like *Bacillus thuringiensis* produce toxins that kill specific insect pests. Fungi, such as *Beauveria bassiana*, are entomopathogenic, meaning they infect and kill insects.  Certain flowering plants contain compounds that are toxic to insects or other pests and can be used as biopesticides.  Therefore, species from all three categories are employed in this way.\n\nBacteria are single-celled prokaryotic organisms that are ubiquitous in various environments.  They play crucial roles in nutrient cycling and can be both beneficial and harmful.\n\nFungi are eukaryotic organisms that include yeasts, molds, and mushrooms. They are vital decomposers in ecosystems and some are used in food production and medicine.  Others can be pathogenic to plants or animals.\n\nFlowering plants, or angiosperms, are the most diverse group of plants, characterized by their flowers and fruits. They are essential for many ecosystems and provide food and resources for humans and other organisms.\n"
    },
    {
        "Q.No.": 12,
        "question_text": "Biomass gasification is considered to be one of the sustainable solutions to the power crisis in India. In this context, which of the following statements is/are correct?\n1. Coconut shells, groundnut shells and rice husk can be used in biomass gasification.\n2. The combustible gases generated from biomass gasification consist of hydrogen and carbon dioxide only.\n3. The combustible gases generated from biomass gasification can be used for direct heat generation but not in internal combustion engines.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. Coconut shells, groundnut shells, and rice husk are examples of biomass that can be used in gasification processes.  Biomass gasification involves the conversion of organic matter into combustible gases through thermal decomposition in the absence of oxygen.  These agricultural residues are readily available and suitable for this process.\n\nStatement 2 is incorrect.  The combustible gases generated from biomass gasification are not limited to hydrogen and carbon dioxide.  While these are significant components, the gas mixture also includes other gases like carbon monoxide, methane, and other hydrocarbons. The exact composition depends on the type of biomass and gasification parameters.\n\nStatement 3 is incorrect. The combustible gases produced during biomass gasification can be used for direct heat generation (e.g., in boilers) and also in internal combustion engines (after appropriate cleaning and conditioning), though the latter application requires more complex gas processing.\n\n\n"
    },
    {
        "Q.No.": 13,
        "question_text": "What is the role of ultraviolet (UV) radiation in the water purification systems?\n1. It inactivates/kills the harmful microorganisms in water.\n2. It removes all the undesirable odours from the water.\n3. It quickens the sedimentation of solid particles, removes turbidity and improves the clarity of water.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation: UV radiation is primarily used in water purification systems to inactivate or kill harmful microorganisms.  This is achieved through the damaging effects of UV radiation on the DNA of these microorganisms, preventing their replication and ultimately leading to their death.  UV radiation does not effectively remove odors or quicken sedimentation.  Therefore, only statement 1 is correct.\n\nUltraviolet (UV) radiation: A type of electromagnetic radiation with wavelengths shorter than visible light, categorized into UVA, UVB, and UVC. UVC, the shortest wavelength, is the most effective for disinfection due to its high energy.\n\nHarmful microorganisms:  Bacteria, viruses, and other pathogens that can cause disease in humans and animals.  These are often present in water sources and need to be removed or inactivated for safe consumption.\n\nSedimentation: The process by which solid particles settle out of a liquid.  While UV radiation does not directly affect sedimentation, effective disinfection can help reduce the overall biological load in water, potentially leading to clearer water over time.  However, this is not a primary function of UV in water purification.\n"
    },
    {
        "Q.No.": 14,
        "question_text": "Graphene is frequently in news recently. What is its importance?\n1. It is a two-dimensional material and has good electrical conductivity.\n2. It is one of the thinnest but strongest materials tested so far.\n3. It is entirely made of silicon and has high optical transparency.\n4. It can be used as conducting electrodes required for touch screens, LCDs and organic LEDs.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 and 4 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Statements 1 and 2 are correct descriptions of graphene.  Graphene is a single layer of carbon atoms arranged in a hexagonal lattice, making it a two-dimensional material.  Its strong sp² bonds and unique structure give it exceptional strength and electrical conductivity. Statement 4 is also correct; graphene's conductivity makes it suitable for use in touch screens, LCDs, and OLEDs as transparent conducting electrodes. Statement 3 is incorrect. Graphene is made entirely of carbon, not silicon.  While it possesses high optical transparency, this is a consequence of its atomic structure, not its composition.\n\n**Short notes on named entities:**\n\n**Graphene:** A single layer of carbon atoms arranged in a two-dimensional honeycomb lattice.  Its unique structure gives it exceptional properties, including high electrical conductivity, strength, and flexibility.  It's a subject of intense research due to its potential applications in various fields.\n\n**Touch screens:**  Displays that respond to the touch of a finger or other object, commonly used in smartphones, tablets, and other electronic devices. They typically utilize a transparent conducting layer to detect the touch input.\n\n**LCDs (Liquid Crystal Displays):**  Displays that use liquid crystals to modulate light, creating images.  They are commonly used in computer monitors, televisions, and other displays, often requiring thin, transparent conducting layers for operation.\n\n**OLEDs (Organic Light-Emitting Diodes):**  Displays that emit light when an electric current is passed through organic materials. They offer advantages such as higher contrast and wider viewing angles compared to LCDs.  They also benefit from the use of transparent conductive electrodes.\n"
    },
    {
        "Q.No.": 15,
        "question_text": "Lead, ingested or inhaled, is a health hazard. After the addition of lead to petrol has been banned, what still are the sources of lead poisoning?\n1. Smelting units\n2. Pens and pencils\n3. Paints\n4. Hair oils and cosmetics\nSelect the correct answer using the codes given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (d)\n\nexplanation: Lead poisoning can occur through various sources even after the ban on lead in petrol. Smelting units release lead into the air and environment.  Paints, especially older ones, often contain lead.  Hair oils and cosmetics can also be contaminated with lead.  While pens and pencils might contain trace amounts, they are less significant sources compared to the others. Therefore, all four options (1, 2, 3, and 4) represent potential sources of lead poisoning.\n\n\nLead: A heavy metal toxic to humans, even in small amounts.  Exposure can cause neurological damage, developmental problems in children, and other health issues.\n\nSmelting units: Industrial facilities that extract metals from ores, often releasing pollutants including lead into the air and water.\n\nPaints:  Older paints frequently contained lead pigments, posing a risk if ingested or inhaled from peeling paint.\n\nHair oils and cosmetics: Some traditional or unregulated products may contain lead as a contaminant.\n"
    },
    {
        "Q.No.": 16,
        "question_text": "With reference to 'stem cells', frequently in the news, which of the following statements is/are correct?\n1. Stem cells can be derived from mammals only.\n2. Stem cells can be used for screening new drugs.\n3. Stem cells can be used for medical therapies.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:\n\nStatement 1: Stem cells can be derived from mammals only.  This statement is incorrect. While stem cells are commonly derived from mammals, they can also be obtained from other organisms, including plants and some invertebrates.  The provided text mentions the creation of synthetic human embryo-like structures using stem cells.\n\nStatement 2: Stem cells can be used for screening new drugs. This statement is correct.  The text explicitly states that stem cells are used in toxicology research to assess drug side effects.  This is a form of drug screening.\n\nStatement 3: Stem cells can be used for medical therapies.  This statement is correct. The text mentions stem cell therapy (SCT) as a medical application of stem cells, involving the introduction of new stem cells into damaged tissue.  Autologous and allogeneic transplantation are also mentioned as types of SCT.  The text also describes the use of stem cells in creating synthetic human embryo-like structures for research purposes that could potentially lead to therapies.\n\n\nStem cells:  Undifferentiated biological cells that can differentiate into specialized cells and can divide (through mitosis) to produce more stem cells.  They have the potential for self-renewal and differentiation into various cell types.  Research on stem cells is ongoing, with potential applications in regenerative medicine and drug discovery.  Ethical considerations surrounding the use of embryonic stem cells are a significant area of debate.\n\nScreening new drugs: The process of evaluating the safety and effectiveness of new drugs before they are approved for use in humans.  This involves multiple stages, including in vitro tests (using cells or tissues in the lab), in vivo tests (using animals), and clinical trials (using human participants). Stem cells provide a valuable tool for in vitro testing.\n\nMedical therapies: Treatments used to cure or manage diseases.  Stem cell therapy is a relatively new medical therapy with the potential to treat a wide range of diseases and injuries by replacing damaged or diseased cells.  However, it is still under development and faces challenges related to safety and effectiveness.\n"
    },
    {
        "Q.No.": 17,
        "question_text": "Consider the following statements:\nChlorofluorocarbons, known as ozone-depleting substances, are used\n1. in the production of plastic foams\n2. in the production of tubeless tyres\n3. in cleaning certain electronic components\n4. as pressurizing agents in aerosol cans\nWhich of the statements given above is/are correct?",
        "option_a": "1, 2 and 3 only",
        "option_b": "4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Chlorofluorocarbons (CFCs) are ozone-depleting substances.  They were used in the production of plastic foams, as pressurizing agents in aerosol cans, and in cleaning certain electronic components.  While they were *not* used in the production of tubeless tires, options 1, 3, and 4 are correct.\n\n**Short Notes:**\n\n* **Chlorofluorocarbons (CFCs):**  These are organic compounds containing carbon, chlorine, and fluorine.  They were widely used in various applications due to their non-reactive, non-flammable, and non-toxic properties, but their release into the atmosphere contributes to ozone depletion.\n\n* **Ozone-depleting substances:**  These are substances that deplete the ozone layer in the stratosphere, which protects Earth from harmful ultraviolet (UV) radiation.  CFCs are a primary example.\n\n* **Ozone (O3):** A molecule composed of three oxygen atoms. In the stratosphere, it absorbs harmful UV radiation, protecting life on Earth.  In the troposphere (lower atmosphere), it is a pollutant.\n\n* **Ultraviolet (UV) radiation:**  Electromagnetic radiation with wavelengths shorter than visible light.  Excessive exposure to UV radiation can cause sunburn, skin damage, and other health problems.\n\n* **Aerosol cans:** Containers that dispense a fine spray of a liquid or gas, often using a propellant.  CFCs were commonly used as propellants in the past.\n\n* **Plastic foams:**  Lightweight materials used in various applications, including insulation and packaging.  CFCs were used as blowing agents in the production of some plastic foams.\n"
    },
    {
        "Q.No.": 18,
        "question_text": "A team of scientists at Brookhaven National Laboratory including those from India created the heaviest anti-matter (anti-helium nucleus). What is/are the implication/implications of the creation of anti-matter?\n1. It will make mineral prospecting and oil exploration easier and cheaper.\n2. It will help probe the possibility of the existence of stars and galaxies made of anti-matter.\n3. It will help understand the evolution of the universe.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: The creation of anti-matter has several implications.  It aids in investigating the existence of antimatter stars and galaxies, contributing to a deeper understanding of the universe's evolution.  Mineral prospecting and oil exploration are not directly impacted by antimatter creation.\n\nBrookhaven National Laboratory: A US Department of Energy national laboratory conducting research in physics, chemistry, biology, and nanotechnology.\n\nAnti-matter:  Matter composed of antiparticles, which have the same mass as particles of ordinary matter but opposite charge and other quantum numbers. When a particle and its antiparticle collide, they annihilate each other, releasing energy.\n\nAnti-helium nucleus: The antimatter counterpart of the helium nucleus, consisting of two antiprotons and two antineutrons.  Its creation is a significant achievement in particle physics.\n"
    },
    {
        "Q.No.": 19,
        "question_text": "Which of the following is/are cited by the scientists as evidence/evidences for the continued expansion of universe?\n1. Detection of microwaves in space\n2. Observation of redshift phenomenon in space\n3. Movement of asteroids in space\n4. Occurrence of supernova explosions in space\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1, 3 and 4",
        "option_d": "None of the above can be cited as evidence",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:The continued expansion of the universe is evidenced by the observation of the redshift phenomenon.  Redshift is the stretching of light waves as they travel through the expanding universe, causing them to shift toward the red end of the spectrum.  The detection of cosmic microwave background radiation (CMB) also supports the Big Bang theory, which predicts an expanding universe.  The movement of asteroids and supernova explosions, while significant space phenomena, are not directly cited as evidence for the universe's continued expansion.  \n\nCosmic Microwave Background Radiation (CMB): The CMB is faint radiation leftover from the Big Bang. Its uniform distribution across the sky is consistent with an expanding universe.\n\nRedshift: The redshift of distant galaxies indicates that they are moving away from us, and the farther they are, the faster they recede, a hallmark of an expanding universe.\n\nAsteroids:  Asteroids are small, rocky objects orbiting the Sun. Their movements are governed by gravity and do not directly indicate the expansion of the universe.\n\nSupernovae: Supernovae are powerful stellar explosions. While they provide insights into stellar evolution and distances in space, they are not direct evidence of universal expansion.\n"
    },
    {
        "Q.No.": 20,
        "question_text": "Electrically charged particles from space travelling at speeds of several hundred km/sec can severely harm living beings if they reach the surface of the Earth. What prevents them from reaching the surface of the Earth?",
        "option_a": "The Earth's magnetic field diverts them towards its poles",
        "option_b": "Ozone layer around the Earth reflects them back to outer space",
        "option_c": "Moisture in the upper layers of atmosphere prevents them from reaching the surface of the Earth",
        "option_d": "None of the statements (a), (b) and (c) given above is correct",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation:Electrically charged particles from space, also known as cosmic rays, are primarily deflected by the Earth's magnetic field.  This magnetic field acts as a shield, diverting many of these charged particles away from the Earth's surface.  The particles are channeled towards the Earth's magnetic poles, resulting in the aurora borealis and aurora australis.  The ozone layer primarily absorbs ultraviolet radiation, not charged particles. Moisture in the upper atmosphere plays a minor role in atmospheric processes but does not significantly deflect high-speed charged particles.\n\nEarth's magnetic field: The Earth's magnetic field is generated by the movement of molten iron in the Earth's outer core. This field extends into space, forming a magnetosphere that protects the Earth from harmful solar radiation and cosmic rays.\n\nCosmic rays: These are high-energy particles that originate from outside the solar system. They consist of protons, atomic nuclei, and electrons.\n\nOzone layer: A layer in the Earth's stratosphere containing a high concentration of ozone (O3), which absorbs most of the Sun's harmful ultraviolet radiation.\n"
    },
    {
        "Q.No.": 21,
        "question_text": "With reference to the scientific progress of ancient India, which of the statements given below are correct?\n1. Different kinds of specialized surgical instruments were in common use by 1st century AD.\n2. Transplant of internal organs in the human body had begun by the beginning of 3rd century AD.\n3. The concept of sine of an angle was known in 5th century AD.\n4. The concept of cyclic quadrilaterals was known in 7th century AD.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 and 4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:Based on the provided text, statement 1 is correct as Sushruta, considered the father of surgery, practiced in ancient India and his work indicates the use of specialized surgical instruments by the 1st century AD. Statement 3 is also correct, as the text mentions that the concept of sine of an angle was known in ancient India (implied by the achievements of mathematicians like Brahmagupta). Statement 4 is correct as well, indicating knowledge of cyclic quadrilaterals in ancient Indian mathematics.  However, there's no mention of organ transplantation in the provided text to support statement 2.  Therefore, only statements 1, 3, and 4 are supported by the given information.\n\n\nSushruta: Sushruta is considered the father of surgery in ancient India. His treatise, the Sushruta Samhita, details various surgical procedures, instruments, and techniques used in ancient Indian medicine.  His contributions significantly advanced surgical practices of his time.\n\nBrahmagupta:  A renowned mathematician and astronomer from 7th-century India, Brahmagupta made significant contributions to mathematics and astronomy. His work, Brahmasphutasiddhanta, introduced concepts like zero and negative numbers, and advanced understanding of algebra and geometry.  His contributions influenced later mathematical developments.\n\nCyclic Quadrilaterals: A cyclic quadrilateral is a four-sided polygon whose vertices all lie on a single circle. The study of cyclic quadrilaterals is part of geometry and involves understanding their properties and relationships between their sides and angles.  The text notes that this concept was known in ancient India.\n\nSine of an Angle: In trigonometry, the sine of an angle is a trigonometric function that relates the angle to the ratio of the length of the side opposite the angle to the length of the hypotenuse in a right-angled triangle. The text implies knowledge of this concept in ancient India.\n"
    },
    {
        "Q.No.": 22,
        "question_text": "With reference to the history of ancient India, which of the following was/were common to both Buddhism and Jainism?\n1. Avoidance of extremities of penance and enjoyment\n2. Indifference to the authority of the Vedas\n3. Denial of efficacy of rituals\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (d)\n\nexplanation:Both Buddhism and Jainism shared several common features in ancient India.  They both rejected the authority of the Vedas, the sacred texts of Hinduism, and considered ritualistic practices as ineffective in achieving spiritual liberation.  Furthermore, both emphasized a middle path, avoiding extreme asceticism or hedonism in their pursuit of enlightenment.  Therefore, options 2 and 3, and 1 are all correct.\n\n**Short notes on named entities:**\n\n* **Buddhism:** A religion founded by Siddhartha Gautama (the Buddha) in ancient India, emphasizing the Four Noble Truths and the Eightfold Path to achieve Nirvana (liberation from suffering).  It spread widely across Asia and continues to be a major world religion.\n\n* **Jainism:**  An ancient Indian religion founded by Mahavira, emphasizing non-violence (ahimsa) and the pursuit of liberation (moksha) through rigorous self-discipline and detachment from worldly possessions.  It is characterized by its strict ethical code and its emphasis on the interconnectedness of all living beings.\n\n* **Vedas:** A collection of ancient Sanskrit texts that form the foundation of Hinduism. They contain hymns, prayers, rituals, and philosophical insights, considered sacred by Hindus.\n\n"
    },
    {
        "Q.No.": 23,
        "question_text": "Which of the following can be said to be essentially the parts of Inclusive Governance?\n1. Permitting the Non-Banking Financial Companies to do banking\n2. Establishing effective District Planning Committees in all the districts\n3. Increasing the government spending on public health\n4. Strengthening the Mid-day Meal Scheme\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 and 4 only",
        "option_c": "2, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Inclusive governance focuses on ensuring participation and equitable benefit-sharing across society.  Option 2 (Establishing effective District Planning Committees) promotes local participation in planning. Option 3 (Increasing government spending on public health) and Option 4 (Strengthening the Mid-day Meal Scheme) aim to improve access to essential services and address inequalities.  Option 1 (Permitting Non-Banking Financial Companies to do banking) is unrelated to inclusive governance's core principles of participation and equitable distribution of benefits.\n\n\nNon-Banking Financial Companies (NBFCs):  These are financial institutions that provide banking services but are not regulated as banks.  They offer loans, investments, and other financial products.\n\nDistrict Planning Committees (DPCs):  These committees are constituted at the district level to involve local communities in the planning process. They help in decentralizing planning and ensuring that local needs are addressed.\n\nMid-day Meal Scheme: A school meal program in India that provides subsidized lunches to students in government schools. It aims to improve school attendance and nutritional status of children.\n"
    },
    {
        "Q.No.": 24,
        "question_text": "The Nagara, the Dravida and the Vesara are the",
        "option_a": "three main racial groups of the Indian subcontinent",
        "option_b": "three main linguistic divisions into which the languages of India can be classified",
        "option_c": "three main styles of Indian temple architecture",
        "option_d": "three main musical Gharanas prevalent in India",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Nagara, Dravida, and Vesara are the three main styles of Indian temple architecture.\n\nNagara style:  Predominantly found in North India, characterized by a curvilinear shikhara (tower) that rises in a series of receding curves.  Examples include the temples of Khajuraho and Konark.\n\nDravida style: Primarily seen in South India, distinguished by a pyramidal shikhara with horizontal layers.  Famous examples include the Brihadeeswarar Temple in Thanjavur and the Meenakshi Amman Temple in Madurai.\n\nVesara style: A hybrid style blending features of both Nagara and Dravida styles, often exhibiting a combination of curvilinear and pyramidal elements.  It's commonly found in the Deccan region of India.\n"
    },
    {
        "Q.No.": 25,
        "question_text": "The Congress ministries resigned in the seven provinces in 1939, because",
        "option_a": "the Congress could not form ministries in the other four provinces",
        "option_b": "emergence of a 'left wing' in the Congress made the working of the ministries impossible",
        "option_c": "there were widespread communal disturbances in their provinces",
        "option_d": "None of the statements (a), (b) and (c) given above is correct",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (d)\n\nexplanation:The Congress ministries resigned in 1939 primarily due to the Viceroy's decision to involve India in World War II without consulting the Congress.  Options (a), (b), and (c) are incorrect. The Congress was able to form ministries in seven out of eleven provinces in 1937. While internal disagreements within the Congress existed, they weren't the sole reason for the resignations. Communal disturbances were a recurring issue, but not the direct cause of the mass resignation in 1939.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Congress:** The Indian National Congress, a major political party in India during the British Raj, advocating for Indian independence.  It played a crucial role in India's freedom struggle.\n\n* **Congress Ministries:**  Provincial governments formed by the Indian National Congress after winning elections in 1937 under the Government of India Act 1935.\n\n* **1939:** The year the Congress ministries resigned en masse in protest against British involvement in World War II.\n\n* **Provinces:** Administrative divisions of British India.  The eleven provinces varied in size and population.\n\n* **Viceroy:** The British monarch's representative in India, holding supreme executive authority.  The Viceroy's actions significantly influenced Indian politics.\n\n* **World War II:** A global conflict that had a significant impact on Indian politics and the struggle for independence. India's involvement was a major point of contention.\n"
    },
    {
        "Q.No.": 26,
        "question_text": "With reference to National Rural Health Mission, which of the following are the jobs of 'ASHA', a trained, community health worker?\n1. Accompanying women to the health facility for antenatal care checkup\n2. Using pregnancy test kits for early detection of pregnancy\n3. Providing information on nutrition and immunization\n4. Conducting the delivery of baby\nSelect the correct answer using the codes given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 and 4 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2012,
        "explanation": "* **correct_option:** (a)\n* **explanation:**  ASHA (Accredited Social Health Activist) workers under the National Rural Health Mission (NRHM) play a crucial role in primary healthcare at the community level.  Their duties include accompanying women to health facilities for antenatal checkups (1), using pregnancy test kits for early pregnancy detection (2), and providing information on nutrition and immunization (3). However, ASHAs are not trained to conduct deliveries (4); that is the responsibility of trained medical professionals.\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **National Rural Health Mission (NRHM):** A flagship program of the Indian government aimed at improving rural healthcare access and quality.  It focuses on strengthening primary healthcare infrastructure, human resources, and community participation.\n\n* **ASHA (Accredited Social Health Activist):** A trained female community health worker at the forefront of NRHM. They act as a bridge between the community and the formal health system, providing essential healthcare services and health education.\n\n* **Antenatal care:**  Healthcare provided to pregnant women before childbirth to monitor their health and the baby's development. This includes regular checkups, tests, and health advice.\n\n* **Immunization:** The process of protecting individuals from infectious diseases through vaccination.  It's a vital component of primary healthcare, particularly for children.\n\n* **Nutrition:** The process of providing or obtaining the food necessary for health and growth.  Proper nutrition is crucial for healthy development throughout life.\n"
    },
    {
        "Q.No.": 27,
        "question_text": "Which of the following is/are the principal feature(s) of the Government of India Act, 1919?\n1. Introduction of dyarchy in the executive government of the provinces\n2. Introduction of separate communal electorates for Muslims\n3. Devolution of legislative authority by the centre to the provinces\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (d)\n\nexplanation:The Government of India Act of 1919, also known as the Montagu-Chelmsford Reforms, introduced several key features.  It established dyarchy in the provinces, dividing the executive branch into \"transferred\" (subjects under Indian ministers responsible to the provincial legislature) and \"reserved\" (subjects under British officials).  The Act also introduced separate communal electorates, particularly for Muslims, allowing them to elect their representatives separately.  Finally, it devolved some legislative authority from the center to the provinces, granting them greater autonomy in certain areas. Therefore, all three statements (1, 2, and 3) are correct.\n\n**Short Notes:**\n\n* **Government of India Act 1919:** This Act aimed to introduce a degree of self-government in India, although it fell short of full independence. It was a landmark step in the evolution of India's political system, paving the way for future reforms.\n\n* **Dyarchy:**  A system of government where executive power is divided between two authorities. In the context of the 1919 Act, it meant a division of power between British officials and Indian ministers in the provinces.  It was a compromise that aimed to gradually introduce Indian participation in governance.\n\n* **Communal Electorates:** Separate electorates were established for different religious communities (Muslims, Sikhs, Christians, etc.) to ensure their representation in legislative bodies. This was a controversial measure that aimed to address the concerns of minority communities but also contributed to the growing communal divide in India.\n\n* **Devolution of Legislative Authority:**  The transfer of legislative powers from the central government to the provincial governments.  This aimed to grant provinces more autonomy in managing their own affairs.\n\n* **Montagu-Chelmsford Reforms:** Another name for the Government of India Act of 1919, named after the Secretary of State for India, Edwin Montagu, and the Viceroy of India, Lord Chelmsford, who were instrumental in its formulation.\n\n* **Round Table Conferences:** A series of conferences held in London during the 1930s to discuss constitutional reforms in India. These conferences involved representatives from the British government, Indian political leaders, and princely states.  The Government of India Act 1935 was a result of these conferences.\n\n* **Communal Award:**  A decision made by the British Prime Minister Ramsay MacDonald in 1932, granting separate electorates to various religious and caste groups in India, including the depressed classes (Dalits).  This was a highly controversial decision.\n\n* **Government of India Act 1935:**  A comprehensive piece of legislation that attempted to establish a federation in India, combining provinces and princely states. It introduced provincial autonomy and significant changes to the structure of government.\n\n\n* **Indian Independence Act 1947:** The Act that formally granted independence to India and Pakistan.\n\n* **Morley-Minto Reforms (Indian Councils Act 1909):**  These reforms introduced a limited form of Indian participation in the legislative councils.  It is considered a precursor to the more substantial reforms of 1919.\n\n* **Ramsay MacDonald:** The British Prime Minister who announced the Communal Award in 1932.\n\n* **Mahatma Gandhi:**  A prominent Indian leader who opposed the Communal Award and undertook a fast unto death to protest against the separate electorate for Dalits.  His actions led to negotiations and modifications to the award.\n\n* **Yeravada Jail:** The prison in Pune, India, where Mahatma Gandhi undertook his fast.\n"
    },
    {
        "Q.No.": 28,
        "question_text": "During Indian freedom struggle, the National Social Conference was formed. What was the reason for its formation?",
        "option_a": "Different social reform groups or organizations of Bengal region united to form a single body to discuss the issues of larger interest and to prepare appropriate petitions/representations to the government",
        "option_b": "Indian National Congress did not want to include social reforms in its deliberations and decided to form a separate body for such a purpose",
        "option_c": "Behramji Malabari and M. G. Ranade decided to bring together all the social reform groups of the country under one organization",
        "option_d": "None of the statements (a), (b) and (c) given above is correct in this context",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:The National Social Conference was formed by Behramji Malabari and M.G. Ranade to unite various social reform groups across India under a single organization.  While option (a) mentions the unification of groups, it incorrectly limits it to the Bengal region. Option (b) is incorrect as the Indian National Congress did initially focus on political independence rather than social reforms, but the formation of a separate body wasn't the sole reason for the National Social Conference.\n\nBehramji Malabari: A prominent Parsi social reformer and philanthropist, known for his work against child marriage and for women's rights.  His efforts significantly contributed to social reform movements in India during the late 19th and early 20th centuries.\n\nM.G. Ranade: A distinguished Indian jurist, economist, and social reformer. He was a key figure in the Indian National Congress and played a crucial role in advocating for social and political reforms. His work encompassed various aspects of social justice and modernization in India.\n\nNational Social Conference:  A significant organization formed in the late 19th century to address social issues like child marriage, widow remarriage, and caste discrimination. It aimed to bring together different social reform groups to create a more unified and effective movement for social change in India.  The organization played a vital role in advocating for social reforms during the Indian freedom struggle.\n"
    },
    {
        "Q.No.": 29,
        "question_text": "Which of the following parties were established by Dr. B. R. Ambedkar?\n1. The Peasants and Workers Party of India\n2. All India Scheduled Castes Federation\n3. The Independent Labour Party\nSelect the correct answer using the codes given below :",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (b)\n\nexplanation: Dr. B. R. Ambedkar founded the All India Scheduled Castes Federation (later known as the Scheduled Castes Federation) and the Independent Labour Party.  The Peasants and Workers Party of India was not established by him.\n\nAll India Scheduled Castes Federation:  This political party was formed by Ambedkar to represent the interests of Dalits (formerly known as Scheduled Castes) in India.  It aimed to secure their political and social rights, fighting against discrimination and advocating for their upliftment.\n\nIndependent Labour Party:  This party focused on the rights and welfare of laborers in India.  Ambedkar's involvement reflected his broader commitment to social justice and economic equality, recognizing the plight of the working class.\n"
    },
    {
        "Q.No.": 30,
        "question_text": "Which of the following special powers have been conferred on the Rajya Sabha by the Constitution of India?",
        "option_a": "To change the existing territory of a State and to change the name of a State",
        "option_b": "To pass a resolution empowering the Parliament to make laws in the State List and to create one or more All India Services",
        "option_c": "To amend the election procedure of the President and to determine the pension of the President after his/her retirement",
        "option_d": "To determine the functions of the Election Commission and to determine the number of Election Commissioners",
        "correct_option": "b",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (b)\n\nexplanation:The Rajya Sabha, or Council of States, is the upper house of the Indian Parliament.  The Constitution grants it certain special powers, primarily related to legislation. Option (b) correctly identifies one of these:  The Rajya Sabha can pass a resolution enabling Parliament to make laws on subjects in the State List (matters normally under state jurisdiction) and to create All-India Services.  This power is crucial during times of national emergency or when a matter requires uniform national policy.  Options (a), (c), and (d) describe powers that primarily reside with other bodies.  The Parliament, not the Rajya Sabha alone, alters state boundaries or names. The President's election procedure and pension are decided by Parliament. The Election Commission's functions and size are not determined by the Rajya Sabha.\n\nState List:  A list of subjects (like agriculture, education, public order) upon which only state legislatures can make laws.\n\nAll-India Services:  Services like the Indian Administrative Service (IAS) and Indian Police Service (IPS) that operate across the country, their creation requires Parliamentary legislation.\n\nRajya Sabha: The upper house of the Indian Parliament, representing the states.  It plays a crucial role in legislative processes, including reviewing bills passed by the Lok Sabha (lower house).\n\nParliament: The supreme legislative body of India, comprising the President, Lok Sabha, and Rajya Sabha.  It makes laws for the entire country.\n\nPresident: The head of state of India, holding primarily ceremonial powers but also some important constitutional roles.  Election procedure, pension, and other aspects are determined by law.\n\nElection Commission: An independent constitutional body responsible for conducting free and fair elections in India. Its functions and structure are determined by law.\n"
    },
    {
        "Q.No.": 31,
        "question_text": "How does the National Rural Livelihood Mission seek to improve livelihood options of rural poor?\n1. By setting up a large number of new manufacturing industries and agribusiness centres in rural areas\n2. By strengthening 'self-help groups' and providing skill development\n3. By supplying seeds, fertilizers, diesel pump-sets and micro-irrigation equipment free of cost to farmers\nSelect the correct answer using the codes given below :",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: The National Rural Livelihoods Mission (NRLM) primarily focuses on strengthening self-help groups (SHGs) and providing skill development to rural poor.  While it may indirectly contribute to the creation of manufacturing industries and agribusiness through the empowerment of SHGs, direct establishment of such industries isn't its core function.  Supplying resources free of cost is also not a core strategy.  Therefore, only option 2 accurately reflects the NRLM's approach.\n\nSelf-help groups (SHGs):  These are village-based groups of women who pool their savings and resources for mutual benefit, often accessing microfinance and undertaking income-generating activities.  They are a key component of the NRLM's strategy.\n\nSkill development:  The NRLM provides training and skill development programs to enhance the employability and income-generating potential of rural individuals, particularly women.\n"
    },
    {
        "Q.No.": 32,
        "question_text": "The Multi-dimensional Poverty Index developed by Oxford Poverty and Human Development Initiative with UNDP support covers which of the following?\n1. Deprivation of education, health, assets and services at household level\n2. Purchasing power parity at national level\n3. Extent of budget deficit and GDP growth rate at national level\nSelect the correct answer using the codes given below :",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2012,
        "explanation": "* **correct_option:** (a)\n* **explanation:** The Multidimensional Poverty Index (MPI), developed by the Oxford Poverty and Human Development Initiative (OPHI) with UNDP support, focuses on deprivation at the household level across health, education, and living standards.  It doesn't consider purchasing power parity at the national level (option 2) or budget deficits and GDP growth rates (option 3).  These macroeconomic indicators are distinct from the MPI's micro-level focus on individual household deprivations.\n\nThe Oxford Poverty and Human Development Initiative (OPHI) is a research centre at the University of Oxford committed to researching and promoting the reduction of poverty and inequality. The United Nations Development Programme (UNDP) is a global development network that advocates for human development worldwide.  The MPI uses a deprivation-based approach to measuring poverty, going beyond simply income to consider various dimensions of well-being.\n"
    },
    {
        "Q.No.": 33,
        "question_text": "Which of the following is/are among the noticeable features of the recommendations of the Thirteenth Finance Commission?\n1. A design for the Goods and Services Tax, and a compensation package linked to adherence to the proposed design.\n2. A design for the creation of lakhs of jobs in the next ten years in consonance with India's demographic dividend\n3. Devolution of a specified share of central taxes to local bodies as grants\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:The Thirteenth Finance Commission's recommendations included a Goods and Services Tax (GST) design and a compensation mechanism tied to its implementation (point 1).  It did *not* propose job creation targets (point 2).  The commission did recommend the devolution of central taxes to local bodies as grants (point 3).  Therefore, only options 1 and 3 are correct.\n\n\nGoods and Services Tax (GST): A comprehensive indirect tax levied on the supply of goods and services across India, replacing multiple indirect taxes.  It aims for a unified national market and streamlined tax collection.\n\nDevolution of central taxes: The transfer of a portion of tax revenue collected by the central government to state and local governments.  This aims to improve financial autonomy and resource allocation at the sub-national level.\n\nThirteenth Finance Commission: A constitutional body in India responsible for recommending the distribution of net proceeds of taxes between the Union and the States.  Its recommendations cover a five-year period and influence fiscal policy.\n"
    },
    {
        "Q.No.": 34,
        "question_text": "What is/are the recent policy initiative(s) of Government of India to promote the growth of manufacturing sector?\n1. Setting up of National Investment and Manufacturing Zones\n2. Providing the benefit of 'single window clearance'\n3. Establishing the Technology Acquisition and Development Fund\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:The provided text mentions several policy initiatives by the Indian government to boost the manufacturing sector.  These include:\n\n1.  **Production Linked Incentive (PLI) Scheme:** This scheme offers incentives based on incremental sales of goods manufactured in India across various sectors like telecom, pharmaceuticals, IT hardware, and food processing.  It aims to increase domestic manufacturing capabilities, attract investment, and create jobs.\n\n2. **Focus on reducing compliance burden and initiating reforms at the state level:** The text mentions that the Government of India is working to reduce the regulatory hurdles for businesses and is undertaking reforms at the state level to create a more conducive business environment.  This is reflected in initiatives like the Business Reform Action Plan (BRAP).\n\n3.  **Promoting exports through district-level competition and job creation:** The text highlights efforts to increase exports by supporting manufacturing at the district level, fostering competition, and creating employment opportunities.\n\nWhile the options mentioned in the question aren't explicitly detailed as separate, comprehensive initiatives, the government's actions described strongly support all three.  Setting up National Investment and Manufacturing Zones would fall under the broader goal of creating a more conducive business environment (option 2).  Establishing a Technology Acquisition and Development Fund would likely be part of the broader technological push within the PLI scheme and other initiatives aimed at fostering innovation (option 1 & 3).  The 'single window clearance' (option 2) is a key aspect of reducing compliance burdens.  Therefore, all three options are indirectly supported by the mentioned policies.\n\n\n**Short notes on important keywords and named entities:**\n\n* **National Investment and Manufacturing Zones:**  These are designated areas with streamlined regulations and infrastructure to attract large-scale manufacturing investments.  They aim to create employment and boost exports.\n\n* **Single window clearance:** A system where businesses can obtain all necessary approvals and permits from a single point of contact, reducing delays and bureaucratic hurdles.\n\n* **Technology Acquisition and Development Fund:** A fund dedicated to acquiring and developing advanced technologies, boosting domestic innovation and competitiveness in manufacturing.\n\n* **Production Linked Incentive (PLI) Scheme:** A scheme providing financial incentives to domestic manufacturers based on their increased production and sales, thereby boosting domestic manufacturing.\n\n* **Business Reform Action Plan (BRAP):** A plan implemented by the Indian government to improve the business environment by streamlining regulations, reducing compliance burdens, and promoting ease of doing business.\n"
    },
    {
        "Q.No.": 35,
        "question_text": "Which of the following are the methods of Parliamentary control over public finance in India?\n1. Placing Annual Financial Statement before the Parliament\n2. Withdrawal of moneys from Consolidated Fund of India only after passing the Appropriation Bill\n3. Provisions of supplementary grants and vote-on-account\n4. A periodic or at least a mid-year review of programme of the Government, against macroeconomic forecasts and expenditure by a Parliamentary Budget Office\n5. Introducing Finance Bill in the Parliament\nSelect the correct answer using the codes given below:",
        "option_a": "1, 2, 3 and 5 only",
        "option_b": "1, 2 and 4 only",
        "option_c": "3, 4 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation:The methods of Parliamentary control over public finance in India include:\n\n1. **Placing the Annual Financial Statement before the Parliament:** The government presents its budget (estimated receipts and expenditure) to the Parliament for approval.  This is a crucial step in ensuring transparency and accountability. The Annual Financial Statement is a detailed document outlining the government's planned revenue and expenditure for the upcoming fiscal year.\n\n2. **Withdrawal of moneys from the Consolidated Fund of India only after passing the Appropriation Bill:**  No money can be withdrawn from the Consolidated Fund of India (the main account of the government) without the Parliament's approval through an Appropriation Bill. This ensures that the government spends only what the Parliament has authorized. The Consolidated Fund of India is the primary account where all government revenues are deposited and from which all government expenditures are made.\n\n3. **Provisions of supplementary grants and vote-on-account:** Supplementary grants allow the government to seek additional funds during the year if unforeseen expenses arise. A vote-on-account provides temporary funding to the government until the annual budget is passed.  Supplementary grants are additional funds requested by the government beyond the original budget allocation, while a vote-on-account is a short-term measure to allow the government to continue functioning when the budget is delayed.\n\n5. **Introducing the Finance Bill in the Parliament:** The Finance Bill incorporates the government's tax proposals for the year. The Parliament scrutinizes and approves this bill, giving it the power to influence government revenue.  The Finance Bill contains the government's proposals for taxation and other financial measures for the upcoming fiscal year.\n\n4. **A periodic or at least a mid-year review of the programme of the Government, against macroeconomic forecasts and expenditure by a Parliamentary Budget Office:** While desirable for enhanced parliamentary oversight, a dedicated Parliamentary Budget Office  is not explicitly mentioned as a constitutional mechanism for parliamentary control over public finance in India.  Therefore, this option is not a standard or established method.  A Parliamentary Budget Office would provide independent analysis of the government's budget and spending to aid the Parliament in its oversight role.\n"
    },
    {
        "Q.No.": 36,
        "question_text": "Mahatma Gandhi undertook fast unto death in 1932, mainly because",
        "option_a": "Round Table Conference failed to satisfy Indian political aspirations",
        "option_b": "Congress and Muslim League had differences of opinion",
        "option_c": "Ramsay Macdonald announced the Communal Award",
        "option_d": "None of the statements (a), (b) and (c) given above is correct in this context",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Mahatma Gandhi's fast unto death in 1932 was primarily a response to the announcement of the Communal Award by Ramsay MacDonald.  The Communal Award, a British initiative, allocated separate electorates for various religious communities in India, including Muslims, sparking concerns among many Indians, especially Gandhi, who believed it would exacerbate communal tensions and hinder national unity.  While the Round Table Conferences did aim to address Indian political aspirations, and differences between the Congress and Muslim League existed, these were not the primary reasons for Gandhi's fast.\n\nRamsay MacDonald:  British Prime Minister who announced the Communal Award in 1932 as part of the British government's efforts to address the demands of various religious and political groups in India during the struggle for independence.  His decision to implement the Communal Award was highly controversial.\n\nCommunal Award:  A controversial British government decision in 1932 that created separate electorates for various religious communities in India, including Muslims, Sikhs, and Europeans, among others. This decision was meant to appease minority communities but was seen by many Indians, including Mahatma Gandhi, as divisive.\n\nRound Table Conference: A series of conferences held in London in the 1930s between the British government and representatives of various Indian political groups to discuss constitutional reforms. Although several conferences were held, they did not fully meet Indian political aspirations.\n\nCongress:  The Indian National Congress was the major Indian nationalist organization during the struggle for independence.  It played a key role in the movement and advocated for self-rule.\n\nMuslim League: The All-India Muslim League was a political party in British India that advocated for the rights and interests of Muslims.  It eventually played a leading role in the creation of Pakistan.\n"
    },
    {
        "Q.No.": 37,
        "question_text": "With reference to Ryotwari Settlement, consider the following statements:\n1. The rent was paid directly by the peasants to the Government.\n2. The Government gave Pattas to the Ryots.\n3. The lands were surveyed and assessed before being taxed.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Ryotwari Settlement was a system of land revenue collection implemented by the British in India.  Under this system, the government surveyed and assessed the land before imposing taxes (statement 3 is correct).  The rent was paid directly by the peasants (Ryots) to the government, eliminating the intermediary zamindars (statement 1 is correct). The government issued Pattas (title deeds) to the Ryots, granting them the right to cultivate the land (statement 2 is correct). Therefore, all three statements are correct.\n\nRyotwari Settlement: A land revenue system where the government directly dealt with individual peasant cultivators (Ryots), bypassing intermediaries like Zamindars.  It involved surveying and assessing land, issuing title deeds (Pattas), and collecting revenue directly from the Ryots.  This system was implemented in parts of British India, particularly in South India and some parts of central and western India.\n\nPattas: Title deeds issued to Ryots under the Ryotwari Settlement, granting them the right to cultivate the land and specifying the amount of revenue they had to pay.  These documents provided a legal basis for the Ryots' land ownership and cultivation rights.\n\nRyots: Individual peasant cultivators who directly paid land revenue to the government under the Ryotwari Settlement. They held the right to cultivate the land and were responsible for paying the assessed tax.\n"
    },
    {
        "Q.No.": 38,
        "question_text": "Consider the following specific stages of demographic transition associated with economic development:\n1. Low birthrate with low death rate\n2. High birthrate with high death rate\n3. High birthrate with low death rate\nSelect the correct order of the above stages using the codes given below:",
        "option_a": "1, 2, 3",
        "option_b": "2, 1, 3",
        "option_c": "2, 3, 1",
        "option_d": "3, 2, 1",
        "correct_option": "c",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: The demographic transition model describes the shift in birth and death rates as a country develops.  It typically starts with Stage 2 (high birthrate, high death rate), then moves to Stage 3 (high birthrate, low death rate), and finally to Stage 1 (low birthrate, low death rate).  Therefore, the correct order is 2, 3, 1.\n\nDemographic Transition Model: This model describes the shift in population growth patterns as a country develops economically and socially. It involves stages characterized by changes in birth and death rates, ultimately leading to a stable or slowly growing population.\n\nStage 1 (Low birthrate with low death rate): This stage represents a mature, developed economy with low birth and death rates, resulting in slow population growth or even decline.  High levels of education, access to healthcare, and family planning contribute to this.\n\nStage 2 (High birthrate with high death rate):  This is the pre-industrial stage characterized by high birth and death rates, resulting in minimal population growth.  High infant mortality, limited access to healthcare, and lack of family planning are common.\n\nStage 3 (High birthrate with low death rate): This is the transitional stage where death rates decline significantly due to improvements in healthcare, sanitation, and food production. Birth rates remain high, leading to rapid population growth.\n\nThomas Malthus:  An 18th-century economist who proposed a theory that population growth would outpace food production, leading to widespread famine, disease, and conflict.  His theory highlighted the potential for population pressures to limit economic development.\n\nCrude Sex Ratio: This is the ratio of males to females in a population, typically expressed as the number of males per 1000 females.  It is a demographic indicator reflecting gender imbalances within a population.\n\nAge Structure: This refers to the distribution of a population across different age groups.  It's a crucial demographic indicator because it reveals insights into a population’s potential for growth, its dependency ratio, and the needs for services like education and healthcare.\n\nAge-Sex Pyramid: A graphical representation of the age and sex structure of a population. Its shape provides insights into population growth trends, life expectancy, and the proportion of young and elderly people.\n\nHuman Development Index (HDI): A composite statistic developed by the United Nations Development Programme (UNDP) to measure a country's level of social and economic development. It considers factors such as life expectancy, education, and per capita income.  Mahbub ul Haq is credited with its creation.\n\nAmartya Sen: A Nobel laureate economist who emphasized the importance of freedom and capabilities in the development process. He argued that development should focus on expanding people's choices and opportunities rather than solely on economic growth.\n"
    },
    {
        "Q.No.": 39,
        "question_text": "In India, in the overall Index of Industrial Production, the Indices of Eight Core Industries have a combined weight of 37.90%. Which of the following are among those Eight Core Industries?\n1. Cement\n2. Fertilizers\n3. Natural gas\n4. Refinery products\n5. Textiles\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 5 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1, 2, 3 and 4 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "c",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: The Eight Core Industries in India whose indices have a combined weight of 37.90% in the overall Index of Industrial Production include:\n\n1. **Cement:**  A key building material, used extensively in construction.  Production involves limestone, clay, and other materials processed in kilns.  India is a major cement producer and consumer.\n\n2. **Fertilizers:** Essential for agriculture, increasing crop yields.  Major types include nitrogenous, phosphatic, and potassic fertilizers.  Production is crucial for food security in India.\n\n3. **Natural gas:** A fossil fuel, used for power generation, industrial feedstock, and domestic consumption.  India is increasing its natural gas production and imports.\n\n4. **Refinery products:** Derived from crude oil, including petroleum products like gasoline, diesel, kerosene, and petrochemicals.  The refining industry is vital for India's energy needs and transportation.\n\nTherefore, options 1, 2, 3, and 4 are among the Eight Core Industries.  Textiles (option 5) is a significant industry but not among the core eight.\n"
    },
    {
        "Q.No.": 40,
        "question_text": "Which of the following provisions of the Constitution of India have a bearing on Education?\n1. Directive Principles of State Policy\n2. Rural and Urban Local Bodies\n3. Fifth Schedule\n4. Sixth Schedule\n5. Seventh Schedule\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "3, 4 and 5 only",
        "option_c": "1, 2 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:The Directive Principles of State Policy (DPSPs) in Part IV of the Constitution of India include provisions related to education (Article 45, Article 41, Article 46).  Rural and Urban Local Bodies (73rd and 74th Constitutional Amendments)  deal with the devolution of powers to local governments, including responsibilities for education at the local level. The Fifth Schedule, Sixth Schedule, and Seventh Schedule do not directly deal with education. The Fifth Schedule addresses the administration of Scheduled Areas, the Sixth Schedule deals with the administration of tribal areas in certain states, and the Seventh Schedule outlines the distribution of legislative powers between the Union and State governments; none of these inherently address education as a primary focus. Therefore, only the DPSPs and the provisions related to local bodies have a direct bearing on education.\n"
    },
    {
        "Q.No.": 41,
        "question_text": "Government of India encourages the cultivation of 'sea buckthorn'. What is the importance of this plant?\n1. It helps in controlling soil erosion and in preventing desertification.\n2. It is a rich source of biodiesel.\n3. It has nutritional value and is well-adapted to live in cold areas of high altitudes.\n4. Its timber is of great commercial value.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:Sea buckthorn is a shrub that is well-adapted to cold, high-altitude areas (statement 3 is correct).  It has significant nutritional value, with its berries being rich in vitamins, antioxidants, and other beneficial compounds.  It also plays a role in preventing soil erosion and desertification by stabilizing the soil with its extensive root system (statement 1 is correct). Statement 2 is incorrect; sea buckthorn is not a significant source of biodiesel. Statement 4 is also incorrect; its timber is not of great commercial value.  Therefore, only statements 1 and 3 are correct.\n\nSea Buckthorn: A thorny shrub native to the Himalayas and other cold regions, known for its high nutritional value and soil-stabilizing properties. Its berries are rich in vitamins, antioxidants, and omega fatty acids.\n\nSoil erosion: The detachment and movement of soil particles by natural forces like wind and water.  Leads to loss of fertile topsoil and reduced agricultural productivity.\n\nDesertification: The process by which fertile land turns into desert, typically as a result of drought, deforestation, or inappropriate agriculture.\n\nBiodiesel: A fuel produced from vegetable oils or animal fats, often used as a substitute for petroleum diesel.\n\nTimber: Wood used for construction and other purposes.\n"
    },
    {
        "Q.No.": 42,
        "question_text": "Which of the following is the chief characteristic of 'mixed farming'?",
        "option_a": "Cultivation of both cash crops and food crops",
        "option_b": "Cultivation of two or more crops in the same field",
        "option_c": "Rearing of animals and cultivation of crops together",
        "option_d": "None of the above",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Mixed farming is characterized by the rearing of animals and the cultivation of crops together.  This integrated approach allows for diversification of income sources and efficient resource utilization.  For example, animal manure can be used as fertilizer for crops, while crop residues can feed livestock.\n\nCash crops are crops grown for sale to generate income, while food crops are grown for direct consumption. Intercropping involves growing two or more crops in the same field simultaneously.  These are distinct from the defining characteristic of mixed farming.\n"
    },
    {
        "Q.No.": 43,
        "question_text": "A particular State in India has the following characteristics:\n1. It is located on the same latitude which passes through northern Rajasthan.\n2. It has over 80% of its area under forest cover.\n3. Over 12% of forest cover constitutes Protected Area Network in this State.\nWhich one among the following States has all the above characteristics?",
        "option_a": "Arunachal Pradesh",
        "option_b": "Assam",
        "option_c": "Himachal Pradesh",
        "option_d": "Uttarakhand",
        "correct_option": "a",
        "subject": "geography",
        "year": 2012,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Arunachal Pradesh fits all the given characteristics.  It is located in the Eastern Himalayas, approximately on the same latitude as northern Rajasthan.  It is also known for its extensive forest cover, exceeding 80% of its area, with a significant portion designated as a Protected Area Network (exceeding 12%).\n\nAssam has significant forest cover, but not over 80%.  Himachal Pradesh and Uttarakhand also have substantial forest cover and are located in the Himalayas, but their forest cover percentages and protected area networks might not meet the specified criteria.  The latitude of northern Rajasthan is approximately 28-30 degrees North. Arunachal Pradesh lies within this latitudinal range.  Protected Area Networks refer to regions designated for conservation, including national parks and wildlife sanctuaries.\n\n**Short notes on named entities:**\n\n* **Rajasthan:** A state in northwestern India known for its deserts, forts, and rich cultural heritage.  It is located in the Thar Desert region.\n* **Arunachal Pradesh:** A state in northeastern India, part of the Eastern Himalayas, known for its biodiversity and high percentage of forest cover.\n* **Assam:** A state in northeastern India, located in the Brahmaputra River valley, known for its tea plantations and diverse wildlife.\n* **Himachal Pradesh:** A state in northern India, located in the Himalayas, known for its mountains, temples, and hill stations.\n* **Uttarakhand:** A state in northern India, also located in the Himalayas, known for its pilgrimage sites and natural beauty, including the Himalayas.\n"
    },
    {
        "Q.No.": 44,
        "question_text": "Consider the following crops of India:\n1. Cowpea\n2. Green gram\n3. Pigeon pea\nWhich of the above is/are used as pulse, fodder and green manure?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Cowpea, green gram (mung bean), and pigeon pea are all legumes commonly grown in India.  All three can be used as pulses (for human consumption), fodder (animal feed), and green manure (improving soil fertility).  Therefore, the correct option is (d).\n\nCowpea: A warm-season legume grown for its edible seeds and used as a source of protein in human diets. It is also used as fodder for livestock and as green manure to enrich the soil.\n\nGreen gram (mung bean): Another important legume crop in India, widely cultivated for its nutritious seeds which are consumed as pulses.  It's also used as fodder and as a green manure crop.\n\nPigeon pea (arhar): A drought-resistant legume crop with high protein content. Its seeds are used as pulses, it serves as fodder for animals, and its leaves and stems are employed as green manure.\n"
    },
    {
        "Q.No.": 45,
        "question_text": "Consider the following factors:\n1. Rotation of the Earth\n2. Air pressure and wind\n3. Density of ocean water\n4. Revolution of the Earth\nWhich of the above factors influence the ocean currents?",
        "option_a": "1 and 2 only",
        "option_b": "1, 2 and 3",
        "option_c": "1 and 4",
        "option_d": "2, 3 and 4",
        "correct_option": "b",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:The rotation of the Earth creates the Coriolis effect, which influences the direction of ocean currents. Air pressure and wind directly drive surface currents.  The density of ocean water, influenced by temperature and salinity, creates deep ocean currents through thermohaline circulation. The revolution of the Earth around the sun has no direct effect on ocean currents. Therefore, factors 1, 2, and 3 influence ocean currents.\n\nRotation of the Earth: The Earth's rotation causes the Coriolis effect, which deflects moving objects (including ocean currents) to the right in the Northern Hemisphere and to the left in the Southern Hemisphere. This significantly impacts the direction and patterns of ocean currents.\n\nAir pressure and wind: Wind is a major driving force of surface ocean currents.  Differences in air pressure create wind, and the wind drags on the ocean surface, causing water to move.\n\nDensity of ocean water: Differences in water density (caused by variations in temperature and salinity) drive deep ocean currents.  Colder, saltier water is denser and sinks, creating a flow of water from the poles towards the equator.  This is known as thermohaline circulation.\n\nRevolution of the Earth: The Earth's revolution around the sun primarily affects climate patterns and seasons, which indirectly influence ocean temperatures and salinity, but it doesn't directly drive the movement of ocean currents in the way that rotation, wind, and density do.\n"
    },
    {
        "Q.No.": 46,
        "question_text": "With reference to the wetlands of India, consider the following statements :\n1. The country's total geographical area under the category of wetlands is recorded more in Gujarat as compared to other States.\n2. In India, the total geographical area of coastal wetlands is larger than that of inland wetlands.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is incorrect.  Gujarat does not have the largest area under wetlands in India.  While Gujarat possesses significant wetland areas, other states like Uttar Pradesh, West Bengal, and Andhra Pradesh have larger expanses.\n\nStatement 2 is also incorrect. Inland wetlands occupy a larger geographical area compared to coastal wetlands in India.  While coastal wetlands are crucial ecosystems, the sheer expanse of inland wetlands (lakes, rivers, marshes, etc.) across the country surpasses that of coastal wetlands.\n\nWetlands are areas where water covers the soil, or is present either at or near the surface of the soil all year or for varying periods of time during the year, including during the growing season.  They support a diverse range of plant and animal life, playing a crucial role in biodiversity and ecosystem services.  Coastal wetlands are found along coastlines and are influenced by tides, while inland wetlands are located away from the immediate coastal influence.\n"
    },
    {
        "Q.No.": 47,
        "question_text": "Consider the following crops of India:\n1. Groundnut\n2. Sesamum\n3. Pearl millet\nWhich of the above is/are predominantly rainfed crop/crops?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Groundnut, sesame, and pearl millet are all predominantly rainfed crops in India.  While irrigation can supplement their growth, they are primarily dependent on monsoon rainfall for their cultivation.  \n\nGroundnut (peanut) is a kharif crop, meaning it's sown in the monsoon season (June-September).  Sesame is also a kharif crop and is widely grown in drier regions of the country. Pearl millet (bajra) is a major kharif cereal crop, especially important in arid and semi-arid regions where rainfall is limited.  Therefore, all three crops are largely dependent on rainfall.\n"
    },
    {
        "Q.No.": 48,
        "question_text": "When you travel in Himalayas, you will see the following:\n1. Deep gorges\n2. U-turn river courses\n3. Parallel mountain ranges\n4. Steep gradients causing land-sliding\nWhich of the above can be said to be the evidences for Himalayas being young fold mountains?",
        "option_a": "1 and 2 only",
        "option_b": "1, 2 and 4 only",
        "option_c": "3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "geography",
        "year": 2012,
        "explanation": "```text\ncorrect_option: (d)\nexplanation: Deep gorges, U-turn river courses, parallel mountain ranges, and steep gradients leading to landslides are all characteristic features of young fold mountains.  The Himalayas' relatively recent formation is evidenced by these features.  The rapid uplift of the Himalayas has resulted in rivers actively eroding through the rock, forming deep gorges and U-shaped valleys.  The parallel ranges are a consequence of the folding process during mountain building.  Steep gradients increase the susceptibility to landslides due to the unstable nature of the newly uplifted land.\n\nDeep gorges: Steep-sided valleys carved by rivers through erosion in mountainous regions.\nU-turn river courses:  Rivers changing direction abruptly, often due to tectonic activity or the resistance of hard rock layers.\nParallel mountain ranges:  Mountain ranges running alongside each other, formed by the folding of rock layers during tectonic plate collisions.\nSteep gradients:  Sudden changes in elevation, leading to instability and increased risk of landslides.\nYoung fold mountains: Mountains formed relatively recently through the folding of rock layers due to tectonic forces.  They are characterized by high peaks, steep slopes, and ongoing geological activity.\n```\n"
    },
    {
        "Q.No.": 49,
        "question_text": "Normally, the temperature decreases with the increase in height from the Earth's surface, because\n1. the atmosphere can be heated upwards only from the Earth's surface\n2. there is more moisture in the upper atmosphere\n3. the air is less dense in the upper atmosphere\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation:The temperature decreases with increasing altitude primarily because the Earth's surface is the main source of atmospheric heating.  The sun's energy warms the ground, which then heats the air above it.  As you go higher, you are further from this primary heat source, leading to a decrease in temperature. While air density also decreases with altitude (option 3), this is a secondary effect contributing to the temperature decrease.  The amount of moisture in the upper atmosphere (option 2) is not the primary reason for the temperature gradient.\n"
    },
    {
        "Q.No.": 50,
        "question_text": "The acidification of oceans is increasing. Why is this phenomenon a cause of concern?\n1. The growth and survival of calcareous phytoplankton will be adversely affected.\n2. The growth and survival of coral reefs will be adversely affected.\n3. The survival of some animals that have phytoplanktonic larvae will be adversely affected.\n4. The cloud seeding and formation of clouds will be adversely affected.\nWhich of the statements given above is/are correct?",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "environment",
        "year": 2012,
        "explanation": "```text\ncorrect_option: (a)\nexplanation:Ocean acidification is a significant concern due to its detrimental effects on marine life.  Increased acidity, primarily caused by the absorption of excess atmospheric CO2 by the oceans, directly impacts organisms that build shells and skeletons from calcium carbonate, such as calcareous phytoplankton and coral reefs.  This hinders their growth and survival (statements 1 and 2).  Many marine animals rely on phytoplankton as a food source during their larval stages, so the reduced survival of phytoplankton also negatively impacts these animals (statement 3).  There is no direct evidence linking ocean acidification to cloud seeding or formation (statement 4). Therefore, only statements 1, 2, and 3 are correct.\n\n\nCalcareous phytoplankton: Microscopic marine plants that use calcium carbonate to build their shells or skeletons. Their decline due to ocean acidification disrupts the base of the marine food web.\n\nCoral reefs:  Large underwater structures built by coral polyps.  They are highly sensitive to changes in ocean pH and temperature.  Ocean acidification weakens their skeletons, making them more vulnerable to damage and disease.\n\nPhytoplanktonic larvae: The larval stage of many marine animals, which are often planktonic (drifting in ocean currents) and depend on phytoplankton for food. Their survival is directly impacted by the health of phytoplankton populations.\n```\n"
    },
    {
        "Q.No.": 51,
        "question_text": "In India, other than ensuring that public funds are used efficiently and for intended purpose, what is the importance of the office of the Comptroller and Auditor General (CAG)?\n1. CAG exercises exchequer control on behalf of the Parliament when the President of India declares national emergency/financial emergency.\n2. CAG reports on the execution of projects or programmes by the ministries are discussed by the Public Accounts Committee.\n3. Information from CAG reports can be used by investigating agencies to press charges against those who have violated the law while managing public finances.\n4. While dealing with the audit and accounting of government companies, CAG has certain judicial powers for prosecuting those who violate the law.\nWhich of the statements given above is/are correct?",
        "option_a": "1, 3 and 4 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nThe Comptroller and Auditor General (CAG) of India is an independent institution responsible for auditing the accounts of the Union and State governments.  Its importance extends beyond efficient use of public funds.\n\nStatement 2 is correct: The CAG's reports on government projects and programs are crucial for parliamentary oversight. These reports are examined by the Public Accounts Committee (PAC), a parliamentary committee that scrutinizes government spending and holds the executive accountable.\n\nStatement 3 is correct:  The information contained in CAG reports can be used by investigating agencies, such as the Central Bureau of Investigation (CBI), to initiate legal proceedings against individuals who have misused public funds or violated laws.\n\nStatement 1 and 4 are incorrect: The CAG does not exercise exchequer control during a national emergency (though its role remains vital in scrutinizing emergency spending).  The CAG also does not possess judicial powers to prosecute individuals; it only submits its findings, which can then be used by other agencies for prosecution.\n\n\n**Short Notes on Named Entities:**\n\n* **Comptroller and Auditor General (CAG):** The CAG is India's supreme audit institution, responsible for auditing the accounts of the central and state governments.  It ensures financial accountability and transparency in government spending.  Its independence is crucial to its effectiveness.\n\n* **Public Accounts Committee (PAC):**  A parliamentary committee that examines the CAG's reports and holds the government accountable for its financial management. It plays a vital role in parliamentary oversight of public finances.\n\n* **President of India:** The head of state in India, responsible for appointing the CAG.  The President's role is largely ceremonial, but the CAG reports directly to the President.\n\n* **Parliament:** The supreme legislative body in India, responsible for making laws and overseeing the government's actions, including its financial management. The CAG acts as an agent of Parliament in auditing government spending.\n\n* **Investigating Agencies:**  Agencies like the CBI investigate alleged crimes, including financial irregularities. CAG reports provide vital evidence for such investigations.\n\n"
    },
    {
        "Q.No.": 52,
        "question_text": "The endeavour of Janani Suraksha Yojana Programme is\n1. to promote institutional deliveries\n2. to provide monetary assistance to the mother to meet the cost of delivery\n3. to provide for wage loss due to pregnancy and confinement\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:The Janani Suraksha Yojana (JSY) program aims to achieve all three stated goals: promoting institutional deliveries (reducing home births), providing monetary assistance to mothers to cover delivery costs, and providing compensation for wage loss due to pregnancy and confinement.  Therefore, statements 1, 2, and 3 are correct.\n\nJanani Suraksha Yojana (JSY): A program in India designed to reduce maternal and neonatal mortality by promoting institutional deliveries and providing financial assistance to pregnant women and new mothers.  It aims to improve maternal health and reduce the financial burden associated with childbirth.\n\nInstitutional deliveries: Childbirths that take place in healthcare facilities, such as hospitals or clinics, rather than at home.  These settings provide access to medical professionals and necessary equipment to handle complications.\n"
    },
    {
        "Q.No.": 53,
        "question_text": "The Prime Minister of India, at the time of his/her appointment",
        "option_a": "need not necessarily be a member of one of the Houses of the Parliament but must become a member of one of the Houses within six months",
        "option_b": "need not necessarily be a member of one of the Houses of the Parliament but must become a member of the Lok Sabha within six months",
        "option_c": "must be a member of one of the Houses of the Parliament",
        "option_d": "must be a member of the Lok Sabha",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "* **correct_option:** (a)\n* **explanation:** The Prime Minister of India does not need to be a member of Parliament at the time of appointment, but must become a member of either the Lok Sabha or Rajya Sabha within six months.  This is because the Prime Minister needs to be accountable to the Parliament.  The Lok Sabha is the lower house of the Parliament, and the Rajya Sabha is the upper house.  While conventionally the Prime Minister is the leader of the majority party in the Lok Sabha, the Constitution doesn't mandate this.\n"
    },
    {
        "Q.No.": 54,
        "question_text": "With reference to the Delimitation Commission, consider the following statements:\n1. The orders of the Delimitation Commission cannot be challenged in a Court of Law.\n2. When the orders of the Delimitation Commission are laid before the Lok Sabha or State Legislative Assembly, they cannot effect any modifications in the orders.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (b)\n\nexplanation:The orders of the Delimitation Commission are not justiciable, meaning they cannot be challenged in a court of law.  However, when these orders are presented before the Lok Sabha or State Legislative Assemblies, they can be debated and scrutinized. While the Assemblies cannot directly modify the orders, the process of review and discussion can influence public opinion and potentially lead to future adjustments.  Therefore, statement 1 is correct, but statement 2 is incorrect.\n\nDelimitation Commission:  A temporary body constituted by the government to redraw electoral boundaries of constituencies based on population data from the census. Its primary function is to ensure equitable representation in legislative bodies.  The commission's decisions are final and binding, subject to parliamentary approval or ratification.\n\n\nLok Sabha: The lower house of the Parliament of India, representing the people directly. It is responsible for passing laws and holding the government accountable.\n\nState Legislative Assembly: The lower house of the state legislature in India.  Similar to the Lok Sabha, it holds the state government accountable and passes state-level laws.\n"
    },
    {
        "Q.No.": 55,
        "question_text": "Consider the following:\n1. Hotels and restaurants\n2. Motor transport undertakings\n3. Newspaper establishments\n4. Private medical institutions\nThe employees of which of the above can have the 'Social Security' coverage under Employees' State Insurance Scheme?",
        "option_a": "1, 2 and 3 only",
        "option_b": "4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: The Employees' State Insurance Scheme (ESIS) provides social security coverage to employees in various sectors.  Hotels and restaurants, motor transport undertakings, and newspaper establishments all employ workers who can be covered under ESIS.  Private medical institutions also fall under the purview of ESIS coverage for their employees. Therefore, employees of all four categories (1, 2, 3, and 4) can have social security coverage under the ESIS.\n\nEmployees' State Insurance Scheme (ESIS): A social security scheme in India providing medical benefits and cash benefits to employees in case of sickness, maternity, temporary or permanent disablement, and death due to employment injury.  It is administered by the Employees' State Insurance Corporation (ESIC).\n\nHotels and restaurants: Establishments providing accommodation and food services.  Employment in these sectors often involves roles with varying levels of skill and responsibility.\n\nMotor transport undertakings: Businesses involved in the operation of vehicles for transportation of goods or passengers.  This encompasses a broad range of employment, from drivers and mechanics to administrative staff.\n\nNewspaper establishments: Organizations involved in the printing, publishing, and distribution of newspapers. Employment in this sector includes journalists, printers, and distributors.\n\nPrivate medical institutions: Healthcare facilities operated by private entities, ranging from small clinics to large hospitals.  Employment within these settings includes doctors, nurses, technicians, and administrative staff.\n"
    },
    {
        "Q.No.": 56,
        "question_text": "According to the Constitution of India, it is the duty of the President of India to cause to be laid before the Parliament which of the following?\n1. The Recommendations of the Union Finance Commission\n2. The Report of the Public Accounts Committee\n3. The Report of the Comptroller and Auditor General\n4. The Report of the National Commission for Scheduled Castes\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:According to the Constitution of India, the President is mandated to lay before the Parliament the recommendations of the Union Finance Commission (Article 280), the report of the Comptroller and Auditor General of India (Article 151), and the reports of the National Commission for Scheduled Castes and the National Commission for Scheduled Tribes (Article 338A and 338B respectively).  The Public Accounts Committee's report is not directly presented by the President; it's presented to Parliament by the Committee itself.\n\n**Short notes on named entities:**\n\n* **President of India:** The head of state of India, elected by an electoral college consisting of elected members of Parliament and state legislative assemblies.  The President's role is largely ceremonial, but they hold significant reserve powers.\n\n* **Union Finance Commission:** A constitutional body that is appointed by the President every five years to investigate the financial position of states and recommend the distribution of tax revenue between the Union and the states.\n\n* **Parliament:** The supreme legislative body of India, consisting of two houses: the Rajya Sabha (Council of States) and the Lok Sabha (House of the People).  It makes laws, approves the budget, and holds the government accountable.\n\n* **Comptroller and Auditor General (CAG):** An independent constitutional authority that audits the accounts of the Union and state governments, ensuring financial accountability and transparency.\n\n* **Public Accounts Committee (PAC):** A parliamentary committee that examines the audit reports of the CAG and scrutinizes government spending.  Its members are elected by Parliament.\n\n* **National Commission for Scheduled Castes (NCSC):** A constitutional body that investigates matters related to the safeguards provided to Scheduled Castes under the Constitution.  It submits its reports to the President.\n\n* **National Commission for Scheduled Tribes (NCST):**  Similar to NCSC, this body investigates matters related to the safeguards provided to Scheduled Tribes. It also submits its reports to the President.\n"
    },
    {
        "Q.No.": 57,
        "question_text": "A deadlock between the Lok Sabha and the Rajya Sabha calls for a joint sitting of the Parliament during the passage of\n1. Ordinary Legislation\n2. Money Bill\n3. Constitution Amendment Bill\nSelect the correct answer using the codes given below :",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation: A joint sitting of the Parliament is called only for resolving deadlocks between the Lok Sabha and the Rajya Sabha during the passage of Ordinary Legislation and Constitution Amendment Bills.  Money Bills cannot be subjected to a joint sitting.\n\nLok Sabha: The lower house of the Indian Parliament, directly elected by the people.  It is the more powerful house, holding primary responsibility for financial legislation.\n\nRajya Sabha: The upper house of the Indian Parliament, representing the states.  Its members are indirectly elected.  It has less power than the Lok Sabha, particularly regarding financial matters.\n\nOrdinary Legislation:  Laws passed on matters not specifically designated as money bills or requiring constitutional amendments.  These are typically about general governance and policy.\n\nMoney Bill:  A bill primarily dealing with matters concerning taxation, borrowing, or spending of government funds.  It has special provisions in the Constitution to ensure its passage.\n\nConstitution Amendment Bill: A bill proposed to change the Constitution of India. These bills require a special majority in both houses of Parliament.  A joint sitting can be called if there is a deadlock.\n"
    },
    {
        "Q.No.": 58,
        "question_text": "How do District Rural Development Agencies (DRDAs) help in the reduction of rural poverty in India?\n1. DRDAs act as Panchayati Raj Institutions in certain specified backward regions of the country.\n2. DRDAs undertake area-specific scientific study of the causes of poverty and malnutrition and prepare detailed remedial measures.\n3. DRDAs secure inter-sectoral and inter-departmental coordination and cooperation for effective implementation of anti-poverty programmes.\n4. DRDAs watch over and ensure effective utilization of the funds intended for anti-poverty programmes.\nWhich of the statements given above is/are correct?",
        "option_a": "1, 2 and 3 only",
        "option_b": "3 and 4 only",
        "option_c": "4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (b)\n\nexplanation: DRDAs play a crucial role in poverty reduction by facilitating coordination between different government departments and sectors (statement 3) to ensure the effective implementation of anti-poverty programs.  They also monitor the utilization of funds allocated for these programs (statement 4), ensuring accountability and efficient resource allocation.  While DRDAs do work closely with Panchayati Raj Institutions, they don't *act as* them (statement 1 is incorrect).  The conduct of area-specific studies (statement 2) is not a core function of DRDAs, though they might participate in or utilize such studies. Therefore, only statements 3 and 4 are entirely accurate.\n\n\nDistrict Rural Development Agencies (DRDAs):  These are agencies at the district level in India responsible for planning, implementing, and monitoring rural development programs.  They act as a crucial link between the state government and the local level implementing agencies.\n\nPanchayati Raj Institutions (PRIs): These are local self-government bodies in India, operating at the village (Gram Panchayat), block (Panchayat Samiti), and district (Zila Parishad) levels.  They are responsible for local governance and development.\n\nMid-day Meal Scheme (MDM): A school meal program in India providing subsidized lunches to students in government and government-aided primary and upper-primary schools. Aims to improve nutritional status and school attendance.\n\nIntegrated Child Development Services (ICDS): A centrally sponsored program in India providing a package of six basic services to children under six years of age, pregnant women, and lactating mothers. Services include supplementary nutrition, immunization, health checkups, and preschool education.\n\nNational Nutrition Mission (Poshan Abhiyaan): A flagship program of the Indian government aiming to reduce malnutrition among children, women, and adolescent girls.  Focuses on improving nutritional intake and health practices.\n\nNational Food Security Act (NFSA), 2013:  Legislation guaranteeing the right to food to a substantial portion of the Indian population, providing subsidized food grains through the Public Distribution System (PDS).\n\nPublic Distribution System (PDS): A government-sponsored network of fair price shops distributing subsidized food grains and other essential commodities to eligible beneficiaries.\n\nHuman Development Index (HDI): A composite statistic of life expectancy, education, and per capita income indicators, which are used to rank countries into four tiers of human development.\n\nPoverty: A state of deprivation characterized by a lack of access to basic necessities like food, shelter, clothing, and healthcare.  Absolute poverty refers to the inability to meet a minimum standard of living.  Relative poverty is defined in relation to the average standard of living in a society.\n\n\n"
    },
    {
        "Q.No.": 59,
        "question_text": "Which of the following are among the Fundamental Duties of citizens laid down in the Indian Constitution?\n1. To preserve the rich heritage of our composite culture\n2. To protect the weaker sections from social injustice\n3. To develop the scientific temper and spirit of inquiry\n4. To strive towards excellence in all spheres of individual and collective activity\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: The Fundamental Duties of citizens are enshrined in Part IV-A of the Indian Constitution.  These duties were added in 1976 through the 42nd Amendment. Options 1, 3, and 4 are among the Fundamental Duties. Option 2, \"To protect the weaker sections from social injustice,\" is not explicitly listed as a Fundamental Duty, though it aligns with the spirit of several of them.  The Indian Constitution is a living document, meaning it can be amended to adapt to changing societal needs.  The judiciary plays a crucial role in interpreting and upholding the Constitution.  The Directive Principles of State Policy, also part of the Constitution, outline societal goals, but unlike Fundamental Duties, they are not legally enforceable.  The Preamble to the Constitution summarizes its key objectives and ideals.  The Constituent Assembly was responsible for drafting the Constitution.  The Kesavananda Bharati case (1973) established the concept of the \"basic structure\" of the Constitution, which cannot be altered through amendments.\n"
    },
    {
        "Q.No.": 60,
        "question_text": "What is the provision to safeguard the autonomy of the Supreme Court of India?\n1. While appointing the Supreme Court Judges, the President of India has to consult the Chief Justice of India.\n2. The Supreme Court Judges can be removed by the Chief Justice of India only.\n3. The salaries of the Judges are charged on the Consolidated Fund of India to which the legislature does not have to vote.\n4. All appointments of officers and staffs of the Supreme Court of India are made by the Government only after consulting the Chief Justice of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "3 and 4 only",
        "option_c": "4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct.  The President of India consults the Chief Justice of India (CJI) while appointing Supreme Court judges. This consultation is a crucial step in safeguarding the judiciary's independence and autonomy.  The CJI, as the head of the judiciary, plays a vital role in ensuring the appointment of qualified and suitable individuals.\n\nStatement 2 is incorrect. Supreme Court judges cannot be removed by the CJI alone.  The process of removing a judge is complex and involves impeachment by Parliament.\n\nStatement 3 is correct. The salaries of Supreme Court judges are charged upon the Consolidated Fund of India, which is not subject to the legislature's vote. This financial independence is another key aspect of judicial autonomy, ensuring judges are free from political influence.\n\nStatement 4 is correct. The Chief Justice of India is consulted before appointments of officers and staff in the Supreme Court. This ensures that the administration of the Court remains independent and aligned with the judiciary's needs.\n\n\n**Short Notes on Named Entities:**\n\n* **Supreme Court of India:** The highest court of appeal in India, responsible for interpreting the Constitution and upholding the rule of law.  Its independence is crucial for a functioning democracy.\n\n* **President of India:** The head of state of India, responsible for appointing judges to the Supreme Court, among other significant constitutional duties.\n\n* **Chief Justice of India:** The head of the Supreme Court of India, responsible for the administration of the court and plays a key role in judicial appointments.\n\n* **Consolidated Fund of India:** The principal account of the Indian government, where all revenues received by the government are credited, and expenditures are debited.  Salaries of Supreme Court judges are charged to this fund to maintain their independence.\n"
    },
    {
        "Q.No.": 61,
        "question_text": "To meet its rapidly growing energy demand, some opine that India should pursue research and development on thorium as the future fuel of nuclear energy. In this context, what advantage does thorium hold over uranium?\n1. Thorium is far more abundant in nature than uranium.\n2. On the basis of per unit mass of mined mineral, thorium can generate more energy compared to natural uranium.\n3. Thorium produces less harmful waste compared to uranium.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:All three statements are correct.  Thorium is significantly more abundant in the Earth's crust than uranium, making it a potentially more sustainable fuel source.  While the energy produced per unit mass is comparable, thorium reactors have the potential to produce less radioactive waste, and the waste has a shorter half-life, making it easier to manage.\n\n**Short notes on named entities:**\n\n* **Thorium:** A radioactive chemical element used in nuclear reactors. It is more abundant than uranium and produces less long-lived radioactive waste. Its use in nuclear power is still under development.\n\n* **Uranium:** A radioactive chemical element widely used as fuel in nuclear power plants. It produces significant amounts of radioactive waste with long half-lives.\n\n* **Nuclear energy:** Energy derived from nuclear reactions, primarily fission (splitting of atoms) or fusion (combining of atoms). It is a powerful energy source but raises concerns about waste disposal and safety.\n\n* **India:** A country with rapidly growing energy demand, exploring thorium as a potential future fuel for nuclear energy to reduce reliance on imported uranium.\n\n* **Research and development (R&D):** The systematic investigation and creation of new knowledge and technologies to solve problems and improve existing processes. In this context, it refers to the efforts to develop thorium-based nuclear reactors.\n\n* **Fission:**  The splitting of a heavy atomic nucleus into two lighter nuclei, releasing a large amount of energy. This process is used in most current nuclear power plants.\n\n* **Radioactive waste:** Material rendered radioactive by nuclear processes.  It requires careful management and disposal due to its potential harm to human health and the environment.  The level of radioactivity and duration of its persistence depends on the process used.  Some radioactive waste is highly dangerous for tens of thousands of years.\n\n* **Zirconium:** A metallic element used in nuclear reactors as cladding for fuel rods, helping to contain radioactive materials.  It's known for its corrosion resistance.  Deposits are found in various locations including India (Chavara Koden, Kerala and Manavalkuruchi, Tamil Nadu).\n\n* **Kundankulam:** The location of a nuclear power plant in India, built in collaboration with Russia using light water reactors.\n\n* **Light water reactor:** A type of nuclear reactor that uses ordinary water as both coolant and moderator.  This is a common technology in nuclear power plants around the world.\n\n"
    },
    {
        "Q.No.": 62,
        "question_text": "The increasing amount of carbon dioxide in the air is slowly raising the temperature of the atmosphere, because it absorbs",
        "option_a": "the water vapour of the air and retains its heat",
        "option_b": "the ultraviolet part of the solar radiation",
        "option_c": "all the solar radiations",
        "option_d": "the infrared part of the solar radiation",
        "correct_option": "d",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Carbon dioxide (CO2) is a greenhouse gas.  Greenhouse gases absorb infrared (IR) radiation, which is emitted by the Earth's surface after it's been warmed by the sun. This absorption traps heat in the atmosphere, leading to a warming effect.  Ultraviolet (UV) radiation is absorbed primarily by the ozone layer in the stratosphere, not by CO2. Water vapor is also a greenhouse gas, but its concentration in the atmosphere is largely determined by temperature, not the amount of CO2.  The absorption of all solar radiation would be impossible, as some radiation is reflected back to space.  Therefore, the correct option is (d), because CO2 absorbs the infrared part of the solar radiation.\n\nInfrared radiation:  A type of electromagnetic radiation with longer wavelengths than visible light.  It's emitted by warm objects, including the Earth's surface, and is largely responsible for the Earth's temperature.\n\nUltraviolet radiation:  A type of electromagnetic radiation with shorter wavelengths than visible light.  High levels of UV radiation are harmful to living organisms. The ozone layer protects us from harmful UV radiation.\n\nCarbon dioxide (CO2): A colorless, odorless gas produced by burning carbon-based fuels and respiration.  It's a major greenhouse gas.\n\nGreenhouse effect: The warming of the Earth's atmosphere due to the trapping of heat by greenhouse gases.\n\nGreenhouse gases: Gases that absorb and emit infrared radiation, thereby contributing to the greenhouse effect.  Examples include CO2, methane, nitrous oxide, and water vapor.\n"
    },
    {
        "Q.No.": 63,
        "question_text": "Which one of the following sets of elements was primarily responsible for the origin of life on the Earth?",
        "option_a": "Hydrogen, Oxygen, Sodium",
        "option_b": "Carbon, Hydrogen, Nitrogen",
        "option_c": "Oxygen, Calcium, Phosphorus",
        "option_d": "Carbon, Hydrogen, Potassium",
        "correct_option": "b",
        "subject": "geography",
        "year": 2012,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Carbon, hydrogen, and nitrogen are the fundamental building blocks of organic molecules, which are essential for life.  These elements form the backbone of amino acids (proteins), nucleic acids (DNA and RNA), and carbohydrates, all crucial components of living organisms.\n\nOxygen is important for respiration in most life forms, but life originated in an anaerobic environment. Sodium and potassium are important ions for cellular processes, but they are not primary building blocks of organic molecules. Phosphorus and calcium are also essential for life (phosphorus in DNA/RNA, calcium in bones), but carbon, hydrogen, and nitrogen are more fundamental to the origin of life.\n"
    },
    {
        "Q.No.": 64,
        "question_text": "What are the reasons for the people's resistance to the introduction of Bt brinjal in India?\n1. Bt brinjal has been created by inserting a gene from a soil fungus into its genome.\n2. The seeds of Bt brinjal are terminator seeds and therefore, the farmers have to buy the seeds before every season from the seed companies.\n3. There is an apprehension that the consumption of Bt brinjal may have adverse impact on health.\n4. There is some concern that the introduction of Bt brinjal may have adverse effect on the biodiversity.\nSelect the correct answer using the codes given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 and 3 only",
        "option_c": "3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:The resistance to Bt brinjal in India stemmed from multiple concerns.  The apprehension regarding potential adverse health effects from consuming Bt brinjal was a major factor.  Furthermore, fears about the impact on biodiversity due to the introduction of a genetically modified crop were significant.  The nature of the seeds as terminator seeds, requiring farmers to purchase new seeds each season from companies, also fueled opposition, as it raised concerns about farmer dependency and economic control. While Bt brinjal was created using a gene from a soil fungus, this fact alone didn't constitute the primary reason for resistance.  Therefore, all four reasons listed contributed to the public's opposition.\n\nBt brinjal: A genetically modified eggplant variety engineered for pest resistance.\nTerminator seeds: Seeds that are genetically modified to produce sterile offspring, forcing farmers to purchase seeds annually.\nBiodiversity: The variety of life in a particular habitat or ecosystem.\nGEAC (Genetic Engineering Appraisal Committee): The Indian governmental body responsible for assessing the safety of genetically modified organisms.\n"
    },
    {
        "Q.No.": 65,
        "question_text": "Other than resistance to pests, what are the prospects for which genetically engineered plants have been created?\n1. To enable them to withstand drought\n2. To increase the nutritive value of the produce\n3. To enable them to grow and do photosynthesis in spaceships and space stations.\n4. To increase their shelf life\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 and 4 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Genetically engineered plants have been created for various purposes beyond pest resistance.  They are engineered to withstand drought (1), enhance the nutritional value of their produce (2), and extend their shelf life (4).  However, creating plants capable of growing and photosynthesizing in space (3) is not yet a realized prospect of genetic engineering, though it's a potential area of future research.\n\nBt cotton: A genetically modified cotton variety engineered for pest resistance using a gene from the bacterium Bacillus thuringiensis.  It was approved for commercial cultivation in India in 2002.\n\nDrought: A prolonged period of abnormally low rainfall, leading to a shortage of water. Genetically modified plants can be engineered to better tolerate drought conditions.\n\nNutritive value: The amount and types of nutrients present in food, affecting its contribution to human health. Genetic engineering can be used to increase the levels of essential vitamins and minerals in crops.\n\nShelf life: The length of time that a food product remains safe and palatable for consumption.  Genetic modification can increase the shelf life of produce by delaying spoilage.\n\nGenetic Engineering Appraisal Committee (GEAC): An Indian governmental body that appraises proposals related to genetic engineering applications.\n\nGenome Editing: Techniques used to make precise changes to an organism's DNA sequence.  This differs from genetic modification, which often introduces foreign genes.\n\nCRISPR-Cas9: A revolutionary genome editing technology based on a bacterial immune system. It is used to make targeted changes in DNA.\n\nSpace: The region beyond Earth's atmosphere.  While some research explores the possibility of growing plants in space, it is not currently a successful application of genetic engineering.\n"
    },
    {
        "Q.No.": 66,
        "question_text": "Consider the following statements:\nThe most effective contribution made by Dadabhai Naoroji to the cause of Indian National Movement was that he\n1. exposed the economic exploitation of India by the British\n2. interpreted the ancient Indian texts and restored the self-confidence of Indians\n3. stressed the need for eradication of all the social evils before anything else\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation: Dadabhai Naoroji's most significant contribution to the Indian National Movement was exposing the economic exploitation of India by the British.  His work, particularly \"Poverty and Un-British Rule in India,\" meticulously documented the drain of wealth from India to Britain, effectively highlighting the unjust nature of British rule and fueling nationalist sentiment. While he may have touched upon other aspects like social reform and Indian cultural revival, his economic analysis held the most impactful influence on the movement's trajectory.  \n\nDadabhai Naoroji: A Parsi scholar, politician, and a founding member of the Indian National Congress. He is remembered for his pioneering work in exposing the economic exploitation of India under British rule.  His book \"Poverty and Un-British Rule in India\" was a landmark contribution to the nationalist movement.\n\n"
    },
    {
        "Q.No.": 67,
        "question_text": "With reference to Dhrupad, one of the major traditions of India that has been kept alive for centuries, which of the following statements are correct?\n1. Dhrupad originated and developed in the Rajput kingdoms during the Mughal period.\n2. Dhrupad is primarily a devotional and spiritual music.\n3. Dhrupad Alap uses Sanskrit syllables from Mantras.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None of the above is correct",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: Dhrupad, a major Indian musical tradition, is primarily devotional and spiritual music (statement 2).  Dhrupad alap, its improvisational section, often utilizes Sanskrit syllables from mantras (statement 3). However, Dhrupad's origins and development were not solely confined to Rajput kingdoms during the Mughal period (statement 1).  While it flourished under Mughal patronage, its roots extend further back in time and across various regions.\n\n**Short Notes:**\n\n* **Dhrupad:** One of the oldest and most significant Hindustani classical music forms, characterized by its slow tempo, emphasis on improvisation (alap), and spiritual depth.  It's known for its complex rhythmic structures and meditative quality.\n\n* **Alap:** The improvisational opening section of a Dhrupad performance, characterized by free-flowing melodic exploration without a fixed rhythm.  It sets the mood and establishes the raga.\n\n* **Mantra:** A sacred utterance, sound, syllable, word, or phrase, considered to have spiritual power and used in prayer and meditation in various religious traditions, particularly Hinduism and Buddhism.\n\n* **Rajput Kingdoms:**  A group of kingdoms in medieval India ruled by Rajput dynasties, known for their warrior culture and patronage of arts and culture, including music.\n\n* **Mughal Period:** The period of Mughal rule in India (16th-18th centuries), marked by significant political, social, and cultural transformations. The Mughals were known for their patronage of various art forms.\n"
    },
    {
        "Q.No.": 68,
        "question_text": "How do you distinguish between Kuchipudi and Bharatanatyam dances?\n1. Dancers occasionally speaking dialogues is found in Kuchipudi dance but not in Bharatanatyam.\n2. Dancing on the brass plate by keeping the feet on its edges is a feature of Bharatanatyam but Kuchipudi dance does not have such a form of movements.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation: Kuchipudi dance incorporates occasional dialogues, a feature absent in Bharatanatyam.  Dancing on the edges of a brass plate is characteristic of Bharatanatyam, not Kuchipudi.\n\nKuchipudi:  A classical Indian dance form originating in Kuchipudi village, Andhra Pradesh. Known for its energetic and expressive style, often incorporating storytelling and dramatic elements through dialogues and gestures.  It emphasizes both grace and athleticism.\n\nBharatanatyam:  One of the oldest classical dance forms of India, originating in Tamil Nadu. Characterized by precise and intricate footwork, graceful hand gestures (mudras), and expressive facial expressions.  It is often performed solo and focuses on conveying emotions and stories through abhinaya (acting).\n"
    },
    {
        "Q.No.": 69,
        "question_text": "With reference to the religious history of medieval India, the Sufi mystics were known to pursue which of the following practices?\n1. Meditation and control of breath\n2. Severe ascetic exercises in a lonely place\n3. Recitation of holy songs to arouse a state of ecstasy in their audience.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Sufi mystics in medieval India engaged in practices encompassing meditation and breath control (1), ascetic exercises in seclusion (2), and the recitation of devotional songs to induce ecstasy in their listeners (3).  Therefore, all three practices were part of their spiritual pursuits.\n\nSufi:  Sufism is a mystical branch of Islam emphasizing a direct, personal experience of God through devotion, love, and contemplation.  Sufi orders played a significant role in spreading Islam in India, and their mystical practices blended with existing Indian traditions.\n\nMeditation and control of breath: These practices aim at achieving a state of heightened awareness and spiritual insight by focusing the mind and controlling the body's physiological processes.\n\nSevere ascetic exercises in a lonely place: This refers to practices involving self-denial and physical hardship often undertaken in isolation to purify the soul and deepen spiritual connection.\n\nRecitation of holy songs to arouse a state of ecstasy in their audience: This practice uses music and poetry to create a spiritual atmosphere and inspire religious fervor in listeners.  This is a common element in many mystical traditions.\n\nAl-Ghazzali: A prominent Muslim theologian and mystic who attempted to reconcile Islamic philosophy and mysticism. His work had a significant influence on the development of Sufi thought.\n\nQuran:  The holy book of Islam, viewed by Sufis as a source of spiritual guidance and mystical insight.\n\nSama:  A form of devotional music and poetry in Sufi traditions, used to express spiritual longing and experience.\n\nChishti Order: A prominent Sufi order in India, known for its emphasis on love and compassion.  It played a significant role in the spread of Islam and the development of Indo-Islamic culture.\n\nPir:  A spiritual guide or master in Sufi traditions.\n\nMurids:  Disciples or followers of a Pir in Sufi orders.\n\nWali:  A saintly person in Islam, often associated with Sufi orders.\n"
    },
    {
        "Q.No.": 70,
        "question_text": "The Rowlatt Act aimed at",
        "option_a": "compulsory economic support to war efforts",
        "option_b": "imprisonment without trial and summary procedures for trial",
        "option_c": "suppression of the Khilafat Movement",
        "option_d": "imposition of restrictions on freedom of the press",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:The Rowlatt Act, enacted in 1919, allowed the British government in India to imprison individuals without trial and utilize summary procedures for trials.  This aimed to suppress dissent and revolutionary activities.\n\n**Short Notes:**\n\n* **Rowlatt Act:**  This controversial legislation, officially known as the Anarchical and Revolutionary Crimes Act,  was passed by the Imperial Legislative Council despite widespread Indian opposition. It bypassed normal legal processes, enabling indefinite detention without charge or trial. This fueled widespread protests and ultimately contributed to the escalating tensions that led to the Jallianwala Bagh massacre.\n\n* **Khilafat Movement:** A movement launched by Indian Muslims in the early 20th century to protect the Ottoman Caliphate (the religious and political leader of Muslims) from Allied powers after World War I. The movement demonstrated the potential for Hindu-Muslim unity in the Indian nationalist struggle.\n\n* **Compulsory economic support to war efforts:** This refers to measures implemented by governments during wartime to secure financial and material resources for the military.  It could involve taxation, rationing, and conscription.\n\n* **Suppression of the Khilafat Movement:** The British government's actions to suppress the Khilafat Movement stemmed from their desire to maintain control in India and protect their interests in the Middle East.\n\n* **Imposition of restrictions on freedom of the press:**  The British government frequently imposed restrictions on the Indian press to control the flow of information and limit criticism of their policies.  This was a common tool for suppressing dissent.\n\n* **Lord Minto:**  The Viceroy of India (1905-1910), known for introducing the Morley-Minto Reforms of 1909, which included the introduction of separate electorates for Muslims. This was a significant step towards the further division of Indian politics along communal lines.\n\n* **Morley-Minto Reforms:**  A series of constitutional reforms introduced in 1909 that expanded Indian representation in legislative councils but also introduced separate electorates for Muslims, furthering communal divisions.\n\n* **Simla Deputation:** A delegation of Muslim leaders who met with Lord Minto in 1906 to advocate for separate electorates for Muslims.\n\n* **Jallianwala Bagh Massacre:** A tragic event that occurred on April 13, 1919, in Amritsar, India, where British troops fired upon a peaceful gathering of Indian civilians, resulting in numerous deaths and injuries.  It significantly fueled anti-British sentiment and escalated the Indian independence movement.\n\n* **Gandhi:**  Mohandas Karamchand Gandhi, a prominent leader of Indian nationalism, known for his philosophy of Satyagraha (passive resistance) and his role in leading India to independence.\n\n* **Montford Reforms:** Also known as the Government of India Act 1919, these reforms introduced limited self-government in India but fell short of satisfying Indian aspirations for full independence.\n\n* **Mahatma Gandhi:**  Mohandas Karamchand Gandhi, a leader of the Indian independence movement who championed non-violent resistance.\n\n* **Satyagraha:** A philosophy and practice of non-violent resistance developed and championed by Mahatma Gandhi.\n\n* **Non-Cooperation Movement:** A major non-violent movement launched by Gandhi in 1920 to oppose British rule in India.\n\n* **Lucknow Pact:** An agreement between the Indian National Congress and the Muslim League in 1916 that aimed to foster Hindu-Muslim unity in the struggle for self-rule.\n\n* **Defence of India Act 1915:** This act gave the British government in India broad powers to suppress dissent and maintain order during World War I.  It was later criticized for its infringement on civil liberties.\n"
    },
    {
        "Q.No.": 71,
        "question_text": "The Lahore Session of the Indian National, Congress (1929) is very important in history, because\n1. the Congress passed a resolution demanding complete independence\n2. the rift between the extremists and moderates was resolved in that Session\n3. a resolution was passed rejecting the two-nation theory in that Session\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "None of the above.",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation: The Lahore Session of the Indian National Congress in 1929 is historically significant primarily because the Congress passed a resolution declaring its goal as Purna Swaraj (complete independence).  While the session did not resolve the rift between extremists and moderates (a persistent issue within the Congress), nor did it explicitly reject the two-nation theory (that emerged later), the declaration of complete independence was a major turning point in the Indian freedom struggle.\n\nIndian National Congress:  A major political party in India during the British Raj, instrumental in India's independence movement.  It evolved from a moderate organization to one encompassing various ideologies and strategies, eventually adopting the goal of complete independence.\n\nLahore Session (1929): A landmark session of the Indian National Congress held in Lahore, Pakistan (then part of British India), where the declaration of Purna Swaraj was adopted.  This marked a shift towards a more assertive and radical approach to achieving independence.\n\nPurna Swaraj:  A Hindi term meaning \"complete independence\" or \"self-rule.\"  Its adoption as the official goal of the Indian National Congress at the Lahore Session signaled a decisive break from earlier negotiations and compromises with the British government.\n\nTwo-nation theory: A political ideology advocating for the division of India into separate Hindu and Muslim states.  This theory was primarily championed by the Muslim League and played a crucial role in the Partition of India in 1947.  The Lahore Session of the Congress did not directly address this theory.\n\nExtremists:  A faction within the Indian National Congress advocating for more radical and assertive methods to achieve independence from British rule.\n\nModerates: A faction within the Indian National Congress favoring a more gradual and conciliatory approach to gaining independence from British rule.  Their strategies often involved petitions, negotiations, and constitutional means.\n"
    },
    {
        "Q.No.": 72,
        "question_text": "Lord Buddha's image is sometimes shown with the hand gesture called 'Bhumisparsha Mudra'. It symbolizes",
        "option_a": "Buddha's calling of the Earth to watch over Mara and to prevent Mara from disturbing his meditation",
        "option_b": "Buddha's calling of the Earth to witness his purity and chastity despite the temptations of Mara",
        "option_c": "Buddha's reminder to his followers that they all arise from the Earth and finally dissolve into the Earth, and thus this life is transitory",
        "option_d": "Both the statements (a) and (b) are correct in this context",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "* **correct_option:** (d)\n* **explanation:** The Bhumisparsha Mudra depicts the Buddha calling upon the Earth to witness his purity and to prevent Mara, the personification of evil and temptation, from disrupting his meditation.  Options (a) and (b) accurately describe aspects of this symbolism; therefore, (d) is the most comprehensive answer.\n\nMara: In Buddhism, Mara is a demon or malevolent force representing the allure of worldly desires and attachments that obstruct enlightenment.  He tempts individuals to stray from the path of spiritual liberation.\n\nBuddha: Siddhartha Gautama, the founder of Buddhism, who attained enlightenment and became known as the Buddha (the awakened one). His teachings focus on the Four Noble Truths and the Eightfold Path to overcome suffering.  His image in various mudras (hand gestures) is a central element in Buddhist art and iconography.\n\nBhumisparsha Mudra:  A specific hand gesture in Buddhist iconography where the Buddha touches the earth with his right hand, symbolizing his calling on the Earth to witness his purity and vanquish Mara's temptations during his enlightenment.\n"
    },
    {
        "Q.No.": 73,
        "question_text": "The religion of early Vedic Aryans was primarily of",
        "option_a": "Bhakti",
        "option_b": "image worship and Yajnas",
        "option_c": "worship of nature and Yajnas",
        "option_d": "worship of nature and Bhakti",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:The religion of early Vedic Aryans centered around performing Yajnas (sacrificial rituals) and the worship of nature.  Gods were personified natural forces.  While Bhakti (devotion) developed later, it wasn't the primary religious practice during the early Vedic period.  Image worship also became more prominent later.\n\nIndra: The most important god in the Rig Veda, Indra was the god of thunder, lightning, storms, and rain. He was considered a powerful warrior and protector of the Aryans.\n\nAgni: The fire god, Agni, held a crucial role in Vedic rituals.  Offerings were made to Agni, believed to carry them to the other gods.\n\nSoma: A plant-based divine drink, Soma was associated with immortality and ecstasy.  Its consumption played a vital part in Vedic rituals.\n\nAditi & Usha: Aditi was the mother of gods, while Usha represented the dawn. These represented important female divinities in the Vedic pantheon.\n\nYajna:  Elaborate sacrificial rituals were central to Vedic religion. They involved offerings to the gods, accompanied by prayers and mantras.\n\nBhakti:  A form of devotion to a personal god that emerged later in Indian religious history, becoming prominent in the post-Vedic era.\n"
    },
    {
        "Q.No.": 74,
        "question_text": "Which of the following statements is/are correct regarding Brahmo Samaj?\n1. It opposed idolatry.\n2. It denied the need for a priestly class for interpreting the religious texts.\n3. It popularized the doctrine that the Vedas are infallible.\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:The Brahmo Samaj was a religious reform movement in India that advocated for monotheism and opposed idolatry (Statement 1 is correct).  They believed in the direct accessibility of God and rejected the need for a priestly class to interpret religious texts (Statement 2 is correct).  The Brahmo Samaj did *not* believe in the infallibility of the Vedas; rather, they emphasized reason and critical thinking in interpreting religious texts.  Therefore, Statement 3 is incorrect.  The correct answer is (b) 1 and 2 only.\n"
    },
    {
        "Q.No.": 75,
        "question_text": "The Reserve Bank of India (RBI) acts as a bankers' bank. This would imply which of the following?\n1. Other banks retain their deposits with the RBI.\n2. The RBI lends funds to the commercial banks in times of need.\n3. The RBI advises the commercial banks on monetary matters.\nSelect the correct answer using the codes given below:",
        "option_a": "2 and 3 only",
        "option_b": "1 and 2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: The Reserve Bank of India (RBI) functions as a bankers' bank. This means it performs several crucial roles for other banks in the country.  Option 1 is correct because commercial banks maintain a certain percentage of their deposits with the RBI as required reserves (CRR and SLR). Option 2 is also correct as the RBI acts as the lender of last resort, providing funds to commercial banks during financial crises.  Option 3 is correct because the RBI plays a significant advisory role, guiding commercial banks on monetary policy and other financial matters. Therefore, all three statements are true.\n\n\nShort notes on keywords and named entities:\n\nReserve Bank of India (RBI):  India's central bank, responsible for monetary policy, regulating banks, and maintaining financial stability.  It issues currency, manages foreign exchange reserves, and acts as a lender of last resort.\n\nBankers' bank: A central bank's role in providing services and oversight to commercial banks, including holding reserves, providing loans, and offering regulatory guidance.\n\nCommercial banks: Banks that offer financial services to individuals and businesses, including deposits, loans, and other financial products.  They are regulated by the central bank.\n\nCRR (Cash Reserve Ratio): The percentage of a bank's deposits that it must hold as reserves with the RBI.\n\nSLR (Statutory Liquidity Ratio): The percentage of a bank's deposits that it must maintain in liquid assets like gold and government securities.\n\nMonetary matters:  Issues related to the money supply, interest rates, inflation, and other aspects of a country's monetary policy.\n"
    },
    {
        "Q.No.": 76,
        "question_text": "Under which of the following circumstances may 'capital gains' arise?\n1. When there is an increase in the sales of a product\n2. When there is a natural increase in the value of the property owned\n3. When you purchase a painting and there is a growth in its value due to increase in its popularity\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "2 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: Capital gains arise from an increase in the value of an asset.  Option 1 describes increased sales, which is related to revenue, not capital gains. Option 2 correctly describes a capital gain; the property's value increased naturally. Option 3 also describes a capital gain; the painting's value increased due to increased popularity. Therefore, only options 2 and 3 represent circumstances where capital gains may arise.\n\nCapital gains: An increase in the value of an asset (like property, stocks, or art) that results in a profit when the asset is sold.\n\nSales of a product: The total amount of a product sold within a specific time period.  This relates to revenue generation, not asset appreciation.\n\nProperty: Land and any buildings or structures on it.  Its value can fluctuate based on market conditions, demand, and improvements.\n\nPainting: A work of art created using paint on a surface.  Its value can be influenced by the artist's reputation, rarity, and historical significance.\n"
    },
    {
        "Q.No.": 77,
        "question_text": "Which of the following measures would result in an increase in the money supply in the economy?\n1. Purchase of government securities from the public by the Central Bank\n2. Deposit of currency in commercial banks by the public\n3. Borrowing by the government from the Central Bank\n4. Sale of government securities to the public by the Central Bank\nSelect the correct answer using the codes given below:",
        "option_a": "1 only",
        "option_b": "2 and 4 only",
        "option_c": "1 and 3",
        "option_d": "2, 3 and 4",
        "correct_option": "c",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:\n\n1. **Purchase of government securities from the public by the Central Bank:** This is an example of Open Market Operations (OMO). When the central bank buys securities, it injects money into the economy, increasing the money supply.  The money used to purchase the securities effectively creates new money in circulation.\n\n2. **Deposit of currency in commercial banks by the public:** This action increases the reserves of commercial banks.  However, it does not directly increase the money supply unless the banks lend out these deposits, creating new money through the money multiplier effect.\n\n3. **Borrowing by the government from the Central Bank:** This is known as deficit financing.  The central bank creates new money to lend to the government, directly increasing the money supply. This can be inflationary if not managed carefully.\n\n4. **Sale of government securities to the public by the Central Bank:** This is also an OMO.  When the central bank sells securities, it withdraws money from the economy, decreasing the money supply.  The money used to buy the securities is removed from circulation.\n\nTherefore, only options 1 and 3 directly increase the money supply.\n\n\n**Short notes on important keywords and named entities:**\n\n* **Central Bank:**  The central bank (Reserve Bank of India in this context) is the apex monetary authority of a country. It controls the money supply, regulates banks, and acts as the lender of last resort.\n\n* **Money Supply:** The total amount of money in circulation in an economy at a given time, including currency, demand deposits, and other liquid assets.  Changes in the money supply can impact inflation and economic growth.\n\n* **Government Securities:** Debt instruments issued by a government to finance its spending. They are considered low-risk investments and are traded in the open market.\n\n* **Open Market Operations (OMO):** A tool used by the central bank to influence the money supply by buying or selling government securities in the open market.\n\n* **Commercial Banks:** Banks that accept deposits from the public and provide loans to businesses and individuals. They are crucial intermediaries in the money supply mechanism.\n\n* **Deficit Financing:** Government borrowing to finance a budget deficit.  This can increase the money supply if the borrowing is from the central bank.\n"
    },
    {
        "Q.No.": 78,
        "question_text": "Which of the following would include Foreign Direct Investment in India?\n1. Subsidiaries of foreign companies in India\n2. Majority foreign equity holding in Indian companies.\n3. Companies exclusively financed by foreign companies\n4. Portfolio investment\nSelect the correct answer using the codes given below :",
        "option_a": "1, 2, 3 and 4",
        "option_b": "2 and 4 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3 only",
        "correct_option": "d",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Foreign Direct Investment (FDI) involves a foreign company making a direct investment into a company or business in another country.  Options 1, 2, and 3 all describe scenarios that would constitute FDI in India:\n\n1. **Subsidiaries of foreign companies in India:**  A subsidiary is a company controlled by another company (the parent company). If the parent company is foreign, establishing a subsidiary in India is a form of FDI.\n\n2. **Majority foreign equity holding in Indian companies:**  This means a foreign investor owns more than 50% of the equity shares of an Indian company, giving them controlling interest.  This is direct investment.\n\n3. **Companies exclusively financed by foreign companies:** If a company in India is entirely funded by foreign investment, this is direct investment in the Indian economy.\n\n4. **Portfolio investment:** Portfolio investment involves investing in the securities (stocks and bonds) of a company, without obtaining any control or management rights. This is not FDI; it's indirect investment.\n\nTherefore, only options 1, 2, and 3 represent FDI in India.  Portfolio investment is a separate category of foreign investment.\n"
    },
    {
        "Q.No.": 79,
        "question_text": "Consider the following statements; The price of any currency in international market is decided by the\n1. World Bank\n2. demand for goods/services provided by the concerned country\n3. stability of the government of the concerned country\n4. economic potential of the country in question\nWhich of the statements given above are correct?",
        "option_a": "1, 2, 3 and 4",
        "option_b": "2 and 3 only",
        "option_c": "3 and 4 only",
        "option_d": "1 and 4 only",
        "correct_option": "b",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:The price of a currency in the international market is determined by several factors, primarily the demand and supply of that currency.  Statement 2, \"demand for goods/services provided by the concerned country,\" directly reflects this. A country's exports increase the demand for its currency, while imports increase the supply.  Statement 3, \"stability of the government of the concerned country,\" also plays a significant role. Political instability creates uncertainty and can lead to capital flight, decreasing the value of the currency. Statement 4, \"economic potential of the country in question,\" is another important factor. A country with strong economic fundamentals, such as high growth rates and low inflation, tends to have a stronger currency. The World Bank (Statement 1) does not directly set currency prices; it is an international financial institution that provides loans and grants to developing countries.\n\n\nShort notes on keywords and named entities:\n\n* **World Bank:** An international financial institution that provides loans and grants to developing countries for various development projects. It aims to reduce poverty and improve living standards.\n\n* **demand for goods/services:** The amount of a particular currency that is desired by buyers in the foreign exchange market. This demand is driven by factors such as a country's exports, investment inflows, and tourism.\n\n* **stability of the government:** The level of political and economic stability within a country. Political stability and sound economic policies influence investor confidence and capital flows, impacting currency value.\n\n* **economic potential:** A country's capacity for economic growth and development. Factors such as GDP growth, inflation, and fiscal strength influence investor confidence and currency value.\n"
    },
    {
        "Q.No.": 80,
        "question_text": "The basic aim of Lead Bank Scheme is that",
        "option_a": "big banks should try to open offices in each district",
        "option_b": "there should be stiff competition among the various nationalized banks",
        "option_c": "individual banks should adopt particular districts for intensive development",
        "option_d": "all the banks should make intensive efforts to mobilize deposits",
        "correct_option": "c",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:The Lead Bank Scheme's primary goal is for individual banks to focus on specific districts for intensive development.  This approach allows banks to concentrate resources and expertise on particular areas, promoting economic growth within those regions.\n\nThe other options are not the central aim of the scheme:  (a)  While the scheme might indirectly lead to wider bank presence, it's not the primary objective. (b)  Competition among banks is a general aspect of the banking sector but not the specific aim of this scheme. (d) While deposit mobilization is important for banks, the Lead Bank Scheme's focus is more targeted development of specific districts.\n\nNationalized banks: Banks that are owned by the government.  The nationalization of banks in India occurred in phases (1969, 1980), significantly altering the banking landscape.\n\nNarsimhan Committee:  A committee that made significant recommendations for reforming the Indian banking sector, addressing issues of efficiency and competition.  There were two committees: one in 1991 and another in 1998.  The recommendations impacted banking regulations and practices.\n\nSARFAESI Act 2002: The Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002, provides a framework for banks to recover non-performing assets (NPAs) more efficiently.\n\nPrivate banks: Banks that are privately owned and operate for profit.  The licensing of private banks has evolved over time, with the government setting criteria for entry.\n\nBase Rate for loans (BOLR):  A benchmark interest rate used by banks to determine lending rates.  It is a key element of pricing loans and reflects the bank's cost of funds.\n\nDebt Recovery Tribunal: A specialized tribunal established to handle the recovery of debts owed to banks and financial institutions.  It plays a crucial role in the enforcement of financial contracts.\n\nCRR (Cash Reserve Ratio), SLR (Statutory Liquidity Ratio):  Reserve ratios mandated by the central bank (RBI) that banks must maintain to ensure liquidity and stability in the financial system.  These ratios affect the amount of money banks can lend.\n\nRepo Rate, Reverse Repo Rate, MSF (Marginal Standing Facility), LAF (Liquidity Adjustment Facility):  Monetary policy tools used by the central bank to manage liquidity and interest rates in the economy. These tools influence the cost of borrowing and lending between banks and the central bank.\n\nMoral suasion:  The use of persuasion and influence by the central bank to guide banks' lending practices without imposing strict regulations.\n\nDirect action:  Direct interventions by the central bank to influence the money supply and credit conditions, such as changing reserve requirements or interest rates.\n\nOMO (Open Market Operations): The buying and selling of government securities by the central bank to influence the money supply.\n\nM1, M2, M3, M4: Measures of money supply reflecting different levels of liquidity in the economy.\n\n\n"
    },
    {
        "Q.No.": 81,
        "question_text": "Consider the following:\n1. Assessment of land revenue on the basis of nature of the soil and the quality of crops\n2. Use of mobile cannons in warfare\n3. Cultivation of tobacco and red chillies\nWhich of the above was/were introduced into India by the English?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "2 and 3",
        "option_d": "None",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation: The English introduced the use of mobile cannons in warfare and the cultivation of tobacco and red chillies into India.  Assessment of land revenue based on soil and crop quality was a pre-existing practice refined and utilized by various rulers, including the Mughals, but not uniquely introduced by the English.\n\n**Short Notes:**\n\n* **Assessment of land revenue:**  Systems for assessing land revenue existed in India long before the arrival of the English.  Different rulers employed various methods, often based on factors like soil fertility and crop yields. The Mughals, for example, developed sophisticated revenue systems under Akbar.\n\n* **Mobile cannons:**  Canons were a significant development in warfare.  The English, along with other European powers, utilized mobile artillery effectively, impacting military strategies in India. Babur's use of cannons at Panipat is a notable example of their early impact.\n\n* **Cultivation of tobacco and red chillies:** These New World crops were introduced to India by the Portuguese and later spread widely due to the European presence.  Their cultivation significantly impacted Indian agriculture and cuisine.\n\n* **East India Company (EIC):** A powerful British trading company chartered in 1600. It gradually gained political control over large parts of India, eventually leading to British colonial rule.\n\n* **Captain William Hawkins:** An early English representative who visited the Mughal court of Jahangir in 1609, seeking trading privileges.\n\n* **Captain Thomas Best:** An English captain involved in naval skirmishes with the Portuguese off the coast of Surat in 1612.\n\n* **Sir Thomas Roe:** Served as an ambassador from King James I of England to the Mughal court of Jahangir in 1615, securing trade concessions.\n\n* **Golden Farman:**  A document granting trade privileges to the EIC issued by the Sultan of Golconda in 1632.\n\n* **Fort St. George:** A fort established by the English in Madras (present-day Chennai) in 1639.\n\n* **Job Charnock:**  A key figure in establishing the English presence in Bengal, founding the settlement at Calcutta.\n\n* **Fort William:**  The main English fort built in Calcutta in 1700.\n\n* **John Surman:**  An English representative who secured important trade and administrative privileges from the Mughal emperor Farrukhsiyar in 1715.\n\n* **King Louis XIV:**  The French king who supported the French East India Company.\n\n* **French East India Company:** A French trading company that competed with the British in India.\n\n* **Danish East India Company:** A Danish trading company with a relatively smaller presence in India compared to the British and French.\n\n* **Aurangzeb:** The last effective Mughal emperor whose long reign (1658-1707) witnessed the beginning of the empire's decline.\n\n* **Muhammad Shah:** A Mughal emperor whose rule (1719-1748) was marked by weakness and the growing power of regional rulers.\n\n* **Al-Biruni:**  A scholar who wrote *Kitab al-Hind*, an important source on India's culture and society, commissioned by Sultan Mahmud of Ghazni.\n\n* **Sultan Mahmud of Ghazni:** A powerful ruler of Ghazni who conducted several raids into India, targeting wealthy temples.\n\n* **Prithviraja III:** A Chahamana ruler who briefly challenged the expansion of the Delhi Sultanate before his defeat in 1192.\n\n* **Sultan Muhammad Ghori:**  An Afghan ruler who defeated Prithviraja III and established the Delhi Sultanate.\n\n* **Rajaraja I:** A powerful Chola ruler who expanded the kingdom and initiated significant architectural projects.\n\n* **Rajendra I:**  The son of Rajaraja I, who continued the Chola expansion into Southeast Asia.\n\n* **Uttaramerur:** A village in Tamil Nadu with inscriptions detailing the functioning of the Chola sabha (assembly).\n\n* **Amir Khusrau:** A poet who wrote about the linguistic diversity of India in the 14th century.\n\n* **Ghiyasuddin Balban:** A powerful Delhi Sultan.\n\n* **Alauddin Khalji:** A Delhi Sultan who expanded the Sultanate and introduced significant administrative reforms.\n\n* **Muhammad Tughluq:**  A Delhi Sultan known for his ambitious but often disastrous policies.\n\n* **Firuz Shah Tughluq:** A Delhi Sultan.\n\n* **Ibn Battuta:**  A 14th-century traveler from Morocco whose accounts provide valuable insights into the social and political conditions of India.\n\n* **Genghis Khan:** Founder of the Mongol Empire.\n\n* **Timur (Tamerlane):** A Turco-Mongol conqueror whose descendants founded the Mughal dynasty in India.\n\n* **Babur:** The founder of the Mughal dynasty in India.\n\n* **Humayun:** The second Mughal emperor.\n\n* **Akbar:** The third Mughal emperor, known for his administrative and religious policies.\n\n* **Jahangir:** The fourth Mughal emperor.\n\n* **Shah Jahan:** The fifth Mughal emperor, known for his magnificent architectural projects.\n\n* **Aurangzeb:** The sixth Mughal emperor, whose reign marked the beginning of the Mughal decline.\n\n* **Todar Mal:** Akbar's revenue minister who developed the zabt system of revenue assessment.\n\n* **Abul Fazl:** Akbar's court historian who wrote the Akbar Nama and Ain-i Akbari.\n\n* **Nur Jahan:**  The wife of Jahangir, who held significant influence in the Mughal court.\n\n* **Queen Elizabeth I:** The English queen during the establishment of the EIC.\n\n* **Shivaji:** The founder of the Maratha kingdom.\n\n* **Nadir Shah:**  An Iranian ruler who invaded and plundered Delhi in 1739.\n\n* **Ahmad Shah Abdali:** An Afghan ruler who conducted multiple raids into India.\n\n* **Saadat Khan:** Founder of the Awadh state.\n\n* **Murshid Quli Khan:** Founder of the Bengal state.\n\n* **Asaf Jah:** Founder of the Hyderabad state.\n\n* **Banda Bahadur:** A Sikh leader who led a revolt against Mughal rule in the early 18th century.\n\n* **Maharaja Ranjit Singh:** A Sikh ruler who unified the Sikh misls and established a powerful kingdom in Punjab.\n\n* **Churaman:**  An early Jat leader who consolidated Jat power in the late 17th and early 18th centuries.\n\n* **Suraj Mal:** A Jat ruler who established the strong kingdom of Bharatpur.\n\n\n"
    },
    {
        "Q.No.": 82,
        "question_text": "With reference to the guilds (Shreni) of ancient India that played a very important role in the country's economy, which of the following statements is/are correct?\n1. Every guild was registered with the central authority of the State and the king was the chief administrative authority on them.\n2. The wages, rules of work, standards and prices were fixed by the guild.\n3. The guild had judicial powers over its own members.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3.",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Guilds in ancient India, known as *shrenis*, played a crucial role in the economy.  While they weren't directly registered with a central state authority (making statement 1 incorrect), they did possess significant autonomy.  They set their own internal rules, including wages, work standards, and prices (statement 2 is correct).  Furthermore, *shrenis* often functioned as self-governing bodies with judicial powers over their members (statement 3 is correct).  Therefore, only statements 2 and 3 are correct.\n\nShreni:  Guilds in ancient India that functioned as self-governing bodies for artisans and merchants. They regulated production, prices, and trade within their respective crafts or industries, often acting as courts for disputes among their members. Their organization and influence contributed significantly to the economic structure of ancient India.\n\nAryāṁ:  A term often found in ancient Indian texts, though its precise meaning and application in the context of guilds requires further contextual analysis from other sources.  It may refer to a specific type of guild or a broader social category.  More research is needed to clarify its association with the shrenis.\n\nKumāramātyas:  Important officials within the Gupta Empire's bureaucracy, their specific roles and responsibilities within the context of regulating guilds require further examination.  More information is needed to determine their relationship with the shreni system.\n\nViṣaya:  An administrative division within ancient Indian empires, potentially encompassing multiple villages.  The relationship between viṣayas and the functioning of shrenis requires further exploration using other sources.  More research is needed to define the connection.\n\nSamudragupta:  A Gupta emperor known for his military campaigns and administrative abilities. His relationship with the shrenis requires additional research to ascertain how his rule affected their functioning.\n"
    },
    {
        "Q.No.": 83,
        "question_text": "83. The distribution of powers between the Centre and the States in the Indian Constitution is based on the scheme provided in the",
        "option_a": "Morley-Minto. Reforms, 1909",
        "option_b": "Montagu-Chelmsford Act, 1919",
        "option_c": "Government of India Act, 1935",
        "option_d": "Indian Independence Act, 1947",
        "correct_option": "c",
        "subject": "polity",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation:The Government of India Act, 1935, laid the foundation for the distribution of powers between the Centre and the States in the Indian Constitution.  While elements of federalism existed in earlier acts like the Montagu-Chelmsford Reforms and the Morley-Minto Reforms, the 1935 Act provided a more comprehensive and structured framework, although it leaned towards a unitary system. The Indian Independence Act, 1947, primarily dealt with the transfer of power and did not fundamentally alter the existing power-sharing arrangement established in 1935.\n\n\nMorley-Minto Reforms, 1909: Introduced limited Indian participation in the legislative councils, marking a small step towards self-governance in British India.  It did not establish a significant federal structure.\n\nMontagu-Chelmsford Act, 1919:  Further expanded the legislative councils and introduced dyarchy (dual governance) in certain provinces, dividing powers between Indian ministers and British officials.  It was a step towards greater Indian involvement but still lacked a clear federal structure.\n\nGovernment of India Act, 1935:  This act established a federal system with a division of powers between the Centre and the provinces. It created a federation with both provincial and central legislatures, though with significant central control. It formed the basis of the post-independence federal system, albeit with significant modifications.\n\nIndian Independence Act, 1947: This act primarily dealt with the transfer of power from British rule to independent India.  It did not drastically change the existing federal framework established by the 1935 Act.  It focused on the partition of India and the establishment of independent India and Pakistan.\n"
    },
    {
        "Q.No.": 84,
        "question_text": "Despite having large reserves of coal, why does India import millions of tonnes of coal?\n1. It is the policy of India to save its own coal reserves for future, and import it from other countries for the present use.\n2. Most of the power plants in India are coal-based and they are not able to get sufficient supplies of coal from within the country.\n3. Steel companies need large quantity of coking coal which has to be imported.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2012,
        "explanation": "correct_option: (b)\n\nexplanation: India possesses substantial coal reserves, yet it imports millions of tonnes annually due to several factors.  Statement 2 is correct because many Indian power plants rely on coal, and domestic supply often falls short of their needs. This leads to the necessity of importing coal to meet the energy demand. Statement 3 is also correct as steel production requires significant amounts of coking coal, a specific type of coal not readily available in sufficient quantities within India, necessitating imports. Statement 1, however, is incorrect. While there might be some strategic considerations regarding the use of domestic reserves, it's not the primary reason for coal imports. The main driver is the insufficient domestic supply to meet the burgeoning energy and industrial demands.\n\n\n**Short Notes on Keywords and Named Entities:**\n\n* **Coal:** A combustible black or dark brown sedimentary rock formed from decayed plant matter.  It's a primary source of energy for electricity generation and various industrial processes. India has significant coal reserves but faces challenges in extraction and distribution.\n\n* **India:** A large, diverse country in South Asia with a rapidly growing economy and significant energy demands.  Its energy sector is heavily reliant on coal, but it's also actively pursuing renewable energy sources.\n\n* **Coking Coal:** A high-quality coal used in the production of coke, a fuel essential for iron and steelmaking. It has specific properties making it suitable for metallurgical processes.\n\n* **Power Plants:** Facilities that generate electricity, often using fossil fuels like coal, but also increasingly employing renewable sources.  In India, a significant portion of power generation is coal-based.\n\n* **Steel Companies:** Businesses involved in the production of steel, a crucial material in construction, manufacturing, and various other industries. Steel production is energy-intensive and relies on coking coal.\n\n"
    },
    {
        "Q.No.": 85,
        "question_text": "A person stood alone in a desert on a dark night and wanted to reach his village which was situated 5 km east of the point where he was standing. He had no instruments to find the direction but he located the polestar. The most convenient way now to reach his village is to walk in the",
        "option_a": "direction facing the polestar",
        "option_b": "direction opposite to the polestar",
        "option_c": "direction keeping the polestar to his left",
        "option_d": "direction keeping the polester to his right",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "* **correct_option:** (c)\n* **explanation:** The polestar (Polaris) is almost directly above the Earth's North Pole.  To walk east, the person needs to keep the polestar to his left.  Walking in the direction of the polestar would lead him north, the opposite direction would lead him south, and keeping it to his right would lead him west. Therefore, keeping the polestar to his left is the most convenient way to reach his village, which is situated east of his current location.\n\nA polestar is a star that appears almost directly above the Earth's North Pole, and it's used for navigation as its position remains relatively fixed in the night sky. A desert is a barren, arid land with little to no vegetation. A village is a small settlement, typically smaller than a town.\n"
    },
    {
        "Q.No.": 86,
        "question_text": "Recently, there has been a concern over the short supply of a group of elements called 'rare earth metals'. Why?\n1. China, which is the largest producer of these elements, has imposed some restrictions on their export.\n2. Other than China, Australia, Canada and Chile, these elements are not found in any country.\n3. Rare earth metals are essential for the manufacture of various kinds of electronic items and there is a growing demand for these elements.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Statement 1 is correct. China's dominance in rare earth metal production and its imposition of export restrictions have contributed to supply concerns.  Statement 2 is incorrect. While China is the largest producer, other countries like Australia, Canada, and others also possess rare earth deposits.  Statement 3 is correct. Rare earth metals are crucial for electronics manufacturing, and increasing demand exacerbates the supply issue.  Therefore, only statements 1 and 3 are correct.\n\n\nChina: The world's leading producer of rare earth elements, holding a significant portion of global reserves and refining capacity.  Its export policies heavily influence the global market.\n\nAustralia: Possesses significant rare earth mineral deposits, although their extraction and processing capacity is not as large as China's.\n\nCanada: Another country with rare earth mineral resources, but similar to Australia, it faces challenges in competing with China's established industry.\n\nChile:  While not as prominently featured in rare earth production as Australia or Canada, Chile also has some rare earth deposits.\n\nRare earth metals: A group of 17 elements crucial for various high-tech applications, including electronics, magnets, and green technologies.  Their unique properties make them indispensable in modern technologies, leading to high demand.\n"
    },
    {
        "Q.No.": 87,
        "question_text": "Consider the following protected areas:\n1. Bandipur\n2. Bhitarkanika\n3. Manas\n4. Sunderbans.\nWhich of the above are declared Tiger Reserves?",
        "option_a": "1 and 2 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: Bandipur, Manas, and Sunderbans are declared Tiger Reserves.  \n\nBandipur National Park: Located in Karnataka, India, it's part of the Nilgiri Biosphere Reserve and known for its high tiger density.  It's a significant habitat for elephants and other wildlife.\n\nBhitarkanika National Park: Situated in Odisha, India, it's famous for its mangrove forests and diverse avifauna.  While it's a significant wildlife sanctuary, it's not officially a Tiger Reserve.\n\nManas National Park: Located in Assam, India, it's a UNESCO World Heritage Site and a Tiger Reserve. It's also known for its diverse flora and fauna, including several endangered species.\n\nSunderbans National Park: Situated in West Bengal, India, it's a UNESCO World Heritage Site and a Tiger Reserve. It's the largest mangrove forest in the world and a crucial habitat for the Bengal tiger.\n"
    },
    {
        "Q.No.": 88,
        "question_text": "Consider the following statements:\n1. The duration of the monsoon decreases from southern India to northern India.\n2. The amount of annual rainfall in the northern plains of India decreases from east to west.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is correct. The monsoon's duration decreases as it moves from southern India to northern India.  The southern parts of the peninsula receive rainfall for a longer period compared to the northern plains.  The retreating monsoon leaves the southern parts later than the northern parts.\n\nStatement 2 is also correct.  The annual rainfall in the northern plains of India shows a clear east-to-west gradient. The eastern parts, influenced by the Bay of Bengal branch of the monsoon, receive significantly higher rainfall than the western parts, which are in the rain shadow of the Himalayas and receive less moisture from the monsoon winds.  The Brahmaputra basin in the east receives much higher rainfall than the Satluj basin in the west.\n\n\n**Short notes on named entities:**\n\n* **Monsoon:** The monsoon is a seasonal wind pattern that brings significant rainfall to the Indian subcontinent.  It's crucial for agriculture and the overall economy of India.  It has two main branches: the Arabian Sea branch and the Bay of Bengal branch. The monsoon's arrival and retreat are timed differently across the country.\n\n* **Southern India:** This refers to the southern part of the Indian Peninsula, characterized by the Deccan Plateau and various mountain ranges. It receives rainfall from both branches of the monsoon.\n\n* **Northern India:**  This refers to the northern plains of India, extending from the Himalayas in the north to the Vindhya and Satpura ranges in the south. It's largely an alluvial plain, fed by the rivers originating in the Himalayas.\n\n* **Northern Plains of India:** This vast fertile plain is formed by the deposition of sediments from the rivers Indus, Ganga, and Brahmaputra. It's one of the most densely populated regions in the world.\n\n* **Satluj:** A major tributary of the Indus River, originating in the Himalayas.\n\n* **Brahmaputra:** A major river of South Asia, originating in Tibet and flowing through India and Bangladesh.\n\n* **Ganga:** One of the major rivers of India, originating in the Himalayas and flowing through the northern plains.\n\n* **Yamuna:** A major tributary of the Ganga River.\n\n* **Uttarakhand:** A state in northern India, located in the Himalayas, known for its origin of several major rivers including the Ganga and Yamuna.\n\n* **Alaknanda:** A major tributary of the Ganga River, formed by the confluence of several rivers in Uttarakhand.\n\n* **Bhagirathi:**  Another major tributary of the Ganga River, originating in the Himalayas.\n\n* **Peninsular Plateau:** An elevated plateau in southern India, comprising mostly hard, ancient rocks. It is a region with diverse topography and climate.\n\n* **Godavari:** The longest river in peninsular India.\n\n* **Indira Point:** The southernmost point of India, located on the Great Nicobar Island.\n\n* **Vindhyas:** A mountain range in central India, separating the northern plains from the Deccan Plateau.\n\n* **Deccan Plateau:** A large plateau in southern India, known for its black soil and unique geological formations.\n\n* **Deccan Trap:**  A large igneous province formed by extensive volcanic activity in the Deccan region of India.\n\n* **Narmada & Tapi:** Rivers flowing through central India, occupying ancient rift valleys.\n\n* **Western Ghats:** A mountain range along the western coast of India, intercepting moisture from the Arabian Sea branch of the monsoon, creating a rain shadow effect on the eastern side.\n\n* **Eastern Ghats:** A discontinuous mountain range along the eastern coast of India.\n\n* **Bay of Bengal:** A large bay in the Indian Ocean, bordered by India, Bangladesh, Myanmar, Thailand, and Sri Lanka.\n\n* **Arabian Sea:** A large marginal sea of the Indian Ocean, bordered by the Arabian Peninsula, the Horn of Africa, and the Indian subcontinent.\n\n* **Western Disturbances:**  Cyclonic weather systems originating in the Mediterranean Sea and bringing rainfall to northwest India during winter.\n\n* **Chota Nagpur Plateau:** A plateau in eastern India known for its mineral resources.\n\n* **Coromandel Coast:** The eastern coast of southern India, known for its fertile deltas and ports.\n\n* **Meghalaya:** A state in northeastern India known for its high rainfall.\n\n\n"
    },
    {
        "Q.No.": 89,
        "question_text": "Which one of the following is the characteristic climate of the Tropical Savannah Region?",
        "option_a": "Rainfall throughout the year",
        "option_b": "Rainfall in winter only",
        "option_c": "An extremely short dry season",
        "option_d": "A definite dry and wet season",
        "correct_option": "d",
        "subject": "geography",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: The Tropical Savannah region is characterized by a definite dry and wet season.  The text describes the region as having moderate rainfall and a green annual rain period, indicating a distinct wet season.  The presence of  \"course tau grass,\" acacia trees, and animals like the Maasai (Changa) further supports this description of a savannah climate.  Option (a) describes a climate with rainfall throughout the year, which is not characteristic of a savannah. Option (b) describes rainfall only in winter, while option (c) suggests an extremely short dry season; neither of these accurately reflects the seasonal rainfall pattern of a savannah.\n\nTropical Savannah: This biome is characterized by a distinct wet and dry season, with moderate rainfall.  The vegetation includes grasses (like tau grass), scattered trees (like acacia), and supports a variety of wildlife adapted to the seasonal changes.\n\nMaasai (Changa):  A Nilotic ethnic group inhabiting southern Kenya and northern Tanzania, known for their pastoral lifestyle adapted to the savannah environment.\n\nAcacia: A genus of thorny trees and shrubs commonly found in dry tropical and subtropical regions, including savannahs.  They are well-adapted to drought conditions.\n\nTau grass: A type of tall grass characteristic of savannah ecosystems, providing grazing for herbivores.\n"
    },
    {
        "Q.No.": 90,
        "question_text": "In which one among the following categories, of protected areas in India are local people not allowed to collect and use the biomass?",
        "option_a": "Biosphere Reserves",
        "option_b": "National Parks",
        "option_c": "Wetlands declared under Ramsar Convention",
        "option_d": "Wildlife Sanctuaries",
        "correct_option": "b",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: In India, National Parks have the highest level of protection among protected areas.  Human activities, including the collection and use of biomass, are strictly prohibited within their boundaries to preserve the ecological integrity and biodiversity of the area.  Biosphere reserves, on the other hand, have a zoning system that allows for sustainable use of resources in designated areas by local communities. Wildlife sanctuaries allow for some regulated human activities, and Ramsar wetlands protect specific wetland ecosystems, but neither strictly prohibits biomass collection by local people in all zones.\n\n\nShort notes on important keywords and named entities:\n\n**Protected areas:** Designated regions with varying levels of protection to conserve biodiversity and natural resources.  They range from strictly protected national parks to areas allowing sustainable use by local communities (biosphere reserves, wildlife sanctuaries).\n\n**National Parks:**  Strictly protected areas where human intervention is minimal, aimed at conserving the natural ecosystem and biodiversity.  All extractive activities are generally prohibited.\n\n**Biosphere Reserves:**  Areas encompassing a core zone of strict protection, a buffer zone with limited human activity, and a transition zone where sustainable use of resources is permitted.  Local communities often play a role in management.\n\n**Wetlands declared under Ramsar Convention:**  Wetlands of international importance designated under the Ramsar Convention, focusing on their conservation and wise use.  Management strategies can vary.\n\n**Wildlife Sanctuaries:**  Protected areas where wildlife is conserved, but some human activities (e.g., grazing, forestry) may be permitted under regulation.\n"
    },
    {
        "Q.No.": 91,
        "question_text": "Consider the following kinds of organisms.:\n1. Bat\n2. Bee\n3. Bird\nWhich of the above is/are pollinating agent/agents?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation: Bats, bees, and birds can all act as pollinating agents.  Bees are well-known pollinators, using pollen from flowers as a food source. Birds, particularly hummingbirds and sunbirds, are also important pollinators, often feeding on nectar from flowers with long, tubular shapes.  Certain bat species are also pollinators, feeding on nectar and transferring pollen between plants in the process.  Therefore, all three organisms listed (bats, bees, and birds) can be pollinating agents.\n\nBats:  Bats are mammals capable of flight, exhibiting a wide range of ecological roles, including insectivory, frugivory, and nectarivory.  Many bat species are nocturnal and play a crucial role in seed dispersal and pollination.\n\nBees: Bees are flying insects known for their role in pollination. They collect nectar and pollen from flowers, transferring pollen between plants as they feed.  Different bee species have diverse foraging behaviors and preferences.\n\nBirds: Birds are warm-blooded vertebrates characterized by feathers, wings, and beaks.  Many bird species are diurnal and play vital roles in seed dispersal and pollination, particularly those that feed on nectar.\n"
    },
    {
        "Q.No.": 92,
        "question_text": "Which one of the following groups of animals belongs to the category of endangered species?",
        "option_a": "Great Indian Bustard, Musk Deer, Red Panda and Asiatic Wild Ass",
        "option_b": "Kashmir Stag, Cheetal, Blue Bull and Great Indian Bustard",
        "option_c": "Snow Leopard, Swamp Deer, Rhesus Monkey and Saras Crane",
        "option_d": "Lion-tailed Macaque, Blue Bull, Hanuman Langur and Cheetal",
        "correct_option": "a",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation:The Great Indian Bustard, Musk Deer, Red Panda, and Asiatic Wild Ass are all listed as endangered species.  The other options contain some endangered species, but also include species that are not considered endangered.\n\nGreat Indian Bustard: This large, ground-dwelling bird is critically endangered, primarily due to habitat loss and hunting.  Its population is severely fragmented.\n\nMusk Deer: These small deer are endangered due to poaching for their musk, a valuable ingredient in perfumes and traditional medicine.  Habitat loss also contributes to their decline.\n\nRed Panda:  These arboreal mammals are endangered due to habitat loss and fragmentation from deforestation and human encroachment.  They are also vulnerable to poaching.\n\nAsiatic Wild Ass (also known as the Indian Wild Ass or Onager): These asses are endangered due to habitat loss and degradation, hunting, and competition with livestock for resources.  Their range is restricted to a few arid regions.\n\nKashmir Stag (Hangul): This subspecies of red deer is critically endangered, primarily due to habitat loss and fragmentation, poaching, and disease.  Its population is extremely small and isolated.\n\nCheetal (Axis axis): Also known as the chital or spotted deer, this is a relatively common deer species in India, not generally considered endangered.\n\nBlue Bull (Nilgai): This large antelope is not considered endangered, though populations may be threatened in some areas.\n\nSnow Leopard:  This elusive cat is vulnerable due to habitat loss, prey depletion, and poaching.  It inhabits high-altitude regions of the Himalayas.\n\nSwamp Deer (Barasingha): This deer is endangered, facing threats from habitat loss, poaching, and disease.\n\nRhesus Monkey:  A common primate, not considered endangered.\n\nSaras Crane: This large crane is vulnerable due to habitat loss and degradation, and human disturbance.\n\nLion-tailed Macaque: This primate is endangered due to habitat loss and fragmentation, primarily from deforestation.\n\nHanuman Langur: This monkey is not considered endangered, though populations may be threatened in some areas.\n"
    },
    {
        "Q.No.": 93,
        "question_text": "Consider the following statements: If there were no phenomenon of capillarity\n1. it would be difficult to use a kerosene lamp\n2. one would not be able to use a straw to consume a soft drink.\n3. the blotting paper would fail to function\n4. the big trees that we see around would not have grown on the Earth\nWhich of the statements given above are correct?",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (d)\nexplanation:Capillarity is the ability of a liquid to flow in narrow spaces without the assistance of, or even in opposition to, external forces like gravity.  If capillarity did not exist:\n\n1. Kerosene lamps would be difficult to use because the kerosene would not rise through the wick by capillary action.\n\n2. Using a straw to drink a soft drink would be impossible; the liquid would not rise into the straw.\n\n3. Blotting paper relies on capillarity to absorb liquids; it would be ineffective without it.\n\n4.  Capillary action is crucial for water transport in large trees.  Water moves from the roots to the leaves against gravity through tiny vessels, a process aided by capillarity. Without it, large trees would struggle to obtain sufficient water, hindering their growth.\n\n\nKerosene: A combustible hydrocarbon liquid, used as fuel.\nStraw: A slender tube, typically made from straw or plastic, used for drinking beverages.\nBlotting paper: An absorbent paper used to remove excess liquid from a surface.\nBig trees: Tall trees, requiring efficient water transport systems.\n"
    },
    {
        "Q.No.": 94,
        "question_text": "The Millennium Ecosystem Assessment describes the following major categories of ecosystem services-provisioning, supporting, regulating, preserving and cultural. Which one of the following is supporting service?",
        "option_a": "Production of food and water",
        "option_b": "Control of climate and disease",
        "option_c": "Nutrient cycling and crop pollination.",
        "option_d": "Maintenance of diversity",
        "correct_option": "c",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Nutrient cycling and crop pollination are considered supporting services because they are necessary for the functioning of the ecosystem, providing the foundation for other ecosystem services.  Nutrient cycling involves the movement and transformation of nutrients within the ecosystem, while crop pollination is essential for plant reproduction and food production.\n\nProduction of food and water (a) is a provisioning service. Control of climate and disease (b) is a regulating service. Maintenance of diversity (d) is a supporting service, but nutrient cycling and pollination are more directly involved in supporting the basic functions of the ecosystem.\n\nMillennium Ecosystem Assessment: A major UN-led assessment of the consequences of ecosystem change for human well-being.  It classified ecosystem services into four major categories: provisioning, regulating, supporting, and cultural.\n\nEcosystem services: The many and varied benefits that humans derive from ecosystems.  These benefits are essential for human well-being and include things like clean water, food, and climate regulation.\n\nHomeostasis: The ability of a system (e.g., an ecosystem) to maintain a stable internal environment in the face of external changes.\n\nEcotones: Transitional zones between two different ecosystems.  They often have higher biodiversity than either of the adjacent ecosystems due to the “edge effect”.\n\nEcological Niche: The specific role and position a species occupies within its ecosystem, including its interactions with other species and the environment.\n\nBiome: A large geographic area characterized by specific climate conditions and the types of plants and animals that thrive in those conditions.  Examples include tundra, taiga, and rainforest.  Biome distribution is largely determined by temperature and precipitation.\n\nFood chain: A linear sequence of organisms where each organism is eaten by the next one in the chain.  Energy flows through the food chain from producers (plants) to consumers (animals).\n\nFood web: A complex network of interconnected food chains, illustrating the multiple feeding relationships within an ecosystem.\n\nEcological pyramid: A graphical representation of the trophic structure of an ecosystem, showing the relative biomass, numbers, or energy at each trophic level.  Energy pyramids are always upright, while pyramids of numbers and biomass can be inverted.\n\nBioaccumulation: The accumulation of substances, such as pesticides or other chemicals, in an organism.\n\nBiomagnification: The increasing concentration of a substance, such as a toxin, in organisms at successively higher levels of a food chain.\n\nDetritus: Dead organic matter.\n\nDetritus food chain: A food chain that begins with detritus and includes decomposers.\n\n\n"
    },
    {
        "Q.No.": 95,
        "question_text": "What is the difference between the antelopes Oryx and Chiru?",
        "option_a": "Oryx is adapted to live in hot and arid areas whereas Chiru is adapted to live in steppes and semi-desert areas of cold high mountains",
        "option_b": "Oryx is poached for its antlers whereas Chiru is poached for its musk",
        "option_c": "Oryx exists in western India only whereas Chiru exists in north-east India only",
        "option_d": "None of the statements (a), (b) and (c) given above is correct",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2012,
        "explanation": "correct_option: (a)\n\nexplanation: Oryx antelopes are adapted to hot, arid environments, while Chiru are adapted to the cold, high-altitude steppes and semi-deserts of mountains.  Oryx are sometimes poached for their horns (though not their primary value), while Chiru are poached primarily for their musk.  Neither antelope is restricted to only western or northeastern India; their ranges are much broader.\n\nOryx:  A genus of large antelopes known for their long, straight horns.  They are well-adapted to arid and semi-arid habitats, exhibiting traits like efficient water conservation mechanisms. Several Oryx species exist across Africa and the Arabian Peninsula.\n\nChiru: A Tibetan antelope inhabiting the high-altitude grasslands and steppes of the Tibetan Plateau.  They are critically endangered, primarily due to poaching for their soft underwool (shahtoosh) and to a lesser extent, their musk.  Their adaptations include thick fur for insulation in cold environments.\n"
    },
    {
        "Q.No.": 96,
        "question_text": "Which of the following can be threats to the biodiversity of a geographical area?\n1. Global warming\n2. Fragmentation of habitat.\n3. Invasion of alien species\n4. Promotion of vegetarianism\nSelect the correct answer using the codes given below:",
        "option_a": "1, 2 and 3 only",
        "option_b": "2. and 3 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation: Global warming, habitat fragmentation, and invasion of alien species are all significant threats to biodiversity.  Global warming alters habitats, making them unsuitable for many species. Habitat fragmentation isolates populations, reducing genetic diversity and making them vulnerable. Invasive species outcompete native species for resources, leading to population declines and extinctions. Promotion of vegetarianism, while having other environmental impacts, is not a direct threat to biodiversity in the same way as the other three options.\n"
    },
    {
        "Q.No.": 97,
        "question_text": "and 3 only\n(c) 1 and 4 only\n(d) 1, 2, 3 and 4\n\n97. Consider the following:\n1. Black-necked crane\n2. Cheetah\n3. Flying squirrel\n4. Snow leopard\nWhich of the above are naturally found in India?",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation:The Black-necked crane (1) is found in the high altitude wetlands of India, particularly in the Himalayas. The Snow leopard (4) inhabits the high-altitude mountainous regions of the Himalayas in India. The Flying squirrel (3) is also found in India.  Cheetahs (2), however, are not naturally found in India; they were declared extinct in India in 1952.  The African cheetah reintroduction project is underway in India, but this is not a naturally occurring population.  Therefore, only options 1, 3, and 4 are naturally found in India.\n\n\nBlack-necked crane: A large, endangered crane species found in the high-altitude wetlands of the Himalayas, including India.  Known for its distinctive black neck and white face.  Its habitat is threatened by human activities and climate change.\n\nCheetah: A large, spotted feline known for its speed.  Once widely distributed across Africa and Asia, but now significantly reduced in range due to habitat loss and hunting.  Extinct in India but there are efforts to reintroduce the species.\n\nFlying squirrel: Small, nocturnal mammals with large eyes, and patagium (skin membrane) that allows them to glide between trees.  They are arboreal and inhabit forests.\n\nSnow leopard: A large cat species inhabiting high-altitude mountainous regions of Central Asia, including the Himalayas in India.  Known for its thick fur and camouflage abilities.  Its habitat is threatened by climate change and human activities.\n"
    },
    {
        "Q.No.": 98,
        "question_text": "Consider the following agricultural practices:\n1. Contour bunding\n2. Relay cropping\n3. Zero tillage\nIn the context of global climate change, which of the above helps/help in carbon sequestration/storage in the soil?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None of them",
        "correct_option": "c",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (c)\nexplanation: Contour bunding involves creating bunds (ridges) along the contours of slopes to prevent soil erosion and conserve water. This practice helps in carbon sequestration by reducing soil erosion, which leads to the loss of organic matter. Relay cropping involves planting a second crop before the first crop is harvested. This increases the biomass and organic matter in the soil, contributing to carbon sequestration. Zero tillage farming involves planting crops directly into the soil without plowing or tilling. This leaves the soil undisturbed, preserving soil structure and increasing organic matter accumulation, which enhances carbon sequestration.  Therefore, all three practices contribute to carbon sequestration.\n"
    },
    {
        "Q.No.": 99,
        "question_text": "What would happen if phytoplankton of an ocean is completely destroyed for some reason?\n1. The ocean as a carbon sink would be adversely affected.\n2. The food chains in the ocean would be adversely affected.\n3. The density of ocean water would drastically decrease.\nSelect the correct answer using the codes given below:",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2012,
        "explanation": "correct_option: (a)\nexplanation:Phytoplankton are the base of most marine food webs.  Their destruction would lead to a collapse of the food chain (2).  Phytoplankton also play a crucial role in the carbon cycle, absorbing significant amounts of atmospheric CO2 through photosynthesis.  Their elimination would severely impair the ocean's capacity as a carbon sink (1).  The density of ocean water would not drastically decrease because phytoplankton's contribution to overall water density is relatively small compared to the mass of water itself (3).\n\n**Short notes:**\n\n* **Phytoplankton:** Microscopic, photosynthetic organisms that form the base of most aquatic food webs. They are crucial for oxygen production and carbon sequestration.\n\n* **Carbon sink:** A natural or artificial reservoir that absorbs and stores more carbon dioxide from the atmosphere than it releases. Oceans are a major carbon sink.\n\n* **Food chain:** A linear network of links in a food web starting from producer organisms and ending at apex predator species, detritivores, or decomposer species.  Each link represents a feeding relationship between two species.\n"
    },
    {
        "Q.No.": 100,
        "question_text": "Vultures which used to be very common in Indian countryside some years ago are rarely seen nowadays. This is attributed to",
        "option_a": "the destruction of their nesting sites by new invasive species",
        "option_b": "a drug used by cattle owners for treating their diseased cattle",
        "option_c": "scarcity of food available to them",
        "option_d": "a widespread, persistent and fatal disease among them",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2012,
        "explanation": "correct_option: (b)\nexplanation: The decline in vulture populations in the Indian countryside is primarily attributed to diclofenac, a drug used to treat diseased cattle.  Vultures that feed on carcasses of treated cattle ingest the drug, which is toxic to them, causing kidney failure and death.  This has led to a drastic reduction in vulture numbers.\n\nOther options are less likely causes:\n\n(a) The destruction of nesting sites by invasive species is a possible factor affecting some bird populations, but it's not the primary reason for the widespread decline of vultures in India.\n\n(c)  While food scarcity can impact vulture populations, the diclofenac poisoning is a more significant and direct cause of their decline.\n\n(d) While diseases can affect any population, a widespread, persistent, and fatal disease affecting vultures hasn't been the main factor behind the observed decline.  Diclofenac poisoning is the confirmed primary cause.\n\n\n**Named Entities and Keywords:**\n\n* **Vultures:** Large birds of prey that feed on carrion (dead animals).  Several vulture species are found in India, and many are critically endangered.  Their role in the ecosystem is significant, as they help remove carcasses, preventing the spread of disease.\n\n* **Indian countryside:** Refers to the rural areas of India, where vultures were once common.  The decline of vultures has significant ecological consequences for this environment.\n\n* **Diclofenac:** A non-steroidal anti-inflammatory drug (NSAID) used to treat pain and inflammation in cattle.  It is highly toxic to vultures, even in small doses. The widespread use of diclofenac in veterinary medicine is the primary cause of the decline in vulture populations.\n\n* **Cattle owners:** Individuals who raise and care for cattle. Their practices, particularly the use of diclofenac, have had a devastating impact on vulture populations.\n\n* **Diseased cattle:**  Cattle suffering from illnesses or injuries. The treatment of these animals with diclofenac has unintentionally caused the deaths of numerous vultures.\n\n* **Invasive species:** Organisms that are not native to a particular area and whose introduction causes ecological damage.  While this is a general ecological concern, it is not the main factor for vulture decline in India.\n\n* **Food:**  The carrion (dead animals) that vultures consume. The availability of food can affect vulture populations, but diclofenac poisoning is a more direct threat.\n\n\n"
    }
]