[
    {
        "q_num": 1,
        "question_text": "With reference to Mughal India, what is/are the difference/differences between Jagirdar and Zamindar?\n1. Jagirdars were holders of land assignments in lieu of judicial and police duties, whereas Zamindars were holders of revenue rights without obligation to perform any duty other than revenue collection.\n2. Land assignments to Jagirdars were hereditary and revenue rights of Zamindars were not hereditary.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is largely correct. Jagirdars received land assignments (jagirs) in exchange for military and administrative services, including judicial and police duties.  Zamindars, on the other hand, primarily held revenue rights, their main obligation being the collection of revenue for the Mughal state.  While some Zamindars might have had other responsibilities, it wasn't a defining feature of their position in the same way it was for Jagirdars.\n\nStatement 2 is incorrect. While the heritability of jagirs varied depending on the grant's terms and the ruler's whims, it was often hereditary.  Similarly, Zamindari rights could also be hereditary, although the degree of heritability varied across regions and time periods.  The Mughal system was complex, and the extent of heritability for both positions wasn't uniformly defined.\n\n**Short Notes:**\n\n* **Jagirdar:** A landholder in Mughal India who received a jagir (land assignment) in exchange for military service, administrative duties (including judicial and police functions), and revenue collection responsibilities. The size and duration of the jagir varied depending on the Jagirdar's rank and the ruler's favor.  Heritability wasn't always guaranteed.\n\n* **Zamindar:**  A landholder in Mughal India primarily responsible for collecting revenue from the peasants on behalf of the state.  While some Zamindars might have had additional administrative or judicial responsibilities, their primary function was revenue collection.  The extent of their power and the heritability of their rights were not uniform throughout the empire.\n\n* **Mansabdari system:** A unique system of military and administrative organization employed by the Mughal emperors. It involved assigning ranks (mansabs) to officials based on a dual ranking system (zat and sawar) that determined their salary, military responsibilities, and social status.  It played a crucial role in the administration and military of the Mughal Empire.\n\n* **Zat:**  One component of the dual ranking system in the Mughal Mansabdari system. It represented the personal rank of a mansabdar, indicating their social standing and status. It determined the official's salary and social standing.\n\n* **Sawar:** The second component of the dual ranking system in the Mughal Mansabdari system.  It represented the number of cavalrymen a mansabdar was expected to maintain. It showed the military capacity of the mansabdar.\n\n* **Akbar:** The third Mughal emperor, known for his administrative reforms, religious tolerance, and expansion of the empire. His reign is considered a golden age in Mughal history. His administrative and military reforms were significant.\n\n* **Aurangzeb:** The sixth Mughal emperor, known for his religious conservatism and expansionist policies. His reign marked a shift toward greater religious intolerance and the decline of the Mughal Empire.  His policies had significant negative consequences.\n\n* **Jahangir:** The fourth Mughal emperor, known for his patronage of arts and culture, and his relatively peaceful reign compared to some of his predecessors and successors. His reign saw some modifications in the Mansabdari system.\n\n\n"
    },
    {
        "q_num": 2,
        "question_text": "With reference to land reforms in independent India, which one of the following statements is correct?",
        "option_a": "The ceiling laws were aimed at family holdings and not individual holdings.",
        "option_b": "The major aim of land reforms was providing agricultural land to all the landless.",
        "option_c": "It resulted in cultivation of cash crops as a predominant form of cultivation.",
        "option_d": "Land reforms permitted no exemptions to the ceiling limits.",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:The ceiling laws in India were designed to limit the maximum amount of land that an individual *family* could own.  The aim was to redistribute surplus land to landless farmers and reduce land concentration. Option (b) is incorrect because while providing land to the landless was a goal, it wasn't the *major* aim;  redistributing surplus land was equally, if not more, important. Option (c) is wrong because land reforms didn't predominantly shift cultivation towards cash crops. Option (d) is false because there were exemptions granted under the ceiling laws, often due to political influence or loopholes in implementation.  The Zamindari system, Mahalwari system, and Ryotwari system were pre-independence land revenue systems that the reforms aimed to dismantle.  The Bhoodan and Gramdan movement represented a non-violent approach to land redistribution.  The Naxalite movement, conversely, employed more forceful methods.  Telangana witnessed both communal legal and Naxalite movements related to land reforms. West Bengal and Kerala saw significant peasant mobilization for land rights.  Article 39 of the Indian Constitution guided land reform policy by emphasizing equitable distribution of resources.  The implementation of ceiling laws, however, faced significant challenges due to political resistance and loopholes.  Despite aims to distribute land to the landless, the actual redistribution was far less successful than intended.\n"
    },
    {
        "q_num": 3,
        "question_text": "The Global Competitiveness Report is published by the",
        "option_a": "International Monetary Fund",
        "option_b": "United Nations Conference on Trade and Development",
        "option_c": "World Economic Forum",
        "option_d": "World Bank",
        "correct_option": "c",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation:The Global Competitiveness Report is published by the World Economic Forum (WEF).\n\nThe International Monetary Fund (IMF) is an international organization that works to foster global monetary cooperation, secure financial stability, facilitate international trade, promote high employment and sustainable economic growth, and reduce poverty around the world.  It provides loans, policy advice, and technical assistance to its member countries.\n\nThe United Nations Conference on Trade and Development (UNCTAD) is an intergovernmental organization of the United Nations responsible for dealing with trade, investment, and development issues.  It promotes the integration of developing countries into the global economy.\n\nThe World Bank is an international financial institution that provides loans and grants to the governments of low- and middle-income countries for the purpose of pursuing capital projects. It aims to reduce poverty and support economic development.\n"
    },
    {
        "q_num": 4,
        "question_text": "Consider the following statements about 'the Charter Act of 1813':\n1. It ended the trade monopoly of the East India Company in India except for trade in tea and trade with China.\n2. It asserted the sovereignty of the British Crown over the Indian territories held by the Company.\n3. The revenues of India were now controlled by the British Parliament.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation:The Charter Act of 1813 significantly altered the East India Company's role in India.  Statement 1 is correct: it ended the Company's monopoly on trade in India, except for tea and trade with China.  Statement 2 is incorrect: the Act did not explicitly assert the sovereignty of the British Crown over the Company's territories. While it increased British parliamentary control, it didn't directly transfer sovereignty. Statement 3 is correct: the Act increased parliamentary oversight of Indian revenues, giving the British Parliament more control over the Company's financial dealings. Therefore, only statements 1 and 3 are correct.\n\n\n**Short notes on named entities:**\n\n* **Charter Act of 1813:** This Act marked a significant shift in British control over India, curtailing the East India Company's trade monopoly and increasing parliamentary oversight of its affairs.  It laid the groundwork for greater British influence over Indian governance and finances.\n\n* **East India Company (EIC):**  A powerful British trading company that held significant political and economic power in India from the 17th to the 19th centuries.  It gradually transitioned from a trading entity to a governing body, managing large swathes of Indian territory. The EIC's rule ended in 1858 after the Sepoy Mutiny.\n\n* **British Crown:** Refers to the British monarch and the sovereign power of the United Kingdom. The Crown's authority gradually extended over India, culminating in the direct rule of the British government after 1858.\n\n* **British Parliament:** The supreme legislative body of the United Kingdom.  The Charter Act of 1813 enhanced the Parliament's influence over the East India Company's actions in India, particularly regarding financial matters.\n\n* **Revolt of 1857 (Sepoy Mutiny):** A major uprising against British rule in India. The aftermath of this revolt led to significant changes in the governance of India, including the abolishment of the East India Company's rule.\n\n* **Act for the Good Government of India:** This is another name for the Charter Act of 1813, reflecting its intent to improve the administration of India under British control.\n\n* **Abolition of EIC:** The East India Company's political power was abolished in 1858 following the Sepoy Mutiny, with the British Crown taking direct control of India's governance.  The Company continued to exist as a commercial entity for a short time after.\n\n* **Lord Warren Hastings:** The first Governor-General of Bengal, who played a crucial role in establishing British administrative control in India.\n\n* **Lord William Bentinck:**  Governor-General of India, instrumental in implementing social reforms and administrative changes during his tenure.\n\n* **Macaulay Committee:** A committee formed in 1854 to reform the civil service examination system in India, opening opportunities for Indians.\n\n\n"
    },
    {
        "q_num": 5,
        "question_text": "With reference to Swadeshi Movement, consider the following statements:\n1. It contributed to the revival of the indigenous artisan crafts and industries.\n2. The National Council of Education was established as a part of Swadeshi Movement.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation:Both statements 1 and 2 are correct.  The Swadeshi Movement actively promoted the revival of indigenous artisan crafts and industries as a form of economic nationalism, aiming to reduce reliance on British goods.  The establishment of the National Council of Education was a key part of the movement's efforts to create a national system of education independent from British control.\n\n\nSwadeshi Movement: A nationalist movement in India during the early 20th century, primarily in response to the Partition of Bengal. It advocated for the use of Indian-made goods (\"Swadeshi\") and the boycott of British products.  It had both moderate and extremist wings with differing approaches to achieving self-rule.\n\nNational Council of Education: An institution established during the Swadeshi Movement to promote Indian education and create alternatives to the British-controlled education system.  It aimed to foster national consciousness and pride through education.\n"
    },
    {
        "q_num": 6,
        "question_text": "Consider the following pairs: Movement/ Organization Leader\n1. All India Anti-Untouchability League   :     Mahatma Gandhi\n2. All India Kisan Sabha                  :     Swami Sahajanand Saraswati\n3. Self-Respect Movement                  :     E. V. Ramaswami Naicker\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation:All three pairs are correctly matched.\n\n* **Mahatma Gandhi** was associated with the All India Anti-Untouchability League, working towards the eradication of untouchability in India.  He championed the rights and upliftment of the marginalized communities.\n\n* **Swami Sahajanand Saraswati** was a prominent leader of the All India Kisan Sabha, a peasant movement advocating for the rights and welfare of farmers. He played a crucial role in organizing and leading peasant movements throughout India.\n\n* **E. V. Ramaswami Naicker**, also known as Periyar, was the founder of the Self-Respect Movement, a social reform movement in South India that challenged caste discrimination and advocated for social justice and equality.  He strongly criticized Brahminical dominance and promoted rationalism and self-respect among the non-Brahmin communities.\n"
    },
    {
        "q_num": 7,
        "question_text": "Which one of the following is not a Harappan site?",
        "option_a": "Chanhudaro",
        "option_b": "Kot Diji",
        "option_c": "Sohgaura",
        "option_d": "Desalpur",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation: Chanhudaro, Kot Diji, and Desalpur are all well-known sites associated with the Indus Valley Civilization (Harappan Civilization).  Sohgaura, however, is not linked to the Harappan civilization.  While Sohgaura is an important archaeological site, its significance lies in its association with later periods, notably the discovery of inscriptions related to the Mauryan Empire.  Therefore, Sohgaura is the correct answer.\n\nChanhudaro: A significant Harappan site located in Sindh, Pakistan, known for its unique artifacts and craft production.\n\nKot Diji: An early Harappan site situated in Sindh, Pakistan.  It provides valuable insights into the early stages of the Indus Valley Civilization.\n\nDesalpur: Another Harappan site, its location is in present-day Pakistan. It contributes to understanding the settlement patterns of the civilization.\n\nSohgaura: An archaeological site in Uttar Pradesh, India, famous for its inscriptions from the Mauryan period, predating the Harappan civilization.\n"
    },
    {
        "q_num": 8,
        "question_text": "In which of the following relief sculpture inscriptions is 'Ranyo Ashoka' (King Ashoka) mentioned along with the stone portrait of Ashoka?",
        "option_a": "Kanganahalli",
        "option_b": "Sanchi",
        "option_c": "Shahbazgarhi",
        "option_d": "Sohgaura",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:The provided text mentions that a stone portrait of Ashoka with the inscription 'Raya Asoko' (a variation of 'Ranyo Ashoka') was discovered at Kanaganahalli.  Therefore, the correct option is (a).\n\nKanganahalli:  An archaeological site in Karnataka, India, known for the discovery of a stone portrait of Emperor Ashoka and an inscription mentioning him. This inscription is crucial evidence relating to Ashoka's reign and the spread of Buddhism.\n\nSanchi: A Buddhist complex in Madhya Pradesh, India, famous for its stupas, temples, and other structures.  It's a significant site for understanding early Buddhist art and architecture.  While associated with Ashoka, it doesn't contain a stone portrait of him with an inscription.\n\nShahbazgarhi: An important location in Pakistan where one of Ashoka's edicts is inscribed on a rock.  It's primarily known for its inscription, not a portrait.\n\nSohgaura: An archaeological site in Uttar Pradesh, India, known for its discoveries related to the early Iron Age and the use of Brahmi script.  It's not connected to Ashoka.\n"
    },
    {
        "q_num": 9,
        "question_text": "Consider the following:\n1. Deification of the Buddha\n2. Treading the path of Bodhisattvas\n3. Image worship and rituals\nWhich of the above is/are the feature/ features of Mahayana Buddhism?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Mahayana Buddhism is characterized by the deification of the Buddha, the following of the Bodhisattva path (a path to enlightenment focused on helping others), and the practice of image worship and rituals.  Therefore, all three features (1, 2, and 3) are characteristic of Mahayana Buddhism.\n\nBuddha: The founder of Buddhism, Siddhartha Gautama, who achieved enlightenment and taught the path to liberation from suffering.  His teachings emphasize ethical conduct, meditation, and wisdom.\n\nBodhisattvas: In Mahayana Buddhism, these are enlightened beings who postpone their own final enlightenment to help others achieve liberation. They embody compassion and serve as role models for aspiring Buddhists.\n\nImage worship and rituals:  These are common practices in Mahayana Buddhism, involving the veneration of Buddha images and the performance of various rituals to cultivate devotion and spiritual growth.  These practices are not central to all forms of Buddhism.\n"
    },
    {
        "q_num": 10,
        "question_text": "With reference to forced labour (Vishti) in India during the Gupta period, which one of the following statements is correct?",
        "option_a": "It was considered a source of income for the State, a sort of tax paid by the people.",
        "option_b": "It was totally absent in the Madhya Pradesh and Kathiawar regions of the Gupta Empire.",
        "option_c": "The forced labourer was entitled to weekly wages.",
        "option_d": "The eldest son of the labourer was sent as the forced labourer.",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Vishti, during the Gupta period in India, was a form of forced labor that served as a tax levied on the people, contributing to the state's revenue.  It wasn't a payment for individual laborers.  The other options are incorrect; there's no evidence suggesting Vishti's absence in specific regions or that laborers received wages or that only the eldest son was conscripted.\n\n\nGupta Empire: A powerful ancient Indian empire that flourished from the 4th to the 6th century CE.  Known for its significant contributions to art, literature, science, and administration.  The empire's administration included various forms of taxation, including forced labor like Vishti.\n\nForced Labour (Vishti): A system of compulsory labor imposed by the state or ruling authority.  In the Gupta period, it was a significant source of revenue and manpower for various public works projects.  The nature of this labor varied, and its impact on the laborers is a subject of ongoing historical debate.\n\nMadhya Pradesh and Kathiawar: Two regions in India. Madhya Pradesh is a state in central India, while Kathiawar is a historical region in the western state of Gujarat.  Both were part of the Gupta Empire at different points in its history.\n"
    },
    {
        "q_num": 11,
        "question_text": "Building 'Kalyaana Mandapas' was a notable feature in the temple construction in the kingdom of",
        "option_a": "Chalukya",
        "option_b": "Chandela",
        "option_c": "Rashtrakuta",
        "option_d": "Vijayanagara",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: The Vijayanagara kingdom is known for its magnificent temple architecture, a notable feature of which was the construction of Kalyana Mandapas (marriage halls).  While the Chalukyas, Rashtrakutas, and Chandelas were also significant in temple building, the scale and style of Kalyana Mandapas are particularly associated with the Vijayanagara period.\n\nChalukya: A powerful dynasty that ruled parts of South India from the 6th to the 12th centuries CE. Known for their contributions to temple architecture, particularly the Vesara style, a blend of Dravidian and Nagara styles.  Their empire extended over large parts of present-day Karnataka, Andhra Pradesh, and parts of Maharashtra and Gujarat.\n\nChandela: A Rajput dynasty that ruled central India from the 9th to the 13th centuries CE.  Their architectural legacy includes impressive temples, known for their intricate carvings and sculptures, often dedicated to Shiva.  Their kingdom was primarily located in present-day Madhya Pradesh and parts of Uttar Pradesh.\n\nRashtrakuta: Another significant dynasty of South India that ruled from the 8th to the 10th centuries CE. Their empire encompassed large parts of present-day Karnataka, Maharashtra, Andhra Pradesh, and Gujarat. They were patrons of art and architecture, and their temples are recognized for their distinct style and craftsmanship.  \n\nVijayanagara:  A powerful empire in South India that flourished from the 14th to the 16th centuries CE.  The Vijayanagara style of architecture is characterized by its grandeur, scale, and intricate detailing.  Kalyana Mandapas are a significant part of this architectural heritage, along with numerous other temples and structures.  The empire's capital was Hampi, a UNESCO World Heritage Site.\n"
    },
    {
        "q_num": 12,
        "question_text": "Consider the following statements:\n1. In the revenue administration of Delhi Sultanate, the in-charge of revenue collection was known as 'Amil'.\n2. The Iqta system of Sultans of Delhi was an ancient indigenous institution.\n3. The office of 'Mir Bakshi' came into existence during the reign of Khalji Sultans of Delhi.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is correct.  'Amil' was the title given to the revenue collector in the Delhi Sultanate.\n\nStatement 2 is incorrect. The Iqta system, while used by the Delhi Sultans, was not an ancient indigenous institution.  It was a system of land grants in lieu of salary, borrowed and adapted from other systems.\n\nStatement 3 is correct. The office of 'Mir Bakshi,'  a high-ranking military official responsible for army pay and recruitment, emerged during the Khalji dynasty's reign.\n\n\n**Short notes:**\n\n* **Amil:** The revenue collector in the Delhi Sultanate's administration.  They were responsible for collecting taxes and managing the revenue of a specific region. Their efficiency was crucial for the Sultanate's financial stability.\n\n* **Iqta system:** A land grant system used in the Delhi Sultanate where land was given to military commanders in lieu of salaries.  This system helped maintain a standing army but also led to potential abuses of power by the Iqtadars. It was not a uniquely Indian system.\n\n* **Mir Bakshi:** A high-ranking military official in the Delhi Sultanate.  Their responsibilities included overseeing the recruitment, payment, and equipment of the army. The position gained prominence during the Khalji period.\n\n* **Khalji Sultans:** A dynasty that ruled the Delhi Sultanate from 1290 to 1320.  Known for their military prowess and expansion of the Sultanate's territory.  Alauddin Khalji is a notable ruler from this dynasty.\n\n* **Delhi Sultanate:** A period in Indian history (1206-1526) marked by the rule of various dynasties of Turkic origin. It saw significant changes in the political, administrative, economic and social spheres of India.\n"
    },
    {
        "q_num": 13,
        "question_text": "Consider the following statements:\n1. Saint Nimbarka was a contemporary of Akbar.\n2. Saint Kabir was greatly influenced by Shaikh Ahmad Sirhindi.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation:\n\nStatement 1 is incorrect. Saint Nimbarka, a prominent figure in the Dvaita Vedanta school of Hindu philosophy, predates Akbar.  Nimbarka's lifespan is generally placed between the 12th and 13th centuries CE, while Akbar reigned from 1556 to 1605 CE.\n\nStatement 2 is also incorrect. Saint Kabir (14th-15th centuries CE) was a mystic poet and saint whose teachings blended elements of Hinduism and Islam.  Shaikh Ahmad Sirhindi (1564-1624 CE), a prominent figure in the Naqshbandi Sufi order, lived much later.  Kabir's philosophy predates Sirhindi's by several decades and there's no evidence suggesting Kabir was influenced by him.\n\n\n**Short Notes:**\n\n* **Saint Nimbarka:** A prominent Hindu philosopher and theologian, known for his contributions to the Dvaita Vedanta school of thought. His teachings emphasize the absolute distinction between the individual soul (jivatman) and the supreme being (Brahman).  His philosophy is characterized by a unique blend of monism and dualism.\n\n\n* **Saint Kabir:**  A 15th-century mystic poet and saint known for his revolutionary teachings that transcended religious boundaries. His poetry and songs are filled with social and religious commentary, emphasizing love, devotion, and the unity of God.  He is considered a prominent figure in both Hindu and Sufi traditions.\n\n\n* **Akbar:** The third Mughal emperor of India, known for his religious tolerance and administrative reforms. He is credited with promoting a syncretic culture and fostering a relatively peaceful coexistence of various religious groups within his empire.\n\n\n* **Shaikh Ahmad Sirhindi:** A highly influential figure in the Naqshbandi Sufi order.  He advocated for a return to orthodox Islamic beliefs and practices, often opposing the religious syncretism promoted by Akbar. His writings and teachings had a significant impact on the religious landscape of the Mughal Empire.\n"
    },
    {
        "q_num": 14,
        "question_text": "With reference to the British colonial rule in India, consider the following statements:\n1. Mahatma Gandhi was instrumental in the abolition of the system of 'indentured labour'.\n2. In Lord Chelmsford's War Conference', Mahatma Gandhi did not support the resolution on recruiting Indians for World War.\n3. Consequent upon the breaking of Salt Law by Indian people, the Indian National Congress was declared illegal by the colonial rulers.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is correct. Mahatma Gandhi's efforts played a significant role in raising awareness about the injustices of indentured servitude and advocating for its abolition.  While the process was complex and involved various factors, Gandhi's influence is undeniable.\n\nStatement 2 is correct.  Gandhi opposed the recruitment of Indians for World War I, viewing it as supporting British imperial interests.  The Chelmsford War Conference involved discussions on this very issue.\n\nStatement 3 is incorrect.  While the Salt Satyagraha led to widespread arrests and increased repression, the Indian National Congress was not declared illegal immediately after the breaking of the Salt Law.  The colonial government employed various methods of suppression, but a complete ban on the INC came later.\n\n**Short Notes:**\n\n* **Mahatma Gandhi:** A prominent leader of the Indian independence movement known for his philosophy of nonviolent resistance (Satyagraha).  His campaigns significantly impacted the course of Indian history, including the struggle against colonial rule.\n\n* **Indentured Labour:** A system where individuals were bound by contract to work for a specific period, often under harsh conditions, in exchange for passage to a new location.  It was widely used during the colonial era, particularly involving the migration of Indian laborers.\n\n* **Lord Chelmsford:** The Viceroy of India during World War I. His administration faced significant challenges related to the war effort and the growing Indian nationalist movement.\n\n* **Chelmsford War Conference:** A meeting held during World War I to discuss the participation of Indian soldiers in the war.  It highlighted the tensions between British colonial authorities and Indian nationalists.\n\n* **Salt Satyagraha:** A pivotal moment in the Indian independence movement, involving the mass civil disobedience against the British salt tax.  It symbolized the broader struggle against colonial oppression.\n"
    },
    {
        "q_num": 15,
        "question_text": "With reference to Indian National Movement, consider the following pairs: Person Position held\n1. Sir Tej Bahadur Sapru    : President, All India Liberal Federation\n2. K. C. Neogy              : Member, The Constituent Assembly\n3. P. C. Joshi              : General Secretary, Communist Party of India\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "* **correct_option:** (d)\n* **explanation:**\n\nAll three pairs are correctly matched.\n\nSir Tej Bahadur Sapru was indeed the President of the All India Liberal Federation.  The All India Liberal Federation was a significant political group during the Indian independence movement, advocating for gradual constitutional reforms within the British framework.  Sapru was a prominent figure in the moderate wing of Indian nationalism.\n\nK. C. Neogy was a member of the Constituent Assembly, the body responsible for drafting India's constitution. He played a crucial role in the economic discussions and debates within the assembly.\n\nP. C. Joshi served as the General Secretary of the Communist Party of India. The CPI was one of the major political forces during the Indian independence movement, though their ideology differed from the mainstream nationalist movements.  Joshi was a key figure in shaping the CPI's strategies and policies during a critical period.\n"
    },
    {
        "q_num": 16,
        "question_text": "With reference to Mian Tansen, which one of the following statements is not correct?",
        "option_a": "Tansen was the title given to him by Emperor Akbar.",
        "option_b": "Tansen composed Dhrupads on Hindu gods and goddesses.",
        "option_c": "Tansen composed songs on his patrons.",
        "option_d": "Tansen invented many Ragas.",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation:Tansen, whose real name was Ramtanu Pande, was a renowned musician in the court of Emperor Akbar.  Options (a), (b), and (c) are accurate.  He was given the title \"Tansen\" by Akbar, he composed dhrupads (a form of Hindustani classical music) on Hindu deities, and he undoubtedly created songs for his patrons, as was customary for court musicians. However, he did not invent many ragas. Ragas are melodic frameworks in Indian classical music, and while Tansen was a master musician who may have popularized or modified existing ragas, he did not invent them in the same way a composer might invent a new musical piece.  The creation and development of ragas is a long and complex process spanning centuries and involving many musicians.\n\n**Short Notes:**\n\n* **Mian Tansen:** A legendary musician in the Mughal court of Emperor Akbar. He is credited with exceptional musical talent and mastery of various ragas. His contributions significantly influenced the development of Hindustani classical music.\n\n* **Emperor Akbar:** The third Mughal emperor, known for his religious tolerance and patronage of the arts. His reign saw a flourishing of music, painting, and literature.\n\n* **Dhrupad:** A very ancient and traditional form of Hindustani classical music characterized by its slow tempo, complex melodic structures, and emphasis on improvisation.\n\n* **Ragas:** Melodic frameworks or scales in Indian classical music. Each raga has its own unique character, mood, and associated time of day or season.  They are not invented, but rather developed and refined over time.\n"
    },
    {
        "q_num": 17,
        "question_text": "Who among the following Mughal Emperors shifted emphasis from illustrated manuscripts to album and individual portrait?",
        "option_a": "Humayun",
        "option_b": "Akbar",
        "option_c": "Jahangir",
        "option_d": "Shah Jahan",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation:Jahangir is known for shifting the emphasis in Mughal painting from illustrated manuscripts to individual portraits and albums.  While Akbar's reign saw a flourishing of illustrated manuscripts and a blend of Persian and Indian styles, Jahangir fostered a distinct style focused on realistic portraits of himself, his family, and court members, often accompanied by detailed depictions of animals and birds.  These portraits were frequently compiled into albums, showcasing a new format for artistic expression. Humayun's era saw the beginnings of Mughal painting, but it was under Akbar and Jahangir that it truly blossomed. Shah Jahan, while a patron of the arts, continued the trends established under Jahangir.\n\n\nHumayun: The second Mughal emperor, known for his patronage of Persian art and architecture. His reign was relatively short and marked by instability, but he laid the foundation for the artistic flourishing under his successors.\n\nAkbar: The third Mughal emperor, known for his significant contributions to Mughal art, architecture, and administration.  His reign saw the development of a distinct Mughal style of painting, integrating Persian and Indian elements. The Akbarnama, a detailed illustrated manuscript chronicling his reign, is a prime example of this style.\n\nJahangir: The fourth Mughal emperor, known for his keen interest in art and his patronage of leading painters. His reign saw the peak of Mughal portraiture, with a shift towards realistic depictions and a focus on individual portraits and albums.  He was known for his meticulous attention to detail and his appreciation for the natural world.\n\nShah Jahan: The fifth Mughal emperor, famous for his architectural achievements, especially the Taj Mahal.  While a great patron of the arts, his reign continued the trends already established in Mughal painting, rather than initiating a major shift in style.\n"
    },
    {
        "q_num": 18,
        "question_text": "Which one of the following National Parks lies completely in the temperate alpine zone?",
        "option_a": "Manas National Park",
        "option_b": "Namdapha National Park",
        "option_c": "Neora Valley National Park",
        "option_d": "Valley of Flowers National Park",
        "correct_option": "d",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation:The Valley of Flowers National Park is located in the West Himalayas, which falls within the temperate alpine zone.  Manas National Park, Namdapha National Park, and Neora Valley National Park are located in different geographical zones and do not lie completely within the temperate alpine zone.\n\nManas National Park: Located in Assam, India, it is a biodiversity hotspot featuring diverse ecosystems including grasslands, forests, and rivers.  It's known for its rich flora and fauna, including endangered species like the rhinoceros.\n\nNamdapha National Park: Situated in Arunachal Pradesh, India, it represents a significant area of  tropical and subtropical forests. It's characterized by high biodiversity, with numerous plant and animal species.\n\nNeora Valley National Park: Located in West Bengal, India, this park is characterized by temperate forests at higher elevations.  It's known for its diverse flora and fauna, including a variety of birds.\n"
    },
    {
        "q_num": 19,
        "question_text": "Atal Innovation Mission is set up under the",
        "option_a": "Department of Science and Technology",
        "option_b": "Ministry of Labour and Employment",
        "option_c": "NITI Aayog",
        "option_d": "Ministry of Skill Development and Entrepreneurship",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation: The Atal Innovation Mission (AIM) is set up under NITI Aayog.  NITI Aayog is a policy think tank of the Government of India, formed in 2015, replacing the Planning Commission.  It plays a key role in formulating and monitoring national development policies. The Department of Science and Technology (DST) is a department under the Ministry of Science and Technology, responsible for promoting scientific research and development. The Ministry of Labour and Employment deals with labor laws, employment generation, and social security for workers. The Ministry of Skill Development and Entrepreneurship focuses on skill development programs and promoting entrepreneurship.  AIM's focus on fostering innovation and entrepreneurship aligns with NITI Aayog's broader mandate of national development.\n"
    },
    {
        "q_num": 20,
        "question_text": "On 21st June, the Sun",
        "option_a": "does not set below the horizon at the Arctic Circle",
        "option_b": "does not set below the horizon at Antarctic Circle",
        "option_c": "shines vertically overhead at noon on the Equator",
        "option_d": "shines vertically overhead at the Tropic of Capricorn",
        "correct_option": "a",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: On June 21st, the summer solstice occurs in the Northern Hemisphere.  This means the Sun is directly overhead at the Tropic of Cancer (23.5° N latitude). At the Arctic Circle (66.5° N latitude), the Sun will not set below the horizon on this day.  The Antarctic Circle experiences its winter solstice, with the Sun remaining below the horizon. The Sun is never directly overhead at the Equator except during the equinoxes (March 21st and September 23rd).\n\nArctic Circle:  The Arctic Circle is the most northerly of the five major circles of latitude that mark maps of the Earth.  It is located at 66.5 degrees north of the Equator.  Areas within the Arctic Circle experience periods of continuous daylight (midnight sun) in summer and continuous darkness in winter.\n\nAntarctic Circle: The Antarctic Circle is the most southerly of the five major circles of latitude that mark maps of the Earth. It is located at 66.5 degrees south of the Equator.  Areas within the Antarctic Circle experience periods of continuous daylight in summer and continuous darkness in winter.  The opposite of the Arctic Circle.\n\nEquator: The Equator is an imaginary line that divides the Earth into the Northern and Southern Hemispheres. It is located at 0 degrees latitude.  It is equidistant from the North and South Poles.\n\nTropic of Capricorn: The Tropic of Capricorn is one of the five major circles of latitude that mark maps of the Earth. It is located at 23.5 degrees south of the Equator.  The Sun is directly overhead at the Tropic of Capricorn on the December solstice.\n"
    },
    {
        "q_num": 21,
        "question_text": "Which one of the following groups of plants was domesticated in the 'New World' and introduced into the 'Old World'?",
        "option_a": "Tobacco, cocoa and rubber",
        "option_b": "Tobacco, cotton and rubber",
        "option_c": "Cotton, coffee and sugarcane",
        "option_d": "Rubber, coffee and wheat",
        "correct_option": "a",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation: Tobacco, cocoa, and rubber are all New World crops that were introduced to the Old World after European colonization of the Americas.  Tobacco is a plant native to the Americas, known for its leaves used in smoking and chewing.  Cocoa beans, from the cacao tree, are native to the Amazon basin and are processed to make chocolate. Rubber is derived from the latex of the Hevea brasiliensis tree, originally from the Amazon rainforest. Cotton is also a New World crop but the question asks for a group of plants.  Coffee and sugarcane are Old World crops. Wheat is also an Old World crop.  Therefore, only option (a) correctly identifies a group of plants domesticated in the New World and subsequently introduced to the Old World.\n"
    },
    {
        "q_num": 22,
        "question_text": "Consider the following statements:\n1. Asiatic lion is naturally found in India only.\n2. Double-humped camel is naturally found in India only.\n3. One-horned rhinoceros is naturally found in India only.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: Asiatic lions are naturally found only in India's Gir Forest National Park and surrounding areas.  Double-humped camels are found in India, but also in other parts of Asia.  One-horned rhinoceroses are found in India's Kaziranga National Park and other parts of South Asia.  Therefore, only statement 1 is correct.\n\nAsiatic Lion:  A subspecies of lion found only in India's Gir National Park and surrounding areas.  It is critically endangered, with conservation efforts focused on maintaining its genetic diversity and protecting its habitat.\n\nDouble-humped Camel (Bactrian Camel):  A species of camel with two humps, native to Central Asia. While some are found in India, their natural range is not limited to the country.\n\nOne-horned Rhinoceros (Indian Rhinoceros): A critically endangered species of rhinoceros found primarily in the grasslands and wetlands of India's Kaziranga National Park and other protected areas in Nepal and Bhutan.  Poaching and habitat loss are significant threats.\n"
    },
    {
        "q_num": 23,
        "question_text": "Consider the following pairs: Famous place River\n1. Pandharpur       : Chandrabhaga\n2. Tiruchirappalli  : Cauvery\n3. Hampi            : Malaprabha\nWhich of the pairs given above are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Pandharpur is situated on the banks of the Chandrabhaga River. Tiruchirappalli is located on the banks of the Cauvery River. However, Hampi is not situated on the Malaprabha River; it's associated with the Tungabhadra River.  Therefore, only pairs 1 and 2 are correctly matched.\n\n\nPandharpur: A town in Maharashtra, India, known for its Vitthal-Rukmini temple and an important pilgrimage site.\n\nChandrabhaga River: A river in Maharashtra, India, a tributary of the Krishna River.\n\nTiruchirappalli (Trichy): A city in Tamil Nadu, India, located on the banks of the Cauvery River, historically significant and a major commercial center.\n\nCauvery River: A major river in southern India, originating in the Brahmagiri hills and flowing through Karnataka and Tamil Nadu.\n\nHampi: A UNESCO World Heritage Site in Karnataka, India, famous for its ruins of the Vijayanagara Empire.\n\nMalaprabha River: A river in Karnataka, India, a tributary of the Krishna River.  The Malaprabha is not directly associated with Hampi.\n"
    },
    {
        "q_num": 24,
        "question_text": "In a given year in India, official poverty lines are higher in some States than in others because",
        "option_a": "poverty rates vary from State to State",
        "option_b": "price levels vary from State to State",
        "option_c": "Gross State Product varies from State to State",
        "option_d": "quality of public distribution varies from State to State",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation:Official poverty lines are determined by considering the cost of basic necessities.  Since price levels (the cost of goods and services) vary significantly across different states in India due to factors like transportation costs, local market dynamics, and availability of resources, the poverty line needs to be adjusted accordingly.  A higher price level in a state would necessitate a higher poverty line to reflect the same standard of living as in a state with lower prices.\n\nPoverty rates (a) reflect the outcome of poverty, not the reason for varying poverty lines. Gross State Product (c) indicates a state's overall economic output, but doesn't directly influence the cost of living which determines the poverty line. The quality of public distribution (d), while impacting access to necessities, doesn't directly determine the cost of those necessities, and thus doesn't directly determine the poverty line.\n"
    },
    {
        "q_num": 25,
        "question_text": "In the context of which of the following do some scientists suggest the use of cirrus cloud thinning technique and the injection of sulphate aerosol into stratosphere?",
        "option_a": "Creating the artificial rains in some regions",
        "option_b": "Reducing the frequency and intensity of tropical cyclones",
        "option_c": "Reducing the adverse effects of solar wind on the Earth",
        "option_d": "Reducing the global warming",
        "correct_option": "d",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Cirrus cloud thinning and stratospheric sulphate aerosol injection are geoengineering techniques proposed by some scientists to mitigate global warming.  These methods aim to reflect more sunlight back into space, thus reducing the amount of solar radiation absorbed by the Earth and subsequently lowering temperatures.  \n\nCreating artificial rain (option a) involves cloud seeding, a different weather modification technique. Reducing tropical cyclone frequency and intensity (option b) is a goal of various climate mitigation strategies, but not directly addressed by these specific geoengineering techniques.  Reducing the adverse effects of solar wind (option c) is unrelated to these techniques; it relates to protecting Earth's magnetosphere and infrastructure from solar flares and coronal mass ejections.\n"
    },
    {
        "q_num": 26,
        "question_text": "In the context of which one of the following are the terms 'pyrolysis and plasma gasification' mentioned?",
        "option_a": "Extraction of rare earth elements",
        "option_b": "Natural gas extraction technologies",
        "option_c": "Hydrogen fuel-based automobiles",
        "option_d": "Waste-to-energy technologies",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Pyrolysis and plasma gasification are thermal processes used in waste-to-energy technologies to convert waste materials into energy.  Pyrolysis involves heating organic material in the absence of oxygen, breaking it down into gases, liquids, and solid char. Plasma gasification uses a high-temperature plasma to gasify waste, creating a synthesis gas that can be used to generate electricity or other fuels.\n\nWaste-to-energy technologies aim to recover energy from waste materials, reducing landfill burden and contributing to renewable energy sources.  Rare earth element extraction involves separating these elements from ores, often using chemical processes. Natural gas extraction focuses on retrieving natural gas from underground reservoirs. Hydrogen fuel-based automobiles use hydrogen fuel cells to convert hydrogen into electricity, offering a potential zero-emission transportation alternative.\n"
    },
    {
        "q_num": 27,
        "question_text": "Which of the following are in Agasthyamala Biosphere Reserve?",
        "option_a": "Neyyar, Peppara and Shendurney Wildlife Sanctuaries; and Kalakad Mundanthurai Tiger Reserve",
        "option_b": "Mudumalai, Sathyamangalam and Wayanad Wildlife Sanctuaries; and Silent Valley National Park",
        "option_c": "Kaundinya, Gundla Brahmeswaram and Papikonda Wildlife Sanctuaries; and Mukurthi National Park",
        "option_d": "Kawal and Sri Venkateswara Wildlife Sanctuaries; and Nagarjunasagar-Srisailam Tiger Reserve",
        "correct_option": "a",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation: The Agasthyamala Biosphere Reserve includes Neyyar, Peppara, and Shendurney Wildlife Sanctuaries, and the Kalakad Mundanthurai Tiger Reserve.\n\nNeyyar Wildlife Sanctuary: Located in the Western Ghats of Kerala, known for its diverse flora and fauna, including elephants, tigers, and various bird species.\n\nPeppara Wildlife Sanctuary:  Another sanctuary in the Western Ghats of Kerala,  sharing similar biodiversity with Neyyar.  It's important for its role in maintaining the ecological balance of the region.\n\nShendurney Wildlife Sanctuary: Situated in the Western Ghats of Kerala, this sanctuary is known for its rich biodiversity and is a significant part of the Agasthyamalai Biosphere Reserve.\n\nKalakad Mundanthurai Tiger Reserve:  A tiger reserve spanning parts of Tamil Nadu and Kerala, known for its tiger population and diverse ecosystems.  It's a crucial area for the conservation of tigers and other endangered species in the Western Ghats.\n\n\nThe other options list wildlife sanctuaries and national parks located in different regions of India, not within the Agasthyamala Biosphere Reserve.\n"
    },
    {
        "q_num": 28,
        "question_text": "Consider the following statements:\n1. Some species of turtles are herbivores.\n2. Some species of fish are herbivores.\n3. Some species of marine mammals are herbivores.\n4. Some species of snakes are viviparous.\nWhich of the statements given above are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is correct. Many turtle species are herbivores, such as the red-eared slider and many species of tortoises.\n\nStatement 2 is correct.  Many fish species are herbivores, including various species of carp, parrotfish, and surgeonfish.  They play a crucial role in maintaining aquatic ecosystems.\n\nStatement 3 is correct. Some marine mammals are herbivores, most notably the manatee and the dugong.  These animals feed primarily on seagrass.\n\nStatement 4 is correct. Some snake species are viviparous (give birth to live young), meaning they do not lay eggs. Examples include the garter snake and the rattlesnake.  Viviparity is an adaptation in certain environments.\n"
    },
    {
        "q_num": 29,
        "question_text": "Consider the following pairs: Wildlife Naturally found in\n1. Blue-finned Mahseer  : Cauvery River\n2. Irrawaddy Dolphin    : Chambal River\n3. Rusty-spotted Cat    : Eastern Ghats\nWhich of the pairs given above are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation:The Blue-finned Mahseer is found in the Cauvery River.  The Irrawaddy Dolphin is found in the Ganges-Brahmaputra-Meghna and Karnaphuli-Sangu river systems,  but not the Chambal River. The Rusty-spotted Cat is found in the Eastern Ghats. Therefore, only pairs 1 and 3 are correctly matched.\n\nBlue-finned Mahseer: A species of mahseer fish found in several South Asian rivers, including the Cauvery.  It is a large, powerful fish and is considered an important part of the river ecosystem.\n\nIrrawaddy Dolphin: A freshwater dolphin species found in rivers and coastal areas of Southeast Asia.  They are endangered due to habitat loss and other human activities.\n\nRusty-spotted Cat: One of the smallest cat species in the world, found in parts of India and Sri Lanka.  It is a nocturnal animal and inhabits a variety of habitats, including forests and grasslands.  \n\nCauvery River: A major river in southern India, originating in the Brahmagiri hills and flowing through Karnataka and Tamil Nadu before emptying into the Bay of Bengal. It is crucial for agriculture and human settlements.\n\nChambal River: A river in central India, flowing through Madhya Pradesh, Rajasthan, and Uttar Pradesh. It is known for its crocodiles and other wildlife.\n\nEastern Ghats: A mountain range in eastern India, running parallel to the Bay of Bengal coast. The region is known for its biodiversity and unique flora and fauna.\n"
    },
    {
        "q_num": 30,
        "question_text": "Why is there a great concern about the 'microbeads' that are released into environment?",
        "option_a": "They are considered harmful to marine ecosystems.",
        "option_b": "They are considered to cause skin cancer in children.",
        "option_c": "They are small enough to be absorbed by crop plants in irrigated fields.",
        "option_d": "They are often found to be used as food adulterants.",
        "correct_option": "a",
        "subject": "environment",
        "year": 2019,
        "explanation": "```text\ncorrect_option: (a)\nexplanation:Microbeads are tiny plastic particles that are harmful to marine ecosystems.  They are small enough to be ingested by marine organisms, leading to bioaccumulation and biomagnification of toxins in the food chain.  This can cause harm to marine life at all trophic levels.  Skin cancer in children (b) is not directly linked to microbeads.  Microbeads are too large to be absorbed by crop plants (c), and they are not used as food adulterants (d).  Bioaccumulation is the increase in the concentration of a substance in an organism's tissues over time. Biomagnification is the increase in concentration of a substance as it moves up the food chain.\n```\n"
    },
    {
        "q_num": 31,
        "question_text": "Recently, there was a growing awareness in our country about the importance of Himalayan nettle (Girardinia diversifolia) because it is found to be a sustainable source of",
        "option_a": "anti-malarial drug",
        "option_b": "biodiesel",
        "option_c": "pulp for paper industry",
        "option_d": "textile fibre",
        "correct_option": "d",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation: Himalayan nettle (Girardinia diversifolia) is a sustainable source of textile fiber.  \n\nHimalayan nettle: A plant species native to the Himalayas, known for its strong fibers used in traditional textile production.  Its growing recognition highlights the potential for sustainable and locally sourced materials in the textile industry.\n\nBiodiesel: A fuel made from vegetable oils or animal fats, used as an alternative to petroleum diesel.  Its production often involves processing of oil-rich plants.\n\nPulp for paper industry:  The processed material from wood or other fibrous plants, used in paper manufacturing.  Sustainable sources of pulp are increasingly important for environmentally friendly paper production.\n\nAnti-malarial drug: A medication used to treat malaria, a disease caused by parasites transmitted through mosquito bites.  Research into plant-based anti-malarial drugs is ongoing, but Himalayan nettle isn't currently a primary source.\n"
    },
    {
        "q_num": 32,
        "question_text": "For the measurement/estimation of which of the following are satellite images/remote sensing data used?\n1. Chlorophyll content in the vegetation of a specific location\n2. Greenhouse gas emissions from rice paddies of a specific location\n3. Land surface temperatures of a specific location\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Satellite images and remote sensing data are used for measuring chlorophyll content in vegetation, estimating greenhouse gas emissions (though it might require additional data sources for precise quantification), and determining land surface temperatures.  Chlorophyll content is assessed using spectral reflectance properties of vegetation in satellite imagery. Land surface temperatures are directly measured by thermal infrared sensors on satellites.  Greenhouse gas emissions from localized sources like rice paddies are challenging to measure solely through satellite data due to the need for high spatial resolution and atmospheric correction techniques. While satellites can detect some indicators related to rice paddy emissions (e.g., methane plumes under specific conditions), ground-based measurements are typically required for accurate estimation. Therefore, options 1 and 3 are directly measurable, while option 2 requires a combination of satellite and ground-based data.\n\n\nShort notes on important keywords and named entities:\n\n* **Satellite images/remote sensing data:** Technology using satellites to capture images and data of Earth's surface. Various sensors measure different properties like light reflectance (for vegetation), thermal radiation (for temperature), and gaseous emissions.  Applications are diverse, covering environmental monitoring, agriculture, urban planning, and more.\n\n* **Chlorophyll content:** The amount of chlorophyll, a green pigment in plants essential for photosynthesis, present in vegetation. Chlorophyll levels indicate plant health and productivity, which are crucial factors in assessing vegetation health and carbon sequestration.\n\n* **Greenhouse gas emissions:** The release of gases like carbon dioxide, methane, and nitrous oxide into the atmosphere. These gases trap heat, leading to global warming and climate change.  Sources include industrial processes, agriculture, transportation, and natural sources.\n\n* **Rice paddies:** Flooded fields where rice is cultivated. They are significant sources of methane, a potent greenhouse gas, due to anaerobic decomposition of organic matter in the waterlogged soil.\n\n* **Land surface temperatures:** The temperature of Earth's surface.  It's influenced by various factors, including solar radiation, atmospheric conditions, and land cover.  Land surface temperature data is vital for understanding weather patterns, climate change impacts, and ecosystem dynamics.\n\n* **IPCC-UN's IPCC:** The Intergovernmental Panel on Climate Change, a UN body assessing the science related to climate change. Their reports synthesize scientific findings to inform policymakers and the public about climate change risks and mitigation strategies.\n\n"
    },
    {
        "q_num": 33,
        "question_text": "Consider the following States:\n1. Chhattisgarh\n2. Madhya Pradesh\n3. Maharashtra\n4. Odisha\nWith reference to the States mentioned above, in terms of percentage of forest cover to the total area of State, which one of the following is the correct ascending order?",
        "option_a": "2-3-1-4",
        "option_b": "2-3-4-1",
        "option_c": "3-2-4-1",
        "option_d": "3-2-1-4",
        "correct_option": "b",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:The correct ascending order of states based on the percentage of forest cover to the total area is 2-3-4-1 (Madhya Pradesh, Maharashtra, Odisha, Chhattisgarh).  While precise figures fluctuate slightly year to year based on surveys, this order generally holds true.  More detailed data from official sources (like the India State of Forest Report) would be needed for completely accurate ranking.\n\n\nChhattisgarh: A state in central India known for its rich biodiversity and mineral resources, including coal and iron ore.  It has significant forest cover but not the highest percentage among the given options.\n\nMadhya Pradesh:  A central Indian state with extensive forest cover, including significant portions of the Satpura and Vindhya ranges.  It generally ranks higher than Maharashtra in terms of forest cover percentage.\n\nMaharashtra: A state in western India with a diverse geography, including coastal regions, plateaus, and the Western Ghats.  It has a substantial amount of forest cover but less than Madhya Pradesh or Odisha.\n\nOdisha: An eastern Indian state,  a significant portion of which is covered by the Eastern Ghats mountain range.  Known for its rich biodiversity and substantial forest cover, generally higher than Maharashtra and Chhattisgarh.\n"
    },
    {
        "q_num": 34,
        "question_text": "Which of the following statements are correct about the deposits of 'methane hydrate'?\n1. Global warming might trigger the release of methane gas from these deposits.\n2. Large deposits of 'methane hydrate' are found in Arctic Tundra and under the seafloor.\n3. Methane in atmosphere oxidizes to carbon dioxide after a decade or two.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. Methane hydrates are ice-like crystalline structures containing methane gas trapped within a cage of water molecules.  Global warming could increase ocean temperatures and destabilize these hydrates, leading to the release of large amounts of methane into the atmosphere.  Methane is a potent greenhouse gas, contributing significantly to global warming.\n\nStatement 2 is correct.  Significant deposits of methane hydrate are found in permafrost regions like the Arctic tundra and beneath the ocean floor in continental margins and deep-sea sediments. These areas provide the low temperatures and high pressures necessary for the formation of methane hydrates.\n\nStatement 3 is correct. Atmospheric methane has a shorter lifespan than carbon dioxide.  It oxidizes relatively quickly in the atmosphere, typically within a decade or two, forming carbon dioxide and water vapor.  While this oxidation process removes methane, it converts it into another greenhouse gas (CO2), albeit one with a lower global warming potential per molecule than methane.\n\nTherefore, all three statements are correct.  Methane hydrate is a type of clathrate, a crystalline structure where a gas is trapped within a lattice of water molecules, making it a potential source of energy.  Arctic Tundra refers to the treeless regions of the Arctic, characterized by permafrost.\n"
    },
    {
        "q_num": 35,
        "question_text": "Consider the following:\n1. Carbon monoxide\n2. Methane\n3. Ozone\n4. Sulphur dioxide\nWhich of the above are released into atmosphere due to the burning of crop/biomass residue?",
        "option_a": "1 and 2 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: Burning crop/biomass residue, a common agricultural practice, leads to the release of several gases into the atmosphere.  Methane (CH₄) is a significant component of biomass, and its combustion produces carbon monoxide (CO) and methane itself.  Incomplete combustion can also release sulfur dioxide (SO₂) if the biomass contains sulfur-containing compounds.  While ozone (O₃) is not directly produced by burning biomass, the combustion process can contribute to the precursors (e.g., nitrogen oxides) that are involved in tropospheric ozone formation.\n\nCarbon monoxide (CO): A colorless, odorless, and highly toxic gas.  It is a product of incomplete combustion of carbon-containing materials.  It binds to hemoglobin in blood, reducing oxygen transport capacity.\n\nMethane (CH₄): A potent greenhouse gas. It is produced by the anaerobic decomposition of organic matter. It is also a major component of natural gas.\n\nOzone (O₃):  A triatomic molecule of oxygen.  In the stratosphere, it forms a protective layer that absorbs harmful UV radiation. In the troposphere (lower atmosphere), it is a pollutant formed by photochemical reactions involving nitrogen oxides and volatile organic compounds.\n\nSulfur dioxide (SO₂): A colorless gas with a pungent odor. It is a major air pollutant produced by the burning of fossil fuels and biomass containing sulfur. It contributes to acid rain and respiratory problems.\n"
    },
    {
        "q_num": 36,
        "question_text": "Consider the following pairs:\n   Sea                    Bordering country\n1. Adriatic Sea         : Albania\n2. Black Sea            : Croatia\n3. Caspian Sea          : Kazakhstan\n4. Mediterranean Sea    : Morocco\n5. Red Sea              : Syria\nWhich of the pairs given above are correctly matched?",
        "option_a": "1, 2 and 4 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "b",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation: Only pair 1 (Adriatic Sea : Albania) and pair 3 (Caspian Sea : Kazakhstan) are correctly matched.  Albania borders the Adriatic Sea. Kazakhstan borders the Caspian Sea.\n\nPair 2 is incorrect because Croatia borders the Adriatic Sea, not the Black Sea.  Pair 4 is incorrect because Morocco borders the Atlantic Ocean and the Mediterranean Sea, but the pairing in the question is only with the Mediterranean Sea. Pair 5 is incorrect because Syria borders the Mediterranean Sea, not the Red Sea.\n\n\nAdriatic Sea: A sea located between the Italian Peninsula and the Balkan Peninsula. It is part of the Mediterranean Sea.\n\nBlack Sea: A sea located between Eastern Europe and Western Asia. It is connected to the Mediterranean Sea through the Bosporus Strait, the Sea of Marmara, and the Dardanelles Strait.\n\nCaspian Sea: The world's largest inland body of water, located between Europe and Asia.  It is a saltwater lake.\n\nMediterranean Sea: A sea surrounded by the Mediterranean Basin and connected to the Atlantic Ocean by the Strait of Gibraltar.  It is a significant historical and cultural area.\n\nRed Sea: A sea between Africa and Asia. It connects to the Indian Ocean through the Bab el-Mandeb strait.  It is known for its high salinity.\n"
    },
    {
        "q_num": 37,
        "question_text": "Among the following, which one is the largest exporter of rice in the world in the last five years?",
        "option_a": "China",
        "option_b": "India",
        "option_c": "Myanmar",
        "option_d": "Vietnam",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation: Based on data from the last five years, India is the largest exporter of rice globally.  While China is a significant rice producer and exporter, India's export volumes have consistently surpassed those of China in recent years.  Myanmar and Vietnam are also important rice-exporting countries, but their export volumes are smaller compared to India's.\n\nIndia: A major agricultural country, known for its extensive rice production and export.  A significant portion of the Indian population is engaged in agriculture, with rice being a staple crop.  India's rice production and export are influenced by factors like monsoon patterns, government policies, and global demand.\n\nChina: Another major rice producer and exporter, with large-scale farming practices.  China's rice production is crucial for its food security, and its export volumes are substantial.  However, in recent years, India's exports have exceeded China's.\n\nMyanmar: A Southeast Asian country with a significant rice-producing sector.  Rice exports contribute to Myanmar's economy, though the scale is smaller than India's and China's.\n\nVietnam: A Southeast Asian country that is a major rice exporter, known for its high-quality rice varieties.  Vietnam's rice exports are important for its economy, but its export volume is generally lower than India's.\n"
    },
    {
        "q_num": 38,
        "question_text": "Consider the following pairs: Glacier River\n1. Bandarpunch  : Yamuna\n2. Bara Shigri  : Chenab\n3. Milam        : Mandakini\n4. Siachen      : Nubra\n5. Zemu         : Manas\nWhich of the pairs given above are correctly matched?",
        "option_a": "1, 2 and 4",
        "option_b": "1, 3 and 4",
        "option_c": "2 and 5",
        "option_d": "3 and 5",
        "correct_option": "a",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nBandarpunch glacier is a source of the Yamuna river.  Bara Shigri glacier feeds the Chenab river. Siachen glacier is associated with the Nubra River.  Milam glacier is *not* a source of the Mandakini River; and Zemu glacier is *not* a source of the Manas River. Therefore, only pairs 1, 2, and 4 are correctly matched.\n\n**Short notes on named entities:**\n\n* **Bandarpunch:** A glacier in the Garhwal Himalayas, Uttarakhand, India. It is a significant source of the Yamuna River.\n\n* **Yamuna:** One of the major rivers of North India, a tributary of the Ganges. Originates from the Yamunotri glacier in the Himalayas.\n\n* **Bara Shigri:** A large glacier in Himachal Pradesh, India. It is a major source of the Chenab River.\n\n* **Chenab:** One of the five rivers that make up the Punjab region in India and Pakistan.  Originates in the Himalayas in Himachal Pradesh.\n\n* **Milam:** A glacier in the Kumaon Himalayas, Uttarakhand, India.  It is associated with other rivers in the region.\n\n* **Mandakini:** A river in Uttarakhand, India, a tributary of the Alaknanda River.\n\n* **Siachen:** The world's highest battlefield, located in the Karakoram Range in the Himalayas. The glacier is a source of the Nubra River.\n\n* **Nubra:** A river in Ladakh, Jammu and Kashmir, India.  It is fed by the Siachen Glacier and other sources.\n\n* **Zemu:** A glacier in Sikkim, India. It is a source of the Rathong Chu River, not the Manas River.\n\n* **Manas:** A river in Assam, India. A tributary of the Brahmaputra River.\n"
    },
    {
        "q_num": 39,
        "question_text": "In India, the use of carbofuran, methyl parathion, phorate and triazophos is viewed with apprehension. These chemicals are used as",
        "option_a": "pesticides in agriculture",
        "option_b": "preservatives in processed foods",
        "option_c": "fruit-ripening agents",
        "option_d": "moisturising agents in cosmetics",
        "correct_option": "a",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: Carbofuran, methyl parathion, phorate, and triazophos are all organophosphate or carbamate insecticides used in agriculture to control pests.  Their use is viewed with apprehension in India due to their high toxicity to humans and other non-target organisms, potential for environmental contamination, and risks associated with improper handling and disposal.  The other options are incorrect:  they are not commonly used as preservatives in food, fruit-ripening agents, or moisturizing agents in cosmetics.\n\nCarbofuran: A carbamate insecticide, highly toxic to humans and animals, known for its persistence in the environment.  Its use is restricted or banned in many countries due to its toxicity.\n\nMethyl parathion: An organophosphate insecticide, highly toxic to humans, animals, and the environment.  It's known to cause severe health problems, including respiratory issues and neurological damage.\n\nPhorate: An organophosphate insecticide used to control soil insects. It is highly toxic and poses significant risks to human health and the environment.\n\nTriazophos: An organophosphate insecticide, moderately toxic, but still poses risks to humans and the environment.  It's used to control various pests in crops.\n\nPesticides: Chemical substances used to control, repel, or kill pests, including insects, weeds, and fungi.  While essential for agriculture, many pesticides pose risks to human health and the environment if misused.\n"
    },
    {
        "q_num": 40,
        "question_text": "Consider the following statements:\n1. Under Ramsar Convention, it is mandatory on the part of the Government of India to protect and conserve all the wetlands in the territory of India.\n2. The Wetlands (Conservation and Management) Rules, 2010 were framed by the Government of India based on the recommendations of Ramsar Convention.\n3. The Wetlands (Conservation and Management) Rules, 2010 also encompass the drainage area or catchment regions of the wetlands as determined by the authority.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The Ramsar Convention encourages, but does not mandate, the protection and conservation of all wetlands within a signatory nation's territory.  The Convention sets a framework for international cooperation and provides guidelines.  India, as a signatory, has committed to designating specific wetlands as Ramsar sites, signifying a commitment to their conservation.  However, it doesn't obligate the protection of *all* wetlands.\n\nStatement 2 is incorrect. While the Wetlands (Conservation and Management) Rules, 2010, were influenced by international conventions like the Ramsar Convention, they are not directly based on its recommendations. They are domestic legislation adapted to India's specific context and needs.\n\nStatement 3 is correct. The Wetlands (Conservation and Management) Rules, 2010, explicitly include the drainage area or catchment regions of wetlands within their scope of conservation and management.  The authority has the power to determine these regions.\n\n\nRamsar Convention: An intergovernmental treaty that provides the framework for national action and international cooperation for the conservation and wise use of wetlands.  It designates wetlands of international importance (Ramsar sites), encouraging their protection.\n\nWetlands (Conservation and Management) Rules, 2010:  Indian legislation aimed at protecting and managing wetlands within the country.  It establishes a regulatory framework for wetland conservation, including their catchment areas.\n"
    },
    {
        "q_num": 41,
        "question_text": "Consider the following statements:\n1. Agricultural soils release nitrogen oxides into environment.\n2. Cattle release ammonia into environment.\n3. Poultry industry releases reactive nitrogen compounds into environment.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 and 3 only",
        "option_c": "2 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation:Agricultural soils contain nitrogen-containing compounds that can be converted into nitrogen oxides (N2O) through microbial processes like nitrification and denitrification. These nitrogen oxides are then released into the atmosphere. Cattle produce large amounts of manure, which contains ammonia (NH3) that volatilizes and enters the atmosphere. The poultry industry also generates significant quantities of manure and waste, leading to the release of various reactive nitrogen compounds, including ammonia and nitrogen oxides.  Therefore, all three statements are correct.\n"
    },
    {
        "q_num": 42,
        "question_text": "What is common to the places known as Aliyar, Isapur and Kangsabati?",
        "option_a": "Recently discovered uranium deposits",
        "option_b": "Tropical rain forests",
        "option_c": "Underground cave systems",
        "option_d": "Water reservoirs",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Aliyar, Isapur, and Kangsabati are all names of water reservoirs located in different parts of India.  While the provided text doesn't directly state this, it does mention various rivers and river basins in India, which are sources for reservoirs.  The other options are incorrect based on the information provided.  There is no mention of uranium deposits, tropical rainforests, or cave systems specifically related to these three places.\n"
    },
    {
        "q_num": 43,
        "question_text": "In the context of proposals to the use of hydrogen-enriched CNG (H-CNG) as fuel for buses in public transport, consider the following statements:\n1. The main advantage of the use of H-CNG is the elimination of carbon monoxide emissions.\n2. H-CNG as fuel reduces carbon dioxide and hydrocarbon emissions.\n3. Hydrogen up to one-fifth by volume can be blended with CNG as fuel for buses.\n4. H-CNG makes the fuel less expensive than CNG.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. While H-CNG reduces CO emissions compared to CNG, it doesn't eliminate them entirely.  The combustion of even small amounts of CNG will still produce some CO.\n\nStatement 2 is correct. Blending hydrogen with CNG leads to a reduction in both carbon dioxide (CO2) and hydrocarbon emissions because hydrogen combustion produces only water vapor.\n\nStatement 3 is correct.  Hydrogen can be blended with CNG at a concentration of up to 20% by volume without significant engine modifications.\n\nStatement 4 is incorrect. The production and addition of hydrogen to CNG adds to the overall cost, making H-CNG more expensive than CNG.\n\nTherefore, only statements 2 and 3 are correct.\n\n**Short notes on named entities:**\n\n* **H-CNG (Hydrogen-enriched Compressed Natural Gas):** A fuel blend consisting of compressed natural gas (CNG) and hydrogen gas.  The addition of hydrogen aims to reduce the environmental impact of CNG combustion by lowering greenhouse gas emissions.\n\n* **CNG (Compressed Natural Gas):**  A fuel primarily composed of methane, stored under high pressure. It's a relatively clean-burning fossil fuel compared to gasoline or diesel, but still emits greenhouse gases.\n\n* **Carbon monoxide (CO):** A toxic and colorless gas produced during incomplete combustion of carbon-containing fuels.  It's a significant air pollutant.\n\n* **Carbon dioxide (CO2):** A major greenhouse gas contributing to climate change. It's produced during the complete combustion of carbon-containing fuels.\n\n* **Hydrocarbons:** Organic compounds composed of hydrogen and carbon atoms.  They are found in fossil fuels and are emitted during combustion.  Many hydrocarbons are air pollutants.\n\n* **Hydrogen (H2):** A highly energetic and clean-burning fuel.  When burned, it produces only water vapor, making it an attractive alternative to fossil fuels.  However, its production and storage present challenges.\n"
    },
    {
        "q_num": 44,
        "question_text": "Why are dewdrops not formed on a cloudy night?",
        "option_a": "Clouds absorb the radiation released from the Earth's surface.",
        "option_b": "Clouds reflect back the Earth's radiation.",
        "option_c": "The Earth's surface would have low temperature on cloudy nights.",
        "option_d": "Clouds deflect the blowing wind to ground level.",
        "correct_option": "a",
        "subject": "geography",
        "year": 2019,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Dew formation happens when the ground cools down at night, causing water vapor in the air to condense into liquid water droplets.  On a cloudy night, clouds prevent the Earth's surface from radiating its heat efficiently into space. This is because clouds absorb and reflect back the infrared radiation emitted by the Earth. As a result, the ground stays warmer, and the temperature difference between the ground and the air is not large enough for significant dew formation to occur.\n\nClouds:  Clouds are visible masses of water droplets or ice crystals suspended in the atmosphere. They form when water vapor in the air condenses around tiny particles called condensation nuclei. Different cloud types exist based on altitude and shape.\n\nEarth's radiation: The Earth's surface emits infrared radiation (heat) as it cools down at night. This radiation plays a crucial role in the cooling process that leads to dew formation.  The amount of radiation emitted depends on several factors, including the temperature of the surface and the presence of clouds.\n\nInfrared radiation: A type of electromagnetic radiation that is invisible to the human eye.  It is associated with heat and is emitted by all objects that have a temperature above absolute zero.  Clouds are effective at absorbing and emitting infrared radiation.\n"
    },
    {
        "q_num": 45,
        "question_text": "Consider the following statements:\n1. The 44th Amendment to the Constitution of India introduced an Article placing the election of the Prime Minister beyond judicial review.\n2. The Supreme Court of India struck down the 99th Amendment to the Constitution of India as being violative of the independence of judiciary.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. The 44th Amendment did not introduce an article placing the election of the Prime Minister beyond judicial review.  While the 44th Amendment made changes related to the Prime Minister's office and the relationship between the executive and legislature, it did not explicitly remove the possibility of judicial review concerning the Prime Minister's election.\n\nStatement 2 is correct. The Supreme Court did strike down a part of the 99th Amendment to the Constitution.  The Supreme Court deemed this portion of the amendment to be inconsistent with the independence of the judiciary.  The specific details of the case and the part of the amendment struck down would require further research beyond this provided context.\n\n\n**Short notes on named entities:**\n\n* **44th Amendment to the Constitution of India:** This amendment, enacted in 1978, introduced several changes to the Constitution, primarily aimed at limiting the power of the executive and strengthening democratic institutions.  Significant changes included modifying the definition of \"Money Bill,\" impacting the relationship between Parliament and the executive.\n\n* **99th Amendment to the Constitution of India:** This amendment, enacted in 2014, dealt with the appointment of judges to the National Judicial Appointments Commission (NJAC).  The Supreme Court challenged the amendment's effect on judicial independence.\n\n* **Supreme Court of India:** The highest court of appeal in India, responsible for interpreting the Constitution and ensuring its enforcement. It has the power of judicial review, enabling it to examine the constitutionality of laws and government actions.\n\n* **Judicial Review:** The power of the judiciary to review laws passed by the legislature and actions taken by the executive to determine their compatibility with the Constitution. It is a cornerstone of a constitutional democracy.\n\n* **Independence of Judiciary:** The principle that the judiciary should be free from interference from the executive or legislature, enabling it to act impartially in upholding the law and protecting the rights of citizens.  This independence is vital for the rule of law.\n"
    },
    {
        "q_num": 46,
        "question_text": "Consider the following statements:\n1. The motion to impeach a Judge of the Supreme Court of India cannot be rejected by the Speaker of the Lok Sabha as per the Judges (Inquiry) Act, 1968.\n2. The Constitution of India defines and gives details of what constitutes 'incapacity and proved misbehaviour' of the Judges of the Supreme Court of India.\n3. The details of the process of impeachment of the Judges of the Supreme Court of India are given in the Judges (Inquiry) Act, 1968.\n4. If the motion for the impeachment of a Judge is taken up for voting, the law requires the motion to be backed by each House of the Parliament and supported by a majority of total membership of that House and by not less than two-thirds of total members of that House present and voting.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "3 only",
        "option_c": "3 and 4 only",
        "option_d": "1, 3 and 4",
        "correct_option": "d",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation:\n\nStatement 1 is incorrect. The Judges (Inquiry) Act, 1968, outlines the process of impeachment, but it doesn't prevent the Speaker from rejecting a motion.  The Speaker's role is to ensure the motion adheres to procedural rules.  Rejection is possible if the motion is deemed procedurally flawed.\n\nStatement 2 is incorrect. The Constitution mentions \"proved misbehaviour\" and \"incapacity\" as grounds for impeachment but doesn't detail what constitutes them.  The specifics are left to interpretation and the process of inquiry.\n\nStatement 3 is correct. The Judges (Inquiry) Act, 1968, details the procedure for impeachment, including the inquiry process and the role of Parliament.\n\nStatement 4 is correct. The motion needs to be passed by both Houses of Parliament with the specified majorities.\n\nTherefore, only statements 3 and 4 are correct.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Lok Sabha:** The lower house of the Indian Parliament, directly elected by the people.  It is responsible for initiating money bills and holds the executive accountable.\n\n* **Judges (Inquiry) Act, 1968:** This Act establishes the procedure for investigating and removing judges of the Supreme Court and High Courts for proven misbehavior or incapacity.\n\n* **Supreme Court of India:** The highest court of appeal in India. It interprets the Constitution and has the power of judicial review.\n\n* **Impeachment:** A formal process to remove a public official from office for misconduct. In India, this applies to judges and the President.\n\n* **Parliament:** The supreme legislative body of India, comprising the President, Rajya Sabha (Council of States), and Lok Sabha (House of the People).\n\n* **Rajya Sabha:** The upper house of the Indian Parliament. Its members are indirectly elected, representing states and union territories.  It has some powers to delay legislation.\n\n\n"
    },
    {
        "q_num": 47,
        "question_text": "The Ninth Schedule was introduced in the Constitution of India during the prime ministership of",
        "option_a": "Jawaharlal Nehru",
        "option_b": "Lal Bahadur Shastri",
        "option_c": "Indira Gandhi",
        "option_d": "Morarji Desai",
        "correct_option": "a",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation: The Ninth Schedule was added to the Constitution of India by the First Amendment Act of 1951, during Jawaharlal Nehru's tenure as Prime Minister.  The Ninth Schedule initially contained laws that the government wanted to protect from judicial review.  \n\nJawaharlal Nehru was the first Prime Minister of India, leading the nation from its independence in 1947 until 1964.  His leadership was crucial in shaping India's post-independence policies and its constitution.\n\nLal Bahadur Shastri served as Prime Minister after Nehru's death, from 1964 to 1966. Indira Gandhi, daughter of Jawaharlal Nehru, was Prime Minister from 1966 to 1977 and again from 1980 to 1984. Morarji Desai was Prime Minister from 1977 to 1979.\n"
    },
    {
        "q_num": 48,
        "question_text": "Consider the following statements:\n1. Coal sector was nationalized by the Government of India under Indira Gandhi.\n2. Now, coal blocks are allocated on lottery basis.\n3. Till recently, India imported coal to meet the shortages of domestic supply, but now India is self-sufficient in coal production.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  The coal sector in India was nationalized under Indira Gandhi's government.  Statement 2 is incorrect. Coal block allocation is not done through a lottery system.  Statement 3 is incorrect. While India has increased its domestic coal production, it still imports coal to meet its energy demands and is not self-sufficient.\n\nIndira Gandhi:  Served as Prime Minister of India from 1966 to 1977 and again from 1980 to 1984.  Her tenure was marked by significant policy changes, including nationalization of key industries.\n\nCoal: A combustible black or dark brown sedimentary rock composed mainly of carbonized plant matter. It's a major source of energy globally.  India has significant coal reserves but also faces challenges in production and distribution.\n"
    },
    {
        "q_num": 49,
        "question_text": "Consider the following statements:\n1. The Parliament (Prevention of Disqualification) Act, 1959 exempts several posts from disqualification on the grounds of 'Office of Profit'.\n2. The above-mentioned Act was amended five times.\n3. The term 'Office of Profit' is well-defined in the Constitution of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is correct. The Parliament (Prevention of Disqualification) Act, 1959,  exempts certain posts from disqualification based on holding an \"Office of Profit\".  This act aims to clarify which positions don't constitute an \"Office of Profit\" under the Representation of the People Act, thus allowing individuals holding those posts to remain members of Parliament.\n\nStatement 2 is correct. The Parliament (Prevention of Disqualification) Act, 1959, has been amended multiple times to address evolving situations and interpretations of \"Office of Profit\".  The exact number of amendments might vary depending on the source, but it has undergone several revisions.\n\nStatement 3 is incorrect. The Constitution of India doesn't explicitly define \"Office of Profit\".  The concept is interpreted through judicial pronouncements and legislative actions, primarily the Parliament (Prevention of Disqualification) Act, 1959, and its subsequent amendments.  The lack of a precise constitutional definition has led to ongoing debates and legal challenges.\n\n\n**Short notes on named entities:**\n\n* **Parliament (Prevention of Disqualification) Act, 1959:** This Act aims to prevent conflicts of interest by clarifying which positions do not lead to disqualification from Parliament on grounds of holding an \"Office of Profit\".  It lists specific posts exempted from this disqualification.\n\n* **Office of Profit:** This refers to any position that provides financial gain or other benefits, potentially creating a conflict of interest for a member of Parliament or other public office holder.  The interpretation of what constitutes an \"Office of Profit\" is subject to legal and political debate.\n\n* **Representation of the People Act:**  This Act deals with the conduct of elections to Parliament and State Legislatures in India.  It lays down rules regarding disqualifications for contesting and holding office.\n\n* **Constitution of India:** India's supreme law, which outlines the framework for the governance of the country.  It establishes the fundamental rights and duties of citizens, and defines the structure and powers of the government.\n\n* **Article 105 (Constitution of India):**  Deals with the privileges of Parliament members.\n\n* **Article 194 (Constitution of India):** Deals with the privileges of State Legislature members.\n\n* **Article 14 (Constitution of India):** Guarantees equality before the law and equal protection of the laws within the territory of India. It permits reasonable classification.\n\n* **Article 361 (Constitution of India):**  Grants immunity to the President and Governor from legal proceedings in certain circumstances.\n\n* **Article 361-A (Constitution of India):**  Deals with the protection of the President and Governors from defamation.\n\n* **Rule of Law:** A principle of governance in which all persons, institutions and entities, public and private, including the State itself, are accountable to laws that are publicly promulgated, equally enforced and independently adjudicated, and which are consistent with international human rights norms and standards.  A.V. Dicey is associated with this concept.\n\n* **A.V. Dicey:**  A British jurist known for his articulation of the concept of the rule of law.\n\n\n"
    },
    {
        "q_num": 50,
        "question_text": "Under which Schedule of the Constitution of India can the transfer of tribal land to private parties for mining be declared null and void?",
        "option_a": "Third Schedule",
        "option_b": "Fifth Schedule",
        "option_c": "Ninth Schedule",
        "option_d": "Twelfth Schedule",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:The Fifth Schedule of the Constitution of India deals with the administration and control of Scheduled Areas and Scheduled Tribes.  It empowers the Governor of a state to make regulations for the well-being of Scheduled Tribes in these areas.  Transferring tribal land to private parties for mining without proper consultation and adherence to these regulations can be challenged and declared null and void under the provisions of the Fifth Schedule.  The other Schedules mentioned don't directly address this issue.\n\nThe Third Schedule contains forms of oaths or affirmations. The Ninth Schedule lists certain Acts and Regulations that are immune from judicial review. The Twelfth Schedule deals with municipalities.\n"
    },
    {
        "q_num": 51,
        "question_text": "Consider the following statements about Particularly Vulnerable Tribal Groups (PVTGs) in India:\n1. PVTGs reside in 18 States and one Union Territory.\n2. A stagnant or declining population is one of the criteria for determining PVTG status.\n3. There are 95 PVTGs officially notified in the country so far.\n4. Irular and Konda Reddi tribes are included in the list of PVTGs.\nWhich of the statements given above are correct?",
        "option_a": "1, 2 and 3",
        "option_b": "2, 3 and 4",
        "option_c": "1, 2 and 4",
        "option_d": "1, 3 and 4",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation:\n\nStatement 1:  Incorrect. PVTGs reside in 18 states and 1 Union Territory.\n\nStatement 2: Correct. A stagnant or declining population is a criterion for PVTG status.\n\nStatement 3:  Incorrect. The number of officially notified PVTGs is 75.\n\nStatement 4: Correct. Irular and Konda Reddi tribes are among the PVTGs.\n\n\nIrular Tribe:  The Irular tribe is an indigenous community primarily found in the southern Indian states of Tamil Nadu and Andhra Pradesh.  They are known for their traditional skills in making ropes and baskets from natural fibers.  They have faced historical marginalization and social exclusion.\n\nKonda Reddi Tribe: The Konda Reddi tribe is a Particularly Vulnerable Tribal Group (PVTG) inhabiting the Eastern Ghats mountain range of Andhra Pradesh, India.  They are known for their unique cultural practices and traditional way of life, often characterized by isolation and limited access to resources.  They are considered one of the most vulnerable tribal communities in India.\n"
    },
    {
        "q_num": 52,
        "question_text": "With reference to the Constitution of India, prohibitions or limitations or provisions contained in ordinary laws cannot act as prohibitions or limitations on the constitutional powers under Article 142. It could mean which one of the following?",
        "option_a": "The decisions taken by the Election Commission of India while discharging its duties cannot be challenged in any court of law.",
        "option_b": "The Supreme Court of India is not constrained in the exercise of its powers by laws made by the Parliament.",
        "option_c": "In the event of grave financial crisis in the country, the President of India can declare Financial Emergency without the counsel from the Cabinet.",
        "option_d": "State Legislatures cannot make laws on certain matters without the concurrence of Union Legislature.",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:Article 142 of the Indian Constitution grants the Supreme Court the power to pass any decree or make any order as is necessary for doing complete justice in any case before it.  This power is not subject to limitations imposed by ordinary laws passed by the Parliament.  Therefore, the Supreme Court is not constrained in exercising its powers under Article 142 by laws made by the Parliament.\n\n**Short notes on named entities:**\n\n* **Article 142:** This article of the Indian Constitution empowers the Supreme Court to pass any decree or order necessary for complete justice in any case before it.  It allows the court to go beyond existing laws if it deems necessary for justice.\n\n* **Supreme Court of India:** The highest court of appeal in India, responsible for interpreting the Constitution and upholding the rule of law. Its powers are extensive and include judicial review.\n\n* **Parliament:** The bicameral legislature of India, comprising the Rajya Sabha (Council of States) and the Lok Sabha (House of the People). It is responsible for making laws for the country.\n\n* **Election Commission of India:**  An autonomous constitutional body responsible for conducting free and fair elections to the Parliament, State Legislatures, and the offices of the President and Vice-President of India.  Its independence is crucial for democratic governance.\n\n* **President of India:** The head of state of India, primarily a ceremonial role, though holding certain reserve powers like declaring Financial Emergency.\n\n* **Article 361:** This article grants immunity to the President and Governor from legal proceedings during their term of office.  It ensures the smooth functioning of the executive branch.\n\n\n* **A.V. Dicey:**  A British jurist known for his articulation of the concept of the rule of law, emphasizing the supremacy of law and equality before the law.  His ideas have influenced constitutional thought globally, but their direct application to India is debated due to the unique nature of its constitution.\n\n* **Rule of Law:**  A principle that all persons and institutions, public and private, including the government, are accountable under the law. It ensures equality before the law and prevents arbitrary exercise of power.\n\n* **Judicial Review:** The power of the judiciary to review laws and government actions to ensure their compatibility with the Constitution. It is a cornerstone of constitutionalism.\n\n* **Golaknath case (1967), Kesavananda Bharati case (1973), Minerva Mills case (1980):** Landmark Supreme Court cases that shaped the understanding of the scope of judicial review and the concept of the basic structure of the Constitution.\n\n* **Basic Structure Doctrine:**  A judicial principle that limits the Parliament's power to amend the Constitution, protecting fundamental aspects of the Constitution from alteration.\n\n* **Judicial Activism:**  A judicial philosophy where judges actively shape public policy through their decisions. It's often contrasted with judicial restraint.\n\n* **Article 13:** This article deals with the judicial review of laws, declaring laws inconsistent with fundamental rights as void.\n\n* **Article 32:**  This article guarantees the right to constitutional remedies, enabling citizens to approach the Supreme Court for enforcement of their fundamental rights.\n\n* **Article 226:** This article empowers High Courts to issue writs for the enforcement of fundamental rights and other legal rights.\n\n"
    },
    {
        "q_num": 53,
        "question_text": "With reference to the Legislative Assembly of a State in India, consider the following statements:\n1. The Governor makes a customary address to Members of the House at the commencement of the first session of the year.\n2. When a State Legislature does not have a rule on a particular matter, it follows the Lok Sabha rule on that matter.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  The Governor of a state in India traditionally addresses the members of the Legislative Assembly at the beginning of the first session of the year. This is a customary practice, not a constitutional mandate.\n\nStatement 2 is incorrect.  While state legislatures may look to the Lok Sabha's rules for guidance when their own rules are silent on a matter, they are not obligated to follow Lok Sabha rules.  Each state legislature has its own rules of procedure.  The rules of procedure of the state legislature are primarily based on the rules of the Lok Sabha, but they are not bound to follow them.  They have their own set of rules and regulations.\n\n\n**Short notes on important keywords and named entities:**\n\n* **Legislative Assembly of a State in India:**  The lower house of a bicameral state legislature (in states with two houses).  It is the primary legislative body of the state, responsible for making laws pertaining to state matters. Members are elected by the people of the state.\n\n* **Governor:** The head of a state in India. Appointed by the President of India, the Governor's role is largely ceremonial, but they have certain powers, including the power to summon, prorogue, and dissolve the state legislature; to give assent to bills passed by the legislature; and to reserve certain bills for the President's consideration.\n\n* **Lok Sabha:** The lower house of the Parliament of India. It is the more powerful of the two houses and its rules of procedure are often used as a model for other legislative bodies in India.\n\n\n"
    },
    {
        "q_num": 54,
        "question_text": "Consider the following statements:\n1. The United Nations Convention against Corruption (UNCAC) has a 'Protocol against the Smuggling of Migrants by Land, Sea and Air'.\n2. The UNCAC is the ever-first legally binding global anti-corruption instrument.\n3. A highlight of the United Nations Convention against Transnational Organized Crime (UNTOC) is the inclusion of a specific chapter aimed at returning assets to their rightful owners from whom they had been taken illicitly.\n4. The United Nations Office on Drugs and Crime (UNODC) is mandated by its member States to assist in the implementation of both UNCAC and UNTOC.\nWhich of the statements given above are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. The Protocol against the Smuggling of Migrants by Land, Sea and Air supplements the United Nations Convention against Transnational Organized Crime (UNTOC), not the UNCAC.\n\nStatement 2 is correct. The UNCAC is the first legally binding global anti-corruption instrument.\n\nStatement 3 is correct. UNTOC includes a chapter on asset recovery.\n\nStatement 4 is correct. The UNODC assists in the implementation of both UNCAC and UNTOC.\n\n\nShort notes on named entities:\n\n* **United Nations Convention against Corruption (UNCAC):**  A multilateral treaty promoting measures to prevent and combat corruption.  It covers various aspects, including bribery, embezzlement, and money laundering.  It encourages international cooperation in combating corruption.\n\n* **United Nations Convention against Transnational Organized Crime (UNTOC):** A legally binding international treaty aimed at combating transnational organized crime. It covers various forms of organized crime, including trafficking in persons, smuggling of migrants, and illicit manufacturing and trafficking of firearms.\n\n* **Protocol against the Smuggling of Migrants by Land, Sea and Air:**  A supplementary protocol to UNTOC, specifically targeting the crime of smuggling of migrants.  It outlines measures to criminalize smuggling, protect victims, and enhance international cooperation.\n\n* **United Nations Office on Drugs and Crime (UNODC):** A United Nations office mandated to assist states in implementing international drug control treaties and conventions, including those related to crime prevention and criminal justice.  It provides technical assistance, training, and research support.\n"
    },
    {
        "q_num": 55,
        "question_text": "Consider the following statements:\n1. As per recent amendment to the Indian Forest Act, 1927, forest dwellers have the right to fell the bamboos grown on forest areas.\n2. As per the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, bamboo is a minor forest produce.\n3. The Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006 allows ownership of minor forest produce to forest dwellers.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  While the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, grants forest dwellers rights over forest produce, including bamboo, it doesn't automatically grant the right to fell them as per the 1927 Act.  Specific permissions and regulations would still apply.\n\nStatement 2 is correct. The Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, explicitly classifies bamboo as a minor forest produce.\n\nStatement 3 is correct.  The 2006 Act aims to grant forest dwellers ownership rights over minor forest produce, including bamboo, subject to certain conditions and regulations.\n\n\n**Short Notes:**\n\n* **Indian Forest Act, 1927:**  This Act governs the management of forests in India, including harvesting and use of forest resources. It has undergone several amendments over the years.\n\n* **Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006:** This Act recognizes the rights of forest-dwelling communities over forest resources, including the right to collect, use, and in some cases, own minor forest produce.  It aims to address historical injustices and empower these communities.\n\n* **Minor Forest Produce:**  These are non-timber forest products, such as bamboo, tendu leaves, honey, etc., that are collected by forest dwellers for their livelihoods.  The Act provides legal recognition and protection for their rights over such produce.\n"
    },
    {
        "q_num": 56,
        "question_text": "Which Article of the Constitution of India safeguards one's right to marry the person of one's choice?",
        "option_a": "Article 19",
        "option_b": "Article 21",
        "option_c": "Article 25",
        "option_d": "Article 29",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation:  The right to marry a person of one's choice is not explicitly mentioned in any single article of the Indian Constitution. However, it is derived from a confluence of Articles, primarily Article 21 (right to life and personal liberty), which has been interpreted by the Supreme Court to include the right to privacy and the freedom to make personal choices, including marriage.  Article 19 (freedom of speech and expression, assembly, association, etc.) also plays a role, as these freedoms are essential for choosing a partner and forming a relationship.  Article 25 (freedom of conscience and religion) is relevant in cases where marriage choices involve religious considerations.  Article 29 safeguards the right to conserve one's own culture and language.  The Supreme Court has consistently held that the right to marry is a fundamental right, even if it is not explicitly stated in a single article.\n"
    },
    {
        "q_num": 57,
        "question_text": "Consider the following statements:\n1. According to the Indian Patents Act, a biological process to create a seed can be patented in India.\n2. In India, there is no Intellectual Property Appellate Board.\n3. Plant varieties are not eligible to be patented in India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nStatement 1 is incorrect.  The Indian Patents Act excludes plants and animals from patentability,  including biological processes for creating seeds.  Statement 2 is incorrect. India does have an Intellectual Property Appellate Board (IPAB).  Statement 3 is correct. Plant varieties are not patentable in India; they are protected under the Protection of Plant Varieties and Farmers' Rights Act, 2001.\n\nTherefore, only statement 3 is correct.\n\n\n**Short notes on named entities:**\n\n* **Indian Patents Act:**  This Act governs the granting of patents in India for inventions.  It outlines the criteria for patentability, the process of applying for a patent, and the rights granted to patent holders.  It specifically excludes certain subject matter from patentability, such as plants and animals in their natural form.\n\n* **Intellectual Property Appellate Board (IPAB):**  This was a tribunal in India that heard appeals related to intellectual property rights, including patents, trademarks, and designs. Note that the IPAB has been dissolved and its functions transferred to other bodies.\n\n* **Protection of Plant Varieties and Farmers' Rights Act, 2001:** This Act provides a sui generis system for the protection of plant varieties in India. It grants breeders exclusive rights over their new plant varieties while also protecting the rights of farmers. This is different from a patent system.\n"
    },
    {
        "q_num": 58,
        "question_text": "Consider the following statements: The Environment Protection Act, 1986 empowers the Government of India to\n1. state the requirement of public participation in the process of environmental protection, and the procedure and manner in which it is sought\n2. lay down the standards for emission or discharge of environmental pollutants from various sources\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation: The Environment Protection Act of 1986 in India empowers the government to both  state the requirements for public participation in environmental protection and lay down emission/discharge standards for pollutants.  The act provides a framework for environmental regulations and citizen involvement.\n\nThe Environment Protection Act, 1986:  This landmark legislation provides the overarching legal framework for environmental protection in India. It empowers the central government to set standards, implement regulations, and take action against environmental violations.  It's a crucial tool in managing various environmental challenges.\n\nPublic participation in environmental protection:  This refers to the involvement of citizens in decision-making processes related to environmental issues.  It ensures transparency, accountability, and considers diverse perspectives in environmental management.\n\n\nEmission or discharge standards: These are legally mandated limits on the amount of pollutants that can be released into the environment from various sources (industries, vehicles, etc.).  They are crucial for controlling pollution levels and protecting environmental quality.\n"
    },
    {
        "q_num": 59,
        "question_text": "As per the Solid Waste Management Rules, 2016 in India, which one of the following statements is correct?",
        "option_a": "Waste generator has to segregate waste into five categories.",
        "option_b": "The Rules are applicable to notified urban local bodies, notified towns and all industrial townships only.",
        "option_c": "The Rules provide for exact and elaborate criteria for the identification of sites for landfills and waste processing facilities.",
        "option_d": "It is mandatory on the part of waste generator that the waste generated in one district cannot be moved to another district.",
        "correct_option": "b",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation: The Solid Waste Management Rules, 2016, are applicable to all urban local bodies, notified towns, and industrial townships.  Option (a) is incorrect; the rules specify segregation into three categories (biodegradable, non-biodegradable, and domestic hazardous wastes) as a minimum requirement. Option (c) is incorrect because the rules provide a framework for site selection but not exact and elaborate criteria. Option (d) is incorrect; the rules do not prohibit inter-district movement of waste.\n\nSolid Waste Management Rules, 2016:  These rules aim to provide a comprehensive framework for the management of solid waste in India.  They cover aspects like waste segregation, collection, processing, and disposal, with a focus on minimizing environmental impact and promoting resource recovery.\n\nUrban local bodies:  These are local government bodies responsible for the administration of urban areas, including waste management.\n\nNotified towns/industrial townships:  Towns and industrial areas officially designated by the government, making them subject to specific regulations.\n\nWaste generator: Individuals, households, businesses, or industries that produce solid waste.  Their responsibilities include waste segregation and proper disposal.\n\nLandfills/waste processing facilities:  Sites used for the disposal or processing of solid waste.  The selection of these sites involves considerations of environmental impact, accessibility, and proximity to waste generation sources.\n"
    },
    {
        "q_num": 60,
        "question_text": "Consider the following statements: As per the Industrial Employment (Standing Orders) Central (Amendment) Rules, 2018\n1. if rules for fixed-term employment are implemented, it becomes easier for the firms/companies to lay off workers\n2. no notice of termination of employment shall be necessary in the case of temporary workman\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation:The Industrial Employment (Standing Orders) Central (Amendment) Rules, 2018, introduced provisions for fixed-term employment.  Statement 1 suggests that this makes it easier for firms to lay off workers. While fixed-term contracts inherently allow for termination at the end of the term, the ease of layoff depends on the specific rules and regulations governing the termination process within the contract and the overall legal framework.  Further information is needed to definitively confirm whether statement 1 is entirely correct. Statement 2 claims that no notice is needed for temporary workers' termination. This is generally true for temporary workers under certain conditions as defined in the 2018 amendment, but the exact requirements might vary based on the specific contract and applicable labor laws. Hence, both statements could be partially correct, depending on the detailed implementation of the rules.  Therefore, the best option is (c).\n\n\nIndustrial Employment (Standing Orders) Central (Amendment) Rules, 2018: These rules amended the existing standing orders related to industrial employment in India, introducing significant changes, including provisions for fixed-term employment and clarifying regulations for temporary workers.\n\nFixed-term employment: A type of employment contract where the employment period is specified in advance and ends automatically at the end of that term.\n\nTemporary workman:  An individual employed for a specific period or task, typically shorter than permanent employees.  Their employment ends upon completion of the task or expiration of the specified time.\n"
    },
    {
        "q_num": 61,
        "question_text": "The Service Area Approach was implemented under the purview of",
        "option_a": "Integrated Rural Development Programme",
        "option_b": "Lead Bank Scheme",
        "option_c": "Mahatma Gandhi National Rural Employment Guarantee Scheme",
        "option_d": "National Skill Development Mission",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation: The provided text does not explicitly state that the Service Area Approach was implemented under any of the listed programs.  However, the context heavily emphasizes rural development initiatives.  The Lead Bank Scheme (option b) focuses on assigning banks to specific rural areas to coordinate credit distribution, which aligns with a service area approach.  While other options relate to rural development, they don't directly imply a structured \"service area\" methodology.\n\n\nIntegrated Rural Development Programme (IRDP): Aimed at poverty alleviation in rural areas through various income-generating activities and infrastructure development.  It lacked a specific service area focus but paved the way for more targeted approaches.\n\nLead Bank Scheme:  Aimed at ensuring adequate credit flow to rural areas by assigning a lead bank to each district to coordinate lending activities. This inherently involves a service area approach, dividing responsibility geographically.\n\nMahatma Gandhi National Rural Employment Guarantee Scheme (MGNREGS): Guarantees 100 days of wage employment to rural households. While it operates within geographical areas, it's not fundamentally structured as a \"service area\" approach.\n\nNational Skill Development Mission:  Focuses on skill development and training to improve employability.  It lacks a direct connection to the concept of a defined service area.\n"
    },
    {
        "q_num": 62,
        "question_text": "With reference to the management of minor minerals in India, consider the following statements:\n1. Sand is a ‘minor mineral’ according to the prevailing law in the country.\n2. State Governments have the power to grant mining leases of minor minerals, but the powers regarding the formation of rules related to the grant of minor minerals lie with the Central Government.\n3. State Governments have the power to frame rules to prevent illegal mining of minor minerals.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. Sand is classified as a minor mineral under the prevailing Indian laws.\n\nStatement 2 is incorrect.  While State Governments do grant mining leases for minor minerals, the power to frame rules regarding the grant of these leases rests with the State Governments, not the Central Government.  The central government has some overarching regulatory power but the primary authority is vested in the states.\n\nStatement 3 is correct. State Governments possess the authority to create and implement rules aimed at curbing illegal mining activities involving minor minerals within their respective jurisdictions.\n\n\n"
    },
    {
        "q_num": 63,
        "question_text": "Consider the following statements:\n1. Most of India’s external debt is owed by governmental entities.\n2. All of India’s external debt is denominated in US dollars.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is partially correct.  While a significant portion of India's external debt is held by governmental entities, a considerable amount is also owed by private sector actors.  Statement 2 is incorrect. India's external debt is not solely denominated in US dollars; it's held in a variety of currencies, though the US dollar likely comprises a significant portion.\n\nIndia: A large, diverse South Asian nation with a rapidly growing economy and significant external debt.  The country's economic policies and debt management strategies are influenced by global financial conditions and international institutions.\n\nUS dollar: The most widely used currency in international trade and finance.  Many countries hold significant US dollar reserves, and a large portion of global debt is denominated in this currency.\n"
    },
    {
        "q_num": 64,
        "question_text": "Which of the following is not included in the assets of a commercial bank in India?",
        "option_a": "Advances",
        "option_b": "Deposits",
        "option_c": "Investments",
        "option_d": "Money at call and short notice",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Deposits are a liability for a commercial bank, not an asset.  Assets represent what a bank owns, while liabilities represent what it owes.  Advances (loans given out), investments (in securities), and money at call and short notice (easily accessible funds) are all assets because they represent things of value the bank possesses.  Deposits, on the other hand, are funds held by the bank on behalf of its customers, representing a liability (something the bank owes).\n\nA short note on the named entities:\n\n**Advances:** Loans provided by a commercial bank to individuals or businesses.  These are a key source of income for banks.\n\n**Deposits:** Funds entrusted to a bank by customers. These form the primary source of funds for banks to lend out.\n\n**Investments:** Securities (like government bonds or shares) held by the bank as part of its investment portfolio.  These offer diversification and potential returns.\n\n**Money at call and short notice:** Highly liquid assets that can be easily converted to cash. These are typically short-term loans made to other financial institutions.\n\nThe provided historical context about Indian banking (nationalization dates, committees, etc.) and the regulatory and monetary policy details (CRR, SLR, Repo rate, etc.) are relevant to understanding the banking sector's operations but do not directly impact the core question of classifying assets and liabilities.  The additional context about inclusive growth and UN SDGs is entirely unrelated.\n"
    },
    {
        "q_num": 65,
        "question_text": "In the context of India, which of the following factors is/are contributor/contributors to reducing the risk of a currency crisis?\n1. The foreign currency earnings of India’s IT sector\n2. Increasing the government expenditure\n3. Remittances from Indians abroad\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "1 and 3 only",
        "option_c": "2 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation:Foreign currency earnings from India's IT sector contribute to forex reserves, bolstering the rupee and reducing vulnerability to currency crises.  Remittances from Indians abroad similarly increase forex reserves, strengthening the currency's position. Increasing government expenditure, however, can lead to higher fiscal deficits and inflation, potentially increasing the risk of a currency crisis.  Therefore, only options 1 and 3 contribute to reducing the risk of a currency crisis in India.\n\nShort notes on keywords and named entities:\n\n**Currency crisis:** A situation where a country's currency rapidly loses value against other currencies, often leading to economic instability.  This can be triggered by various factors, including large fiscal deficits, high inflation, and speculative attacks.\n\n**India's IT sector:** A major contributor to India's economy, known for its expertise in software development, IT services, and business process outsourcing.  It generates significant foreign exchange earnings, contributing to the country's balance of payments.\n\n**Government expenditure:** The total spending by the government, including on infrastructure, social welfare programs, and other public services.  Excessive expenditure without sufficient revenue can lead to fiscal deficits and inflation.\n\n**Remittances from Indians abroad:** Money sent by Indians working overseas to their families and relatives in India.  These remittances constitute a significant source of foreign exchange inflows for India, impacting its balance of payments and exchange rate.\n"
    },
    {
        "q_num": 66,
        "question_text": "Which one of the following suggested that the Governor should be an eminent person from outside the State and should be a detached figure without intense political links or should not have taken part in politics in the recent past?",
        "option_a": "First Administrative Reforms Commission (1966)",
        "option_b": "Rajamannar Committee (1969)",
        "option_c": "Sarkaria Commission (1983)",
        "option_d": "National Commission to Review the Working of the Constitution (2000)",
        "correct_option": "a",
        "subject": "polity",
        "year": 2019,
        "explanation": "* **correct_option:** (a)\n\n* **explanation:** The First Administrative Reforms Commission (1966) suggested that the Governor should be an eminent person from outside the State and should be a detached figure without intense political links or should not have taken part in politics in the recent past.  This recommendation aimed to ensure the Governor's impartiality and prevent potential conflicts of interest with the state government.\n\nThe Rajamannar Committee (1969) focused on Centre-State relations and did not specifically address the Governor's appointment criteria in this manner. The Sarkaria Commission (1983) also dealt with Centre-State relations but its recommendations concerning the Governor did not emphasize the external appointment aspect as prominently as the First Administrative Reforms Commission.  The National Commission to Review the Working of the Constitution (2000) addressed various aspects of the Constitution but did not explicitly reiterate this specific suggestion regarding the Governor's appointment.\n\n\n**Short notes:**\n\n* **First Administrative Reforms Commission (1966):**  This commission, chaired by Morarji Desai, examined administrative reforms in India. Its recommendations covered various aspects of governance, including the role and selection of Governors.\n\n* **Rajamannar Committee (1969):** This committee, headed by P.V. Rajamannar, examined Centre-State relations in India and suggested various reforms to improve the balance of power between the central and state governments.\n\n* **Sarkaria Commission (1983):** Chaired by Justice R.S. Sarkaria, this commission reviewed Centre-State relations and made recommendations to strengthen the federal structure of India.  Its recommendations included addressing issues related to the Governor's role and powers.\n\n* **National Commission to Review the Working of the Constitution (2000):** This commission, chaired by Justice M.N. Venkatachaliah, comprehensively reviewed the Indian Constitution and suggested various amendments and reforms.  Its work included a review of the functioning of various constitutional bodies, including the Governor's office.\n"
    },
    {
        "q_num": 67,
        "question_text": "Which of the following is issued by registered foreign portfolio investors to overseas investors who want to be part of the Indian stock market without registering themselves directly?",
        "option_a": "Certificate of Deposit",
        "option_b": "Commercial Paper",
        "option_c": "Promissory Note",
        "option_d": "Participatory Note",
        "correct_option": "d",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: A Participatory Note (PN) is issued by registered foreign portfolio investors (FPIs) to overseas investors.  These notes allow overseas investors to invest in the Indian stock market without having to register themselves directly with Indian regulatory authorities.  The FPI acts as an intermediary, holding the underlying Indian securities on behalf of the overseas investor.\n\nA Certificate of Deposit (CD) is a short-term debt instrument issued by banks. Commercial Paper (CP) is an unsecured, short-term debt instrument issued by corporations. A Promissory Note (PN) is a written promise to pay a specified sum of money on demand or at a definite time.  None of these three instruments directly facilitate investment in the Indian stock market by overseas investors without direct registration.\n"
    },
    {
        "q_num": 68,
        "question_text": "Consider the following statements:\n1. As per law, the Compensatory Afforestation Fund Management and Planning Authority exists at both National and State levels.\n2. People’s participation is mandatory in the compensatory afforestation programmes carried out under the Compensatory Afforestation Fund Act, 2016.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The Compensatory Afforestation Fund Management and Planning Authority (CAMPA) does exist at both the national and state levels as per the Compensatory Afforestation Fund Act, 2016.  Statement 2 is incorrect. While the Act emphasizes the importance of local communities and their participation in compensatory afforestation, it doesn't mandate their participation.  The Act aims to ensure that compensatory afforestation is carried out effectively and sustainably, but the degree of people's participation varies depending on the specific project and location.\n\nCompensatory Afforestation Fund Management and Planning Authority (CAMPA): CAMPA is a statutory body established under the Compensatory Afforestation Fund Act, 2016. It manages funds collected for compensatory afforestation, which is the planting of trees to compensate for forest land diverted for non-forestry purposes.  It aims to ensure that the diverted forest land is effectively compensated for by creating new forest areas.  CAMPA works at both the national and state levels to coordinate and oversee compensatory afforestation projects.\n\nCompensatory Afforestation Fund Act, 2016: This Act established the legal framework for the management and utilization of funds collected for compensatory afforestation.  The Act aims to ensure that the loss of forest land is compensated for through the creation of new forest areas, promoting sustainable forest management, and involving local communities in the process.  The Act outlines the responsibilities of the CAMPA and the procedures for the implementation of compensatory afforestation projects.\n"
    },
    {
        "q_num": 69,
        "question_text": "In India, which of the following review the independent regulators in sectors like telecommunications, insurance, electricity, etc.?\n1. Ad Hoc Committees set up by the Parliament\n2. Parliamentary Department Related Standing Committees\n3. Finance Commission\n4. Financial Sector Legislative Reforms Commission\n5. NITI Aayog\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "1, 3 and 4",
        "option_c": "3, 4 and 5",
        "option_d": "2 and 5",
        "correct_option": "d",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation: Parliamentary Department Related Standing Committees (2) are responsible for scrutinizing the performance of independent regulators.  NITI Aayog (5), while involved in policy-making, doesn't directly review regulators.  Ad hoc committees (1) are temporary and not consistently involved. The Finance Commission (3) focuses on fiscal matters, and the Financial Sector Legislative Reforms Commission (4) is concerned with legislative changes, not ongoing regulatory review.\n\n**Short notes:**\n\n* **Parliamentary Department Related Standing Committees:**  These committees are permanent bodies of Parliament that oversee the work of various government departments, including those related to independent regulators.  They examine budgets, policies, and performance.\n\n* **NITI Aayog:**  A policy think tank of the Government of India, it provides strategic and technical advice to the government on various aspects of policy and planning but does not directly review regulators.\n\n* **Finance Commission:**  A constitutional body that makes recommendations to the President on the distribution of tax revenue between the Union and the states.  Its role is primarily fiscal, not regulatory oversight.\n\n* **Financial Sector Legislative Reforms Commission:** This commission reviews and proposes changes to legislation related to the financial sector. Its focus is legislative reform, not ongoing performance review of established regulators.\n\n* **Ad hoc Committees:** Temporary committees set up by Parliament to address specific issues.  Their mandate is limited to the specific issue, and they do not have a continuous role in regulatory oversight.\n"
    },
    {
        "q_num": 70,
        "question_text": "With reference to India’s Five-Year Plans, which of the following statements is/are correct?\n1. From the Second Five-Year Plan, there was a determined thrust towards substitution of basic and capital good industries.\n2. The Fourth Five-Year Plan adopted the objective of correcting the earlier trend of increased concentration of wealth and economic power.\n3. In the Fifth Five-Year Plan, for the first time, the financial sector was included as an integral part of the Plan.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is correct. The Second Five-Year Plan (1956-61), under the guidance of P.C. Mahalanobis, prioritized the development of heavy industries and import substitution.  The focus was on building a strong industrial base to reduce reliance on imports for basic and capital goods.\n\nStatement 2 is correct. The Fourth Five-Year Plan (1969-74) aimed to address the growing income inequality and concentration of economic power, a concern that had emerged in the preceding plans.  The plan included policies to promote a more equitable distribution of wealth.\n\nStatement 3 is incorrect. While the financial sector played a role in all Five-Year Plans, it wasn't explicitly included as an integral part *for the first time* in the Fifth Five-Year Plan (1974-78).  The integration of the financial sector into planning evolved gradually over the various plans.\n\n\n**Short notes on keywords and named entities:**\n\n* **Five-Year Plans (India):**  A series of centrally-planned economic development programs implemented by the Indian government since 1951.  They aimed to achieve specific economic and social goals, such as industrialization, poverty reduction, and improved infrastructure.  Each plan had its own focus and priorities, often reflecting the prevailing economic philosophy and global context.\n\n* **Second Five-Year Plan (1956-61):**  Emphasized rapid industrialization, particularly in the heavy industries sector, adopting a socialist-inspired model.  P.C. Mahalanobis, a renowned statistician, played a crucial role in shaping its strategy.\n\n* **Fourth Five-Year Plan (1969-74):** Focused on addressing poverty, inequality, and unemployment.  It incorporated strategies for rural development and emphasized employment generation.\n\n* **Fifth Five-Year Plan (1974-78):**  Aimed to remove poverty and unemployment.  It emphasized employment generation, poverty alleviation, and self-reliance.  The plan also gave importance to agriculture and rural development.\n\n* **P.C. Mahalanobis:** A prominent Indian statistician and economist known for his contributions to the Second Five-Year Plan.  His model emphasized the development of heavy industries as a driver of economic growth.\n\n* **Import Substitution:** An economic policy that aims to replace imported goods with domestically produced goods.  This strategy was crucial in India's early Five-Year Plans to foster self-reliance and industrial growth.\n"
    },
    {
        "q_num": 71,
        "question_text": "With reference to Asian Infrastructure Investment Bank (AIIB), consider the following statements:\n1. AIIB has more than 80 member nations.\n2. India is the largest shareholder in AIIB.\n3. AIIB does not have any members from outside Asia.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. The AIIB has more than 100 member nations as of October 26, 2023.\n\nStatement 2 is incorrect. China is the largest shareholder in the AIIB.\n\nStatement 3 is incorrect. The AIIB has members from outside Asia, including countries like the UK, France, Germany, and the US.\n\n\nAsian Infrastructure Investment Bank (AIIB): A multilateral development bank established in 2015 with headquarters in Beijing, China.  Its mission is to finance infrastructure projects in Asia and beyond, promoting sustainable and inclusive economic growth.  It is governed by its member countries, with voting power distributed based on shareholding.  China holds the largest share.\n\n"
    },
    {
        "q_num": 72,
        "question_text": "What was the purpose of Inter-Creditor Agreement signed by Indian banks and financial institutions recently?",
        "option_a": "To lessen the Government of India’s perennial burden of fiscal deficit and current account deficit",
        "option_b": "To support the infrastructure projects of Central and State Governments",
        "option_c": "To act as independent regulator in case of applications for loans of ₹ 50 crore or more",
        "option_d": "To aim at faster resolution of stressed assets of ₹ 50 crore or more which are under consortium lending",
        "correct_option": "d",
        "subject": "economy",
        "year": 2019,
        "explanation": "* **correct_option:** (d)\n* **explanation:** The Inter-Creditor Agreement signed by Indian banks and financial institutions aims to accelerate the resolution of stressed assets valued at ₹50 crore or more that are under consortium lending.  Consortium lending involves multiple banks providing loans to a single borrower. Stressed assets are loans where repayment is doubtful.  Faster resolution helps reduce the burden on banks and improves the overall health of the financial system. Options (a), (b), and (c) are incorrect as the agreement's primary focus is not on fiscal deficits, government infrastructure projects, or acting as an independent regulator.\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **India:** A large, diverse country in South Asia, a major player in the global economy and a significant contributor to international organizations.  Its economy is characterized by a mix of public and private sectors, with ongoing efforts towards reforms and development.\n\n* **Indian banks and financial institutions:**  These comprise public sector banks (owned by the government), private sector banks, and various non-banking financial companies (NBFCs) and housing finance companies (HFCs). They play a crucial role in financing the Indian economy.\n\n* **Stressed assets:** Loans where the borrower is experiencing difficulty in making timely repayments, posing a significant risk of default to the lender(s).  These assets require special attention and resolution mechanisms to minimize losses.\n\n* **Consortium lending:** A financing arrangement where multiple lenders provide funds to a single borrower, sharing the risk and responsibility of the loan. This is often used for large-scale projects.\n\n* **₹50 crore:**  A significant amount of money in Indian Rupees, approximately equivalent to US$6 million (the exact amount varies slightly depending on the exchange rate).  This threshold is relevant in defining the scope of the Inter-Creditor Agreement.\n"
    },
    {
        "q_num": 73,
        "question_text": "The Chairmen of public sector banks are selected by the",
        "option_a": "Banks Board Bureau",
        "option_b": "Reserve Bank of India",
        "option_c": "Union Ministry of Finance",
        "option_d": "Management of concerned bank",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: The Banks Board Bureau (BBB) is responsible for the selection and appointment of Chairmen of public sector banks in India.  The BBB is an independent body that was set up by the government to improve the governance of public sector banks.  The Reserve Bank of India (RBI) is the central bank of India and regulates the banking sector, but it does not directly select the Chairmen of public sector banks. The Union Ministry of Finance has overall responsibility for the financial sector, but the actual selection is delegated to the BBB. The management of the concerned bank does not have the authority to select its own Chairman.\n\nShort notes on named entities:\n\n* **Banks Board Bureau (BBB):** An independent body established by the Indian government to improve the governance of public sector banks.  Its key function is the selection and appointment of top management, including Chairmen, of these banks.  It aims to enhance professionalism and efficiency in the banking sector.\n\n* **Reserve Bank of India (RBI):** The central bank of India, responsible for regulating the country's financial system.  Its functions include issuing currency, managing foreign exchange reserves, maintaining monetary stability, and supervising banks.  While it plays a crucial role in the banking sector's overall health, it doesn't directly appoint bank Chairmen.\n\n* **Union Ministry of Finance:** The Indian government ministry responsible for the country's financial policy and administration.  It oversees the overall functioning of the banking sector but delegates the selection of Chairmen to the BBB.\n\n* **Public Sector Banks:** Banks owned and controlled by the Indian government.  These banks play a vital role in providing financial services to the public, particularly in rural and underserved areas.  The appointment of their Chairmen is a crucial aspect of their governance.\n"
    },
    {
        "q_num": 74,
        "question_text": "Consider the following statements:\n1. Petroleum and Natural Gas Regulatory Board (PNGRB) is the first regulatory body set up by the Government of India.\n2. One of the tasks of PNGRB is to ensure competitive markets for gas.\n3. Appeals against the decisions of PNGRB go before the Appellate Tribunals for Electricity.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  The Petroleum and Natural Gas Regulatory Board (PNGRB) was not the first regulatory body established by the Government of India.  Many other regulatory bodies existed prior to its formation.\n\nStatement 2 is correct. One of PNGRB's key roles is to promote competitive markets in the petroleum and natural gas sector.\n\nStatement 3 is incorrect.  Appeals against PNGRB decisions do not go to the Appellate Tribunals for Electricity.  The appropriate appellate body would be specified in the PNGRB Act.\n\n\n**Short notes on named entities:**\n\n* **Petroleum and Natural Gas Regulatory Board (PNGRB):** An independent regulatory authority in India responsible for regulating the petroleum and natural gas sector.  Its main functions include promoting competition, ensuring fair pricing, and overseeing the development of infrastructure.\n\n* **Appellate Tribunals for Electricity:**  These tribunals handle appeals related to electricity sector disputes in India.  They are distinct from the appellate bodies for the petroleum and natural gas sector.\n"
    },
    {
        "q_num": 75,
        "question_text": "With reference to communication technologies, what is/are the difference/differences between LTE (Long-Term Evolution) and VoLTE (Voice over Long-Term Evolution)?\n1. LTE is commonly marketed as 3G and VoLTE is commonly marketed as advanced 3G.\n2. LTE is data-only technology and VoLTE is voice-only technology.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation:LTE (Long-Term Evolution) is a standard for wireless communication of high-speed data for mobile phones and other portable devices.  It's a 4G technology, not 3G. VoLTE (Voice over Long-Term Evolution) uses the LTE network to transmit voice calls, instead of the older 2G or 3G networks.  Therefore, statement 1 is incorrect. Statement 2 is also incorrect because LTE can carry both data and voice (via VoLTE), while VoLTE specifically refers to voice calls over the LTE network.  LTE is primarily a data technology, but VoLTE adds voice capabilities.\n"
    },
    {
        "q_num": 76,
        "question_text": "Which of the following statements is/are correct regarding the Maternity Benefit (Amendment) Act, 2017?\n1. Pregnant women are entitled for three months pre-delivery and three months post-delivery paid leave.\n2. Enterprises with crèches must allow the mother minimum six crèche visits daily.\n3. Women with two children get reduced entitlements.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation: Statement 1 is incorrect.  The Maternity Benefit (Amendment) Act, 2017, provides for a minimum of 26 weeks of paid maternity leave (this can be extended depending on the nature of work and other factors), not three months pre-delivery and three months post-delivery.  Statement 2 is also incorrect. While the Act encourages enterprises to provide crèches, it doesn't mandate a specific number of daily visits. Statement 3 is correct. The Act reduces entitlements for women with two or more children.  Therefore, only statement 3 is correct.\n\n**Short notes on important keywords and named entities:**\n\n* **Maternity Benefit (Amendment) Act, 2017:** This Act in India aims to provide paid maternity leave to women employees, promoting maternal health and child welfare.  It mandates a minimum leave period and addresses issues related to workplace conditions for pregnant women.\n\n* **Crèches:** Day-care centers for young children, often provided by workplaces to enable parents, particularly mothers, to balance work and childcare responsibilities.  Their availability is a significant factor in supporting working mothers.\n"
    },
    {
        "q_num": 77,
        "question_text": "Which one of the following is not a sub-index of the World Bank’s Ease of Doing Business Index?",
        "option_a": "Maintenance of law and order",
        "option_b": "Paying taxes",
        "option_c": "Registering property",
        "option_d": "Dealing with construction permits",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: The World Bank’s Ease of Doing Business Index includes sub-indices such as Paying taxes, Registering property, and Dealing with construction permits.  \"Maintenance of law and order\" is not a component of the Ease of Doing Business Index. The Ease of Doing Business Index is a World Bank Group ranking that evaluates the regulatory environment for businesses in various countries. It assesses various aspects of starting and operating a business, covering areas like registering property, paying taxes, enforcing contracts, and dealing with construction permits.  The index aims to identify areas where improvements in regulations could make it easier to do business.\n"
    },
    {
        "q_num": 78,
        "question_text": "In India, 'extended producer responsibility' was introduced as an important feature in which of the following?",
        "option_a": "The Bio-medical Waste (Management and Handling) Rules, 1998",
        "option_b": "The Recycled Plastic (Manufacturing and Usage) Rules, 1999",
        "option_c": "The e-Waste (Management and Handling) Rules, 2011",
        "option_d": "The Food Safety and Standard Regulations, 2011",
        "correct_option": "c",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (c)\n\nexplanation: The e-Waste (Management and Handling) Rules, 2011, introduced Extended Producer Responsibility (EPR) in India.  EPR makes producers responsible for the entire lifecycle of their products, including their end-of-life management.  This is in contrast to the other options:\n\n* **The Bio-medical Waste (Management and Handling) Rules, 1998:** These rules focus on the safe management and handling of bio-medical waste.\n* **The Recycled Plastic (Manufacturing and Usage) Rules, 1999:**  These rules pertain to the manufacturing and usage of recycled plastics.  While they touch upon waste management, EPR as a comprehensive policy framework wasn't introduced here.\n* **The Food Safety and Standard Regulations, 2011:** These regulations concern food safety and standards, not e-waste management.\n\n\n**Short notes on keywords and named entities:**\n\n* **Extended Producer Responsibility (EPR):**  A policy approach where producers are held responsible for the end-of-life management of their products.  It aims to reduce waste and promote environmentally sound recycling and disposal practices.\n\n* **e-Waste:** Discarded electrical and electronic equipment.  It contains hazardous materials that require responsible handling and recycling to prevent environmental and health problems.\n\n* **Bio-medical Waste:** Waste generated from healthcare facilities, including hospitals, clinics, and research labs.  It can be infectious and requires specialized handling and disposal methods.\n\n* **Recycled Plastic:** Plastic that has been processed and reused to create new products.  Recycling helps conserve resources and reduce plastic pollution.\n"
    },
    {
        "q_num": 79,
        "question_text": "The economic cost of food grains to the Food Corporation of India is Minimum Support Price and bonus (if any) paid to the farmers plus",
        "option_a": "transportation cost only",
        "option_b": "interest cost only",
        "option_c": "procurement incidentals and distribution cost",
        "option_d": "procurement incidentals and charges for godowns",
        "correct_option": "c",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation:The economic cost of food grains to the Food Corporation of India (FCI) includes the Minimum Support Price (MSP) and any bonus paid to farmers.  In addition to this, the cost also includes procurement incidentals (expenses related to the purchase and acquisition of grains) and distribution costs (expenses related to moving the grains from procurement points to storage and then to consumers).  Transportation cost is a component of procurement incidentals and distribution cost. Interest cost is not directly included in the immediate cost of procurement.  Charges for godowns are part of storage costs, which are part of the overall distribution cost.\n\nMinimum Support Price (MSP): A price fixed by the government to ensure that farmers receive a minimum price for their produce, protecting them from market fluctuations.\n\nFood Corporation of India (FCI): A statutory body responsible for procuring, storing, transporting, and distributing food grains in India, primarily to maintain food security.  FCI plays a significant role in the Public Distribution System (PDS).\n\nProcurement incidentals:  Expenses incurred during the process of procuring food grains, including transportation to procurement centers, quality inspection, weighing, and initial storage.\n\nDistribution cost: Expenses associated with the movement of food grains from storage to various distribution points, including transportation, handling, and storage at different levels of the supply chain.  This also includes costs associated with maintaining godowns.\n\nNational Food Security Act (NFSA):  A legislation aimed at providing subsidized food grains to a significant portion of the Indian population, with FCI playing a key role in its implementation.\n\nOpen Market Sale Scheme (OMSS): A scheme where FCI sells its surplus food grain stocks in the open market, helping to manage stocks and reduce carrying costs.\n\nPublic Distribution System (PDS): A government-sponsored system for distributing food grains and other essential commodities to the poor and vulnerable sections of the population.\n"
    },
    {
        "q_num": 80,
        "question_text": "In the context of any country, which one of the following would be considered as part of its social capital?",
        "option_a": "The proportion of literates in the population",
        "option_b": "The stock of its buildings, other infrastructure and machines",
        "option_c": "The size of population in the working age group",
        "option_d": "The level of mutual trust and harmony in the society",
        "correct_option": "d",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Social capital refers to the networks of relationships among people who live and work in a particular society, enabling that society to function effectively.  Mutual trust and harmony are key components of strong social networks, facilitating cooperation and collective action.\n\n(a) Literacy rates are an indicator of human capital, related to education and skills.\n(b) Buildings, infrastructure, and machines represent physical capital, essential for economic production.\n(c) The working-age population is a demographic factor influencing labor supply and economic output.\n\nThe provided text contains various economic, demographic, social, and environmental data related to development, poverty, and human development indices (HDI).  However, it does not directly define or elaborate on social capital.  The definitions of poverty, human development, and related concepts are discussed, but not the specific concept of social capital.\n"
    },
    {
        "q_num": 81,
        "question_text": "With reference to the Constitution of India, consider the following statements:\n1. No High Court shall have the jurisdiction to declare any central law to be constitutionally invalid.\n2. An amendment to the Constitution of India cannot be called into question by the Supreme Court of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation:Statement 1 is incorrect. High Courts in India do have the power to declare central laws unconstitutional within their jurisdiction.  Article 226 of the Constitution grants High Courts the power of judicial review, enabling them to examine the constitutional validity of laws.\n\nStatement 2 is also incorrect. While the Supreme Court of India generally cannot question the process of a constitutional amendment,  it can review the *content* of an amendment to determine if it violates the \"basic structure\" doctrine established in the Kesavananda Bharati case (1973).  This doctrine holds that certain fundamental features of the Constitution cannot be altered through amendments.  The Supreme Court's power to do this is a crucial aspect of judicial review in India.\n\n**Short Notes:**\n\n* **Constitution of India:** The supreme law of India, outlining the framework of government, fundamental rights, and directive principles.\n\n* **High Court:**  A state-level court with original and appellate jurisdiction,  part of the Indian judicial system.  Each state has one or more High Courts.\n\n* **Supreme Court of India:** The highest court of appeal in India, having ultimate authority to interpret the Constitution and laws.\n\n* **Judicial Review:** The power of the judiciary to examine the constitutionality of laws and government actions.  A cornerstone of India's constitutional framework.\n\n* **Golak Nath case (1967):** A landmark case that initially limited the Parliament's power to amend fundamental rights.\n\n* **Kesavananda Bharati case (1973):**  A landmark case that established the \"basic structure\" doctrine, limiting the Parliament's amending power.\n\n* **Minerva Mills case (1980):**  Further clarified and strengthened the \"basic structure\" doctrine.\n\n* **99th Constitutional Amendment Act 2014:** An example of a constitutional amendment.  The Supreme Court may review its content for compliance with the basic structure doctrine.\n\n* **Article 13:** Deals with the power of judicial review.\n\n* **Article 32:** Provides a constitutional remedy for the enforcement of fundamental rights.\n\n* **Article 226:** Provides the High Courts with the power of judicial review.\n\n\n"
    },
    {
        "q_num": 82,
        "question_text": "Consider the following statements:\n1. Purchasing Power Parity (PPP) exchange rates are calculated by comparing the prices of the same basket of goods and services in different countries.\n2. In terms of PPP dollars, India is the sixth largest economy in the world.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct. Purchasing Power Parity (PPP) exchange rates are indeed calculated by comparing prices of identical baskets of goods and services across different countries.  This method adjusts for differences in the cost of living between nations, providing a more accurate comparison of economic size than nominal exchange rates.\n\nStatement 2 is also correct.  Based on PPP calculations, India's economy is considered the sixth largest globally.  PPP adjustments account for variations in price levels, giving a more realistic picture of a country's relative economic output and purchasing power.\n\n\nPurchasing Power Parity (PPP): A theory in economics that compares different countries' currencies through a \"basket of goods\" approach. It calculates the value of a currency based on the relative prices of goods and services in different countries, revealing the true purchasing power of each currency.\n\nIndia: A large and diverse country in South Asia, with a rapidly growing economy.  It's a major player in global trade and a significant recipient of foreign direct investment.  Its economy is characterized by a mix of agriculture, industry, and services.\n"
    },
    {
        "q_num": 83,
        "question_text": "With reference to the cultivation of Kharif crops in India in the last five years, consider the following statements:\n1. Area under rice cultivation is the highest.\n2. Area under the cultivation of jowar is more than that of oilseeds.\n3. Area of cotton cultivation is more than that of sugarcane.\n4. Area under sugarcane cultivation has steadily decreased.\nWhich of the statements given above are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation:Based on the provided text, it's difficult to definitively answer which statements are correct regarding the area under cultivation of Kharif crops in India over the last five years.  The document lacks specific quantitative data on the area cultivated for each crop over a five-year period.  However, we can make some inferences:\n\n* **Statement 1:** Rice is a major Kharif crop in India and it's likely that the area under rice cultivation is substantial.  The text supports this. However, without data, we cannot definitively say it's the highest.\n\n* **Statement 2:** Jowar (sorghum) and oilseeds are both Kharif crops.  Again, a comparison requires data which is not provided.\n\n* **Statement 3:** Cotton and sugarcane are both Kharif crops.  Determining which has a larger cultivated area requires data not present in the document.\n\n* **Statement 4:** The document does not provide information on trends in sugarcane cultivation area over the past five years.\n\nTherefore, without the necessary data, none of the statements can be definitively confirmed or refuted. Option (a) is the closest if we assume rice cultivation is the highest, but this is an assumption based on general knowledge of Indian agriculture, not on evidence provided in the document.\n\n\n**Short Notes on Named Entities:**\n\n* **Kharif crops:** Crops sown in the monsoon season (June-September) in India.  Examples include rice, jowar, cotton, sugarcane, and oilseeds.\n\n* **Rice:** A major cereal crop in India, largely cultivated in monsoon-dependent regions. It requires significant water and warm temperatures.\n\n* **Jowar (Sorghum):** A drought-resistant cereal crop grown in various parts of India, particularly in drier regions.\n\n* **Oilseeds:** A group of crops cultivated for their oil-rich seeds.  Examples include groundnuts, mustard, and sesame.\n\n* **Cotton:** A cash crop crucial to India's textile industry, cultivated in regions with warm temperatures and sufficient rainfall.\n\n* **Sugarcane:** A major cash crop used for sugar production, requiring substantial water and warm conditions.  It's often grown in irrigated areas.\n"
    },
    {
        "q_num": 84,
        "question_text": "Among the agricultural commodities imported by India, which one of the following accounts for the highest imports in terms of value in the last five years?",
        "option_a": "Spices",
        "option_b": "Fresh fruits",
        "option_c": "Pulses",
        "option_d": "Vegetable oils",
        "correct_option": "d",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation:Based on the provided text, vegetable oils are the agricultural commodity that accounts for the highest imports in terms of value for India in the last five years.  The text mentions various crops grown in India (rice, wheat, pulses, oilseeds, spices, etc.) but doesn't offer direct import data. However, the emphasis on oilseeds (including palm oil, which is often imported) and the lack of such emphasis on other categories suggests vegetable oils as the most likely answer.\n\nPulses: Pulses are a category of legumes including lentils, beans, and peas, which are important sources of protein in many diets.  India is a major producer and consumer of pulses, but also imports significant quantities to meet domestic demand.\n\nSpices: Spices are aromatic plant products used for flavoring food. India is known for its spice production and exports, but some spices are also imported.\n\nFresh fruits: Fresh fruits are perishable agricultural products with high demand, requiring extensive cold chain infrastructure for handling and transportation. India produces a wide range of fruits but also imports a significant quantity, mostly from neighboring countries.\n\nVegetable oils: Vegetable oils are extracted from various oilseeds and are used widely in cooking and other applications.  India is a large producer of some vegetable oils, but it also imports significant quantities of palm oil and other oils to meet the growing domestic demand.\n"
    },
    {
        "q_num": 85,
        "question_text": "In the context of polity, which one of the following would you accept as the most appropriate definition of liberty?",
        "option_a": "Protection against the tyranny of political rulers",
        "option_b": "Absence of restraint",
        "option_c": "Opportunity to do whatever one likes",
        "option_d": "Opportunity to develop oneself fully",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2019,
        "explanation": "```text\ncorrect_option: (d)\nexplanation: Liberty, in the context of polity, is best defined as the opportunity to develop oneself fully (d).  This encompasses the freedom to pursue one's goals and potential without undue interference from the state, thereby encompassing the essence of protection against tyranny (a). Options (b) and (c) are inadequate as they fail to consider the limits necessary for a functioning society and the importance of social order.\n\nJames Madison, a key figure in the development of the United States' system of government, famously warned against the accumulation of power in the same hands as the definition of tyranny.  His ideas, along with those of Montesquieu (who emphasized the separation of powers) and Aristotle (whose work \"Politics\" is a foundational text in political philosophy), influenced modern conceptions of liberty and limited government.  The Indian Supreme Court's Kesavananda Bharati case (1973) established the \"basic structure\" doctrine, limiting the power of amendments to the Constitution.  The Indra Gandhi v. Raj Narain case (1975) further illustrates the complexities of power dynamics within a democracy.  The concept of a \"Mixed Government\" aims to allocate state functions clearly while implementing checks and balances to prevent overreach.  Judicial restraint, a key principle in maintaining liberty, advocates for judges to limit their role, avoiding law-making where it's not their proper function.\n```\n"
    },
    {
        "q_num": 86,
        "question_text": "Which one of the following is not the most likely measure the Government/RBI takes to stop the slide of Indian rupee?",
        "option_a": "Curbing imports of non-essential goods and promoting exports",
        "option_b": "Encouraging Indian borrowers to issue rupee denominated Masala Bonds",
        "option_c": "Easing conditions relating to external commercial borrowing",
        "option_d": "Following an expansionary monetary policy",
        "correct_option": "d",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (d)\n\nexplanation:The government and the Reserve Bank of India (RBI) employ various measures to stabilize the Indian rupee.  Curbing non-essential imports and boosting exports increases the demand for rupees, strengthening its value.  Encouraging Masala Bonds, rupee-denominated bonds issued by Indian borrowers to overseas investors, brings in foreign currency, supporting the rupee. Easing external commercial borrowing regulations makes it easier for Indian entities to access foreign currency, indirectly supporting the rupee.\n\nHowever, an expansionary monetary policy, which involves increasing the money supply, would likely weaken the rupee.  An expansionary policy lowers interest rates, making the currency less attractive to foreign investors and potentially increasing imports, thus putting downward pressure on the rupee's value.  Therefore, an expansionary monetary policy is the least likely measure to stop the rupee's decline.\n\n\nShort notes on important keywords and named entities:\n\n* **Indian Rupee:** The official currency of India.  Its value fluctuates based on various economic factors, including international trade, foreign investment, and domestic monetary policy.\n\n* **Government/RBI:** The Government of India and the Reserve Bank of India are the primary authorities responsible for managing the country's monetary policy and exchange rate.  They work together to maintain macroeconomic stability.\n\n* **Masala Bonds:** Rupee-denominated bonds issued in international markets by Indian entities. They attract foreign investment and increase the demand for rupees.\n\n* **External Commercial Borrowing:**  Loans raised by Indian entities from foreign lenders.  Government regulations influence the ease of accessing these loans, which affect the supply of foreign currency in the country.\n\n* **Expansionary Monetary Policy:** A policy implemented by the RBI to increase the money supply, typically by lowering interest rates.  This can stimulate economic growth but may also lead to inflation and currency devaluation.\n"
    },
    {
        "q_num": 87,
        "question_text": "Consider the following statements: The Reserve Bank of India's recent directives relating to 'Storage of Payment System Data', popularly known as data diktat, command the payment system providers that\n1. they shall ensure that entire data relating to payment systems operated by them are stored in a system only in India\n2. they shall ensure that the systems are owned and operated by public sector enterprises\n3. they shall submit the consolidated system audit report to the Comptroller and Auditor General of India by the end of the calendar year\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation: Statement 1 is correct.  The Reserve Bank of India (RBI) directive on 'Storage of Payment System Data' mandates that all payment system data must be stored within India.  Statement 2 is incorrect. The directive does not require payment systems to be owned and operated by public sector enterprises. Statement 3 is incorrect; the directive does not mention submission of audit reports to the Comptroller and Auditor General of India (CAG).\n\nReserve Bank of India (RBI):  India's central bank, responsible for monetary policy, regulating banks, and overseeing the payment system.\n\nStorage of Payment System Data: An RBI directive requiring payment system providers to store all transaction data within India, aiming to enhance data security and sovereignty.\n\nPayment system providers:  Entities that facilitate electronic fund transfers, including banks, fintech companies, and other financial institutions involved in payment processing.\n\nComptroller and Auditor General of India (CAG): India's supreme audit institution, responsible for auditing government accounts and ensuring financial accountability.\n"
    },
    {
        "q_num": 88,
        "question_text": "Which of the following adopted a law on data protection and privacy for its citizens known as 'General Data Protection Regulation' in April 2016 and started implementation of it from 25th May, 2018?",
        "option_a": "Australia",
        "option_b": "Canada",
        "option_c": "The European Union",
        "option_d": "The United States of America",
        "correct_option": "c",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation: The European Union adopted the General Data Protection Regulation (GDPR) in April 2016, with implementation starting May 25, 2018.  The GDPR is a regulation in EU law on data protection and privacy for all individual citizens within the European Union (EU).  It addresses the transfer of personal data outside the EU and EEA areas.  Australia, Canada, and the United States have their own data protection laws, but none are called the GDPR.\n"
    },
    {
        "q_num": 89,
        "question_text": "Recently, India signed a deal known as 'Action Plan for Prioritization and Implementation of Cooperation Areas in the Nuclear Field' with which of the following countries?",
        "option_a": "Japan",
        "option_b": "Russia",
        "option_c": "The United Kingdom",
        "option_d": "The United States of America",
        "correct_option": "b",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:The provided text does not contain the answer to this question.  The text mentions India's nuclear cooperation with several countries, including Russia (in the context of the Kundankulam nuclear power plant) and Japan (mentioning a 2019 agreement), but it doesn't specifically state which country the \"Action Plan for Prioritization and Implementation of Cooperation Areas in the Nuclear Field\" was signed with.  More information is needed to answer this question accurately.\n\n\nShort notes on named entities:\n\n* **India:** A large, diverse South Asian country with a significant nuclear program and complex international relations.  It is a major player in global affairs and seeks to increase its influence in various regions.\n\n* **Russia:** A major global power with a long history of cooperation with India, including in the nuclear energy sector.  Russia is a significant supplier of nuclear technology and expertise to India.\n\n* **Japan:** A technologically advanced nation with strong economic ties to India. It has been cooperating with India on various fronts, including in the nuclear energy domain but with some limitations due to Japan's own nuclear policies.\n\n* **United Kingdom:** A major global power with historical ties to India. While the UK has nuclear capabilities, its current nuclear cooperation with India is not explicitly detailed in the provided text.\n\n* **United States of America:** A global superpower with a complex relationship with India.  While the US has cooperated with India on some issues, the specifics of their nuclear cooperation are not detailed in the provided text.  There are historical and ongoing constraints on the full extent of US-India nuclear cooperation.\n\n* **Kundankulam:** A nuclear power plant in India built with Russian collaboration, highlighting the existing nuclear cooperation between the two nations.\n\n"
    },
    {
        "q_num": 90,
        "question_text": "The money multiplier in an economy increases with which one of the following?",
        "option_a": "Increase in the cash reserve ratio",
        "option_b": "Increase in the banking habit of the population",
        "option_c": "Increase in the statutory liquidity ratio",
        "option_d": "Increase in the population of the country",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation: The money multiplier represents the potential of the banking system to create money.  It's inversely related to reserve ratios (CRR and SLR).  An increase in the banking habit of the population means more deposits in banks, increasing the amount banks can lend and thus increasing the money multiplier.  Increases in CRR and SLR reduce the amount banks can lend, decreasing the money multiplier.  Population increase alone doesn't directly affect the money multiplier.\n\nCash Reserve Ratio (CRR): The percentage of a bank's total deposits that it must keep with the central bank (RBI in India).  A higher CRR reduces the amount a bank can lend, thus impacting the money supply.\n\nStatutory Liquidity Ratio (SLR): The percentage of a bank's total deposits that it must maintain in the form of liquid assets like gold, government securities, etc.  A higher SLR similarly reduces lending capacity and money creation.\n"
    },
    {
        "q_num": 91,
        "question_text": "In the context of digital technologies for entertainment, consider the following statements:\n1. In Augmented Reality (AR), a simulated environment is created and the physical world is completely shut out.\n2. In Virtual Reality (VR), images generated from a computer are projected onto real-life objects or surroundings.\n3. AR allows individuals to be present in the world and improves the experience using the camera of smart-phone or PC.\n4. VR closes the world, and transposes an individual, providing complete immersion experience.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 and 4",
        "option_c": "1, 2 and 3",
        "option_d": "4 only",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. Augmented Reality (AR) overlays digital information onto the real world, not creating a completely simulated environment.  Statement 2 is incorrect. Virtual Reality (VR) creates a completely immersive, simulated environment, not projecting images onto real-world objects. Statement 3 is correct. AR enhances the real world by adding digital elements, often using smartphone or PC cameras. Statement 4 is correct. VR creates an immersive experience by blocking out the real world and replacing it with a computer-generated one.\n\nAugmented Reality (AR):  AR technology overlays computer-generated images, sounds, or other sensory information onto a user's view of the real world.  This enhances the user's perception of reality by adding digital elements.\n\nVirtual Reality (VR): VR creates a completely immersive, three-dimensional, computer-generated environment that simulates real or imaginary situations.  The user is typically equipped with a headset and other devices to interact with this virtual world.\n"
    },
    {
        "q_num": 92,
        "question_text": "The word Denisovan' is sometimes mentioned in media in reference to",
        "option_a": "fossils of a kind of dinosaurs",
        "option_b": "an early human species",
        "option_c": "a cave system found in North-East India",
        "option_d": "a geological period in the history of Indian subcontinent",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation: Denisovans were an early human species.  The provided text focuses on the Paleolithic period and early human occupation in India, making this the most relevant answer.  The text mentions the discovery of Paleolithic tools and animal remains, which are relevant to the study of early humans.  There is no mention of dinosaurs, cave systems in Northeast India, or specific geological periods related to the Indian subcontinent in the provided text.\n"
    },
    {
        "q_num": 93,
        "question_text": "With reference to the recent developments in science, which one of the following statements is not correct?",
        "option_a": "Functional chromosomes can be created by joining segments of DNA taken from cells of different species.",
        "option_b": "Pieces of artificial functional DNA can be created in laboratories.",
        "option_c": "A piece of DNA taken out from an animal cell can be made to replicate outside a living cell in a laboratory.",
        "option_d": "Cells taken out from plants and animals can be made to undergo cell division in laboratory petri dishes.",
        "correct_option": "c",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation:The statement \"A piece of DNA taken out from an animal cell can be made to replicate outside a living cell in a laboratory\" is not entirely accurate based on current scientific understanding. While significant advancements have been made in manipulating and replicating DNA segments in vitro (outside a living cell), replicating an entire piece of DNA taken directly from an animal cell, maintaining its complete structure and functionality without the cellular machinery, is currently not possible.  Options (a), (b), and (d) reflect established capabilities in modern biotechnology.\n\nDNA: Deoxyribonucleic acid, the molecule carrying genetic instructions in all living organisms.  It's a double helix structure composed of nucleotides (adenine, guanine, cytosine, and thymine). DNA replication is a complex process involving enzymes and other cellular components within a living cell.\n\nFunctional chromosomes: Chromosomes are thread-like structures in cells carrying genetic information.  Functional chromosomes are capable of carrying out their normal functions, such as gene expression and cell division. Creating functional chromosomes by joining DNA segments from different species involves sophisticated genetic engineering techniques.\n\nArtificial functional DNA:  Synthetic DNA molecules created in a lab setting to perform specific functions.  These can be designed to encode proteins, regulate gene expression, or other biological processes. This is a cornerstone of synthetic biology.\n\nGenome editing: Techniques used to modify an organism's genome, including adding, deleting, or altering DNA sequences.  CRISPR-Cas9 is a prominent example.  Genome editing holds immense potential in medicine and agriculture.\n\nCell division: The process by which a single cell divides into two or more daughter cells.  In vitro cell culture allows scientists to grow and maintain cells from plants and animals in controlled laboratory environments, enabling them to study cell growth and behavior.\n"
    },
    {
        "q_num": 94,
        "question_text": "Consider the following statements: A digital signature is\n1. an electronic record that identifies the certifying authority issuing it\n2. used to serve as a proof of identity of an individual to access information or server on Internet\n3. an electronic method of signing an electronic document and ensuring that the original content is unchanged\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2019,
        "explanation": "correct_option: (c)\nexplanation: A digital signature is an electronic method of signing an electronic document and ensuring that the original content is unchanged.  Statement 1 is incorrect because a digital signature primarily verifies the authenticity of the signer, not the certifying authority itself.  While a digital signature can be used as proof of identity (statement 2), its core function is described in statement 3.  Therefore, only statement 3 is entirely correct.\n\nA digital signature uses cryptography to create a unique digital code that is attached to an electronic document. This code is mathematically linked to the signer's identity and the document's content.  Any alteration to the document will invalidate the signature.  Digital signatures are widely used to ensure data integrity and authenticity in online transactions and communication.\n"
    },
    {
        "q_num": 95,
        "question_text": "In the context of wearable technology, which of the following tasks is/are accomplished by wearable devices?\n1. Location identification of a person\n2. Sleep monitoring of a person\n3. Assisting the hearing impaired person\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (d)\nexplanation: Wearable devices are capable of performing all three tasks listed.  Location identification is achieved through GPS or other location tracking technologies integrated into the device. Sleep monitoring involves sensors that track sleep patterns, heart rate, and other relevant metrics.  Wearable devices can also assist the hearing impaired through features like hearing amplification or real-time transcription of conversations.  Therefore, options 1, 2, and 3 are all correct.\n\nWearable technology:  Refers to electronic devices worn on the body, often incorporating sensors and communication capabilities.  Examples include smartwatches, fitness trackers, and hearing aids.\n\nLocation identification: The process of determining the geographic location of a person or object, often using GPS technology.\n\nSleep monitoring: The process of tracking and analyzing various aspects of sleep, such as sleep stages, duration, and heart rate variability.\n\nAssisting the hearing impaired:  Refers to technologies and methods used to improve the hearing and communication abilities of individuals with hearing loss.\n"
    },
    {
        "q_num": 96,
        "question_text": "'RNA interference (RNAi)' technology has gained popularity in the last few years. Why?\n1. It is used in developing gene silencing therapies.\n2. It can be used in developing therapies for the treatment of cancer.\n3. It can be used to develop hormone replacement therapies.\n4. It can be used to produce crop plants that are resistant to viral pathogens.\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 4",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "1 and 4 only",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2019,
        "explanation": "correct_option: (a)\n\nexplanation: RNA interference (RNAi) technology's recent popularity stems from its applications in gene silencing therapies and the development of treatments for various diseases, including cancer.  It also plays a significant role in creating crop plants resistant to viral pathogens.  Hormone replacement therapies are not directly related to RNAi.\n\nRNA interference (RNAi): A natural process in cells where small RNA molecules (e.g., microRNAs, siRNAs) bind to messenger RNA (mRNA) molecules, preventing them from producing proteins.  This gene silencing mechanism is harnessed in biotechnology.\n\nGene silencing therapies:  Therapeutic approaches aimed at reducing or eliminating the expression of specific genes involved in disease development. RNAi is a key technology for achieving this.\n\nCancer therapies: RNAi can target genes crucial for cancer cell growth and survival, leading to potential cancer treatments.\n\nCrop plants resistant to viral pathogens:  RNAi can be used to engineer plants to resist viral infections by silencing viral genes.  This represents a significant advancement in agriculture.\n\nHormone replacement therapies:  Treatments that replace missing or deficient hormones in the body.  These therapies are not directly related to RNAi technology.\n"
    },
    {
        "q_num": 97,
        "question_text": "Recently, scientists observed the merger of giant 'blackholes' billions of light-years away from the Earth. What is the significance of this observation?",
        "option_a": "Higgs boson particles' were detected.",
        "option_b": "'Gravitational waves' were detected.",
        "option_c": "Possibility of inter-galactic space travel through 'wormhole' was confirmed.",
        "option_d": "It enabled the scientists to understand 'singularity'.",
        "correct_option": "b",
        "subject": "geography",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:The merger of giant black holes billions of light-years away from Earth is significant because it resulted in the detection of gravitational waves.  \n\nGravitational waves are ripples in spacetime predicted by Einstein's theory of general relativity. They are produced by some of the most violent and energetic processes in the universe, such as the merger of black holes. The detection of these waves confirms a key prediction of general relativity and provides valuable information about the properties of black holes and the universe's evolution.\n\nBlack holes are regions of spacetime with extreme gravity, from which nothing, not even light, can escape.  A singularity is a point of infinite density at the center of a black hole, a concept that is still not fully understood.  Higgs boson particles are elementary particles associated with the Higgs field, which gives mass to other particles. A wormhole is a hypothetical tunnel through spacetime that could connect distant points in the universe, but its existence has not been confirmed.\n"
    },
    {
        "q_num": 98,
        "question_text": "Which of the following are the reasons for the occurrence of multi-drug resistance in microbial pathogens in India?\n1. Genetic predisposition of some people\n2. Taking incorrect doses of antibiotics to cure diseases\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "2 and 3 only",
        "option_c": "1, 3 and 4",
        "option_d": "2, 3 and 4",
        "correct_option": "b",
        "subject": "economy",
        "year": 2019,
        "explanation": "correct_option: (b)\n\nexplanation:The provided text highlights several reasons for the occurrence of multi-drug resistance in microbial pathogens.  Genetic predisposition of individuals (option 1) is not directly mentioned as a primary cause of antibiotic resistance in the provided text. However, the injudicious use of antibiotics (option 2), including incorrect dosages and incomplete treatment courses, is explicitly stated as a major contributor.  Other factors like antibiotic use in food animals and poor infection control practices in healthcare settings are also mentioned. Therefore, option (b) is correct.\n\n* **Multi-drug resistance:**  The ability of a microorganism to resist the effects of multiple antimicrobial drugs. This is a significant public health concern, leading to treatment failures and increased mortality.\n\n* **Microbial pathogens:**  Microorganisms (bacteria, viruses, fungi, etc.) that can cause disease in humans or animals.\n\n* **Antibiotics:**  Medicines that inhibit the growth of or destroy bacteria. Overuse and misuse contribute significantly to antibiotic resistance.\n\n* **Injudicious use of antibiotics:** The improper use of antibiotics, including using them for viral infections, taking incorrect dosages, or not completing the prescribed course.  This is a major driver of antibiotic resistance.\n\n* **Infection control practices:**  Procedures and protocols designed to prevent the spread of infections in healthcare settings.  Poor infection control can facilitate the spread of antibiotic-resistant pathogens.\n\n* **Superbugs:** A term for bacteria that have become resistant to multiple antibiotics, making infections difficult to treat.\n"
    },
    {
        "q_num": 99,
        "question_text": "What is Cas9 protein that is often mentioned in news?",
        "option_a": "A molecular scissors used in targeted gene editing",
        "option_b": "A biosensor used in the accurate detection of pathogens in patients",
        "option_c": "A gene that makes plants pest-resistant",
        "option_d": "A herbicidal substance synthesized in genetically modified crops",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2019,
        "explanation": "correct_option: (a)\nexplanation: Cas9 protein is a crucial component of the CRISPR-Cas9 gene editing system.  It acts as a molecular scissor, capable of cutting DNA at specific locations guided by a short RNA sequence. This allows for precise modifications to an organism's genome, including adding, removing, or altering genes.  Other options are incorrect; they describe unrelated technologies or entities.\n\nZFNs and TALENs are also types of engineered nucleases used for gene editing, but CRISPR-Cas9 is more prevalent due to its simplicity and efficiency.  CRISPR stands for Clustered Regularly Interspaced Short Palindromic Repeats.  Gene editing has applications in research, therapeutics (e.g., treating leukemia and AIDS), and biotechnology (e.g., genetically modifying crops and livestock).  Genome editing also raises ethical concerns regarding germline editing and potential loss of gene diversity.  Gene drives are systems that can spread desired genetic alterations through populations, unlike the self-limiting pgSIT system.  GMOs are organisms with altered genetic material, often used in agriculture.  CAR-T therapy involves gene editing of immune cells to target cancer cells.  Nucleic acid vaccines utilize genetic material (DNA or RNA) to trigger an immune response.  The \"dark genome\" refers to non-coding DNA sequences that may have functional roles, while \"Borg DNA\" is a newly discovered DNA structure capable of assimilating genes from the environment.\n"
    },
    {
        "q_num": 100,
        "question_text": "Which one of the following statements is not correct?",
        "option_a": "Hepatitis B virus is transmitted much like HIV.",
        "option_b": "Hepatitis B, unlike Hepatitis C, does not have a vaccine.",
        "option_c": "Globally, the number of people infected with Hepatitis B and C viruses are several times more than those infected with HIV.",
        "option_d": "Some of those infected with Hepatitis B and C viruses do not show the symptoms for many years.",
        "correct_option": "b",
        "subject": "polity",
        "year": 2019,
        "explanation": "correct_option: (b)\nexplanation: Hepatitis B *does* have a vaccine.  This statement is incorrect.\n\nHepatitis B virus: A virus that causes inflammation of the liver. It's transmitted through contact with infected blood or body fluids, similar to HIV, making statement (a) correct.  A vaccine exists for Hepatitis B, making (b) incorrect. Hepatitis B and C infections globally significantly outnumber HIV infections, making (c) correct.  Both Hepatitis B and C can have long asymptomatic periods, making (d) correct.\n"
    }
]