[
    {
        "Q.No.": 1,
        "question_text": "What are the significances of a practical approach to sugarcane production known as ‘Sustainable Sugarcane Initiative’?\n1. Seed cost is very low in this compared to the conventional method of cultivation.\n2. Drip irrigation can be practiced very effectively in this.\n3. There is no application of chemical/inorganic fertilizers at all in this.\n4. The scope for intercropping is more in this compared to the conventional method of cultivation.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 3 only",
        "option_b": "1, 2 and 4 only",
        "option_c": "2, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:The Sustainable Sugarcane Initiative focuses on environmentally friendly and economically sustainable practices.  Let's analyze the statements:\n\n1. **Seed cost:** While the provided text doesn't directly address seed costs in the initiative, it's plausible that using methods like intercropping or promoting specific varieties could indirectly lower seed costs compared to conventional methods. However, this isn't definitively stated.\n\n2. **Drip irrigation:** Drip irrigation is highly efficient in water usage, a key element of sustainability.  The initiative likely promotes water-efficient methods like drip irrigation.\n\n3. **Chemical fertilizers:** The absence of chemical/inorganic fertilizers is a core principle of sustainable agriculture, minimizing environmental damage and promoting soil health. This aligns perfectly with the initiative's goals.\n\n4. **Intercropping:** Intercropping increases biodiversity and can improve soil health and reduce pest pressure, which are all sustainable practices. The initiative's emphasis on sustainability makes this highly likely.\n\nTherefore, statements 2, 3, and 4 strongly align with the principles of a sustainable sugarcane initiative.  Statement 1 is plausible but not definitively supported by the provided information.\n\n**Short notes on keywords and named entities:**\n\n* **Sustainable Sugarcane Initiative:** An agricultural approach focusing on environmentally friendly and economically viable sugarcane production, emphasizing practices like reduced chemical input, efficient water use, and biodiversity.\n\n* **Drip irrigation:** A water-efficient irrigation method delivering water directly to plant roots, minimizing water waste and improving water use efficiency compared to traditional methods.\n\n* **Intercropping:**  A farming practice where two or more crops are grown simultaneously on the same land, enhancing biodiversity, soil health, and potentially reducing pest and weed issues.  It also optimizes resource utilization.\n\n* **Chemical/Inorganic fertilizers:**  Synthetic fertilizers made from minerals or chemicals, providing nutrients to plants but potentially causing environmental harm through water pollution and soil degradation if used improperly.  Sustainable agriculture seeks to reduce or eliminate dependence on these.\n"
    },
    {
        "Q.No.": 2,
        "question_text": "If a wetland of international importance is brought under the ‘Montreux Record’, what does it imply?",
        "option_a": "Changes in ecological character have occurred, are occurring or are likely to occur in the wetland as a result of human interference",
        "option_b": "The country in which the wetland is located should enact a law to prohibit any human activity within five kilometres from the edge of the wetland",
        "option_c": "The survival of the wetland depends on the cultural practices and traditions of certain communities living in its vicinity and therefore the cultural diversity therein should not be destroyed",
        "option_d": "It is given the status of ‘World Heritage Site’",
        "correct_option": "a",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation: The Montreux Record is a register of wetland sites on the List of Wetlands of International Importance (the Ramsar List) where changes in ecological character have occurred, are occurring, or are likely to occur as a result of human interference.  Option (a) directly reflects this definition.  The other options are not associated with the Montreux Record.  The Ramsar Convention is an intergovernmental treaty established in 1971 by UNESCO for the conservation and sustainable use of wetlands.  Wetlands are areas where water covers the soil, or is present either at or near the surface of the soil all year or for varying periods of time during the year, including during the growing season.  Human interference can negatively impact wetlands through activities such as pollution, drainage, and unsustainable development.\n"
    },
    {
        "Q.No.": 3,
        "question_text": "Which one of the following pairs of islands is separated from each other by the “Ten Degree Channel”?",
        "option_a": "Andaman and Nicobar",
        "option_b": "Nicobar and Sumatra",
        "option_c": "Maldives and Lakshadweep",
        "option_d": "Sumatra and Java",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: The Ten Degree Channel separates the Nicobar Islands from Sumatra.\n\nAndaman and Nicobar Islands:  A group of islands in the Bay of Bengal, part of India.  They are known for their biodiversity and unique indigenous cultures.\n\nNicobar Islands: The southernmost part of the Andaman and Nicobar archipelago, characterized by tropical rainforests and beaches.\n\nSumatra:  A large Indonesian island, known for its rich biodiversity, including orangutans and tigers, and its diverse cultures.\n\nMaldives:  An island nation in the Indian Ocean, famous for its beautiful beaches, coral reefs, and luxury resorts.\n\nLakshadweep:  A group of islands in the Arabian Sea, part of India, known for their coral reefs and lagoons.\n\nJava: An Indonesian island, one of the most densely populated islands in the world, known for its volcanic mountains and rich cultural history.\n"
    },
    {
        "Q.No.": 4,
        "question_text": "Consider the following pairs:\n   Programme/Project                                              Ministry\n1. Drought-Prone Area Programme                                 : Ministry of Agriculture\n2. Desert Development Programme                                 : Ministry of Environment and Forests\n3. National Watershed Development Project for Rainfed Areas     : Ministry of Rural Development\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: Only the National Watershed Development Project for Rainfed Areas is correctly matched with the Ministry of Rural Development.  The Drought-Prone Area Programme falls under the Ministry of Rural Development, not the Ministry of Agriculture. The Desert Development Programme is administered by the Ministry of Rural Development, not the Ministry of Environment and Forests.\n\n* **Drought-Prone Area Programme:** Aimed at mitigating the effects of drought in vulnerable areas, focusing on water conservation, sustainable agriculture, and rural development.  It involves various interventions to improve livelihoods and resilience in drought-prone regions.\n\n* **Desert Development Programme:**  Concentrates on the development of desert and arid regions, promoting sustainable land management practices, water resource development, and socio-economic upliftment of communities residing in these areas.\n\n* **National Watershed Development Project for Rainfed Areas:**  Focuses on improving water management and soil conservation in rainfed areas to enhance agricultural productivity and rural livelihoods.  It involves the development of water harvesting structures, soil and water conservation measures, and promoting sustainable agricultural practices.\n\n* **Ministry of Agriculture:** The Indian government ministry responsible for agricultural policies, research, and development.\n\n* **Ministry of Rural Development:** The Indian government ministry focusing on rural infrastructure, poverty alleviation, and rural development programs.\n\n* **Ministry of Environment and Forests:** The Indian government ministry responsible for environmental protection, forest conservation, and related policies.\n"
    },
    {
        "Q.No.": 5,
        "question_text": "With reference to Bombay Natural History Society (BNHS), consider the following statements:\n1. It is an autonomous organization under the Ministry of Environment and Forests.\n2. It strives to conserve nature through action-based research, education and public awareness.\n3. It organizes and conducts nature trails and camps for the general public.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:The Bombay Natural History Society (BNHS) is not an autonomous organization under the Ministry of Environment and Forests.  It is an independent, non-governmental organization.  However, it does strive to conserve nature through action-based research, education, and public awareness.  It also organizes and conducts nature trails and camps for the general public. Therefore, statements 2 and 3 are correct.\n\nBombay Natural History Society (BNHS):  A leading non-governmental organization in India dedicated to the study, conservation, and promotion of natural history.  It conducts research, education, and advocacy programs focusing on biodiversity conservation.  It plays a significant role in influencing policy and raising public awareness about environmental issues.\n"
    },
    {
        "Q.No.": 6,
        "question_text": "With reference to 'Global Environment Facility', which of the following statements is/are correct?",
        "option_a": "It serves as financial mechanism for 'Convention on Biological Diversity' and United Nations Framework Convention on Climate Change",
        "option_b": "It undertakes scientific research on environmental issues at global level",
        "option_c": "It is an agency under OECD to facilitate the transfer of technology and funds to underdeveloped countries with specific aim to protect their environment",
        "option_d": "Both (a) and (b)",
        "correct_option": "a",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: The Global Environment Facility (GEF) serves as a financial mechanism for several conventions, including the Convention on Biological Diversity (CBD) and the United Nations Framework Convention on Climate Change (UNFCCC).  Therefore, statement (a) is correct.  The GEF does not directly undertake scientific research; it funds projects related to environmental issues. Thus, (b) is incorrect. The GEF is not an agency under the Organisation for Economic Co-operation and Development (OECD); it's an independent international organization.  Therefore, (c) is incorrect.  Since only statement (a) is correct, option (d) is also incorrect.\n\n\nConvention on Biological Diversity (CBD): An international treaty adopted in 1992 with the aim of conserving biological diversity, using its components sustainably, and fairly and equitably sharing the benefits arising from genetic resources.  It has three main goals: conservation, sustainable use, and benefit-sharing.\n\nUnited Nations Framework Convention on Climate Change (UNFCCC): An international environmental treaty adopted in 1992 to combat climate change by stabilizing greenhouse gas concentrations in the atmosphere.  It operates through a system of Conferences of the Parties (COPs) and Nationally Determined Contributions (NDCs).\n\nOrganisation for Economic Co-operation and Development (OECD): An intergovernmental economic organization with 38 member countries, focusing on economic and social policy.  It promotes policies to improve economic and social well-being.\n"
    },
    {
        "Q.No.": 7,
        "question_text": "With reference to technologies for solar power production, consider the following statements:\n1. 'Photovoltaics' is a technology that generates electricity by direct conversion of light into electricity, while 'Solar Thermal' is a technology that utilizes the Sun's rays to generate heat which is further used in electricity generation process.\n2. Photovoltaics generates Alternating Current (AC), while Solar Thermal generates Direct Current (DC).\n3. India has manufacturing base for Solar Thermal technology, but not for Photovoltaics.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct. Photovoltaics (PV) directly converts sunlight into electricity using semiconductor materials, while solar thermal systems use sunlight to heat a fluid, which then drives a turbine to generate electricity.\n\nStatement 2 is incorrect. Photovoltaics generate Direct Current (DC), which is often converted to Alternating Current (AC) for use in homes and businesses. Solar thermal systems generate steam, which rotates a turbine that produces AC electricity.\n\nStatement 3 is incorrect.  India has a growing manufacturing base for both photovoltaic and solar thermal technologies, although the PV sector is significantly larger.\n\n\n**Short Notes:**\n\n**Photovoltaics (PV):** A technology that directly converts sunlight into electricity using the photovoltaic effect in semiconductor materials like silicon.  PV systems are widely used for residential, commercial, and utility-scale power generation.  They offer a clean and sustainable energy source.\n\n**Solar Thermal:** A technology that uses sunlight to heat a fluid (e.g., water or oil), which is then used to generate electricity via a heat engine or for direct thermal applications.  Concentrated solar power (CSP) is a common type of solar thermal technology.\n\n**Alternating Current (AC):** The type of electrical current that periodically reverses direction, commonly used in power grids.\n\n**Direct Current (DC):** The type of electrical current that flows in one direction, commonly produced by photovoltaic cells.\n\n**India's Solar Energy Sector:** India is a major player in the global solar energy market, with significant investments in both PV and solar thermal technologies.  National Solar Mission aims to increase solar energy capacity substantially.  Challenges include dependence on imports and developing domestic manufacturing capabilities.  Various schemes and policies like the Solar Park scheme aim to boost domestic manufacturing and deployment.  The International Solar Alliance (ISA) is headquartered in India and promotes the use of solar energy globally.  Projects like the Bhadla Solar Park and Rewa solar power park showcase large-scale solar power projects in India.\n"
    },
    {
        "Q.No.": 8,
        "question_text": "Consider the following languages:\n1. Gujarati\n2. Kannada\n3. Telugu\nWhich of the above has/have been declared as 'Classical Language/Languages' by the Government?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (c)\n\nexplanation: Telugu and Kannada have been declared as classical languages by the Government of India.  Gujarati is not yet declared a classical language.\n\nGujarati: A major Indo-Aryan language spoken primarily in the Indian state of Gujarat.  It has a rich literary tradition and a distinct script.\n\nKannada: A Dravidian language spoken predominantly in the Indian state of Karnataka. It boasts a long history and a significant contribution to South Indian literature and culture.  It was declared a classical language in 2008.\n\nTelugu: A Dravidian language spoken mainly in the Indian states of Andhra Pradesh and Telangana.  It is known for its rich literary heritage and was declared a classical language in 2008.\n"
    },
    {
        "Q.No.": 9,
        "question_text": "Consider the following pairs :\n1. Dampa Tiger Reserve : Mizoram\n2. Gumti Wildlife Sanctuary : Sikkim\n3. Saramati Peak : Nagaland\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (c)\n\nexplanation: Dampa Tiger Reserve is located in Mizoram, Saramati Peak is the highest peak in Nagaland.  Gumti Wildlife Sanctuary is located in Tripura, not Sikkim. Therefore, only pairs 1 and 3 are correctly matched.\n\n\nDampa Tiger Reserve: A tiger reserve in Mizoram, known for its diverse flora and fauna, including tigers, elephants, and various bird species.  It's a significant area for biodiversity conservation in Northeast India.\n\nGumti Wildlife Sanctuary: A wildlife sanctuary located in Tripura, known for its diverse wildlife, including elephants, tigers, and various bird species.  It is significant for the conservation of endangered species.\n\nSaramati Peak: The highest peak in Nagaland, located on the border with Myanmar.  It's a significant geographical feature of the region and offers challenging trekking opportunities.\n"
    },
    {
        "Q.No.": 10,
        "question_text": "With reference to a conservation organization called ‘Wetlands International’, which of the following statements is/are correct?\n1. It is an intergovernmental organization formed by the countries which are signatories to Ramsar Convention.\n2. It works at the field level to develop and mobilize knowledge, and use the practical experience to advocate for better policies.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: Wetlands International is not an intergovernmental organization formed by the countries which are signatories to the Ramsar Convention.  It is an independent non-governmental organization (NGO) working to sustain and restore wetlands and their resources for people and biodiversity.  Statement 2 is correct; Wetlands International works at the field level, developing and mobilizing knowledge and using practical experience to advocate for better policies related to wetland conservation.\n\nRamsar Convention: The Convention on Wetlands, also known as the Ramsar Convention, is an intergovernmental treaty that provides the framework for national action and international cooperation for the conservation and wise use of wetlands and their resources.\n\nWetlands International:  A global not-for-profit organization dedicated to the conservation and restoration of wetlands.  It works in many countries on a wide range of wetland-related projects, from research and advocacy to practical conservation on the ground.\n"
    },
    {
        "Q.No.": 11,
        "question_text": "With reference to a grouping of countries known as BRICS, consider the following statements :\n1. The First Summit of BRICS was held in Rio de Janeiro in 2009.\n2. South Africa was the last to join the BRICS grouping.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The first BRICS summit was held in Yekaterinburg, Russia in 2009. Statement 2 is correct. South Africa joined BRICS in 2010, making it the last member to join the original group.\n\nBRICS: BRICS is an acronym for the grouping of five major emerging economies: Brazil, Russia, India, China, and South Africa.  These countries represent a significant portion of the global population, economy, and trade.  They cooperate on various issues, including economic development, security, and cultural exchange.  They have established institutions like the New Development Bank and the Contingent Reserve Arrangement to further their economic cooperation.\n\nRio de Janeiro: Rio de Janeiro is a city in Brazil, known for its iconic Christ the Redeemer statue, beaches, and vibrant culture.  It is a major center for tourism and commerce in South America.\n\nSouth Africa: South Africa is a country located at the southern tip of the African continent, known for its diverse landscapes, wildlife, and rich history. It is a significant player in the African economy and has a diverse population.\n"
    },
    {
        "Q.No.": 12,
        "question_text": "Consider the following diseases :\n1. Diphtheria\n2. Chickenpox\n3. Smallpox\nWhich of the above diseases has/have been eradicated in India?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: Smallpox has been eradicated in India.  While Diphtheria and Chickenpox are controlled through vaccination programs, they haven't been completely eradicated.\n\nDiphtheria: A serious bacterial infection that affects the nose, throat, and sometimes the skin. It's preventable through vaccination (DTaP vaccine).\n\nChickenpox: A highly contagious viral infection causing a characteristic itchy rash.  A vaccine (Varicella vaccine) is highly effective in preventing it.\n\nSmallpox: A deadly viral disease that caused widespread epidemics throughout history.  A global vaccination campaign led to its eradication, declared by the WHO in 1980.  India played a significant role in this global effort.\n"
    },
    {
        "Q.No.": 13,
        "question_text": "Which of the following phenomena might have influenced the evolution of organisms?\n1. Continental drift\n2. Glacial cycles\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:Both continental drift and glacial cycles have significantly influenced the evolution of organisms.\n\nContinental drift:  The movement of continents over geological time has resulted in the separation and isolation of populations, leading to allopatric speciation (the formation of new and distinct species resulting from an ancestral population's geographical isolation).  Changes in climate and habitat due to continental positions also drive evolutionary pressures.\n\nGlacial cycles:  Periods of glaciation and interglacial periods cause dramatic shifts in climate, sea levels, and available habitats. These changes act as selective pressures, favoring organisms with adaptations suitable for colder or warmer conditions, leading to diversification and extinction events.  The expansion and contraction of ice sheets also alter geographical distribution and create new ecological niches.\n"
    },
    {
        "Q.No.": 14,
        "question_text": "Other than poaching, what are the possible reasons for the decline in the population of Ganges River Dolphins?\n1. Construction of dams and barrages on rivers\n2. Increase in the population of crocodiles in rivers\n3. Getting trapped in fishing nets accidentally\n4. Use of synthetic fertilizers and other agricultural chemicals in crop-fields in the vicinity of rivers\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:  Besides poaching, several factors contribute to the decline of Ganges River Dolphins.  Construction of dams and barrages alters the river's flow and habitat, impacting dolphin navigation and survival.  Accidental entanglement in fishing nets causes significant mortality.  Finally, the use of synthetic fertilizers and agricultural chemicals leads to water pollution, harming the dolphins and their prey.  Increased crocodile populations might also increase predation, but this is less significant than the other factors.  Therefore, options 1, 3, and 4 are correct.\n\n\nGanges River Dolphins:  These freshwater dolphins are found in the Ganges-Brahmaputra-Meghna and Karnaphuli-Sangu river systems. They are highly sensitive to habitat changes and pollution.  Their declining population is a serious conservation concern.\n\nDams and barrages:  These structures alter river flow, creating obstacles for dolphins and fragmenting their habitat, reducing food availability and increasing vulnerability.\n\nFishing nets:  Ganges River Dolphins can become unintentionally entangled in fishing nets, leading to drowning or injury. This is a major cause of mortality.\n\nSynthetic fertilizers and agricultural chemicals: Runoff from agricultural fields contaminates rivers with pollutants, which directly harm dolphins and disrupt the aquatic ecosystem.  This impacts food sources and overall health.\n"
    },
    {
        "Q.No.": 15,
        "question_text": "The Radcliffe Committee was appointed to",
        "option_a": "solve the problem of minorities in India",
        "option_b": "give effect to the Independence Bill",
        "option_c": "delimit the boundaries between India and Pakistan",
        "option_d": "enquire into the riots in East Bengal",
        "correct_option": "c",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: The Radcliffe Committee was appointed to delimit the boundaries between India and Pakistan after the partition of India in 1947.  Sir Cyril Radcliffe headed this committee, which faced a challenging task given the complex religious demographics and existing infrastructure. The committee's work was crucial in determining the border between the newly formed nations, though its decisions were controversial and led to significant displacement and violence.\n\n**Short Notes:**\n\n* **Radcliffe Committee:**  A boundary demarcation commission appointed to divide British India into India and Pakistan.  Its hastily drawn boundaries resulted in widespread displacement and communal violence.\n\n* **India and Pakistan:** Two sovereign nations created from the partition of British India in 1947. The partition led to mass migration and communal conflict.\n\n* **Partition of India:** The division of British India into India and Pakistan in 1947, resulting in the displacement of millions and widespread communal violence.\n\n* **Minority problem in India:** Refers to the challenges faced by religious and ethnic minorities in India, particularly during and after the partition.  Issues include discrimination, violence, and political representation.\n\n* **Independence Bill:** The legislation passed by the British Parliament granting independence to India and Pakistan. It established the process for the transfer of power.\n\n* **Riots in East Bengal:** Refers to the widespread communal violence that occurred in the eastern region of Bengal (now Bangladesh) during and after the partition of India.\n"
    },
    {
        "Q.No.": 16,
        "question_text": "Brominated flame retardants are used in many household products like mattresses and upholstery. Why is there some concern about their use?\n1. They are highly resistant to degradation in the environment.\n2. They are able to accumulate in humans and animals.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: Brominated flame retardants are indeed concerning due to two main reasons:  Their persistence in the environment (meaning they don't break down easily) and their ability to accumulate in the bodies of humans and animals (bioaccumulation).  This bioaccumulation can lead to potential health problems.  Therefore, both statements 1 and 2 correctly describe concerns surrounding the use of these chemicals.\n\nBrominated flame retardants:  These are chemicals added to materials to slow or prevent the spread of fire.  However, many are persistent organic pollutants (POPs), meaning they remain in the environment for extended periods.\n\nBioaccumulation: The process by which substances build up in the tissues of living organisms over time.  This is particularly concerning with substances that don't readily break down.\n"
    },
    {
        "Q.No.": 17,
        "question_text": "Consider the following:\n1. Bats\n2. Bears\n3. Rodents\nThe phenomenon of hibernation can be observed in which of the above kinds of animals?",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1, 2 and 3",
        "option_d": "Hibernation cannot be observed in any of the above",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: Bats, bears, and rodents are all capable of hibernation, although not all species within each group hibernate.  Bears undergo a form of hibernation, but it is less profound than true hibernation seen in bats and some rodents.  True hibernation is characterized by a significant drop in body temperature and metabolic rate.  Bears maintain a relatively higher body temperature and can easily be aroused.  Many rodent species, such as ground squirrels and hamsters, exhibit true hibernation, while others do not. Bats are well-known for their hibernation behavior, with many species entering deep torpor during winter months.\n"
    },
    {
        "Q.No.": 18,
        "question_text": "Which one of the following is the largest Committee of the Parliament?",
        "option_a": "The Committee on Public Accounts",
        "option_b": "The Committee on Estimates",
        "option_c": "The Committee on Public Undertakings",
        "option_d": "The Committee on Petitions",
        "correct_option": "b",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:The provided text indicates that the Committee on Estimates examines the estimates included in the budget and suggests economies in public expenditure. While the exact sizes of the committees aren't explicitly stated,  the context strongly suggests the Committee on Estimates is the largest due to its significant role in scrutinizing the budget, a massive undertaking requiring numerous members.\n\nThe Committee on Public Accounts (PAC) examines the audit reports of the Comptroller and Auditor General of India.  The Committee on Public Undertakings examines the working of public undertakings. The Committee on Petitions examines petitions received by Parliament.  All these committees play important roles, but their scope is narrower than that of the Committee on Estimates.\n"
    },
    {
        "Q.No.": 19,
        "question_text": "Which of the following adds/add carbon dioxide to the carbon cycle on the planet Earth?\n1. Volcanic action\n2. Respiration\n3. Photosynthesis\n4. Decay of organic matter\nSelect the correct answer using the code given below.",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "1, 2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:Volcanic action releases carbon dioxide trapped within the Earth's interior. Respiration, the process by which organisms release energy from organic molecules, produces carbon dioxide as a byproduct. Decay of organic matter involves the breakdown of dead plants and animals, releasing carbon dioxide back into the atmosphere. Photosynthesis, however, consumes carbon dioxide and converts it into organic matter.  Therefore, only volcanic action, respiration, and decay of organic matter add carbon dioxide to the carbon cycle.\n\nVolcanic action:  Volcanoes release various gases, including significant amounts of carbon dioxide, from the Earth's mantle. This is a natural process that has contributed to atmospheric CO2 levels throughout Earth's history.\n\nRespiration:  All living organisms, from plants and animals to microorganisms, respire.  Respiration is the process of breaking down organic molecules (like sugars) to release energy.  Carbon dioxide is a waste product of this process and is released into the atmosphere.\n\nPhotosynthesis: Plants and other photosynthetic organisms use sunlight, water, and carbon dioxide to produce glucose (a sugar) and oxygen.  This process removes carbon dioxide from the atmosphere and incorporates it into organic molecules.\n\nDecay of organic matter: When organisms die, their organic matter is broken down by decomposers (bacteria and fungi).  This decomposition process releases carbon dioxide back into the atmosphere and the soil.\n"
    },
    {
        "Q.No.": 20,
        "question_text": "If you walk through countryside, you are likely to see some birds stalking alongside the cattle to seize the insects disturbed by their movement through grasses. Which of the following is/are such bird/birds?\n1. Painted Stork\n2. Common Myna\n3. Black-necked Crane\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:The question asks about birds that follow cattle to feed on insects disturbed by the cattle's movement.\n\n* **Painted Stork:**  Large wading bird, typically found near wetlands and water bodies, feeding on fish and other aquatic animals. They don't typically follow cattle.\n\n* **Common Myna:** A common bird found in various habitats, including agricultural areas. They are omnivorous and opportunistic feeders, often found near cattle to scavenge insects.\n\n* **Black-necked Crane:**  A large crane species found in high-altitude wetlands of the Himalayas.  They don't typically associate with cattle.\n\nTherefore, only the Common Myna fits the description in the question.\n"
    },
    {
        "Q.No.": 21,
        "question_text": "In medieval India, the designations 'Mahattara' and 'Pattakila' were used for",
        "option_a": "military officers",
        "option_b": "village headmen",
        "option_c": "specialists in Vedic rituals",
        "option_d": "chiefs of craft guilds",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:  Mahattara and Pattakila were designations used for village headmen in medieval India.  While the provided text doesn't directly define these terms, the context of village administration and social organization in ancient and medieval India strongly suggests this.  The other options are less likely. Military officers would likely have different, more explicitly martial titles. Vedic ritual specialists had their own specific designations, and craft guilds also had their own leadership structures.\n"
    },
    {
        "Q.No.": 22,
        "question_text": "Lichens, which are capable of initiating ecological succession even on a bare rock, are actually a symbiotic association of",
        "option_a": "algae and bacteria",
        "option_b": "algae and fungi",
        "option_c": "bacteria and fungi",
        "option_d": "fungi and mosses",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Lichens are a symbiotic association between algae and fungi.  The algae provide food through photosynthesis, while the fungi provide structure and protection. This symbiotic relationship allows lichens to thrive in harsh environments, such as bare rock, and initiate ecological succession.  They are pioneer species, meaning they are among the first organisms to colonize a new or disturbed area.\n\nAlgae are photosynthetic organisms that produce their own food. Fungi are heterotrophic organisms that obtain nutrients by absorbing organic matter.  Bacteria are single-celled prokaryotic organisms, some of which are involved in nutrient cycling. Mosses are small, non-vascular plants.  Ecological succession is the gradual change in species composition of a community over time.\n"
    },
    {
        "Q.No.": 23,
        "question_text": "If you travel through the Himalayas, you are likely to see which of the following plants naturally growing there?\n1. Oak\n2. Rhododendron\n3. Sandalwood\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: Oak and Rhododendron are found in the Himalayan region.  Sandalwood is not naturally found in the Himalayas.\n\nOak:  A genus of deciduous and evergreen trees and shrubs belonging to the beech family, Fagaceae. Many oak species are found in temperate regions of the Northern Hemisphere, including the Himalayas, where they thrive at various altitudes.  They are known for their strong wood and acorns.\n\nRhododendron: A genus of flowering plants in the family Ericaceae, encompassing a wide variety of shrubs and small trees. Many rhododendron species are adapted to high-altitude environments, making them common in the Himalayan mountain ranges. They are renowned for their vibrant and diverse flower displays.\n\nSandalwood:  A genus of fragrant trees belonging to the Santalaceae family, primarily found in tropical and subtropical regions of Asia and the Pacific. They are not naturally found in the high altitudes of the Himalayas. Sandalwood is prized for its aromatic wood, used in perfumes, incense, and other products.\n"
    },
    {
        "Q.No.": 24,
        "question_text": "Which of the following are some important pollutants released by steel industry in India?\n1. Oxides of sulphur\n2. Oxides of nitrogen\n3. Carbon monoxide\n4. Carbon dioxide\nSelect the correct answer using the code given below.",
        "option_a": "1, 3 and 4 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (d)\n\nexplanation:The steel industry in India, like many steel industries globally, releases several pollutants during its various processes.  These include oxides of sulfur (SOx) from the smelting process and the use of sulfur-containing raw materials; oxides of nitrogen (NOx) from high-temperature combustion processes; carbon monoxide (CO) from incomplete combustion of fuel; and carbon dioxide (CO2) as a byproduct of combustion and chemical reactions. Therefore, all four pollutants listed are significant emissions from the Indian steel industry.\n\nOxides of Sulfur (SOx):  These gases are primarily sulfur dioxide (SO2), a major air pollutant causing respiratory problems and acid rain.  Steel production often involves sulfur-containing materials, leading to SOx emissions unless mitigation technologies are employed.\n\nOxides of Nitrogen (NOx):  These gases, including nitric oxide (NO) and nitrogen dioxide (NO2), are formed at high temperatures in combustion processes. They contribute to acid rain, smog, and respiratory issues.  Steelmaking involves significant heat generation, leading to NOx formation.\n\nCarbon Monoxide (CO): A colorless, odorless, and toxic gas produced by incomplete combustion of carbon-containing fuels.  Steel production uses large quantities of fuel, and incomplete combustion can lead to significant CO emissions.\n\nCarbon Dioxide (CO2): A greenhouse gas contributing to climate change.  Steel production is a significant source of CO2 emissions due to the energy-intensive nature of the processes involved.  The use of fossil fuels in steelmaking significantly contributes to CO2 emissions.\n"
    },
    {
        "Q.No.": 25,
        "question_text": "Which of the following Kingdoms were associated with the life of the Buddha?\n1. Avanti\n2. Gandhara\n3. Kosala\n4. Magadha\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 3",
        "option_b": "2 and 4",
        "option_c": "3 and 4 only",
        "option_d": "1, 3 and 4",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation:The life of Buddha was intertwined with several kingdoms of ancient India.  Kosala and Magadha were two major powers during his lifetime.  He was born in the Shakya clan of Kapilavastu, which was located in the region of Kosala.  His teachings spread through Kosala and into Magadha, where the religion gained significant followers and royal patronage. Avanti was a powerful kingdom, but its connection to the Buddha's life is less direct compared to Kosala and Magadha.  Gandhara, located in the northwest, became important for Buddhism later, but it did not play a major role during Buddha's lifetime. Therefore, Kosala and Magadha, along with Avanti, are associated with the Buddha’s life.\n\n\nAvanti:  A powerful kingdom in ancient India, known for its strong rulers and flourishing urban centers like Ujjain. Its location in central India placed it on important trade routes.  While not directly central to Buddha's life, its proximity to other important kingdoms means it was likely aware of the rising influence of Buddhism.\n\nGandhara: A region in northwestern India and Pakistan, known for its unique blend of Indian and Central Asian cultures.  Gandhara art, particularly its depiction of Buddha, became famous later.  It was not a major player during the Buddha's lifetime.\n\nKosala:  A large kingdom in ancient India, encompassing present-day eastern Uttar Pradesh and parts of Nepal.  The Buddha was born in the Shakya clan in Kapilavastu, which was part of Kosala.  The kingdom played a significant role in the early spread of Buddhism.\n\nMagadha: A powerful kingdom in eastern India, its capital was initially Rajgir and later Pataliputra (modern Patna). Magadha's strategic location, fertile lands, and strong rulers contributed to its growth and influence.  The kingdom played a crucial role in the later development and spread of Buddhism, with powerful rulers embracing the faith.  It became a center of Buddhist learning.\n"
    },
    {
        "Q.No.": 26,
        "question_text": "Every year, a monthlong ecologically important campaign/festival is held during which certain communities/ tribes plant saplings of fruit-bearing trees. Which of the following are such communities/tribes?",
        "option_a": "Bhutia and Lepcha",
        "option_b": "Gond and Korku",
        "option_c": "Irula and Toda",
        "option_d": "Sahariya and Agariya",
        "correct_option": "b",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: The provided text does not contain information about which communities or tribes participate in a monthlong ecological campaign involving planting fruit-bearing trees.  Therefore, I cannot answer this question based on the given text.\n"
    },
    {
        "Q.No.": 27,
        "question_text": "The sales tax you pay while purchasing a toothpaste is a",
        "option_a": "tax imposed by the Central Government",
        "option_b": "tax imposed by the Central Government but collected by the State Government",
        "option_c": "tax imposed by the State Government but collected by the Central Government",
        "option_d": "tax imposed and collected by the State Government",
        "correct_option": "d",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation:Sales tax on goods and services is a tax imposed and collected by the State Government.  The Central Government does have some involvement in indirect tax collection through the Goods and Services Tax (GST), but the GST is a shared tax between the Centre and States, and the actual collection and administration of the State GST component rests with the states.  The provided text mentions Article 269 of the Indian Constitution, which deals with the distribution of sales tax revenue between the Centre and States, further supporting the idea that sales tax is primarily a State-level tax.  There is no mention of the Central Government imposing a separate sales tax that is then collected by the States.\n"
    },
    {
        "Q.No.": 28,
        "question_text": "What does venture capital mean?",
        "option_a": "A short-term capital provided to industries",
        "option_b": "A long-term start-up capital provided to new entrepreneurs",
        "option_c": "Funds provided to industries at times of incurring losses",
        "option_d": "Funds provided for replacement and renovation of industries",
        "correct_option": "b",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: Venture capital refers to long-term funding provided to new businesses or entrepreneurs, typically in high-growth industries, with a high-risk, high-reward potential.  Option (a) is incorrect because venture capital is not short-term. Option (c) is incorrect as it focuses on loss recovery rather than growth. Option (d) is incorrect because it describes capital expenditure for existing industries, not new ventures.\n\nSilicon Valley: A region in Northern California known as a global center for high technology, innovation, and entrepreneurship.  Many technology companies and startups are based there.  Venture capital plays a significant role in funding these companies.\n\nEntrepreneurs: Individuals who start and run businesses, often taking on considerable risk in the pursuit of innovation and profit. Venture capital is crucial for many entrepreneurs to launch and grow their businesses.\n\nStart-up: A newly established business, typically characterized by high growth potential and innovative ideas.  Startups are frequent recipients of venture capital funding.\n"
    },
    {
        "Q.No.": 29,
        "question_text": "The main objective of the 12th Five-Year Plan is",
        "option_a": "inclusive growth and poverty reduction",
        "option_b": "inclusive and sustainable growth",
        "option_c": "sustainable and inclusive growth to reduce unemployment",
        "option_d": "faster, sustainable and more inclusive growth",
        "correct_option": "d",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (d)\n\nexplanation:The 12th Five-Year Plan (2012-17) prioritized \"faster, sustainable, and more inclusive growth\".  While options (a), (b), and (c) contain elements of the plan's objectives, option (d) most accurately reflects the overarching goal as stated in the provided text.  Inclusive growth, as defined by the UNDP, emphasizes equal participation and benefit-sharing in economic growth.  Sustainable growth focuses on environmental considerations and long-term viability.  The plan aimed to achieve both simultaneously, along with accelerating the pace of economic expansion.  The 10th Five-Year Plan (2002-07) had already introduced the concept of inclusive growth and equitable development, setting the stage for the 12th Plan to build upon this foundation with a stronger emphasis on sustainability.  The 11th Five-Year Plan (2007-12) also contributed by focusing on increasing the Gross Enrollment Ratio (GER) in higher education and implementing programs like the Right to Education Act (RTE) 2009, AAY, and NREGA.  These initiatives aimed to create a more inclusive and equitable society, facilitating the goals of the 12th Five-Year Plan.  The involvement of Panchayats and Municipalities, as seen in the 8th Five-Year Plan (1992-97), reflects a decentralized planning approach, which was also important for achieving inclusive growth.  The UN's Sustainable Development Goals (SDGs) align with the broader aims of inclusive and sustainable development, focusing on poverty reduction, improved health, education, and environmental sustainability.  C. Rangarajan's work likely contributed to the economic policy framework of the Five-Year Plans. The concept of Human Development, as proposed by Mahbub ul Haq and further developed by Amartya Sen, emphasizes the importance of quality of life, opportunities, and freedoms in achieving true development.  The focus on food security, as indicated in the provided text, is also a key component of inclusive growth, ensuring that the benefits of economic progress reach the most vulnerable populations.\n"
    },
    {
        "Q.No.": 30,
        "question_text": "With reference to Balance of Payments, which of the following constitutes/constitute the Current Account?\n1. Balance of trade\n2. Foreign assets\n3. Balance of invisibles\n4. Special Drawing Rights\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "1, 2 and 4",
        "correct_option": "c",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:The current account in the Balance of Payments (BoP) records all transactions related to the trade of goods and services, as well as income and current transfers.\n\n* Balance of trade: This refers to the difference between the value of a country's exports and imports of goods (merchandise).  It's a major component of the current account.\n\n* Foreign assets:  Foreign assets are holdings of financial instruments issued by foreign entities. These fall under the financial account, not the current account.\n\n* Balance of invisibles: This encompasses services (tourism, transportation, etc.), income (investment returns, wages), and current transfers (foreign aid, remittances).  It's a significant part of the current account.\n\n* Special Drawing Rights (SDRs): SDRs are international reserve assets created by the International Monetary Fund (IMF).  They are recorded in the financial account, representing changes in a country's foreign exchange reserves.  They are not part of the current account.\n\nTherefore, only the balance of trade and the balance of invisibles are part of the current account.\n"
    },
    {
        "Q.No.": 31,
        "question_text": "The terms 'Marginal Standing Facility Rate' and 'Net Demand and Time Liabilities', sometimes appearing in news, are used in relation to",
        "option_a": "banking operations",
        "option_b": "communication networking",
        "option_c": "military strategies",
        "option_d": "supply and demand of agricultural products",
        "correct_option": "a",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation:The Marginal Standing Facility Rate (MSF) is the rate at which commercial banks can borrow money from the Reserve Bank of India (RBI) overnight against the security of government securities.  Net Demand and Time Liabilities (NDTL) represent the total liabilities of a bank, including demand deposits (checking accounts) and time deposits (savings accounts and fixed deposits). Both terms are central to banking operations and monetary policy.  The RBI uses MSF to manage liquidity in the banking system and NDTL is a key indicator of a bank's financial health and size.  Options (b), (c), and (d) are irrelevant to these financial terms.\n"
    },
    {
        "Q.No.": 32,
        "question_text": "What is/are the facility/facilities the beneficiaries can get from the services of Business Correspondent (Bank Saathi) in branchless areas?\n1. It enables the beneficiaries to draw their subsidies and social security benefits in their villages.\n2. It enables the beneficiaries in the rural areas to make deposits and withdrawals.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: Business Correspondents (Bank Saathis) are agents who provide banking services in rural and underserved areas.  Their services extend to enabling beneficiaries to access government subsidies and social security benefits directly in their villages (option 1). They also facilitate basic banking transactions like deposits and withdrawals (option 2). Therefore, both statements are correct.  A short note on the named entities is not possible as the provided context does not contain relevant information to define the named entities in the question.\n"
    },
    {
        "Q.No.": 33,
        "question_text": "In the context of Indian economy, which of the following is/are the purpose/purposes of 'Statutory Reserve Requirements'?\n1. To enable the Central Bank to control the amount of advances the banks can create\n2. To make the people's deposits with banks safe and liquid\n3. To prevent the commercial banks from making excessive profits\n4. To force the banks to have sufficient vault cash to meet their day-to-day requirements\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation: Statutory Reserve Requirements (SRR) in India primarily aim to control the money supply and credit creation by commercial banks.  By mandating banks to hold a certain percentage of their deposits as reserves (CRR and SLR), the central bank limits the amount of money banks can lend out, thus influencing the overall money supply. While SRR contributes to the safety and liquidity of deposits, this is a secondary effect, not the primary purpose. Preventing excessive profits is not a direct aim of SRR; it's a potential consequence of controlling credit expansion.  SRR does not directly dictate vault cash requirements; that's managed internally by banks to meet their daily operational needs.  Therefore, only statement 1 accurately reflects the primary purpose of SRR.\n\n\nShort notes on important keywords and named entities:\n\n* **Statutory Reserve Requirements (SRR):**  Regulations imposed by a central bank on commercial banks, requiring them to maintain a certain percentage of their deposits as reserves.  This is a key tool for monetary policy, influencing credit creation and money supply.\n\n* **Central Bank (Reserve Bank of India - RBI):** The central bank of India, responsible for monetary policy, regulating financial institutions, and maintaining financial stability.  It sets and enforces SRR.\n\n* **Advances:** Loans and credit extended by banks to borrowers. SRR directly controls the volume of advances banks can create.\n\n* **CRR (Cash Reserve Ratio):** The percentage of a bank's net demand and time liabilities that it is required to maintain with the RBI in the form of cash.\n\n* **SLR (Statutory Liquidity Ratio):**  The percentage of a bank's net demand and time liabilities that it is required to maintain in the form of liquid assets like gold, approved securities etc.\n"
    },
    {
        "Q.No.": 34,
        "question_text": "Recently, a series of uprisings of people referred to as 'Arab Spring' originally started from",
        "option_a": "Egypt",
        "option_b": "Lebanon",
        "option_c": "Syria",
        "option_d": "Tunisia",
        "correct_option": "d",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: The Arab Spring, a series of anti-government protests, uprisings, and armed rebellions that spread across much of the Arab world in the early 2010s, began in Tunisia.  While protests and uprisings occurred in Egypt, Lebanon, and Syria during the Arab Spring, they followed the initial events in Tunisia.\n\nEgypt: A country in North Africa, historically significant for its ancient civilization and currently a republic.  It experienced significant upheaval during the Arab Spring.\n\nLebanon: A country in the Levant region of Western Asia, known for its diverse religious and ethnic population. It experienced protests and political instability during the Arab Spring.\n\nSyria: A country in Western Asia, bordering Lebanon and the Mediterranean Sea. It experienced a brutal civil war following the Arab Spring protests.\n\nTunisia: A country in North Africa, the birthplace of the Arab Spring.  The self-immolation of a street vendor sparked widespread protests leading to the overthrow of the long-ruling dictator Zine El Abidine Ben Ali.\n"
    },
    {
        "Q.No.": 35,
        "question_text": "Consider the following countries :\n1. Denmark\n2. Japan\n3. Russian Federation\n4. United Kingdom\n5. United States of America\nWhich of the above are the members of the 'Arctic Council'?",
        "option_a": "1, 2 and 3",
        "option_b": "2, 3 and 4",
        "option_c": "1, 4 and 5",
        "option_d": "1, 3 and 5",
        "correct_option": "d",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (d)\n\nexplanation:The Arctic Council is an intergovernmental forum composed of eight Arctic states: Canada, Denmark (including Greenland and the Faroe Islands), Finland, Iceland, Norway, Russia, Sweden, and the United States.  Therefore, Denmark, Russia, and the United States are members.  Japan and the United Kingdom are not members of the Arctic Council.\n\nDenmark: A Scandinavian country with a territory (Greenland) in the Arctic.  Known for its social democracy and high standard of living.\n\nJapan: An island nation in East Asia, not located within the Arctic region.  A major global economic power.\n\nRussian Federation: The largest country in the world, with a significant portion of its territory located within the Arctic.  Possesses vast natural resources and plays a major role in Arctic governance.\n\nUnited Kingdom: An island nation off the coast of Europe.  Plays an important role in international affairs but is not an Arctic state.\n\nUnited States of America: A North American country with significant Arctic territory (Alaska).  A major global power with substantial interests in the Arctic region.\n"
    },
    {
        "Q.No.": 36,
        "question_text": "Consider the following pairs :\n   Region often in news         Country\n1. Chechnya                  :  Russian Federation\n2. Darfur                    :  Mali\n3. Swat Valley               :  Iraq\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation: Chechnya is a republic within the Russian Federation and has frequently been in the news due to political instability and conflicts.  Darfur is a region in Sudan, not Mali, known for its long-standing conflict. Swat Valley is located in Pakistan, not Iraq. Therefore, only pair 1 is correctly matched.\n\nChechnya: A republic in the North Caucasus region of Russia, known for its history of separatist movements and conflicts with the Russian government.  Its strategic location and history of violence have made it a frequent subject of international attention.\n\nDarfur: A region in western Sudan that has experienced a protracted and brutal conflict marked by widespread human rights abuses, ethnic cleansing, and genocide.  The conflict has resulted in a massive humanitarian crisis.\n\nSwat Valley: A valley in northern Pakistan, part of the Khyber Pakhtunkhwa province.  It's known for its scenic beauty and rich cultural heritage but has also been affected by conflicts, including Taliban insurgency.\n\nMali: A landlocked country in West Africa, often facing political instability and conflicts.\n\nIraq: A country in Western Asia, with a history of conflict and political instability.\n"
    },
    {
        "Q.No.": 37,
        "question_text": "With reference to Agni-IV Missile, which of the following statements is/are correct?\n1. It is a surface-to-surface missile.\n2. It is fuelled by liquid propellant only.\n3. It can deliver one-tonne nuclear warheads about 7500 km away.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:The Agni-IV missile is a surface-to-surface ballistic missile, making statement 1 correct.  It uses solid propellants, not liquid propellants only, making statement 2 incorrect.  It has a range of around 4,000 km and can carry a payload of approximately one tonne,  although the exact range and payload capacity might vary depending on the warhead type, making statement 3 incorrect in regards to the 7500 km range.  Therefore, only statement 1 is entirely correct.\n\nAgni-IV Missile: A surface-to-surface ballistic missile developed by India.  It's part of India's Agni series of missiles and is designed for strategic deterrence.  It uses solid propellants for fuel, offering advantages in terms of storage and launch readiness.\n\n"
    },
    {
        "Q.No.": 38,
        "question_text": "With reference to two non-conventional energy sources called 'coalbed methane' and 'shale gas', consider the following statements:\n1. Coalbed methane is the pure methane gas extracted from coal seams, while shale gas is a mixture of propane and butane only that can be extracted from fine-grained sedimentary rocks.\n2. In India, abundant coalbed methane sources exist, but so far no shale gas sources have been found.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. Coalbed methane (CBM) is methane gas extracted from coal seams.  Shale gas, however, is natural gas extracted from shale rock formations and is not exclusively propane and butane; it's a mixture of hydrocarbons, primarily methane.\n\nStatement 2 is correct. India possesses abundant CBM resources, and while exploration for shale gas is underway, commercially viable reserves have not yet been established on a large scale.\n\n**Short notes on keywords and named entities:**\n\n* **Coalbed Methane (CBM):**  A form of natural gas extracted from coal seams.  CBM is trapped within the coal matrix and released when the coal is depressurized, often through water extraction.  It's considered a cleaner-burning fuel than coal.\n\n* **Shale Gas:** Natural gas found within shale formations, a type of fine-grained sedimentary rock.  Extraction typically involves hydraulic fracturing (\"fracking\"), a controversial technique due to potential environmental impacts. Shale gas is a significant energy source globally.\n\n* **India's Energy Sector:** India is a large consumer of energy, significantly reliant on coal for electricity generation.  The country is actively exploring unconventional gas resources like CBM and shale gas to enhance energy security and reduce reliance on imports.  The success of these efforts is crucial for meeting growing energy demands sustainably.\n"
    },
    {
        "Q.No.": 39,
        "question_text": "With reference to ‘Changpa’ community of India, consider the following statements :\n1. They live mainly in the State of Uttarakhand.\n2. They rear the Pashmina goats that yield a fine wool.\n3. They are kept in the category of Scheduled Tribes.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:\n\n1. **Changpa community:** The Changpa are a nomadic pastoral community primarily residing in the Changthang region of Ladakh, in the state of Jammu and Kashmir, not Uttarakhand.  They are known for their traditional way of life centered around yak and pashmina goat rearing.\n\n\n2. **Pashmina goats:** Pashmina goats are a breed of goat renowned for producing the softest and finest wool in the world, known as pashmina.  The goats are adapted to survive in high-altitude, cold climates.\n\n\n3. **Scheduled Tribes:** Scheduled Tribes are groups in India officially recognized as having a distinct cultural identity, often inhabiting remote areas and facing socio-economic challenges. This designation provides them with certain constitutional safeguards and benefits.\n\nStatement 1 is incorrect because Changpas mainly live in Ladakh. Statement 2 is correct as Changpas rear Pashmina goats. Statement 3 is not explicitly stated in the provided text regarding Changpas but is a general statement about Scheduled Tribes in India.  Therefore, only statement 2 is definitively correct.  The provided text doesn't offer enough information to confirm or deny whether the Changpas are a Scheduled Tribe.\n"
    },
    {
        "Q.No.": 40,
        "question_text": "In India, cluster bean (Guar) is traditionally used as a vegetable or animal feed, but recently the cultivation of this has assumed significance. Which one of the following statements is correct in this context?",
        "option_a": "The oil extracted from seeds is used in the manufacture of biodegradable plastics",
        "option_b": "The gum made from its seeds is used in the extraction of shale gas",
        "option_c": "The leaf extract of this plant has the properties of anti-histamines",
        "option_d": "It is a source of high quality biodiesel",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "* **correct_option:** (b)\n* **explanation:** The cluster bean (guar) gum extracted from its seeds is a crucial component in hydraulic fracturing, also known as fracking, used in the extraction of shale gas.  While guar is used as a vegetable and animal feed, its significance has recently grown due to its industrial applications, primarily in the energy sector.\n\nGuar: A leguminous plant mainly cultivated in India and parts of Africa and Australia.  It's known for its high-quality gum, which is used in various industrial applications, most notably in the oil and gas industry.  The plant also has uses as a vegetable and animal feed.\n\nShale gas: Natural gas trapped within shale formations, a type of sedimentary rock.  Extracting shale gas requires hydraulic fracturing (fracking), a process that involves injecting high-pressure fluids into the shale to release the gas. Guar gum is essential for this process.\n\nBiodegradable plastics: Plastics that decompose naturally under specific conditions, often requiring specific microorganisms or enzymes to break them down.  The oil extracted from guar seeds has not been widely utilized for this purpose.\n\nAnti-histamines: Medications that block the effects of histamine, a chemical released by the body during allergic reactions.  There is no mention in the provided text of guar leaf extract having anti-histamine properties.\n\nBiodiesel: A renewable fuel made from vegetable oils or animal fats. Guar has some potential as a biodiesel source, but the text doesn't explicitly state it's a high-quality source.\n"
    },
    {
        "Q.No.": 41,
        "question_text": "Which of the following have coral reefs?\n1. Andaman and Nicobar Islands\n2. Gulf of Kachchh\n3. Gulf of Mannar\n4. Sunderbans\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 and 4 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (c)\n\nexplanation: The Andaman and Nicobar Islands and the Gulf of Mannar are known to have coral reefs.  The Gulf of Kachchh and the Sunderbans do not have significant coral reef formations.\n\nAndaman and Nicobar Islands: A group of islands in the Bay of Bengal known for their biodiversity, including extensive coral reefs.\n\nGulf of Kachchh: A large gulf in the Arabian Sea; while it has some marine life, it is not primarily known for coral reefs.\n\nGulf of Mannar: A gulf between India and Sri Lanka, famous for its rich marine biodiversity, including a significant coral reef system.\n\nSunderbans: A vast delta region at the mouth of the Ganges and Brahmaputra rivers; primarily a mangrove ecosystem, not known for coral reefs.\n"
    },
    {
        "Q.No.": 42,
        "question_text": "In India, the problem of soil erosion is associated with which of the following?\n1. Terrace cultivation\n2. Deforestation\n3. Tropical climate\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: Soil erosion in India is linked to deforestation, tropical climate, and even terrace cultivation practices.  Deforestation removes the protective cover of vegetation, leaving soil exposed to the erosive forces of wind and rain, especially prevalent in India's tropical climate characterized by heavy monsoons and intense rainfall. While terrace cultivation is a technique to reduce soil erosion on slopes, poorly managed terraces can still contribute to erosion if not properly maintained. Therefore, all three factors contribute to the problem.\n\nShort notes:\n\n* **Soil erosion:** The process of detachment and transportation of soil particles by natural agents like wind and water.  It leads to land degradation and loss of fertile topsoil.\n\n* **Terrace cultivation:** An agricultural technique where slopes are converted into a series of level terraces to reduce soil erosion and improve water retention.  However, improper construction or maintenance can lead to erosion.\n\n* **Deforestation:** The clearing of forests for other land uses, such as agriculture or urbanization. It significantly increases soil erosion risk by removing the protective cover of vegetation.\n\n* **Tropical climate:** A climate characterized by high temperatures and significant rainfall throughout the year or during specific seasons (monsoon).  Intense rainfall in tropical climates can cause significant soil erosion if the land is not protected by vegetation.\n\n* **India:** A large country in South Asia with diverse climates and geographical features, making it susceptible to various types of soil erosion.\n"
    },
    {
        "Q.No.": 43,
        "question_text": "The seasonal reversal of winds is the typical characteristic of",
        "option_a": "Equatorial climate",
        "option_b": "Mediterranean climate",
        "option_c": "Monsoon climate",
        "option_d": "All of the above climates",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:Monsoon climates are characterized by a seasonal reversal of winds.  During summer, winds blow from the ocean towards the land, bringing moisture and rainfall.  In winter, the winds reverse direction, blowing from the land towards the ocean, resulting in dry conditions.  Equatorial climates experience relatively consistent weather patterns throughout the year, lacking the pronounced seasonal wind shifts. Mediterranean climates have dry summers and wet winters, but this is primarily due to the shifting of pressure systems and not a complete wind reversal.  Therefore, the seasonal reversal of winds is most characteristic of monsoon climates.\n"
    },
    {
        "Q.No.": 44,
        "question_text": "With reference to the cultural history of India, the term ‘Panchayatan’ refers to",
        "option_a": "an assembly of village elders",
        "option_b": "a religious sect",
        "option_c": "a style of temple construction",
        "option_d": "an administrative functionary",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: In the context of Indian cultural history, Panchayatan refers to a style of temple construction.  An assembly of village elders is a panchayat.  Religious sects are numerous in India's history. An administrative functionary is a government official.\n"
    },
    {
        "Q.No.": 45,
        "question_text": "Consider the following rivers:\n1. Barak\n2. Lohit\n3. Subansiri\nWhich of the above flows/flow through Arunachal Pradesh?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: The Barak, Lohit, and Subansiri rivers all flow through Arunachal Pradesh.  \n\n* **Barak River:** This river originates in Manipur and flows through Mizoram and Assam before joining the Surma River in Bangladesh. A significant portion of its upper course lies within Arunachal Pradesh.\n\n* **Lohit River:** One of the major tributaries of the Brahmaputra River, the Lohit River originates in the eastern Himalayas and flows through Arunachal Pradesh before merging with the Brahmaputra.\n\n* **Subansiri River:** Another major tributary of the Brahmaputra River, the Subansiri River also originates in the Himalayas and flows through Arunachal Pradesh.  It's known for its significant hydropower potential.\n"
    },
    {
        "Q.No.": 46,
        "question_text": "Consider the following pairs:\n   Wetlands                             Confluence of rivers\n1. Harike Wetlands                  :   Confluence of Beas and Satluj/Sutlej\n2. Keoladeo Ghana National Park     :   Confluence of Banas and Chambal\n3. Kolleru Lake                     :   Confluence of Musi and Krishna\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: Only pair 1 is correctly matched. Harike Wetlands are located at the confluence of the Beas and Sutlej rivers.  Keoladeo Ghana National Park is not located at the confluence of the Banas and Chambal rivers. Kolleru Lake is also not located at the confluence of the Musi and Krishna rivers.\n\nHarike Wetlands: A wetland located in Tarn Taran district, Punjab, India. It's formed by the confluence of the Beas and Sutlej rivers.  It's known for its diverse avian fauna and is an important bird sanctuary.\n\nKeoladeo Ghana National Park:  A bird sanctuary in Bharatpur, Rajasthan.  It's renowned for its birdlife, particularly migratory birds.  It's not located at a river confluence as stated in the incorrect pairing.\n\nKolleru Lake: A freshwater lake located in Andhra Pradesh, India. It's not situated at the confluence of the Musi and Krishna rivers as mentioned in the incorrect pairing.  It's a significant wetland ecosystem.\n\nBeas River: A major tributary of the Indus River, originating in the Himalayas and flowing through Himachal Pradesh and Punjab.\n\nSutlej River (Satluj):  One of the five rivers of the Punjab region, originating in Tibet and flowing through India and Pakistan.  A major tributary of the Indus River.\n\nBanas River: A river in Rajasthan, India, a tributary of the Chambal River.\n\nChambal River: A river flowing through Madhya Pradesh, Rajasthan, and Uttar Pradesh in India.  A tributary of the Yamuna River.\n\nMusi River: A river in Telangana, India, a tributary of the Krishna River.\n\nKrishna River: A major river in southern India, flowing through Karnataka, Telangana, Andhra Pradesh, and Tamil Nadu.\n"
    },
    {
        "Q.No.": 47,
        "question_text": "Which one of the following pairs does not form part of the six systems of Indian Philosophy?",
        "option_a": "Mimamsa and Vedanta",
        "option_b": "Nyaya and Vaisheshika",
        "option_c": "Lokayata and Kapalika",
        "option_d": "Sankhya and Yoga",
        "correct_option": "c",
        "subject": "polity",
        "year": 2014,
        "explanation": "* **correct_option:** (c)\n* **explanation:**  The six systems of Indian philosophy (shad-darshanas) are Samkhya, Yoga, Nyaya, Vaisheshika, Mimamsa, and Vedanta.  Lokayata and Kapalika are not included in this traditional grouping. Lokayata, also known as Charvaka, is a materialistic school of thought that emphasizes empirical experience and rejects the existence of a soul or afterlife. Kapalika is a tantric sect associated with Shiva worship.\n\nSamkhya: A dualistic philosophy that posits two fundamental realities: Purusha (consciousness) and Prakriti (matter).  It emphasizes the liberation of the Purusha from the entanglement of Prakriti.\n\nYoga:  A system of philosophy and practice aimed at achieving union (yoga) between the individual self and the ultimate reality.  It emphasizes ethical conduct, mental discipline, and physical postures (asanas) to control the mind and body.\n\nNyaya:  A school of thought focused on logic and epistemology.  It outlines methods of acquiring knowledge (pramanas) and uses logic to analyze arguments and establish truth.\n\nVaisheshika:  A philosophy that deals with metaphysics and ontology, particularly the nature of reality and categories of existence. It is known for its atomic theory.\n\nMimamsa:  A school of philosophy focusing on the interpretation and application of the Vedas, particularly the Brahmanas and Aranyakas. It emphasizes the importance of ritualistic practices for achieving salvation.\n\nVedanta:  A philosophical system based on the Upanishads, which are part of the Vedas.  It explores the nature of Brahman (ultimate reality), Atman (individual self), and their relationship.  It emphasizes the path of knowledge (jnana) or devotion (bhakti) to achieve liberation (moksha).\n"
    },
    {
        "Q.No.": 48,
        "question_text": "Consider the following pairs :\n   Hills                    Region\n1. Cardamom Hills     :     Coromandel Coast\n2. Kaimur Hills       :     Konkan Coast\n3. Mahadeo Hills      :     Central India\n4. Mikir Hills        :     North-East India\nWhich of the above pairs are correctly matched?",
        "option_a": "1 and 2",
        "option_b": "2 and 3",
        "option_c": "3 and 4",
        "option_d": "2 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\n\nexplanation:\n\nOnly pair 3 (Mahadeo Hills : Central India) and pair 4 (Mikir Hills : North-East India) are correctly matched.\n\n* **Cardamom Hills:** Located in the Western Ghats,  Kerala,  they are not associated with the Coromandel Coast. The Coromandel Coast is the eastern coast of the Indian peninsula, stretching from the southern part of Andhra Pradesh to the northern part of Tamil Nadu.\n\n* **Kaimur Hills:** These hills are situated in central India, not on the Konkan Coast. The Konkan Coast is a narrow coastal plain along the western coast of India, between the Western Ghats and the Arabian Sea.\n\n* **Mahadeo Hills:** These hills are located in central India.\n\n* **Mikir Hills (Now known as Karbi Anglong Hills):** These hills are situated in the North-Eastern state of Assam.\n"
    },
    {
        "Q.No.": 49,
        "question_text": "Which one of the following Schedules of the Constitution of India contains provisions regarding anti-defection?",
        "option_a": "Second Schedule",
        "option_b": "Fifth Schedule",
        "option_c": "Eighth Schedule",
        "option_d": "Tenth Schedule",
        "correct_option": "d",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: The Tenth Schedule of the Constitution of India deals with anti-defection.  It was added through the 52nd Amendment Act of 1985.  The Schedule aims to prevent elected members from changing their party affiliation for personal gain or political advantage.  \n\nThe Second Schedule contains provisions relating to the emoluments, allowances, and privileges of the President, Governors, Speakers, and other dignitaries. The Fifth Schedule deals with the administration and control of Scheduled Areas and Scheduled Tribes in certain states. The Eighth Schedule lists the 22 languages officially recognized by the Constitution of India.\n"
    },
    {
        "Q.No.": 50,
        "question_text": "The most important strategy for the conservation of biodiversity together with traditional human life is the establishment of",
        "option_a": "biosphere reserves",
        "option_b": "botanical gardens",
        "option_c": "national parks",
        "option_d": "wildlife sanctuaries",
        "correct_option": "a",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation:Biosphere reserves are the most effective strategy for conserving biodiversity alongside traditional human life.  They integrate conservation of biodiversity with sustainable use of natural resources and cultural values.  This approach recognizes the importance of local communities and their traditional knowledge in conservation efforts, unlike other options which focus on specific aspects of conservation.\n\nBiosphere reserves are areas of terrestrial and coastal ecosystems promoting conservation of biological diversity and sustainable development based on local community participation.  \n\nNational parks primarily focus on protecting wildlife and natural ecosystems, often restricting human access.  \n\nWildlife sanctuaries offer protection to wildlife, but may allow some human activities.\n\nBotanical gardens primarily focus on the conservation of plant species, ex-situ.  They don't encompass the broader scope of biodiversity and traditional human life integration.\n"
    },
    {
        "Q.No.": 51,
        "question_text": "Turkey is located between",
        "option_a": "Black Sea and Caspian Sea",
        "option_b": "Black Sea and Mediterranean Sea",
        "option_c": "Gulf of Suez and Mediterranean Sea",
        "option_d": "Gulf of Aqaba and Dead Sea",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: Turkey is bordered by the Black Sea to the north and the Mediterranean Sea to the south.\n\nBlack Sea: An inland sea connected to the Atlantic Ocean via the Mediterranean Sea and the Strait of Gibraltar.  It's known for its strategic importance and diverse marine life.\n\nMediterranean Sea: A sea connecting Europe, Africa, and Asia.  It's a significant historical and cultural area, with a rich biodiversity and a long history of trade and exploration.\n\nCaspian Sea: The world's largest inland body of water, located between Europe and Asia. It's known for its oil and gas reserves and unique ecosystem.\n\nGulf of Suez: A narrow waterway at the northern end of the Red Sea, connecting the Red Sea to the Suez Canal. It's a crucial part of global shipping routes.\n\nGulf of Aqaba: A narrow gulf at the northeastern end of the Red Sea, bordering Israel, Jordan, Egypt, and Saudi Arabia.  It's known for its coral reefs and diving opportunities.\n\nDead Sea: A salt lake bordering Jordan and Israel, known for its high salt concentration and therapeutic properties.  It is the lowest point on Earth's land surface.\n"
    },
    {
        "Q.No.": 52,
        "question_text": "What is the correct sequence of occurrence of the following cities in South-East Asia as one proceeds from south to north?\n1. Bangkok\n2. Hanoi\n3. Jakarta\n4. Singapore\nSelect the correct answer using the code given below.",
        "option_a": "4-2-1-3",
        "option_b": "3-2-4-1",
        "option_c": "3-4-1-2",
        "option_d": "4-3-2-1",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:  Singapore is the southernmost of the four cities.  Jakarta is south of Bangkok and Hanoi. Therefore, the correct north-to-south sequence is Jakarta, Singapore, Bangkok, Hanoi.  Option (c) reflects this order.\n\nSingapore: A highly developed island city-state in Southeast Asia, known for its strategic location, modern infrastructure, and thriving economy.\n\nJakarta: The capital city of Indonesia, located on the island of Java. It's a bustling metropolis and the largest city in Southeast Asia.\n\nBangkok: The capital of Thailand, situated on the Chao Phraya River. It's a vibrant city with a rich history and culture.\n\nHanoi: The capital of Vietnam, located in the northern part of the country on the Red River Delta.  It's a historical city with a blend of ancient and modern influences.\n"
    },
    {
        "Q.No.": 53,
        "question_text": "The scientific view is that the increase in global temperature should not exceed 2 °C above pre-industrial level. If the global temperature increases beyond 3 °C above the pre-industrial level, what can be its possible impact/impacts on the world?\n1. Terrestrial biosphere tends toward a net carbon source.\n2. Widespread coral mortality will occur.\n3. All the global wetlands will permanently disappear.\n4. Cultivation of cereals will not be possible anywhere in the world.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:If the global temperature increases by more than 3°C above pre-industrial levels, several severe consequences are likely.  A terrestrial biosphere becoming a net carbon source (releasing more carbon than it absorbs) is highly probable.  Widespread coral mortality is also expected at this level of warming. While complete disappearance of all global wetlands is less certain, significant losses are anticipated.  The statement that cereal cultivation will be impossible everywhere is an overstatement; however, significant reductions in yields and suitable growing areas are expected, making food security a major concern.  Therefore, options 1 and 2 are definitely expected consequences.\n\n\n**Short Notes:**\n\n* **Global temperature increase:**  Refers to the rise in average Earth's surface temperature compared to pre-industrial levels (generally considered as the average temperature from 1850-1900).  Exceeding 2°C is considered a critical threshold by the scientific community.\n\n* **Pre-industrial level:** The average global temperature before significant human impact on the climate system, primarily due to the burning of fossil fuels.\n\n* **Terrestrial biosphere:** The part of the Earth's biosphere that encompasses land ecosystems, including forests, grasslands, and deserts. It plays a crucial role in the carbon cycle.\n\n* **Net carbon source:**  An ecosystem or system that releases more carbon dioxide into the atmosphere than it absorbs.\n\n* **Coral mortality:** The death of coral reefs due to stressors like rising ocean temperatures, ocean acidification, and pollution.\n\n* **Global wetlands:** Areas where water covers the soil, or is present either at or near the surface of the soil all year or for varying periods of time during the year, including swamps, marshes, bogs, and mangroves.  They provide numerous ecological services.\n\n* **Cultivation of cereals:** The process of growing cereal crops like wheat, rice, maize, etc.  These are staple foods for a large part of the global population.\n"
    },
    {
        "Q.No.": 54,
        "question_text": "The national motto of India, ‘Satyameva Jayate’ inscribed below the Emblem of India is taken from",
        "option_a": "Katha Upanishad",
        "option_b": "Chandogya Upanishad",
        "option_c": "Aitareya Upanishad",
        "option_d": "Mundaka Upanishad",
        "correct_option": "a",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: The national motto of India, ‘Satyameva Jayate’, is taken from the Mundaka Upanishad.  \n\nKatha Upanishad: One of the principal Upanishads, focusing on the nature of the Atman (soul) and Brahman (ultimate reality), and the path to liberation (moksha).  It features the dialogue between Nachiketas and Yama.\n\nChandogya Upanishad: A significant Upanishad known for its narratives and teachings on Brahman, Atman, and the concept of knowledge (jnana). It contains the famous story of Uddalaka Aruni teaching his son Shvetaketu.\n\nAitareya Upanishad: Associated with the Aitareya Brahmana, this Upanishad explores the nature of Brahman and its relationship with the individual self.\n\nMundaka Upanishad: This Upanishad emphasizes the importance of knowledge (jnana) for liberation and features the concept of two kinds of knowledge (vidya) – lower and higher.  The phrase \"Satyameva Jayate\" meaning \"Truth alone triumphs\" is found here.\n"
    },
    {
        "Q.No.": 55,
        "question_text": "In the Constitution of India, promotion of international peace and security is included in the",
        "option_a": "Preamble to the Constitution",
        "option_b": "Directive Principles of State Policy",
        "option_c": "Fundamental Duties",
        "option_d": "Ninth Schedule",
        "correct_option": "b",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:The promotion of international peace and security is enshrined in the Directive Principles of State Policy in the Indian Constitution.  These principles, while not legally enforceable, guide the state's actions towards achieving social and economic justice.  The Preamble sets the overall goals, including a sovereign, socialist, secular, and democratic republic. Fundamental Duties are moral obligations on citizens, and the Ninth Schedule contains certain laws that cannot be challenged in courts.\n"
    },
    {
        "Q.No.": 56,
        "question_text": "What are the benefits of implementing the Integrated Watershed Development Programme?\n1. Prevention of soil runoff\n2. Linking the country's perennial rivers with seasonal rivers\n3. Rainwater harvesting and recharge of groundwater table\n4. Regeneration of natural vegetation\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: An Integrated Watershed Development Programme focuses on holistic watershed management.  Options 1, 3, and 4 directly address this:\n\n1. **Prevention of soil runoff:**  This is a key component of watershed management, as runoff leads to erosion, loss of topsoil, and reduced water infiltration.  Effective watershed programs employ techniques like terracing, contour farming, and vegetation cover to minimize runoff.\n\n3. **Rainwater harvesting and recharge of groundwater table:**  These practices increase water availability within the watershed, improving both surface and groundwater resources.  This is crucial for sustainable water management.\n\n4. **Regeneration of natural vegetation:**  Vegetation plays a vital role in watershed health.  Plants help prevent soil erosion, improve water infiltration, and provide habitat for wildlife.  Regeneration efforts are essential for long-term sustainability.\n\nOption 2, \"Linking the country's perennial rivers with seasonal rivers,\" is not a typical focus of Integrated Watershed Development Programmes. While inter-basin water transfer might be considered in broader water resource management strategies, it's not a core element of watershed-level interventions.  Watershed programs primarily concentrate on the sustainable management of resources *within* a specific watershed.\n\n**Short notes on named entities:**\n\n* **Integrated Watershed Development Programme:** A holistic approach to managing water resources and land within a specific watershed. It aims to improve the ecological, social, and economic conditions of the area.\n\n* **Soil runoff:** The flow of water over the land surface, carrying away soil particles and nutrients. It contributes to erosion and degradation of land.\n\n* **Rainwater harvesting:** The collection and storage of rainwater for later use.  It helps replenish groundwater supplies and reduce reliance on other water sources.\n\n* **Groundwater table:** The upper level of the saturated zone of groundwater.  It represents the level below which the ground is saturated with water.\n\n* **Regeneration of natural vegetation:** The process of restoring degraded or depleted vegetation cover. This often involves planting native species and implementing measures to protect existing vegetation.\n"
    },
    {
        "Q.No.": 57,
        "question_text": "Which of the following are associated with ‘Planning’ in India?\n1. The Finance Commission\n2. The National Development Council\n3. The Union Ministry of Rural Development\n4. The Union Ministry of Urban Development\n5. The Parliament\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 5 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "d",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (d)\n\nexplanation:Planning in India involves a multi-faceted approach with various entities contributing to the process.  The Finance Commission plays a crucial role in resource allocation and fiscal federalism, influencing planning at various levels. The National Development Council (NDC) is a key forum for coordinating development strategies and approving Five-Year Plans.  The Union Ministries of Rural and Urban Development implement policies and programs related to their respective sectors, aligning with national planning objectives.  Parliament, as the supreme legislative body, approves budgets and legislation essential for planning implementation. Thus, all five entities listed are associated with planning in India.\n\nShort notes on the entities:\n\n* **The Finance Commission:** A constitutional body that recommends the distribution of tax revenue between the Union and State governments, significantly impacting planning resources.  Its recommendations guide fiscal policy and influence development priorities.\n\n* **The National Development Council (NDC):**  A premier body for coordinating development policies and plans in India. It comprises the Prime Minister, Union Cabinet Ministers, and Chief Ministers of all states, ensuring collaborative planning.\n\n* **The Union Ministry of Rural Development:**  Responsible for implementing rural development programs, poverty reduction strategies, and rural infrastructure development, all integral parts of national planning.\n\n* **The Union Ministry of Urban Development:**  Focuses on urban planning, infrastructure development, and managing urban challenges, contributing significantly to overall national development planning.\n\n* **The Parliament:**  The supreme legislative body in India, responsible for approving budgets, enacting laws, and overseeing the implementation of national plans.  Its role is critical for the legal framework and resource allocation for planning.\n"
    },
    {
        "Q.No.": 58,
        "question_text": "Which of the following is/are the function/functions of the Cabinet Secretariat?\n1. Preparation of agenda for Cabinet Meetings\n2. Secretarial assistance to Cabinet Committees\n3. Allocation of financial resources to the Ministries\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 2 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:The Cabinet Secretariat's functions include preparing the agenda for Cabinet meetings and providing secretarial assistance to Cabinet Committees.  It does *not* allocate financial resources to ministries; that is the responsibility of the Ministry of Finance.\n\nThe Cabinet is the highest decision-making body in the government, composed of the Prime Minister and other ministers.  Cabinet Committees are smaller groups formed to handle specific issues, reducing the workload of the full Cabinet.  The Cabinet Secretariat supports these processes.  The Parliament is the legislative branch, responsible for creating laws and overseeing government spending.  The President is the head of state.\n"
    },
    {
        "Q.No.": 59,
        "question_text": "Consider the following statements : A Constitutional Government is one which\n1. places effective restrictions on individual liberty in the interest of State Authority\n2. places effective restrictions on the Authority of the State in the interest of individual liberty\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: A constitutional government prioritizes individual liberty over state authority.  Statement 1 is incorrect because it suggests a government that restricts individual liberty for the sake of state power, which is antithetical to the core principles of a constitutional government. Statement 2 accurately reflects the purpose of a constitutional government: to limit state power to protect individual freedoms.\n\nA constitution is a set of fundamental principles that govern a state.  It allocates power, sets limits on government, protects fundamental rights, and reflects the aspirations of a society.  The Indian Constitution is a prime example of a modern constitution that fulfills these functions.  The Constituent Assembly of India drafted the constitution, drawing on various historical and international influences, and aiming for a balance between central and state powers, as well as individual liberties and social goals.  Fundamental Rights and Directive Principles of State Policy are key elements of the Indian Constitution, representing legally enforceable rights and non-justiciable policy directives, respectively.  The Election Commission of India plays a crucial role in ensuring free and fair elections, and the judiciary protects and interprets the Constitution.  The structure of the Indian government is a parliamentary system, with the President as Head of State and the Prime Minister as Head of Government.  The executive branch is responsible for implementing laws and policies, while the legislature (Parliament) makes laws, controls the executive, and represents the people.  The judiciary is independent and responsible for upholding the rule of law and interpreting the Constitution.  Federalism in India involves a division of powers between the central government and state governments, with the Supreme Court resolving disputes.  Local governments (Panchayats and Nagarpalikas) also play a vital role in democratic governance.  The Constitution has been amended numerous times to adapt to changing needs and circumstances, but its basic structure remains intact, thanks to the doctrine of basic structure developed by the judiciary.\n"
    },
    {
        "Q.No.": 60,
        "question_text": "Which of the following are the discretionary powers given to the Governor of a State?\n1. Sending a report to the President of India for imposing the President's rule\n2. Appointing the Ministers\n3. Reserving certain bills passed by the State Legislature for consideration of the President of India\n4. Making the rules to conduct the business of the State Government\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "1 and 3 only",
        "option_c": "2, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "b",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:The Governor's discretionary powers are limited.  While the Governor appoints the Ministers (on the advice of the Chief Minister), this is not entirely discretionary as the advice is usually binding.  The Governor can reserve certain bills for the President's consideration, and this is a discretionary power. Sending a report to the President for imposing President's rule is also a discretionary power, though the grounds for doing so are defined. Making rules to conduct the business of the State Government is not a discretionary power; it's a statutory function.  Therefore, only options 1 and 3 represent discretionary powers.\n\nGovernor: The Governor is the head of a state's executive branch, appointed by the President of India.  Their powers are a mix of discretionary and advisory roles, often acting on the advice of the Council of Ministers.\n\nPresident of India: The President is the head of state of India, a largely ceremonial role.  However, they have certain reserve powers and are involved in the process of imposing President's rule in states.\n\nPresident's rule: This refers to the imposition of direct rule by the central government in a state when the state government is deemed unable to function.\n\nState Legislature: The legislative body of a state, responsible for making laws for the state.\n\nCouncil of Ministers:  The group of ministers headed by the Chief Minister who advise the Governor on matters of governance.  The Governor typically acts on their advice.\n\nChief Minister: The head of the state government, chosen from the majority party in the state legislature.  They are appointed by the Governor.\n"
    },
    {
        "Q.No.": 61,
        "question_text": "If the interest rate is decreased in an economy, it will",
        "option_a": "decrease the consumption expenditure in the economy",
        "option_b": "increase the tax collection of the Government",
        "option_c": "increase the investment expenditure in the economy",
        "option_d": "increase the total savings in the economy",
        "correct_option": "c",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: A decrease in interest rates makes borrowing cheaper for businesses.  This leads to increased investment expenditure as businesses are more likely to invest in new projects and expansion when the cost of borrowing is low.\n\nConsumption expenditure might increase, but it's not a direct and guaranteed consequence of a rate decrease.  Tax collection for the government is dependent on various factors, not solely interest rates.  Total savings in the economy are also influenced by multiple factors, and a rate cut could even decrease savings if consumption increases significantly.\n\nEconomy:  The overall state of a nation's economic activity, encompassing various aspects like production, consumption, investment, and employment.  Monetary policy and fiscal policy significantly impact an economy's performance.\n\nInterest rate: The cost of borrowing money, expressed as a percentage.  Central banks manipulate interest rates to influence economic activity.  Lower interest rates stimulate borrowing and investment, while higher rates curb inflation.\n\nConsumption expenditure: Spending by households on goods and services.  A major component of aggregate demand, it's influenced by factors like income, interest rates, and consumer confidence.\n\nInvestment expenditure: Spending by businesses on capital goods (machinery, equipment, etc.).  Crucial for long-term economic growth, it's sensitive to interest rates and business expectations.\n\nTax collection: Revenue generated by the government through various taxes (income tax, corporate tax, GST, etc.).  It funds government spending and influences fiscal policy.\n\nTotal savings: The aggregate savings of households, businesses, and the government.  A key determinant of investment and economic growth, it's influenced by income, interest rates, and government policies.\n"
    },
    {
        "Q.No.": 62,
        "question_text": "Consider the following statements :\n1. The President shall make rules for the more convenient transaction of the business of the Government of India, and for the allocation among Ministers of the said business.\n2. All executive actions of the Government of India shall be expressed to be taken in the name of the Prime Minister.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  Article 77(1) of the Indian Constitution states that the President shall make rules for the more convenient transaction of the business of the Government of India, and for the allocation among Ministers of the said business.  This empowers the President to regulate the functioning of the executive branch.\n\nStatement 2 is incorrect.  All executive actions of the Government of India are taken in the name of the President, not the Prime Minister. While the Prime Minister heads the Council of Ministers and is the de facto head of the executive, the constitutional authority rests with the President.\n\n\n**Short Notes on Named Entities:**\n\n* **President of India:** The head of state of India, a largely ceremonial position.  The President holds the executive power but delegates it to the Council of Ministers headed by the Prime Minister.  The President's role is primarily to act on the advice of the Council of Ministers.\n\n* **Prime Minister of India:** The head of government in India. The Prime Minister is appointed by the President and leads the Council of Ministers. They are responsible for the overall governance and administration of the country.  The Prime Minister holds significant power in the Indian political system.\n\n* **Council of Ministers:** The body of ministers who advise the President and are responsible for running the government. The Prime Minister is the head of the Council of Ministers.  The council is responsible for implementing policies and governance.\n\n* **Government of India:** The central government of India, consisting of the President, the Prime Minister, and the Council of Ministers. It is responsible for the administration of the country at the national level.\n"
    },
    {
        "Q.No.": 63,
        "question_text": "Consider the following statements regarding a No-Confidence Motion in India :\n1. There is no mention of a No-Confidence Motion in the Constitution of India.\n2. A Motion of No-Confidence can be introduced in the Lok Sabha only.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation:  Statement 1 is correct. The Indian Constitution does not explicitly mention a No-Confidence Motion.  It's a convention developed through parliamentary practice. Statement 2 is also correct. A No-Confidence Motion can only be introduced in the Lok Sabha (the lower house of Parliament), not the Rajya Sabha (upper house).  This is because the Council of Ministers is collectively responsible to the Lok Sabha.  The Lok Sabha can remove the government by passing a No-Confidence Motion, while the Rajya Sabha cannot.\n\n\nLok Sabha: The lower house of the Indian Parliament, directly elected by the people. It holds the power to remove the government through a No-Confidence Motion.\n\nRajya Sabha: The upper house of the Indian Parliament, representing the states.  It does not have the power to bring down the government.\n\nNo-Confidence Motion: A parliamentary motion expressing a lack of confidence in the government. If passed, it typically leads to the resignation or dismissal of the government.\n"
    },
    {
        "Q.No.": 64,
        "question_text": "With reference to Neem tree, consider the following statements:\n1. Neem oil can be used as a pesticide to control the proliferation of some species of insects and mites.\n2. Neem seeds are used in the manufacture of biofuels and hospital detergents.\n3. Neem oil has applications in pharmaceutical industry.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is correct. Neem oil is extracted from the seeds of the neem tree and contains various compounds with insecticidal and pesticidal properties.  These compounds disrupt the life cycle of insects and mites, making neem oil an effective natural pest control agent.\n\nStatement 2 is incorrect. While neem seeds can be used to produce biofuels, their use in hospital detergents is not a widely established application.  Neem oil, however, does have some antimicrobial properties and is used in certain soaps and cleaning products.\n\nStatement 3 is correct.  Neem oil and its extracts have various applications in the pharmaceutical industry.  Some of its medicinal uses include antibacterial, antifungal, and anti-inflammatory properties.  These properties are utilized in the creation of various medications and healthcare products.\n\nTherefore, only statements 1 and 3 are correct.\n\n\nNeem tree:  A tropical evergreen tree native to the Indian subcontinent, known for its medicinal and pesticidal properties.  Various parts of the tree, including its leaves, bark, seeds, and oil, are used in traditional medicine and modern applications.\n\nNeem oil: An oil extracted from neem seeds, possessing insecticidal, antifungal, antibacterial, and antiviral properties. It's used in agriculture as a natural pesticide and in various pharmaceutical and cosmetic products.\n\nBiofuels: Fuels produced from renewable biological sources, such as plants or animal waste.  They are considered a more sustainable alternative to fossil fuels.  Neem oil is considered a potential source for biofuel production.\n\nHospital detergents: Cleaning agents used in hospitals to maintain hygiene and prevent the spread of infections.  While neem has antimicrobial properties, its use in hospital detergents is limited.\n\nPharmaceutical industry: The industry involved in the research, development, manufacturing, and marketing of drugs and medications.  Neem's various medicinal properties make it a valuable resource for this industry.\n"
    },
    {
        "Q.No.": 65,
        "question_text": "Which one of the following is the process involved in photosynthesis?",
        "option_a": "Potential energy is released to form free energy",
        "option_b": "Free energy is converted into potential energy and stored",
        "option_c": "Food is oxidized to release carbon dioxide and water",
        "option_d": "Oxygen is taken, and carbon dioxide and water vapour are given out",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: Photosynthesis is the process by which green plants and some other organisms use sunlight to synthesize foods from carbon dioxide and water.  This process converts free energy (sunlight) into potential energy (stored in chemical bonds of sugars). Option (a) describes cellular respiration, the opposite of photosynthesis. Option (c) is also cellular respiration. Option (d) describes respiration.\n\nFree energy: Energy available to do work.\nPotential energy: Stored energy.\nPhotosynthesis: Process by which plants convert light energy into chemical energy.\nCellular respiration: Process by which cells break down glucose to release energy.\nOxidation: Loss of electrons.\n"
    },
    {
        "Q.No.": 66,
        "question_text": "In addition to fingerprint scanning, which of the following can be used in the biometric identification of a person?\n1. Iris scanning\n2. Retinal scanning\n3. Voice recognition\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: Fingerprint scanning is a biometric identification method.  Iris scanning uses patterns in the iris of the eye, retinal scanning uses the pattern of blood vessels in the retina, and voice recognition analyzes the unique characteristics of a person's voice.  All three are used for biometric identification, making option (d) correct.\n\nFingerprint scanning: A biometric technology that uses the unique patterns of ridges and valleys on a person's fingertips to identify individuals.  It's widely used for security and access control.\n\nIris scanning: A biometric technology that identifies individuals based on the unique patterns in the iris of their eyes. It's highly accurate and less prone to spoofing than fingerprint scanning.\n\nRetinal scanning: A biometric technology that scans the pattern of blood vessels in the retina of the eye for identification.  It's considered highly secure due to its uniqueness and difficulty in replication.\n\nVoice recognition: A biometric technology that uses the unique acoustic characteristics of a person's voice to verify their identity. It involves analyzing various aspects of speech, including pitch, tone, and rhythm.\n"
    },
    {
        "Q.No.": 67,
        "question_text": "Which of the following statements is/are correct regarding vegetative propagation of plants?\n1. Vegetative propagation produces clonal population.\n2. Vegetative propagation helps in eliminating the virus.\n3. Vegetative propagation can be practiced most of the year.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: Vegetative propagation is a method of asexual reproduction in plants where new plants are produced from vegetative parts like stems, roots, or leaves.\n\n1. **Vegetative propagation produces clonal populations:** This is true.  Since vegetative propagation involves asexual reproduction, the offspring are genetically identical to the parent plant, creating a clone.\n\n2. **Vegetative propagation helps in eliminating the virus:** This is false.  Viruses often infect the vegetative parts of plants used for propagation. Therefore, vegetative propagation can actually spread viral diseases to new plants.\n\n3. **Vegetative propagation can be practiced most of the year:** This is true, depending on the plant and the method used. Many methods of vegetative propagation can be carried out throughout the year in suitable climates, offering flexibility compared to sexual reproduction.\n\nTherefore, only statements 1 and 3 are correct.\n"
    },
    {
        "Q.No.": 68,
        "question_text": "Which of the following pairs is/are correctly matched?\n   Spacecraft                   Purpose\n1. Cassini-Huygens        :     Orbiting the Venus and transmitting data to the Earth\n2. Messenger              :     Mapping and investigating the Mercury\n3. Voyager 1 and 2        :     Exploring the outer solar system\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:\n\n* **Cassini-Huygens:** This spacecraft orbited Saturn, not Venus, and transmitted data back to Earth.  It studied Saturn's rings, moons, and atmosphere.  The Huygens probe landed on Titan, Saturn's largest moon.\n\n* **Messenger:** This spacecraft orbited Mercury and mapped its surface, studying its geology, composition, and magnetic field.\n\n* **Voyager 1 and 2:** These spacecraft explored the outer solar system, including Jupiter, Saturn, Uranus, and Neptune. Voyager 1 is now in interstellar space.\n\nTherefore, only statement 2 and 3 are correct.  Statement 1 is incorrect because Cassini-Huygens orbited Saturn, not Venus.\n"
    },
    {
        "Q.No.": 69,
        "question_text": "Consider the following pairs:\n   Region           Well-known for the production of\n1. Kinnaur     :    Areca nut\n2. Mewat       :    Mango\n3. Coromandel  :    Soya bean\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "d",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: Kinnaur is known for apples, not areca nuts. Mewat is not primarily known for mangoes. Coromandel Coast is associated with rice and other crops, not soybeans.  Therefore, none of the pairs are correctly matched.\n\nKinnaur: A district in Himachal Pradesh, India, located in the Himalayas.  Known for its apple orchards and scenic beauty.\n\nMewat: A region spanning parts of Haryana, Rajasthan, and Uttar Pradesh, India. Historically known for its pastoral communities and its unique cultural identity.\n\nCoromandel Coast: A stretch of coastline on the eastern side of the Indian peninsula. Historically significant for its ports and trade, and known for its rice cultivation.\n"
    },
    {
        "Q.No.": 70,
        "question_text": "Which of the following is/are the example/examples of chemical change?\n1. Crystallization of sodium chloride\n2. Melting of ice\n3. Souring of milk\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: A chemical change is a process where one or more substances are altered into one or more new and different substances.  \n\n1. Crystallization of sodium chloride is a physical change.  Sodium chloride (NaCl) simply transitions from a dissolved state to a solid crystalline structure; its chemical composition remains unchanged.\n\n2. Melting of ice is also a physical change. Ice (H₂O) changes from a solid to a liquid state, but the chemical formula remains the same.\n\n3. Souring of milk is a chemical change.  Bacteria in milk cause chemical reactions, breaking down lactose and proteins into different substances, resulting in a change of taste, smell, and texture.  This is a decomposition reaction and produces lactic acid, altering the milk's chemical composition.\n"
    },
    {
        "Q.No.": 71,
        "question_text": "The power of the Supreme Court of India to decide disputes between the Centre and the States falls under its",
        "option_a": "advisory jurisdiction",
        "option_b": "appellate jurisdiction",
        "option_c": "original jurisdiction",
        "option_d": "writ jurisdiction",
        "correct_option": "c",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:The Supreme Court of India's original jurisdiction, as defined in Article 131 of the Constitution, covers disputes between the Union (Centre) and one or more States; between the Union and any State(s) on one side and one or more other States on the other; or between two or more States.  This is distinct from its appellate jurisdiction (hearing appeals from lower courts), advisory jurisdiction (giving opinions on legal matters to the President), and writ jurisdiction (issuing writs to enforce fundamental rights).  Therefore, the power to decide Centre-State disputes falls under its original jurisdiction.\n\nThe Centre refers to the Union government of India.  States refer to the individual states that constitute the Indian federation.  Advisory jurisdiction involves the Supreme Court providing legal opinions, usually to the President, on matters of public importance.  Appellate jurisdiction refers to the court's power to review decisions made by lower courts. Writ jurisdiction allows the court to issue orders (writs) to protect fundamental rights.\n"
    },
    {
        "Q.No.": 72,
        "question_text": "Consider the following techniques/phenomena :\n1. Budding and grafting in fruit plants\n2. Cytoplasmic male sterility\n3. Gene silencing\nWhich of the above is/are used to create transgenic crops?",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "None",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation:Budding and grafting are traditional plant breeding techniques that do not involve genetic modification.  Cytoplasmic male sterility is a naturally occurring phenomenon used in hybrid seed production, but it is not a transgenic technique. Gene silencing, however, can be used in the creation of transgenic crops by suppressing the expression of specific genes.  Transgenic crops are those that have been genetically modified by introducing foreign DNA.  Therefore, only gene silencing is a technique used to create transgenic crops.\n\nBudding: A form of asexual reproduction in plants where a new plant develops from a bud on the parent plant.  It's a common propagation method for fruit trees and other plants.\n\nGrafting: A horticultural technique where a part of one plant (the scion) is joined to another plant (the rootstock) to create a single plant. It's used to combine desirable traits from different plants.\n\nCytoplasmic male sterility (CMS): A genetic system in plants where the male reproductive organs are non-functional, resulting in sterility. It's often used to produce hybrid seeds.\n\nGene silencing:  A process that regulates gene expression by reducing or eliminating the production of a specific protein. Techniques like RNA interference (RNAi) can be used to silence genes in transgenic plants.\n"
    },
    {
        "Q.No.": 73,
        "question_text": "Consider the following statements :\n1. Maize can be used for the production of starch.\n2. Oil extracted from maize can be a feedstock for biodiesel.\n3. Alcoholic beverages can be produced by using maize.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation:Maize, also known as corn, is a versatile crop with multiple uses.  Starch is a major component of maize kernels and is extracted for various industrial applications, making statement 1 correct. Maize oil, extracted from the germ of the maize kernel, can be processed into biodiesel, a renewable fuel, making statement 2 correct.  Finally, maize is a common grain used in the fermentation process to produce alcoholic beverages like beer and whiskey, making statement 3 correct. Therefore, all three statements are correct.\n"
    },
    {
        "Q.No.": 74,
        "question_text": "Among the following organisms, which one does not belong to the class of other three?",
        "option_a": "Crab",
        "option_b": "Mite",
        "option_c": "Scorpion",
        "option_d": "Spider",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: Crabs, mites, scorpions, and spiders all belong to the phylum Arthropoda.  However, crabs are crustaceans, while mites, scorpions, and spiders are arachnids.  Crustaceans and arachnids are distinct classes within the Arthropoda phylum.\n\nCrabs:  Decapod crustaceans characterized by a hard exoskeleton, ten legs, and typically a laterally compressed body.  They are found in diverse aquatic and semi-aquatic habitats.\n\nMites: Tiny arachnids with eight legs, found in various terrestrial and aquatic environments. Many are parasitic.\n\nScorpions: Arachnids with eight legs, a segmented body, and a venomous tail.  They are primarily terrestrial predators.\n\nSpiders: Arachnids with eight legs, a two-part body (cephalothorax and abdomen), and spinnerets for silk production. They are mostly terrestrial predators.\n"
    },
    {
        "Q.No.": 75,
        "question_text": "The power to increase the number of judges in the Supreme Court of India is vested in",
        "option_a": "the President of India",
        "option_b": "the Parliament",
        "option_c": "the Chief Justice of India",
        "option_d": "the Law Commission",
        "correct_option": "b",
        "subject": "polity",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: The Parliament has the power to increase the number of judges in the Supreme Court of India.  The President of India appoints the judges, but the number of judges is determined by Parliament.  The Chief Justice of India is the head of the Supreme Court, but doesn't have the power to change the number of judges. The Law Commission is an advisory body that makes recommendations on legal matters, but doesn't have the authority to alter the Supreme Court's composition.\n\nThe President of India is the head of state and has various executive, legislative, financial, judicial, diplomatic, and emergency powers.  The President appoints the Prime Minister, Supreme Court and High Court judges, and other key officials.  The Parliament is the legislative body of India, responsible for making laws.  The Chief Justice of India is the head of the Supreme Court and the highest judicial officer in the country. The Law Commission of India is a body that provides recommendations on legal reforms.\n"
    },
    {
        "Q.No.": 76,
        "question_text": "Consider the following towns of India:\n1. Bhadrachalam\n2. Chanderi\n3. Kancheepuram\n4. Karnal\nWhich of the above are famous for the production of traditional sarees/fabric?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "1, 3 and 4",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: Chanderi (Madhya Pradesh) and Kancheepuram (Tamil Nadu) are renowned for their traditional saree production.  Chanderi sarees are known for their lightweight, sheer texture, and use of silk and zari. Kancheepuram sarees are famous for their intricate silk weaving and vibrant colors.  Bhadrachalam (Telangana) is not primarily known for saree production, although the region has a rich textile history. Karnal (Haryana) is not significantly associated with traditional saree or fabric production. Therefore, only options 2 and 3 are correct.\n\nBhadrachalam: A town in Telangana, known for its significant religious importance as the site of the Bhadrachalam Temple dedicated to Lord Rama.\n\nChanderi: A town in Madhya Pradesh, famous for its exquisite Chanderi sarees, known for their delicate weaving and use of silk and zari.\n\nKancheepuram: A city in Tamil Nadu, renowned for its luxurious silk sarees, characterized by their intricate designs and vibrant colors.  The sarees are produced using traditional methods and are highly valued.\n\nKarnal: A city in Haryana, known for its agricultural significance and historical importance.  It is not primarily known for traditional saree or fabric production.\n"
    },
    {
        "Q.No.": 77,
        "question_text": "Consider the following pairs:\n   National Highway              Cities connected\n1. NH 4                          Chennai and Hyderabad\n2. NH 6                          Mumbai and Kolkata\n3. NH 15                         Ahmedabad and Jodhpur\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: Only NH 6 (Mumbai and Kolkata) is correctly matched.  NH 4 connects Mumbai and Chennai, not Chennai and Hyderabad. NH 15 connects Ahmedabad and Udaipur, not Ahmedabad and Jodhpur.\n\nNational Highway 4:  This highway, now largely superseded by other routes, historically connected Mumbai to Chennai.  Its route has been significantly altered and re-numbered over time.\n\nNational Highway 6: This highway connects Mumbai and Kolkata, traversing a significant portion of central and eastern India.\n\nNational Highway 15: This highway connects Ahmedabad to Udaipur.  The route has been altered and re-numbered in sections.  The current NH 15 does not connect to Jodhpur.\n"
    },
    {
        "Q.No.": 78,
        "question_text": "Consider the following international agreements :\n1. The International Treaty on Plant Genetic Resources for Food and Agriculture\n2. The United Nations Convention to Combat Desertification\n3. The World Heritage Convention\nWhich of the above has/have a bearing on the biodiversity?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation:The International Treaty on Plant Genetic Resources for Food and Agriculture (ITPGRFA) directly addresses plant genetic resources, a crucial component of biodiversity.  The United Nations Convention to Combat Desertification (UNCCD) focuses on land degradation, which significantly impacts biodiversity by reducing habitats and species populations. The World Heritage Convention, while encompassing cultural sites, also protects many natural areas of high biodiversity value, including ecosystems and species.  Therefore, all three agreements have a bearing on biodiversity.\n\nShort notes:\n\n* **International Treaty on Plant Genetic Resources for Food and Agriculture (ITPGRFA):** A legally binding international treaty aiming to ensure the conservation and sustainable use of plant genetic resources for food and agriculture.  It emphasizes fair and equitable sharing of benefits arising from their use.\n\n* **United Nations Convention to Combat Desertification (UNCCD):** An international agreement focused on combating desertification and mitigating the effects of drought.  Land degradation, a key aspect of desertification, directly affects biodiversity by destroying habitats and impacting species.\n\n* **World Heritage Convention:** An international treaty promoting the identification, protection, and conservation of cultural and natural heritage sites considered to be of outstanding universal value. Many World Heritage sites are crucial for biodiversity conservation.  \n\n* **Biodiversity:** The variability among living organisms from all sources, including terrestrial, marine, and other aquatic ecosystems, encompassing diversity within and between species and ecosystems.  It's essential for ecosystem stability and human well-being.\n"
    },
    {
        "Q.No.": 79,
        "question_text": "Consider the following statements regarding ‘Earth Hour’:\n1. It is an initiative of UNEP and UNESCO.\n2. It is a movement in which the participants switch off the lights for one hour on a certain day every year.\n3. It is a movement to raise the awareness about the climate change and the need to save the planet.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 3 only",
        "option_b": "2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation:\n\nStatement 1 is incorrect. Earth Hour is an initiative of the World Wide Fund for Nature (WWF), not UNEP and UNESCO.\n\nStatement 2 is correct. Earth Hour is a worldwide movement organized by WWF where individuals, businesses, and governments are urged to turn off non-essential lights and electrical appliances for one hour to raise awareness about climate change.\n\nStatement 3 is correct.  The primary goal of Earth Hour is to raise awareness about climate change and the need for collective action to protect the planet.\n\n\n**Short Notes on Named Entities:**\n\n* **UNEP (United Nations Environment Programme):**  A leading global environmental agency within the UN system.  It works to address environmental challenges through various programs, advocacy, and international cooperation.\n\n* **UNESCO (United Nations Educational, Scientific and Cultural Organization):** A specialized agency of the UN focused on education, science, culture, and communication. It promotes international collaboration in these fields and works to protect world heritage sites.\n\n* **WWF (World Wide Fund for Nature):** A global non-governmental organization working to conserve nature and reduce the impact of human activities on the environment. It runs numerous conservation projects and campaigns worldwide.\n"
    },
    {
        "Q.No.": 80,
        "question_text": "Which one of the following is the correct sequence of a food chain?",
        "option_a": "Diatoms-Crustaceans-Herrings",
        "option_b": "Crustaceans-Diatoms-Herrings",
        "option_c": "Diatoms-Herrings-Crustaceans",
        "option_d": "Crustaceans-Herrings-Diatoms",
        "correct_option": "a",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: Diatoms are microscopic algae that are primary producers in aquatic food chains. Crustaceans are small invertebrates that feed on diatoms. Herrings are fish that feed on crustaceans.  Therefore, the correct sequence is diatoms → crustaceans → herrings.  The other options present incorrect feeding relationships.\n"
    },
    {
        "Q.No.": 81,
        "question_text": "The Partition of Bengal made by Lord Curzon in 1905 lasted until",
        "option_a": "the First World War when Indian troops were needed by the British and the partition was ended",
        "option_b": "King George V abrogated Curzon's Act at the Royal Durbar in Delhi in 1911",
        "option_c": "Gandhiji launched his Civil Disobedience Movement",
        "option_d": "the Partition of India in 1947 when East Bengal became East Pakistan",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: The Partition of Bengal, implemented by Lord Curzon in 1905, was annulled by King George V at the Royal Durbar in Delhi in 1911.  This decision reversed the earlier partition of Bengal into East Bengal and Assam, and West Bengal and Bihar.\n\nLord Curzon:  Served as Viceroy and Governor-General of India from 1899 to 1905. Known for his administrative reforms and ambitious projects, including the partition of Bengal.\n\nKing George V: King of the United Kingdom and the British Dominions, and Emperor of India from 1910 to 1936. His presence at the Delhi Durbar in 1911 signified the importance of the event.\n\nRoyal Durbar: A formal court held by a monarch or other high-ranking official, often involving elaborate ceremonies and displays of power. The 1911 Delhi Durbar marked the coronation durbar of George V as Emperor of India.\n\nGandhiji:  Mohandas Karamchand Gandhi, a leader of the Indian independence movement known for his philosophy of satyagraha (nonviolent resistance).  His Civil Disobedience Movement began later, in 1930.\n\nPartition of India: The division of British India in 1947 which led to the creation of independent India and Pakistan.  East Bengal became East Pakistan (later Bangladesh).\n\nSwadeshi Movement: A nationalist movement in India in the early 20th century that promoted the use of Indian-made goods to boycott British products.  It was a significant response to the Partition of Bengal.\n\nFirst World War: A global war that lasted from 1914 to 1918. While Indian troops fought in the war, this did not directly lead to the annulment of the Bengal partition.\n"
    },
    {
        "Q.No.": 82,
        "question_text": "The 1929 Session of Indian National Congress is of significance in the history of the Freedom Movement because the",
        "option_a": "attainment of Self-Government was declared as the objective of the Congress",
        "option_b": "attainment of Poorna Swaraj was adopted as the goal of the Congress",
        "option_c": "Non-Cooperation Movement was launched",
        "option_d": "decision to participate in the Round Table Conference in London was taken",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation: The 1929 Lahore Session of the Indian National Congress is historically significant because it was at this session that the attainment of Poorna Swaraj (complete self-rule) was adopted as the goal of the Congress.  \n\nThe Indian National Congress (INC) was a major political party in India that played a crucial role in the Indian independence movement.  The Non-Cooperation Movement was launched in 1920, not in 1929. The decision to participate in the Round Table Conferences was made in later years.  Poorna Swaraj refers to complete independence from British rule, a goal that was officially adopted at the Lahore session.\n"
    },
    {
        "Q.No.": 83,
        "question_text": "With reference to the famous Sattriya dance, consider the following statements :\n1. Sattriya is a combination of music, dance and drama.\n2. It is a centuries-old living tradition of Vaishnavites of Assam.\n3. It is based on classical Ragas and Talas of devotional songs composed by Tulsidas, Kabir and Mirabai.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is correct. Sattriya is a classical Indian dance form that combines music, dance, and drama.  Statement 2 is also correct. It's an ancient tradition associated with the Vaishnavite monasteries of Assam.  Statement 3 is incorrect. While Sattriya uses classical ragas and talas, the devotional songs it's based on are primarily composed by the 15th-17th century Assamese Vaishnava saint, Srimanta Sankaradeva, and his followers, not Tulsidas, Kabir, and Mirabai.  Therefore, only statements 1 and 2 are correct.\n\nSattriya: A classical dance form of Assam, India, characterized by its graceful movements, expressive gestures, and devotional themes. It is deeply rooted in the Vaishnava faith and is performed to the accompaniment of music and songs.\n\nVaishnavites of Assam: Followers of the Vaishnava sect of Hinduism, predominantly found in Assam.  Their religious practices and beliefs significantly influenced the development of Sattriya dance.\n\nTulsidas: A prominent Hindi poet and saint known for his epic Ramcharitmanas, a devotional work narrating the life of Lord Rama.\n\nKabir: A 15th-century mystic poet and saint known for his profound spiritual verses that blended elements of Hinduism and Islam.\n\nMirabai: A 16th-century Rajput princess and mystic poet known for her passionate devotional songs dedicated to Lord Krishna.\n"
    },
    {
        "Q.No.": 84,
        "question_text": "Chaitra 1 of the national calendar based on the Saka Era corresponds to which one of the following dates of the Gregorian calendar in a normal year of 365 days?",
        "option_a": "22nd March (or 21st March)",
        "option_b": "15th May (or 16th May)",
        "option_c": "31st March (or 30th March)",
        "option_d": "21st April (or 20th April)",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation:Chaitra 1 of the Saka calendar typically corresponds to March 22nd or 21st in the Gregorian calendar.  The Saka Era is a lunisolar calendar, meaning it's based on both the moon and the sun, and its starting point is different from the Gregorian calendar, leading to a difference in the dates.  The Gregorian calendar is the solar calendar used internationally.  A normal year in the Gregorian calendar has 365 days.\n"
    },
    {
        "Q.No.": 85,
        "question_text": "With reference to the Indian history of art and culture, consider the following pairs:\n   Famous work of sculpture                                              Site\n1. A grand image of Buddha's Mahaparinirvana with numerous\n   celestial musicians above and the sorrowful figures of\n   his followers below                                              :    Ajanta\n2. A huge image of Varaha Avatar (boar incarnation) of Vishnu,\n   as he rescues Goddess Earth from the deep and chaotic waters,\n   sculpted on rock                                                 :    Mount Abu\n3. \"Arjuna's Penance\"/ \"Descent of Ganga\" sculpted on the surface\n   of huge boulders                                                 :    Mamallapuram\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nPair 1 is incorrectly matched. The Mahaparinirvana of Buddha is located in Kushinagar, Uttar Pradesh, not Ajanta. Ajanta is famous for its cave paintings.\n\nPair 2 is correctly matched. The Varaha Avatar sculpture at Mount Abu is a significant example of rock-cut sculpture.\n\nPair 3 is correctly matched. The Arjuna's Penance/Descent of Ganga relief is located in Mamallapuram, Tamil Nadu.\n\n\nShort notes on named entities:\n\n**Mahaparinirvana:**  The death and entrance into final Nirvana of the Buddha.  It is a significant event in Buddhism, often depicted in art.\n\n**Buddha:** The founder of Buddhism, considered enlightened and a spiritual teacher.  His life and teachings are central to Buddhist art and philosophy.\n\n**Ajanta:** A site in Maharashtra famous for its rock-cut cave temples with exquisite Buddhist paintings.  The paintings depict scenes from the Jataka tales and the life of Buddha.\n\n**Varaha Avatar:** The boar incarnation of the Hindu god Vishnu. He rescues the Earth goddess from the primordial waters, a popular theme in Hindu art.\n\n**Mount Abu:** A hill station in Rajasthan, known for its stunning natural beauty and significant temples and monuments, including the Dilwara Jain temples and the Varaha sculpture.\n\n**Arjuna's Penance:** A massive rock relief at Mamallapuram depicting a scene from the Mahabharata epic, showcasing the skill of Pallava sculptors.  It's also known as the Descent of the Ganges.\n\n**Mamallapuram:**  A town in Tamil Nadu, also known as Mahabalipuram, renowned for its ancient rock-cut temples and sculptures from the Pallava period.  The site showcases exceptional craftsmanship.\n"
    },
    {
        "Q.No.": 86,
        "question_text": "The Ghadr (Ghadar) was a",
        "option_a": "revolutionary association of Indians with headquarters at San Francisco",
        "option_b": "nationalist organization operating from Singapore",
        "option_c": "militant organization with headquarters at Berlin",
        "option_d": "communist movement for India's freedom with headquarters at Tashkent",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: The Ghadr (Ghadar) Party was a revolutionary association of Indians, primarily Sikhs and Punjabi Muslims from British India, with its headquarters in San Francisco.  It aimed to overthrow British rule in India through armed revolt.  Other entities mentioned:  Singapore, Berlin, and Tashkent are locations that were not associated with the Ghadr Party's headquarters.  A nationalist organization operating from Singapore or a militant organization based in Berlin are not accurate descriptions of the Ghadr Party.  A communist movement for India's freedom with headquarters at Tashkent is also inaccurate.\n"
    },
    {
        "Q.No.": 87,
        "question_text": "With reference to India's culture and tradition, what is ‘Kalaripayattu’?",
        "option_a": "It is an ancient Bhakti cult of Shaivism still prevalent in some parts of South India",
        "option_b": "It is an ancient style bronze and brasswork still found in southern part of Coromandel area",
        "option_c": "It is an ancient form of dance-drama and a living tradition in the northern part of Malabar",
        "option_d": "It is an ancient martial art and a living tradition in some parts of South India",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: Kalaripayattu is an ancient martial art and a living tradition in some parts of South India.  It is not a Bhakti cult, a style of metalwork, or a dance-drama form primarily found in the northern Malabar region.\n\nBhakti: Bhakti refers to devotional worship, a prominent feature of Hinduism.  Various Bhakti movements flourished across India, emphasizing personal devotion to a chosen deity.  Shaivism is a sect of Hinduism that worships Shiva as the supreme god.\n\nMalabar: Malabar is a historical region on the southwestern coast of India, known for its diverse culture and history. It encompasses parts of present-day Kerala.\n\nCoromandel Coast: The Coromandel Coast is a stretch of southeastern India, known for its historical significance and trade.  Bronze and brasswork are traditional crafts found in many parts of India.\n"
    },
    {
        "Q.No.": 88,
        "question_text": "Consider the following pairs:\n1. Garba        : Gujarat\n2. Mohiniattam  : Odisha\n3. Yakshagana   : Karnataka\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (c)\nexplanation: Garba is a folk dance form of Gujarat.  Yakshagana is a traditional theatre form of Karnataka. Mohiniattam, however, is a classical dance form of Kerala, not Odisha. Therefore, only pairs 1 and 3 are correctly matched.\n\nGarba: A vibrant folk dance from Gujarat, often performed during the Navratri festival. It involves circular movements and rhythmic clapping, accompanied by devotional songs.\n\nMohiniattam: A graceful and expressive classical dance form originating from Kerala. Known for its fluid movements, delicate gestures, and storytelling narratives.\n\nYakshagana: A traditional theatre form from Karnataka, characterized by elaborate costumes, makeup, and stylized acting. It incorporates dance, music, and dialogue, often depicting mythological stories.\n"
    },
    {
        "Q.No.": 89,
        "question_text": "With reference to Buddhist history, tradition and culture in India, consider the following pairs:\n   Famous shrine            Location\n1. Tabo monastery       :   Spiti Valley and temple complex\n2. Lhotsava Lhakhang    :   Zanskar Valley temple, Nako\n3. Alchi temple         :   Ladakh complex\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (c)\n\nexplanation:\n\n1. **Tabo monastery:** Located in the Spiti Valley, Himachal Pradesh.  It's a significant Buddhist monastery known for its ancient murals and architecture, showcasing a blend of Tibetan and Indian styles.  It's a complex of temples and structures, reflecting centuries of Buddhist artistic and architectural tradition.\n\n2. **Lhotsava Lhakhang:** This is incorrectly matched. While Lhotsava Lhakhang is indeed a temple, it's located in the Nako village in Himachal Pradesh's Kinnaur district, not in Zanskar Valley.  It's a significant Buddhist structure in the Spiti region.\n\n3. **Alchi temple:** Situated in the Alchi village of Ladakh, Jammu and Kashmir. This Buddhist temple complex is renowned for its unique architecture and exquisite murals, demonstrating a fascinating fusion of Indian and Tibetan artistic styles within a secluded Himalayan setting.  It's a key example of Ladakh's rich Buddhist heritage.\n\n\nTherefore, only pair 1 and 3 are correctly matched.\n"
    },
    {
        "Q.No.": 90,
        "question_text": "Consider the following statements:\n1. ‘Bijak’ is a composition of the teachings of Saint Dadu Dayal.\n2. The Philosophy of Pushti Marg was propounded by Madhvacharya.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  The *Bijak* is a collection of the teachings and sayings of Saint Dadu Dayal, a prominent figure in the Sant tradition of North India.  Dadu Dayal's philosophy emphasized a direct and personal experience of God, rejecting ritualistic practices and caste distinctions.  His teachings are known for their simplicity and accessibility.\n\nStatement 2 is incorrect.  The *Pushti Marg* philosophy was propounded by Vallabhacharya, not Madhvacharya.  Vallabhacharya was a prominent figure in the Vaishnava tradition, and the Pushti Marg emphasizes devotion (bhakti) and the grace of Krishna. Madhvacharya, on the other hand, was a prominent Dvaita Vedanta philosopher who emphasized the distinction between God and the individual soul.\n\n\n"
    },
    {
        "Q.No.": 91,
        "question_text": "A community of people called Manganiyars is well-known for their",
        "option_a": "martial arts in North-East India",
        "option_b": "musical tradition in North-West India",
        "option_c": "classical vocal music in South India",
        "option_d": "pietra dura tradition in Central India",
        "correct_option": "b",
        "subject": "geography",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation: The Manganiyars are a community in North-West India renowned for their musical tradition.  Their music is a vibrant part of the region's cultural heritage.\n\nMartial arts (a):  Martial arts are systems and traditions of combat.  Many cultures have developed unique forms of martial arts, often reflecting their history and environment.\n\nClassical vocal music in South India (c): South India has a rich tradition of classical vocal music, with distinct styles and schools.  Carnatic music is a prominent example.\n\nPietra dura tradition in Central India (d): Pietra dura is an inlay technique using semiprecious stones to create decorative patterns, often seen in Mughal-era architecture and crafts.\n"
    },
    {
        "Q.No.": 92,
        "question_text": "What was/were the object/objects of Queen Victoria's Proclamation (1858)?\n1. To disclaim any intention to annex Indian States\n2. To place the Indian administration under the British Crown 3.\nTo regulate East India Company's trade with India\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2014,
        "explanation": "correct_option: (a)\n\nexplanation: Queen Victoria's Proclamation of 1858 aimed to formally transfer the administration of India from the East India Company to the British Crown (abolishing the company's rule) and to assure the Indian princes that the British government did not intend to annex their territories.  While the proclamation did address the administration of India and the relationship with Indian states, it did not directly regulate the East India Company's trade with India; that was already largely controlled by the British government.\n\n**Short Notes:**\n\n* **Queen Victoria:** Queen of the United Kingdom of Great Britain and Ireland from 1837 to 1901. Her reign, the longest of any British monarch, was marked by significant industrial, technological, and imperial expansion.  The Proclamation of 1858 was a key event in the shaping of British rule in India.\n\n* **Queen Victoria's Proclamation (1858):**  Issued after the Sepoy Mutiny of 1857, this proclamation transferred governing power in India from the East India Company to the British Crown. It aimed to quell unrest by promising religious tolerance and a more just administration.\n\n* **East India Company:** A powerful British trading company that gradually assumed political control over large parts of India.  Its rule ended with the 1857 rebellion and the subsequent proclamation.\n\n* **Indian States/Princely States:**  Numerous independent kingdoms and territories in India that existed alongside British-administered provinces.  The proclamation affirmed their continued existence under British paramountcy.\n\n* **Paramountcy:** The position of supreme authority held by the British Crown over the Indian princely states.  While the states retained internal autonomy, they were ultimately subordinate to British rule.\n\n* **Sepoy Mutiny of 1857 (also known as the First War of Independence or the Indian Rebellion of 1857):** A major uprising against the British East India Company's rule in India.  It was a pivotal event leading to significant changes in British administration and policy in India.\n"
    },
    {
        "Q.No.": 93,
        "question_text": "Ibadat Khana at Fatehpur Sikri was",
        "option_a": "the mosque for the use of Royal Family",
        "option_b": "Akbar's private prayer chamber",
        "option_c": "the hall in which Akbar held discussions with scholars of various religions",
        "option_d": "the room in which the nobles belonging to different religions gathered to discuss religious affairs",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2014,
        "explanation": "correct_option: (c)\n\nexplanation:The Ibadat Khana at Fatehpur Sikri was a hall where Akbar held discussions with scholars of various religions.  Akbar, the Mughal emperor, was known for his religious tolerance and his interest in different faiths.  He initiated these discussions in the Ibadat Khana to foster understanding and debate among religious leaders from various backgrounds, including Islam, Hinduism, Jainism, Zoroastrianism, and Christianity.  Fatehpur Sikri itself was a city built by Akbar as his capital.\n\n**Short notes on named entities:**\n\n* **Ibadat Khana:**  A building in Fatehpur Sikri,  it served as a place for Akbar to engage in religious discussions and debates with scholars from diverse religious traditions. It was not a mosque, a private prayer chamber, or exclusively for nobles.\n\n* **Fatehpur Sikri:** A city in Uttar Pradesh, India, built by Mughal emperor Akbar in the late 16th century. It served as his capital for a time and is known for its impressive architecture and blend of architectural styles.\n\n* **Akbar:** The third Mughal emperor, known for his religious tolerance, administrative reforms, and architectural achievements. His reign is considered a golden age in Mughal history.  He fostered debates on religious matters, aiming for harmony among different religious communities.\n\n* **Abul Fazl:** A scholar and advisor to Akbar, he was instrumental in promoting Akbar's policies of religious tolerance and compiled the Ain-i-Akbari, a detailed account of Akbar's reign.\n\n"
    },
    {
        "Q.No.": 94,
        "question_text": "In the context of food and nutritional security of India, enhancing the ‘Seed Replacement Rates’ of various crops helps in achieving the food production targets of the future. But what is/are the constraint/ constraints in its wider/greater implementation?\n1. There is no National Seeds Policy in place.\n2. There is no participation of private sector seed companies in the supply of quality seeds of vegetables and planting materials of horticultural crops.\n3. There is a demand-supply gap regarding quality seeds in case of low value and high volume crops.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "3 only",
        "option_c": "2 and 3",
        "option_d": "None",
        "correct_option": "b",
        "subject": "economy",
        "year": 2014,
        "explanation": "correct_option: (b)\nexplanation:The constraints in wider implementation of enhancing Seed Replacement Rates are primarily related to the availability of quality seeds.  Option 1 is incorrect because while the absence of a robust National Seeds Policy might contribute to challenges, it's not the primary constraint. Option 2 is also incorrect because private sector participation is mentioned as a potential solution to the seed supply problem, not as a constraint.  The core issue highlighted is the demand-supply gap for quality seeds, especially for low-value, high-volume crops (option 3).  This gap directly impacts farmers' ability to adopt improved seeds and achieve higher yields.\n\n**Short notes on keywords and named entities:**\n\n* **Seed Replacement Rates:** The frequency with which farmers replace their seeds with new ones. Higher rates generally lead to improved crop yields and resilience.\n\n* **Food and Nutritional Security of India:**  Ensuring that all citizens have access to sufficient, safe, and nutritious food.  This involves various aspects, including production, distribution, and affordability.\n\n* **National Seeds Policy:** A comprehensive policy framework that governs seed production, distribution, and quality control in a country.  It can guide the development of the seed sector and ensure its alignment with national food security goals.  (Note: The text does not provide details on whether a policy existed at the time).\n\n* **Private sector seed companies:** Companies involved in the commercial production and sale of seeds. Their participation is crucial for efficient seed supply chains and innovation in seed technology.\n\n* **Low-value and high-volume crops:** Crops that have a low market price per unit but are cultivated on a large scale.  These often face challenges in terms of seed supply and farmer adoption of improved varieties due to low profit margins.\n\n* **Demand-supply gap:** A situation where the demand for a particular good or service (in this case, quality seeds) exceeds the available supply.  This leads to shortages and higher prices.\n\n\n"
    },
    {
        "Q.No.": 95,
        "question_text": "With reference to ‘Eco-Sensitive Zones’, which of the following statements is/are correct?\n1. Eco-Sensitive Zones are the areas that are declared under the Wildlife (Protection) Act, 1972.\n2. The purpose of the declaration of Eco-Sensitive Zones is to prohibit all kinds of human activities in those zones except agriculture.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: Eco-Sensitive Zones (ESZs) are declared under the Environment (Protection) Act, 1986, not the Wildlife (Protection) Act, 1972.  Statement 1 is incorrect.  The purpose of ESZs is not to prohibit *all* human activities, but to regulate them to minimize the negative impact on the environment.  Agriculture is often permitted, but with restrictions.  Therefore, statement 2 is also incorrect.  The correct answer is (d) Neither 1 nor 2.\n\nWildlife (Protection) Act, 1972: This act provides for the protection of wild animals, birds and plants.  It establishes schedules of protected species and their conservation.\n\nEnvironment (Protection) Act, 1986:  This act gives the central government the power to protect and improve the environment.  It allows for the setting of environmental standards, regulations, and the declaration of ESZs.\n\nEco-Sensitive Zones (ESZs):  These are areas notified by the government around protected areas like national parks and sanctuaries to act as a buffer zone.  The goal is to regulate activities that could harm the protected area.  The regulations vary depending on the specific ESZ.\n"
    },
    {
        "Q.No.": 96,
        "question_text": "Consider the following statements :\n1. Animal Welfare Board of India is established under the Environment (Protection) Act, 1986.\n2. National Tiger Conservation Authority is a statutory body.\n3. National Ganga River Basin Authority is chaired by the Prime Minister.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "2 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. The Animal Welfare Board of India is established under Section 4 of the Prevention of Cruelty to Animals Act, 1960, not the Environment (Protection) Act, 1986.\n\nStatement 2 is correct. The National Tiger Conservation Authority (NTCA) is a statutory body established under the Wildlife (Protection) Act, 1972.  It is responsible for overseeing tiger conservation efforts in India.\n\nStatement 3 is correct. The National Ganga River Basin Authority (NGRBA) is chaired by the Prime Minister of India. It is responsible for the rejuvenation of the Ganga river.\n\n\n**Short Notes:**\n\n* **Animal Welfare Board of India:**  A statutory body in India responsible for promoting animal welfare and preventing cruelty to animals.  It advises the government on animal welfare matters and enforces relevant laws.\n\n* **Environment (Protection) Act, 1986:**  A landmark environmental law in India that provides the framework for environmental protection and pollution control.  It gives the central government the power to set environmental standards and take action against polluters.\n\n* **National Tiger Conservation Authority (NTCA):** A statutory body established under the Wildlife (Protection) Act, 1972, to oversee the conservation of tigers in India. It works to protect tiger habitats and populations and coordinates conservation efforts across the country.\n\n* **Wildlife (Protection) Act, 1972:**  A comprehensive law in India that protects wildlife and their habitats. It prohibits the hunting and trade of endangered species and provides for the establishment of protected areas like national parks and sanctuaries.\n\n* **National Ganga River Basin Authority (NGRBA):**  A statutory body in India responsible for the comprehensive planning and management of the Ganga river basin. Its aim is to improve the river's water quality and overall ecological health.\n\n* **Prevention of Cruelty to Animals Act, 1960:**  An act of the Parliament of India that aims to prevent the infliction of unnecessary pain or suffering on animals.  It outlines various provisions to protect animals from cruelty.\n"
    },
    {
        "Q.No.": 97,
        "question_text": "Consider the following pairs :\n   Vitamin Deficiency           Disease\n1. Vitamin C            :       Scurvy\n2. Vitamin D            :       Rickets\n3. Vitamin E            :       Night blindness\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: Vitamin C deficiency causes scurvy. Vitamin D deficiency causes rickets. Night blindness is caused by Vitamin A deficiency, not Vitamin E.  Therefore, only pairs 1 and 2 are correctly matched.\n\nVitamin C:  Also known as ascorbic acid, it's a water-soluble vitamin crucial for collagen synthesis, immune function, and iron absorption. Deficiency leads to scurvy, characterized by bleeding gums, weakness, and skin problems.\n\nVitamin D: A fat-soluble vitamin vital for calcium absorption and bone health.  Deficiency in children causes rickets, leading to bone softening and deformities. In adults, it can cause osteomalacia.\n\nVitamin E: A fat-soluble antioxidant that protects cell membranes from damage. While it plays a role in overall health, its deficiency doesn't directly cause night blindness.  Night blindness is primarily linked to Vitamin A deficiency.\n"
    },
    {
        "Q.No.": 98,
        "question_text": "There is some concern regarding the nanoparticles of some chemical elements that are used by the industry in the manufacture of various products. Why?\n1. They can accumulate in the environment, and contaminate water and soil.\n2. They can enter the food chains.\n3. They can trigger the production of free radicals.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (d)\nexplanation: Nanoparticles of chemical elements used in industry are a concern for several reasons.  They can accumulate in the environment, contaminating water and soil (1). This contamination can then lead to nanoparticles entering the food chain (2), potentially causing bioaccumulation and biomagnification.  Furthermore, nanoparticles can trigger the production of free radicals (3), which are highly reactive molecules that can damage cells and tissues, leading to various health problems.  Therefore, all three statements are valid concerns.\n\n**Short notes on keywords and named entities:**\n\n* **Nanoparticles:**  Extremely small particles with at least one dimension less than 100 nanometers (nm).  Their small size gives them unique properties compared to larger particles of the same material, leading to a wide range of applications but also potential risks.\n\n* **Chemical elements:**  Pure substances consisting of only one type of atom. Many chemical elements, in nanoparticle form, are used in various industrial applications.\n\n* **Industry:** The sector of an economy concerned with the production of goods.  Industrial processes often involve the use of nanoparticles due to their unique properties.\n\n* **Free radicals:** Unstable molecules with unpaired electrons, making them highly reactive.  They can damage cells and DNA, contributing to aging and various diseases.  Nanoparticles can increase the production of free radicals in biological systems.\n\n* **Food chains:**  The interconnected network of organisms where energy and nutrients are transferred from one organism to another through consumption.  The entry of nanoparticles into food chains can have cascading effects on the entire ecosystem.\n\n* **Bioaccumulation:** The gradual accumulation of substances, such as nanoparticles, in the tissues of organisms over time.\n\n* **Biomagnification:** The increasing concentration of substances as they move up the food chain, leading to higher levels in top predators.\n\n* **Water and soil contamination:** The presence of harmful substances in water bodies and soil, which can negatively impact ecosystems and human health. Nanoparticles can contribute to this contamination.\n"
    },
    {
        "Q.No.": 99,
        "question_text": "Which of the following organizations brings out the publication known as World Economic Outlook?",
        "option_a": "The International Monetary Fund",
        "option_b": "The United Nations Development Programme",
        "option_c": "The World Economic Forum",
        "option_d": "The World Bank",
        "correct_option": "a",
        "subject": "environment",
        "year": 2014,
        "explanation": "correct_option: (a)\nexplanation: The World Economic Outlook is a publication of the International Monetary Fund (IMF).  The IMF is an international organization that works to foster global monetary cooperation, secure financial stability, facilitate international trade, promote high employment and sustainable economic growth, and reduce poverty around the world.\n\nThe United Nations Development Programme (UNDP) is a UN agency that works to improve living standards, reduce poverty, and promote sustainable development. The World Economic Forum (WEF) is an independent international organization committed to improving the state of the world by engaging business, political, academic, and other leaders of society to shape global, regional, and industry agendas. The World Bank is an international financial institution that provides loans and grants to the governments of low- and middle-income countries for the purpose of pursuing capital projects.\n"
    },
    {
        "Q.No.": 100,
        "question_text": "With reference to Union Budget, which of the following is/are covered under Non-Plan Expenditure?\n1. Defence expenditure\n2. Interest payments\n3. Salaries and pensions\n4. Subsidies\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2, 3 and 4",
        "option_d": "None",
        "correct_option": "c",
        "subject": "economy",
        "year": 2014,
        "explanation": "* **correct_option:** (c)\n* **explanation:**  Non-Plan Expenditure in the Union Budget refers to government spending that is not part of the planned development programs.  The provided text shows that Defence expenditure, interest payments, salaries and pensions, and subsidies are all considered non-plan expenditure.  Therefore, options 1, 2, 3, and 4 are all covered under Non-Plan Expenditure.\n\n**Short notes on keywords and named entities:**\n\n* **Union Budget:**  The annual financial statement presented to the Indian Parliament, outlining the government's estimated receipts and expenditures for the fiscal year. It is mandated by Article 112 of the Constitution of India.  The budget is divided into revenue and capital budgets and further categorized into plan and non-plan expenditures.\n\n* **Non-Plan Expenditure:**  Government spending not directly related to planned development projects. It includes essential services like defense, salaries, pensions, and interest payments on loans. This category is in contrast to Plan Expenditure, which is allocated for development initiatives.\n\n* **Plan Expenditure:**  Government spending allocated for planned developmental programs and projects, aiming for economic growth and social development.  The distinction between Plan and Non-Plan expenditure has been blurred in recent years.\n\n* **Defence expenditure:**  The portion of the Union Budget allocated to the country's defense forces, covering salaries, equipment purchases, and operational costs.  It is a significant component of Non-Plan Expenditure.\n\n* **Interest payments:**  The amount the government pays annually on its borrowings (both internal and external).  A major part of Non-Plan Expenditure, reflecting the government's debt burden.\n\n* **Salaries and pensions:**  Expenditure on salaries for government employees at all levels and pension payments to retired personnel.  These constitute a substantial part of Non-Plan Expenditure.\n\n* **Subsidies:**  Financial assistance provided by the government to certain sectors or groups to lower the cost of goods or services.  Examples include fertilizer subsidies and food subsidies.  This is a component of Non-Plan Expenditure.\n\n* **Article 112 of the Constitution:** This article mandates the presentation of the Annual Financial Statement (budget) to the Parliament by the government.  It outlines the procedures and requirements for the budget process.\n\n* **Department of Economic Affairs (DEA):** The nodal body within the Ministry of Finance, responsible for preparing the Union Budget.  It plays a crucial role in the formulation of economic policies and financial management.\n\n* **Finance Bill:** A Money Bill that includes the taxation proposals of the Union Budget.  It needs to be passed by both houses of Parliament for the tax proposals to become law.\n\n* **Amrit Kaal:** A term referring to the next 25 years of India's development journey (from 2022-2047), focusing on transformative opportunities.  This is a vision for India's future as outlined in the budget.\n\n* **FRBM Act:** The Fiscal Responsibility and Budget Management Act, 2003, aims to improve fiscal discipline and transparency in government finances.  It mandates the presentation of various fiscal policy statements along with the Union Budget.\n\n* **Saptrishi:**  Seven guiding principles for Budget 2023-24, signifying the government's priorities for inclusive development.  It's a symbolic representation of the budget's core themes.\n\n\n"
    }
]