[
    {
        "q_num": 1,
        "question_text": "What will follow if a Money Bill is substantially amended by the Rajya Sabha?",
        "option_a": "The Lok Sabha may still proceed with the Bill, accepting or not accepting the recommendations of the Rajya Sabha",
        "option_b": "The Lok Sabha cannot consider the Bill further",
        "option_c": "The Lok Sabha may send the Bill to the Rajya Sabha for reconsideration",
        "option_d": "The President may call a joint sitting for passing the Bill",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation:A Money Bill can only be introduced in the Lok Sabha (Lower House).  The Rajya Sabha (Upper House) cannot reject a Money Bill, but it can only make recommendations within 14 days of receiving it. The Lok Sabha can then choose to accept or reject these recommendations. If the Lok Sabha doesn't return the bill to the Rajya Sabha within 14 days, the bill is deemed to have been passed in its original form.  Therefore, the Lok Sabha can send the bill back to the Rajya Sabha for reconsideration if it chooses to do so.\n\n\nLok Sabha: The lower house of the Indian Parliament, possessing more power than the Rajya Sabha in financial matters.  It's primarily responsible for initiating and passing Money Bills.\n\nRajya Sabha: The upper house of the Indian Parliament.  While it can review and recommend amendments to Money Bills, it cannot ultimately reject them.\n\nMoney Bill: A bill that deals primarily with matters related to taxation, government spending, and borrowing.  It has a special procedure for passage, giving the Lok Sabha greater control.\n\nPresident:  The head of state in India. While they can give or withhold assent to a bill, the procedure for a Money Bill is relatively straightforward once the Lok Sabha has passed it.  A joint sitting is not involved in the process of a Money Bill.\n"
    },
    {
        "q_num": 2,
        "question_text": "Which one of the following statements is correct?",
        "option_a": "In India, the same person cannot be appointed as Governor for two or more States at the same time",
        "option_b": "The Judges of the High Court of the States in India are appointed by the Governor of the State just as the Judges of the Supreme Court are appointed by the President",
        "option_c": "No procedure has been laid down in the Constitution of India for the removal of a Governor from his/her post",
        "option_d": "In the case of a Union Territory having a legislative setup, the Chief Minister is appointed by the Lt. Governor on the basis of majority support",
        "correct_option": "a",
        "subject": "polity",
        "year": 2013,
        "explanation": "* **correct_option:** (a)\n\n* **explanation:** The statement (a) is correct.  The Indian Constitution doesn't explicitly prohibit a person from being appointed as Governor for multiple states simultaneously, but it's a convention that a single individual doesn't hold the governorship of more than one state at the same time.  This is due to the demanding nature of the role and the need for focused attention on each state's unique governance needs.\n\nOption (b) is incorrect.  High Court judges are appointed by the President, not the Governor. Option (c) is incorrect; the Governor can be removed by the President. Option (d) is incorrect;  in Union Territories with legislatures, the Chief Minister is appointed by the Lieutenant Governor, but the appointment is based on the individual's ability to command a majority in the legislature.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Governor:** The Governor is the constitutional head of a state in India. Appointed by the President, they act as a representative of the central government in the state, but their powers are largely symbolic. They play a crucial role in the formation and dissolution of state governments, but their decisions are usually guided by the advice of the Council of Ministers.\n\n* **Chief Minister:** The Chief Minister is the head of the Council of Ministers in a state. They are appointed by the Governor and are usually the leader of the party with a majority in the state legislative assembly. The Chief Minister's office is the de facto executive authority in the state.  They are responsible for the overall administration and governance of the state.\n\n* **High Court:** The High Court is the highest court of a state in India.  It's responsible for upholding the rule of law within its jurisdiction.  Judges are appointed by the President of India, based on recommendations from the collegium system.\n\n* **Union Territory:** A Union Territory is an administrative division of India that is directly governed by the central government.  Some Union Territories have legislatures, while others do not.\n\n* **Lieutenant Governor:** The Lieutenant Governor is the head of a Union Territory. Their powers and functions are similar to those of a Governor in a state, but they are appointed by the President and report directly to the central government.\n\n* **President:** The President of India is the head of state.  While largely ceremonial, their role is important in matters of national and state governance, including appointments to key positions such as Governors and High Court judges.  The President acts on the advice of the Council of Ministers.\n\n* **Council of Ministers:**  The Council of Ministers is the body of ministers responsible for advising the Governor (in a state) or the President (at the national level).  In a state, the Chief Minister heads the Council of Ministers.  The Council is the real executive power in the government.\n\n* **Articles 163, 164, 167:** These articles of the Indian Constitution deal with the Council of Ministers, their relationship with the Governor, and the role of the Chief Minister. Article 163 establishes the Council of Ministers to aid and advise the Governor, Article 164 deals with the appointment of ministers, and Article 167 outlines the duties of the Chief Minister regarding the Governor.\n\n\nThe states mentioned (Maharashtra, Gujarat, Nagaland, Assam, Manipur, Sikkim, Arunachal Pradesh, Karnataka) are all states within the Republic of India, each with its own Governor, Chief Minister, and legislative assembly.\n"
    },
    {
        "q_num": 3,
        "question_text": "Which one of the following pairs is correctly matched?\n    Geographical Feature                    Region",
        "option_a": "Abyssinian Plateau                      Arabia",
        "option_b": "Atlas Mountains                         North-Western Africa",
        "option_c": "Guiana Highlands                        South-Western Africa",
        "option_d": "Okavango Basin                          Patagonia",
        "correct_option": "b",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: The Atlas Mountains are located in North-Western Africa.\n\nAbyssinian Plateau (also known as the Ethiopian Highlands) is located in Ethiopia.  Arabia is a peninsula in Western Asia.\n\nGuiana Highlands are located in South America, not South-Western Africa.\n\nThe Okavango Basin is located in Southern Africa, not Patagonia (which is in South America).\n"
    },
    {
        "q_num": 4,
        "question_text": "With reference to the history of Indian rock-cut architecture, consider the following statements:\n1. The caves at Badami are the oldest surviving rock-cut caves in India.\n2. The Barabar rock-cut caves were originally made for Ajivikas by Emperor Chandragupta Maurya.\n3. At Ellora, caves were made for different faiths.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. The Barabar caves, located in Bihar, predate the Badami caves.  The Barabar caves are the oldest surviving rock-cut caves in India, dating back to the Mauryan period (322-185 BCE).\n\nStatement 2 is correct. The Barabar caves were indeed originally built for the Ajivikas, a sect of ascetics, during the reign of Emperor Chandragupta Maurya.\n\nStatement 3 is correct. The Ellora caves showcase a unique blend of architectural styles representing three major religions: Hinduism, Buddhism, and Jainism.\n\n\n**Short notes on named entities:**\n\n* **Indian rock-cut architecture:** A style of architecture where structures are carved out of solid rock, rather than being built with separate blocks.  It's a significant aspect of Indian history and religious practice, with examples spanning centuries and various religious traditions.\n\n* **Badami caves:** A complex of rock-cut cave temples and monasteries in Badami, Karnataka, known for their intricate carvings and religious significance. They represent a blend of architectural styles and are important examples of Chalukya art.\n\n* **Barabar caves:** A group of rock-cut caves in Bihar, India, dating back to the Mauryan period.  They are significant for their early use of rock-cut architecture and their association with the Ajivika sect.\n\n* **Ajivikas:** An ancient Indian ascetic sect known for their extreme renunciation and deterministic philosophy.  They believed in the inevitability of fate and karma.\n\n* **Emperor Chandragupta Maurya:** The founder of the Mauryan Empire, a powerful dynasty that unified much of the Indian subcontinent in the 4th century BCE.  He is known for his administrative skills and patronage of various religious sects.\n\n* **Ellora caves:** A UNESCO World Heritage Site in Maharashtra, India, famous for its intricate rock-cut cave temples and monasteries belonging to Hindu, Buddhist, and Jain faiths.  They represent a unique example of religious harmony and artistic achievement.\n"
    },
    {
        "q_num": 5,
        "question_text": "Recombinant DNA technology (Genetic Engineering) allows genes to be transferred\n1. across different species of plants\n2. from animals to plants\n3. from microorganisms to higher organisms\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:Recombinant DNA technology, also known as genetic engineering, involves the manipulation of an organism's genes.  This technology allows for the transfer of genes across different species. Option 1 (across different species of plants) is possible, as seen in the development of genetically modified crops. Option 2 (from animals to plants) is also possible, as genes from animals can be inserted into plants to confer desirable traits.  Option 3 (from microorganisms to higher organisms) is also feasible, as genes from microorganisms can be introduced into higher organisms for various purposes, including gene therapy. Therefore, all three options are correct.\n\nGenetically Modified Organisms (GMOs): Organisms whose genetic material has been altered using biotechnology, resulting in new combinations of genetic material not found naturally.  GMOs are used to enhance crop yields, pest resistance, and nutritional value.\n\nRecombinant DNA Technology: A set of molecular techniques used to create recombinant DNA molecules by joining DNA fragments from different sources.  It's the basis for genetic engineering, allowing scientists to manipulate genes and transfer them between organisms.\n"
    },
    {
        "q_num": 6,
        "question_text": "The Chinese traveller Yuan Chwang (Hiuen Tsang) who visited India recorded the general conditions and culture of India at that time. In this context, which of the following statements is/are correct?\n1. The roads and river-routes were completely immune from robbery.\n2. As regards punishment for offences, ordeals by fire, water and poison were the instruments for determining the innocence or guilt of a person.\n3. The tradesmen had to pay duties at ferries and barrier stations.\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: Statement 1 is incorrect because Yuan Chwang's records indicate that roads and river routes were not immune to robbery; travelers often faced dangers from bandits. Statement 2 is correct; his writings mention the use of ordeals by fire, water, and poison to determine guilt or innocence. Statement 3 is also correct; he documented that tradesmen had to pay duties at various checkpoints along their routes.  Therefore, only statements 2 and 3 are correct.\n\nYuan Chwang (Hiuen Tsang): A 7th-century Chinese Buddhist monk who traveled to India, studying Buddhism and documenting his experiences. His accounts provide valuable insights into the social, religious, and political conditions of India during that period.\n\nOrdeals:  Methods of determining guilt or innocence in medieval times based on supernatural intervention.  Examples include trials by fire, water (submersion), or poison.  The outcome was believed to reflect divine judgment.\n"
    },
    {
        "q_num": 7,
        "question_text": "Consider the following:\n1. Star tortoise\n2. Monitor lizard\n3. Pygmy hog\n4. Spider monkey\nWhich of the above are naturally found in India?",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: The Star tortoise ( *Indotestudo elongata*) is found in India. Monitor lizards (*Varanus* species) are also found in India. The Pygmy hog (*Porcula salvania*) is endemic to the Indian subcontinent.  Spider monkeys (*Ateles* species) are found in Central and South America and are not naturally found in India. Therefore, only options 1, 2, and 3 are found naturally in India.\n\n\nStar Tortoise:  A medium-sized tortoise found in dry areas of India, Pakistan, and Sri Lanka.  They are herbivores and are threatened by habitat loss and illegal pet trade.\n\nMonitor Lizard: A large lizard with diverse species found across the globe, including several species in India. They are carnivores or omnivores, playing a significant role in their ecosystems.\n\nPygmy Hog: The world's smallest wild pig, endemic to the grasslands of Northeast India. Critically endangered due to habitat loss and hunting.\n\nSpider Monkey:  Arboreal New World monkeys characterized by their long limbs and prehensile tails.  Native to Central and South America.\n"
    },
    {
        "q_num": 8,
        "question_text": "Which of the following can be found as pollutants in the drinking water in some parts of India?\n1. Arsenic\n2. Sorbitol\n3. Fluoride\n4. Formaldehyde\n5. Uranium\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 3 only",
        "option_b": "2, 4 and 5 only",
        "option_c": "1, 3 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Arsenic, fluoride, and uranium are all known to contaminate drinking water in certain regions of India.  The provided text mentions arsenic as a pollutant in the context of water pollution and also lists it as one of the pollutants found in air.  Fluoride contamination of drinking water is a significant issue in several parts of India, leading to dental and skeletal fluorosis.  Uranium contamination is also a concern in some areas.  Sorbitol and formaldehyde are not typically found as significant pollutants in drinking water.\n\nArsenic: A naturally occurring metalloid, arsenic can contaminate groundwater through geological processes.  High levels of arsenic in drinking water can cause various health problems, including skin lesions, circulatory problems, and cancer.\n\nSorbitol: A sugar alcohol used as a sweetener and humectant. It's not typically considered a water pollutant.\n\nFluoride: A naturally occurring element, fluoride is essential in small amounts for dental health. However, excessive fluoride in drinking water can cause fluorosis, leading to dental and skeletal problems.\n\nFormaldehyde: A colorless, strong-smelling gas used in various industrial processes. It's a known carcinogen and can be a component of air pollution but is not a typical drinking water pollutant.\n\nUranium: A radioactive element that occurs naturally in the environment.  Uranium contamination of water sources can pose serious health risks due to its radioactivity.\n"
    },
    {
        "q_num": 9,
        "question_text": "With reference to Indian History, the Members of the Constituent Assembly from the Provinces were",
        "option_a": "directly elected by the people of those Provinces",
        "option_b": "nominated by the Indian National Congress and the Muslim League",
        "option_c": "elected by the Provincial Legislative Assemblies",
        "option_d": "selected by the Government for their expertise in constitutional matters",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation:The Constituent Assembly members from the provinces were elected by the Provincial Legislative Assemblies.  The Indian National Congress and the Muslim League played significant roles in Indian politics leading up to independence, but they did not directly nominate the members of the Constituent Assembly.  Direct election by the people was not the method used.  The government did not select members based solely on constitutional expertise.\n\nThe Indian National Congress was a major political party advocating for Indian independence from British rule.  The Muslim League was a political party primarily representing the interests of Indian Muslims.  Provincial Legislative Assemblies were the elected bodies governing the provinces of British India.\n"
    },
    {
        "q_num": 10,
        "question_text": "Consider the following animals:\n1. Sea cow\n2. Sea horse\n3. Sea lion\nWhich of the above is/are mammal/mammals?",
        "option_a": "1 only",
        "option_b": "1 and 3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: Sea cows (manatees) are marine mammals. Sea lions are also mammals belonging to the order Carnivora.  Sea horses are fish, not mammals.  Mammals are characterized by features such as having mammary glands to produce milk for their young, fur or hair, and being warm-blooded.  Both sea cows and sea lions possess these characteristics.\n"
    },
    {
        "q_num": 11,
        "question_text": "Consider the following statements:\n1. An amendment to the Constitution of India can be initiated by an introduction of a bill in the Lok Sabha only.\n2. If such an amendment seeks to make changes in the federal character of the Constitution, the amendment also requires to be ratified by the legislature of all the States of India.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is incorrect.  An amendment to the Constitution of India can be initiated by introducing a bill in either the Lok Sabha or the Rajya Sabha.  Statement 2 is partially correct.  While amendments affecting the federal character of the Constitution require ratification by state legislatures, it doesn't necessarily require *all* state legislatures.  The specific requirement varies depending on the nature of the amendment.  Therefore, neither statement is entirely correct.\n\nLok Sabha: The lower house of the Indian Parliament.  It is the more powerful house, with the Rajya Sabha having less power.\n\nRajya Sabha: The upper house of the Indian Parliament.  It has some power to review legislation passed by the Lok Sabha.\n\nConstitution of India: The supreme law of India. It lays down the framework defining fundamental political principles, establishing the structure, procedures, powers, and duties of government institutions, and setting out fundamental rights, directive principles, and the duties of citizens.\n\nAmendment: A formal or official change made to a law, constitution, or document.  In the Indian context, constitutional amendments are governed by Article 368.\n\nFederal character of the Constitution:  Refers to the division of powers between the Union (central) government and the State governments.  It ensures that both levels of government have significant autonomy and responsibilities.\n"
    },
    {
        "q_num": 12,
        "question_text": "Consider the following statements: Attorney General of India can\n1. take part in the proceedings of the Lok Sabha\n2. be a member of a committee of the Lok Sabha\n3. speak in the Lok Sabha\n4. vote in the Lok Sabha\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 4",
        "option_c": "1, 2 and 3",
        "option_d": "1 and 3 only",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\n\nexplanation:The Attorney General of India can participate in the proceedings of the Lok Sabha, speak in the Lok Sabha, but cannot vote or be a member of a committee of the Lok Sabha.  The Attorney General is the highest law officer of India. They advise the government on legal matters and represent the government in court. While they can participate in debates and offer their expertise in the Lok Sabha, their role is primarily advisory and not representative in the same way as an elected member.  Therefore, only options 1 and 3 are correct.\n\n\nLok Sabha: The lower house of the Parliament of India.  It is composed of elected representatives from across the country and is responsible for making laws.\n\nAttorney General of India: The highest law officer of India.  They advise the government on legal matters and represent it in the Supreme Court and other courts.  Their role is primarily advisory, not legislative or executive.\n"
    },
    {
        "q_num": 13,
        "question_text": "With reference to the usefulness of the by-products of sugar industry, which of the following statements is/are correct?\n1. Bagasse can be used as biomass fuel for the generation of energy.\n2. Molasses can be used as one of the feedstocks for the production of synthetic chemical fertilizers.\n3. Molasses can be used for the production of ethanol.\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:All three statements are correct.\n\nBagasse, the fibrous residue left after sugarcane juice extraction, is a significant biomass fuel source used for energy generation in sugar mills.  It's burned to produce steam, which powers turbines generating electricity.  Molasses, a byproduct of sugar refining, is rich in sugars and can be used as a feedstock for the production of ethanol through fermentation.  Furthermore, molasses is a source of nutrients and can be utilized in the production of certain types of synthetic chemical fertilizers, although this application might be less common compared to its use in ethanol production.\n"
    },
    {
        "q_num": 14,
        "question_text": "Variations in the length of daytime and nighttime from season to season are due to",
        "option_a": "the earth's rotation on its axis",
        "option_b": "the earth's revolution round the sun in an elliptical manner",
        "option_c": "latitudinal position of the place",
        "option_d": "revolution of the earth on a tilted axis",
        "correct_option": "d",
        "subject": "geography",
        "year": 2013,
        "explanation": "* **correct_option:** (d)\n* **explanation:** The variation in the length of daytime and nighttime throughout the year is primarily caused by the tilt of Earth's axis (23.5 degrees) as it revolves around the Sun.  This tilt means that different parts of the Earth receive varying amounts of direct sunlight throughout the year.  When a hemisphere is tilted towards the Sun, it experiences longer days and shorter nights (summer), while the opposite hemisphere experiences shorter days and longer nights (winter).\n\nThe Earth's rotation on its axis causes day and night, but not the seasonal variation in their lengths. The Earth's revolution around the sun in an elliptical orbit does slightly affect the length of seasons, but the primary cause is the axial tilt. Latitudinal position affects the amount of sunlight received, leading to differences in temperature, but doesn't directly explain the seasonal change in day length.\n\n\n**Short notes on keywords and named entities:**\n\n* **Earth:** The fifth largest planet in our solar system, Earth is the only known planet to support life.  It has a roughly spherical shape and is composed of various layers, including a core, mantle, and crust.  Earth's atmosphere plays a crucial role in regulating temperature and supporting life.\n\n* **Sun:** The star at the center of our solar system.  It's a massive ball of hot gas, primarily hydrogen and helium, that generates energy through nuclear fusion.  The Sun's gravitational pull keeps the planets in orbit.\n\n* **Axis:** An imaginary line running through the center of a rotating object, such as the Earth. Earth's axis is tilted relative to its orbital plane around the Sun. This tilt is responsible for the seasons.\n\n* **Revolution:** The movement of one celestial body around another. Earth revolves around the Sun in an elliptical orbit, taking approximately 365.25 days to complete one revolution.\n\n* **Rotation:** The spinning of a celestial body on its axis.  Earth rotates on its axis, causing the cycle of day and night.  One rotation takes approximately 24 hours.\n\n* **Seasons:**  The four periods of the year (spring, summer, autumn, winter) characterized by changes in temperature, daylight hours, and weather patterns.  These changes are primarily due to the Earth's axial tilt and revolution around the Sun.\n\n\n"
    },
    {
        "q_num": 15,
        "question_text": "The Narmada river flows to the west, while most other large peninsular rivers flow to the east. Why?\n1. It occupies a linear rift valley.\n2. It flows between the Vindhyas and the Satpuras.\n3. The land slopes to the west from Central India.\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "None",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation:The Narmada River's westward flow is primarily due to a combination of factors.  It occupies a linear rift valley, a geological formation that dictates its course. Additionally, the land slopes westward from Central India, further guiding the river's flow towards the Arabian Sea. While the river flows between the Vindhyas and Satpuras mountain ranges, this is a consequence of the rift valley's location rather than the primary cause of its westward flow.\n\n**Short notes on named entities:**\n\n* **Narmada River:** A major river in central India, flowing westward into the Arabian Sea.  Its unique westward flow distinguishes it from most other peninsular rivers.\n\n* **Vindhyas:** A mountain range in central India, forming a significant geographical boundary.  They run roughly east-west and influence the drainage patterns of the region.\n\n* **Satpuras:** Another mountain range in central India, running roughly parallel to the Vindhyas, influencing the course of the Narmada River.  They are lower than the Vindhyas.\n\n* **Peninsular rivers:** Rivers originating in the Deccan Plateau of India, generally flowing eastward due to the slope of the land.  Examples include the Godavari, Krishna, and Kaveri.\n\n* **Linear rift valley:** A long, narrow valley formed by the subsidence of the Earth's crust along a linear zone. This geological feature plays a key role in the Narmada River's westward flow.\n"
    },
    {
        "q_num": 16,
        "question_text": "On the planet earth, most of the freshwater exists as ice caps and glaciers. Out of the remaining freshwater, the largest proportion",
        "option_a": "is found in atmosphere as moisture and clouds",
        "option_b": "is found in freshwater lakes and rivers",
        "option_c": "exists as groundwater",
        "option_d": "exists as soil moisture",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation:  The largest proportion of Earth's freshwater, excluding ice caps and glaciers, exists as groundwater.  While freshwater lakes and rivers are significant, groundwater represents a much larger reservoir. Atmospheric moisture and soil moisture, while important parts of the water cycle, hold considerably less freshwater compared to groundwater.  Groundwater is water found underground in the soil or in rocks.  Lakes and rivers are bodies of freshwater found on the surface. Atmospheric moisture refers to water vapor in the air. Soil moisture is water held in the soil.\n"
    },
    {
        "q_num": 17,
        "question_text": "Consider the following pairs:\n1. Nokrek Bio-sphere Reserve    :       Garo Hills\n2. Logltak (Loktak) Lake        :       Barail Range\n3. Namdapha National Park       :       Dafla Hills\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation:Only Nokrek Biosphere Reserve is correctly paired with Garo Hills.  Loktak Lake is situated in the Manipur state, not the Barail Range. Namdapha National Park is located in Arunachal Pradesh, not Dafla Hills.\n\nNokrek Biosphere Reserve: A biosphere reserve in the Garo Hills of Meghalaya, known for its diverse flora and fauna, including the endangered clouded leopard.\n\nLoktak Lake:  A freshwater lake in Manipur, known for its unique floating islands called phumdis.  It's an important wetland ecosystem.\n\nNamdapha National Park: A national park in Arunachal Pradesh, renowned for its rich biodiversity, including several threatened species of plants and animals.  It is located in the eastern Himalayas.\n\nGaro Hills: A range of hills in Meghalaya, known for its dense forests and unique tribal culture.\n\nBarail Range: A range of hills in northeastern India, part of the Patkai hills.\n\nDafla Hills: A range of hills in Arunachal Pradesh, part of the Eastern Himalayas.\n"
    },
    {
        "q_num": 18,
        "question_text": "Consider the following:\n1. Electromagnetic radiation\n2. Geothermal energy\n3. Gravitational force\n4. Plate movements\n5. Rotation of the earth\n6. Revolution of the earth\nWhich of the above are responsible for bringing dynamic changes on the surface of the earth?",
        "option_a": "1, 2, 3 and 4 only",
        "option_b": "1, 3, 5 and 6 only",
        "option_c": "2, 4, 5 and 6 only",
        "option_d": "1, 2, 3, 4, 5 and 6",
        "correct_option": "d",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:Electromagnetic radiation (1) drives weather patterns and influences climate, causing dynamic changes on the Earth's surface. Geothermal energy (2) causes volcanic eruptions and geysers, altering landscapes. Gravitational force (3) shapes landforms through erosion and sedimentation. Plate movements (4) are responsible for earthquakes, volcanic activity, and mountain building. The rotation of the Earth (5) causes day and night, influencing temperature variations and weather patterns. The revolution of the Earth (6) around the sun causes seasons, affecting climate and ecosystems.  All six factors contribute to dynamic changes on Earth's surface.\n\nElectromagnetic radiation:  Electromagnetic radiation encompasses a wide spectrum of energy, including visible light, ultraviolet radiation, infrared radiation, and more. It plays a vital role in driving weather systems and influencing Earth's climate through processes like heating the atmosphere and oceans.\n\nGeothermal energy: Geothermal energy is heat from the Earth's interior. This heat drives plate tectonics and volcanic activity, resulting in significant changes to the Earth's surface through lava flows, volcanic eruptions, and the formation of new land.\n\nGravitational force:  Gravity is the fundamental force of attraction between objects with mass. On Earth, it's responsible for shaping landforms through processes like erosion (the wearing away of land by natural forces), and sedimentation (the deposition of eroded material).\n\nPlate movements: Plate tectonics is the theory that Earth's outer shell is divided into several plates that glide over the mantle, the rocky inner layer above the core. The movement of these plates causes earthquakes, volcanic eruptions, and the formation of mountains and ocean basins.\n\nRotation of the Earth: The Earth's rotation on its axis causes the daily cycle of day and night. This rotation significantly affects temperature variations across the globe, influencing weather patterns and wind systems.\n\nRevolution of the Earth: The Earth's revolution around the sun causes the seasonal changes experienced throughout the year. These seasonal variations influence temperature, precipitation, and the growth cycles of plants and animals.\n\nCFCs (Chlorofluorocarbons): CFCs are synthetic organic compounds that were widely used in refrigerants, aerosols, and other applications. They are now known to deplete the ozone layer, resulting in increased exposure to harmful ultraviolet radiation.\n\nIPCC (Intergovernmental Panel on Climate Change): The IPCC is a UN body that assesses the science related to climate change.  Its reports provide comprehensive assessments of the state of climate science, informing policymakers and the public.\n\nGlobal Warming: Global warming refers to the long-term heating of Earth's climate system observed since the pre-industrial period (between 1850 and 1900) due to human activities, primarily fossil fuel burning, which increases heat-trapping greenhouse gas levels in Earth's atmosphere.  The term is frequently used interchangeably with the term climate change, though the latter refers to both human- and naturally produced warming and the effects it has on our planet. It includes both global warming and its effects, such as sea level rise; ice melt in Greenland, Antarctica, the Himalayas, and the Arctic; and changes in rainfall patterns.\n\nGHGs (Greenhouse Gases): Greenhouse gases are gases in Earth's atmosphere that trap heat.  Examples include carbon dioxide (CO2), methane (CH4), and nitrous oxide (N2O).  Increased concentrations of these gases contribute to global warming.\n\nGWP (Global Warming Potential): GWP is a measure of how much heat a greenhouse gas traps in the atmosphere over a specific time period, relative to carbon dioxide.  It helps to compare the relative warming effects of different gases.\n\nOzone Depletion: Ozone depletion refers to the reduction of the ozone layer in the stratosphere. The ozone layer protects life on Earth from harmful ultraviolet radiation.  CFCs and other ozone-depleting substances have caused significant thinning of this layer.\n"
    },
    {
        "q_num": 19,
        "question_text": "Which of the following bodies does not find mention in the Constitution?\n1. National Development Council\n2. Planning Commission\n3. Zonal Councils\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:The Constitution of India does not explicitly mention the National Development Council, the Planning Commission (which has since been replaced by NITI Aayog), or the Zonal Councils.  These bodies were established through executive actions and legislation following the adoption of the Constitution.\n\nNational Development Council:  A council comprising of the Prime Minister, Chief Ministers of all the States and Union Territories, and other members nominated by the central government. It's a forum for discussion and coordination on national development matters.\n\nPlanning Commission:  A body established in 1950 to formulate India's five-year plans.  It played a crucial role in economic planning and resource allocation but was dissolved in 2014.\n\nZonal Councils:  Five councils (Northern, Central, Eastern, Southern, Western) set up to promote cooperation and coordination between states within a particular zone.  They facilitate interstate dialogues and collaborative efforts.\n"
    },
    {
        "q_num": 20,
        "question_text": "The demand for the Tebhaga Peasant Movement in Bengal was for",
        "option_a": "the reduction of the share of the landlords from one-half of the crop to one-third",
        "option_b": "the grant of ownership of land to peasants as they were the actual cultivators of the land",
        "option_c": "the uprooting of Zamindari system and the end of serfdom",
        "option_d": "writing off all peasant debts",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2013,
        "explanation": "correct_option: (a)\n\nexplanation:The Tebhaga movement's primary demand was to reduce the share of the landlords from half the harvest to one-third.  While other options represent related agrarian grievances and desires for broader land reform, this was the movement's central focus.\n\nTebhaga Peasant Movement: This movement, primarily in Bengal, aimed at reducing the share of landlords in the harvest. It was a significant peasant uprising fueled by widespread poverty and exploitation.\n\nZamindari system: A land tenure system in which Zamindars, or landlords, collected revenue from peasants and paid a portion to the state. This system was prevalent in many parts of India and often led to exploitation of peasants.  The colonial rule further exacerbated the existing inequalities within this system.\n\nSerfdom: A system of agricultural labor where peasants were bound to the land and owed services to their landlord. While not the central focus of the Tebhaga movement, the movement sought to alleviate the oppressive conditions that resembled aspects of serfdom.\n"
    },
    {
        "q_num": 21,
        "question_text": "The Parliament can make any law for whole or any part of India for implementing international treaties",
        "option_a": "with the consent of all the States",
        "option_b": "with the consent of the majority of States",
        "option_c": "with the consent of the States concerned",
        "option_d": "without the consent of any State",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\n\nexplanation: Article 253 of the Indian Constitution empowers the Parliament to make laws for the whole or any part of India for implementing international treaties.  This power is exercised without the need for the consent of any state.  The Parliament's authority in this matter stems from its role as the supreme legislative body of the nation, responsible for upholding India's international obligations.\n\n**Short notes on keywords and named entities:**\n\n* **Parliament:** The supreme legislative body of India, responsible for making laws for the entire country. It consists of two houses: the Lok Sabha (House of the People) and the Rajya Sabha (Council of States).\n\n* **International treaties:** Formal agreements between two or more countries, which become legally binding once ratified. These treaties cover a wide range of issues, including trade, human rights, and environmental protection.  India's participation in international treaties demonstrates its commitment to global cooperation and adherence to international norms.\n\n* **States:**  In the Indian context, \"States\" refer to the individual units of the Indian federation. Each state has its own government and legislature, but their powers are subject to the overarching authority of the Parliament.\n\n\n"
    },
    {
        "q_num": 22,
        "question_text": "In the grasslands, trees do not replace the grasses as a part of an ecological succession because of",
        "option_a": "insects and fungi",
        "option_b": "limited sunlight and paucity of nutrients",
        "option_c": "water limits and fire",
        "option_d": "None of the above",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: In grasslands, trees cannot replace grasses during ecological succession primarily due to limited sunlight reaching the ground level and nutrient deficiency in the soil.  Grasses are better adapted to these conditions, while trees require more sunlight and nutrients for establishment and growth. Fire and water limitations also play a role in preventing tree establishment in grasslands.\n\nInsects and fungi are involved in decomposition but do not prevent tree establishment in grasslands.\n"
    },
    {
        "q_num": 23,
        "question_text": "Which one of the following is the correct sequence of ecosystems in the order of decreasing productivity?",
        "option_a": "Oceans, lakes, grasslands, mangroves",
        "option_b": "Mangroves, oceans, grasslands, lakes",
        "option_c": "Mangroves, grasslands, lakes, oceans",
        "option_d": "Oceans, mangroves, lakes, grasslands",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Mangroves are highly productive ecosystems due to their unique environment and the abundance of nutrients. Grasslands have high productivity compared to lakes and oceans. Lakes have moderate productivity, while oceans, despite their vast size, have relatively lower productivity per unit area due to nutrient limitations in many areas.  Therefore, the correct sequence in decreasing order of productivity is mangroves, grasslands, lakes, and oceans.\n"
    },
    {
        "q_num": 24,
        "question_text": "Contour bunding is a method of soil conservation used in",
        "option_a": "desert margins, liable to strong wind action",
        "option_b": "low flat plains, close to stream courses, liable to flooding",
        "option_c": "scrublands, liable to spread of weed growth",
        "option_d": "None of the above",
        "correct_option": "b",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: Contour bunding is a soil conservation technique primarily used on gentle slopes to control water runoff and prevent soil erosion. Low, flat plains near stream courses are particularly susceptible to flooding, making contour bunding an effective method to manage water flow and reduce the risk of soil erosion during floods.  Desert margins are more prone to wind erosion, while scrublands are primarily concerned with weed management.  Contour bunding doesn't directly address these issues.\n"
    },
    {
        "q_num": 25,
        "question_text": "The Government enacted the Panchayat Extension to Scheduled Areas (PESA) Act in 1996. Which one of the following is not identified as its objective?",
        "option_a": "To provide self-governance",
        "option_b": "To recognize traditional rights in tribal areas",
        "option_c": "To create autonomous regions",
        "option_d": "To free tribal people from exploitation",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation:The PESA Act aims to provide self-governance to tribal communities, recognize their traditional rights, and free them from exploitation.  Creating autonomous regions is not explicitly stated as an objective of the PESA Act.  While the Act empowers Panchayats in Scheduled Areas, leading to greater self-governance and potentially influencing the management of resources, it doesn't aim to establish formally demarcated \"autonomous regions\" in the same way as some other legal frameworks might.\n\nPESA Act 1996:  This Act, the Panchayat Extension to Scheduled Areas Act, aims to empower tribal communities through self-governance at the local level. It seeks to strengthen existing Panchayati Raj institutions and adapt them to the unique needs and customs of Scheduled Areas.  The Act recognizes the customary laws and traditions of tribal communities and seeks to incorporate them into the governance structure.\n\nScheduled Areas: These are geographically defined areas inhabited predominantly by tribal populations, which are designated by the Indian Constitution to receive special protection and safeguards.  The government has special provisions and regulations applicable to these areas to protect the interests of the tribal communities.\n\nSelf-governance: This refers to the ability of a community to govern itself, make its own decisions, and manage its own affairs without undue external interference. The PESA Act promotes self-governance by granting more power to local Panchayats.\n\nTraditional rights: These are rights and customs that have been practiced by tribal communities for generations.  The PESA Act aims to recognize and protect these rights, ensuring that development initiatives do not infringe upon them.\n\nExploitation:  The PESA Act aims to protect tribal communities from exploitation by outsiders, ensuring fair treatment and preventing the misuse of resources.\n"
    },
    {
        "q_num": 26,
        "question_text": "Under the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, who shall be the authority to initiate the process for determining the nature and extent of individual or community forest rights or both?",
        "option_a": "State Forest Department",
        "option_b": "District Collector/Deputy Commissioner",
        "option_c": "Tahsildar/Block Development Officer/Mandal Revenue Officer",
        "option_d": "Gram Sabha",
        "correct_option": "d",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (d)\n\nexplanation:The Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, mandates that the Gram Sabha initiates the process for determining the nature and extent of individual or community forest rights.  The Gram Sabha is the village assembly, and its involvement ensures community participation in the decision-making process. While other entities like the District Collector/Deputy Commissioner and Tahsildar/Block Development Officer/Mandal Revenue Officer play roles in the process, they do so after the Gram Sabha has initiated it. The State Forest Department also plays a role, but it's not the initiating authority.\n\nGram Sabha: The Gram Sabha is a village assembly consisting of all persons registered in the electoral rolls relating to a village comprised within the area of a Gram Panchayat.  It is a crucial institution for participatory democracy at the grassroots level.\n\nDistrict Collector/Deputy Commissioner:  A District Collector or Deputy Commissioner is a senior administrative officer heading the district administration in many states of India. They have wide-ranging responsibilities, including revenue collection, law and order, and disaster management.\n\nTahsildar/Block Development Officer/Mandal Revenue Officer: These are revenue officials at the sub-district level, working under the District Collector. They handle land records, revenue collection, and other administrative tasks within their respective jurisdictions.\n\nState Forest Department: The State Forest Department is responsible for managing and conserving forest resources within a state.  Their roles include forest protection, afforestation, and sustainable forest management.\n"
    },
    {
        "q_num": 27,
        "question_text": "Improper handling and storage of cereal grains and oilseeds result in the production of toxins known as aflatoxins which are not generally destroyed by normal cooking process. Aflatoxins are produced by",
        "option_a": "bacteria",
        "option_b": "protozoa",
        "option_c": "moulds",
        "option_d": "viruses",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "```text\ncorrect_option: (c)\nexplanation: Aflatoxins are mycotoxins, which are toxins produced by certain types of molds (fungi).  Bacteria, protozoa, and viruses are not known to produce aflatoxins.  Aflatoxins are a serious concern in food safety, particularly in improperly stored grains and oilseeds, as they can be carcinogenic and cause various health problems.  Normal cooking processes generally do not destroy aflatoxins.\n```\n"
    },
    {
        "q_num": 28,
        "question_text": "‘Economic Justice’ as one of the objectives of the Indian Constitution has been provided in",
        "option_a": "the Preamble and the Fundamental Rights",
        "option_b": "the Preamble and the Directive Principles of State Policy",
        "option_c": "the Fundamental Rights and the Directive Principles of State Policy",
        "option_d": "None of the above",
        "correct_option": "b",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation:The concept of 'Economic Justice' is enshrined in the Directive Principles of State Policy (DPSP), not in the Preamble or Fundamental Rights.  The Preamble sets out the goals and objectives of the Constitution, including justice—social, economic, and political—but doesn't provide mechanisms for achieving it. Fundamental Rights guarantee individual liberties and freedoms, while DPSPs outline the social and economic goals the state should strive for.  Therefore, 'Economic Justice' as a constitutional objective is found in the Preamble (aspirational goal) and the DPSP (mechanism for achieving the goal).\n\n\nPreamble: The Preamble to the Indian Constitution is a brief introductory statement that sets out the goals and objectives of the Constitution. It declares India to be a sovereign, socialist, secular, democratic republic, assuring its citizens justice, liberty, equality, and fraternity.  It was adopted on November 26, 1949.\n\nFundamental Rights: Part III of the Indian Constitution lists the Fundamental Rights, which are basic human rights guaranteed to all citizens.  These rights are enforceable by courts and protect citizens from state action that violates their fundamental freedoms.  They include the right to equality, freedom, against exploitation, freedom of religion, cultural and educational rights, and the right to constitutional remedies.\n\nDirective Principles of State Policy: Part IV of the Indian Constitution contains the Directive Principles of State Policy, which are guidelines for the state to follow when making laws and policies. These principles aim to promote social and economic welfare.  They are not legally enforceable but serve as guidelines for the government to work towards a just society.  They include provisions relating to economic justice, social security, and equal pay for equal work.\n\nDirect Democracy: A form of democracy in which people decide policy initiatives directly.  This contrasts with representative democracy, where citizens elect representatives to make decisions on their behalf.  Examples of direct democracy mechanisms include referendums, initiatives, recalls, and plebiscites.  Switzerland is often cited as a country with a strong tradition of direct democracy.\n\nDistributive Justice: A concept of fairness in the distribution of resources and opportunities within a society. It's often seen as encompassing both social and economic justice, ensuring that benefits and burdens are distributed equitably.  The ideal of distributive justice, especially concerning the equitable distribution of wealth and resources, has historical roots in various social and political movements, including the Russian Revolution.\n\nSovereignty: The supreme authority within a territory.  A sovereign nation is independent and free to govern itself without external interference.  The Indian Constitution establishes India as a sovereign nation, meaning it is not subject to the control of any other nation.\n\nLiberty: The state of being free from external constraints or restrictions.  The Indian Constitution guarantees various freedoms, including freedom of speech, expression, assembly, and religion.\n\nEquality: The state of being equal, especially in status, rights, and opportunities.  The Indian Constitution aims to ensure equality before the law and equal opportunity for all citizens, regardless of caste, creed, religion, or gender.\n\nFraternity: A sense of brotherhood and solidarity among the citizens of a nation. The Indian Constitution promotes fraternity, assuring the dignity of the individual and the unity and integrity of the nation.\n\nBerubari Union Case: A 1960 case in which the Supreme Court of India held that the Preamble is not a part of the Constitution and therefore cannot be used to interpret the Constitution's provisions.\n\nKesavananda Bharati Case: A landmark 1973 Supreme Court case that established the \"basic structure doctrine,\" which limits the Parliament's power to amend the Constitution.  The Court ruled that certain fundamental features of the Constitution are immutable and cannot be altered, even through constitutional amendments.\n"
    },
    {
        "q_num": 29,
        "question_text": "Due to improper/indiscriminate disposal of old and used computers or their parts, which of the following are released into the environment as e-waste?\n1. Beryllium\n2. Cadmium\n3. Chromium\n4. Heptachlor\n5. Mercury\n6. Lead\n7. Plutonium\nSelect the correct answer using the codes given below.",
        "option_a": "1, 3, 4, 6 and 7 only",
        "option_b": "1, 2, 3, 5 and 6 only",
        "option_c": "2, 4, 5 and 7 only",
        "option_d": "1, 2, 3, 4, 5, 6 and 7",
        "correct_option": "b",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: E-waste, or electronic waste, contains various heavy metals and toxic substances.  Beryllium (Be), Cadmium (Cd), Chromium (Cr), Mercury (Hg), and Lead (Pb) are all heavy metals commonly found in electronic components.  These metals can leach into the soil and water, causing environmental contamination. Heptachlor is an organochlorine pesticide,  while Plutonium (Pu) is a radioactive element; both can be found in specific electronic components (though less common than the heavy metals). Therefore, options 1, 2, 3, 5, and 6 are definitely present in e-waste, making (b) the correct answer.\n\nBeryllium: A lightweight, strong metal used in electronics for its heat conductivity and electrical properties.  It's toxic, causing lung problems with prolonged exposure.\n\nCadmium:  A toxic heavy metal used in batteries and some electronic components. It bioaccumulates in the food chain, harming wildlife and humans.\n\nChromium: A metal with various forms, some toxic (hexavalent chromium). Used in electronics for its corrosion resistance.  Toxic forms can cause cancer and other health issues.\n\nHeptachlor: A persistent organic pollutant (POP), a highly toxic insecticide that persists in the environment. Its presence in e-waste is less common than the other components but possible due to contamination.\n\nMercury: A highly toxic heavy metal used in switches, displays, and other components.  It's neurotoxic and bioaccumulates, causing significant environmental damage.\n\nLead: A toxic heavy metal used in solders and other electronic components.  It's neurotoxic, especially to children, causing developmental problems.\n\nPlutonium: A radioactive element;  it's unlikely to be found in large quantities in typical e-waste, but its presence in certain specialized electronic components is possible.\n"
    },
    {
        "q_num": 30,
        "question_text": "Acid rain is caused by the pollution of environment by",
        "option_a": "carbon dioxide and nitrogen",
        "option_b": "carbon monoxide and carbon dioxide",
        "option_c": "ozone and carbon dioxide",
        "option_d": "nitrous oxide and sulphur dioxide",
        "correct_option": "d",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: Acid rain is primarily caused by the presence of sulfur dioxide (SO2) and nitrogen oxides (NOx) in the atmosphere.  These gases react with water, oxygen, and other chemicals to form sulfuric and nitric acids. These acids then fall to the ground as rain, snow, fog, or dry particles.\n\nCarbon dioxide (CO2) is a greenhouse gas contributing to climate change but is not a primary cause of acid rain.  Carbon monoxide (CO) is a toxic gas produced by incomplete combustion, also not directly involved in acid rain formation. Ozone (O3) is a component of smog and a respiratory irritant, but its role in acid rain is less significant compared to SO2 and NOx.  Nitrous oxide (N2O) is a greenhouse gas with a minor contribution to acid rain.  Therefore, the combination of nitrous oxide and sulfur dioxide is the most accurate answer among the given options.\n"
    },
    {
        "q_num": 31,
        "question_text": "With reference to food chains in ecosystems, consider the following statements:\n1. A food chain illustrates the order in which a chain of organisms feed upon each other.\n2. Food chains are found within the populations of a species.\n3. A food chain illustrates the numbers of each organism which are eaten by others. Which of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "environment",
        "year": 2013,
        "explanation": "```text\ncorrect_option: (a)\nexplanation: Statement 1 is correct as a food chain shows the feeding relationships between organisms. Statement 2 is incorrect; food chains are found within ecosystems, not just populations. Statement 3 is incorrect; a food chain primarily illustrates the feeding order, not the exact numbers consumed.\n\nFood chain: A linear sequence of organisms where each organism feeds on the preceding one, transferring energy through trophic levels.\n\nFood web: A complex network of interconnected food chains showing multiple feeding relationships within an ecosystem.\n\nEcological pyramid: A graphical representation of the relationships between different trophic levels in an ecosystem, showing the number, biomass, or energy at each level.  There are three types: pyramid of numbers, pyramid of biomass, and pyramid of energy.\n```\n"
    },
    {
        "q_num": 32,
        "question_text": "Consider the following pairs:\n   National Park                       River flowing through the Park\n1. Corbett National Park        :       Ganga\n2. Kaziranga National Park      :       Manas\n3. Silent Valley National Park  :       Kaveri\nWhich of the above pairs is/are correctly matched?",
        "option_a": "1 and 2",
        "option_b": "3 only",
        "option_c": "1 and 3",
        "option_d": "None",
        "correct_option": "d",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: None of the pairs are correctly matched.\n\n* **Corbett National Park:**  Located in Uttarakhand, India.  It is known for its tiger population and is situated in the Himalayan foothills. The Ramganga River flows through the park, not the Ganga River.\n\n* **Kaziranga National Park:** Located in Assam, India. Famous for its one-horned rhinoceros population. The Brahmaputra River is in the vicinity, but the Manas River, a tributary of the Brahmaputra, flows through the park, not the Ganga.\n\n* **Silent Valley National Park:** Located in Kerala, India.  Known for its rich biodiversity and undisturbed rainforest ecosystem. The Kaveri River does not flow through this park.  Several smaller rivers and streams are found within the park.\n\n"
    },
    {
        "q_num": 33,
        "question_text": "Consider the following organisms:\n1. Agaricus\n2. Nostoc\n3. Spirogyra\nWhich of the above is/are used as biofertilizer/biofertilizers?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation:Nostoc is a genus of cyanobacteria (blue-green algae) that are capable of nitrogen fixation.  Nitrogen fixation is the process of converting atmospheric nitrogen into ammonia, a form usable by plants.  Therefore, Nostoc serves as a biofertilizer.  Agaricus is a genus of mushrooms and Spirogyra is a genus of green algae; neither of these are typically used as biofertilizers.\n\nAgaricus:  Agaricus is a genus of gilled mushrooms, many of which are edible and commonly cultivated.  They are saprophytes, meaning they obtain nutrients from decaying organic matter.  They are not known for nitrogen fixation or other biofertilizing properties.\n\nNostoc: Nostoc is a genus of cyanobacteria, also known as blue-green algae.  Many species are capable of nitrogen fixation, a crucial process for plant growth. This ability makes them valuable as biofertilizers in agriculture, enriching the soil with usable nitrogen.\n\nSpirogyra: Spirogyra is a genus of filamentous green algae found in freshwater habitats. While important for aquatic ecosystems, it does not possess nitrogen-fixing capabilities and is not used as a biofertilizer.\n"
    },
    {
        "q_num": 34,
        "question_text": "Which of the following adds/add nitrogen to the soil?\n1. Excretion of urea by animals\n2. Burning of coal by man\n3. Death of vegetation\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Urea, a nitrogenous waste product, is excreted by animals.  Upon decomposition, urea releases nitrogen compounds back into the soil, making it available to plants.  Death of vegetation also returns nitrogen to the soil through decomposition. Burning coal, however, does not add nitrogen to the soil; it releases other pollutants into the atmosphere.\n\nUrea: A nitrogen-containing compound produced as a waste product of protein metabolism in animals.  It's excreted in urine and is a significant source of nitrogen in the nitrogen cycle.\n\nBurning coal: A process of combustion that releases various pollutants into the atmosphere, including carbon dioxide, sulfur dioxide, and nitrogen oxides.  It does not add nitrogen to the soil, but it can indirectly affect nitrogen cycling through atmospheric deposition of nitrogen oxides.\n\nDeath of vegetation: When plants die, their nitrogen-containing organic matter decomposes, releasing nitrogen compounds back into the soil. This is a crucial part of the nitrogen cycle, returning nitrogen to the ecosystem.\n"
    },
    {
        "q_num": 35,
        "question_text": "In which of the following States is lion-tailed macaque found in its natural habitat?\n1. Tamil Nadu\n2. Kerala\n3. Karnataka\n4. Andhra Pradesh\nSelect the correct answer using the codes given below.",
        "option_a": "1, 2 and 3 only",
        "option_b": "2 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: The lion-tailed macaque is found in the Western Ghats mountain range, which spans across the states of Kerala, Karnataka and Tamil Nadu.  Therefore, the correct answer is (a) 1, 2 and 3 only.\n\nTamil Nadu: A state in southern India known for its diverse geography, including coastal plains, hills, and forests.  It is home to several wildlife sanctuaries and national parks.\n\nKerala: A state in southwestern India known for its lush greenery, backwaters, and beaches.  It is a biodiversity hotspot and part of the Western Ghats.\n\nKarnataka: A state in southern India with diverse ecosystems, including the Western Ghats, which are a significant biodiversity area.  It is home to various wildlife species.\n\nAndhra Pradesh: A state in southeastern India, with a mix of coastal regions, plains, and hills.  While it has biodiversity, it is not within the primary habitat range of the lion-tailed macaque.\n"
    },
    {
        "q_num": 36,
        "question_text": "Some Buddhist rock-cut caves are called Chaityas, while the others are called Viharas. What is the difference between the two?",
        "option_a": "Vihara is a place of worship, while Chaitya is the dwelling place of the monks",
        "option_b": "Chaitya is a place of worship, while Vihara is the dwelling place of the monks",
        "option_c": "Chaitya is the stupa at the far end of the cave, while Vihara is the hall axial to it",
        "option_d": "There is no material difference between the two",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "* **correct_option:** (b)\n* **explanation:** In Buddhist rock-cut architecture, Chaityas are prayer halls or places of worship, while Viharas are monasteries or dwelling places for monks.  Therefore, option (b) accurately describes the difference.\n\nChaityas:  These are structures, often cave temples, specifically designed for Buddhist worship.  They typically feature a stupa (a dome-shaped structure containing relics) at one end and an aisle for circumambulation.  Many Chaityas are elaborately carved and decorated with Buddhist imagery.\n\nViharas: These are monastic complexes, typically including living quarters, assembly halls, and other facilities for the resident Buddhist monks.  They served as centers for study, meditation, and communal life.  While some Viharas might contain small shrines or places for private devotion, their primary function was as residential spaces for the monastic community.\n\nStupa: A dome-shaped structure, often found in Buddhist architecture, that typically houses Buddhist relics, such as the ashes or other remains of important figures.  Stupas are revered sites of pilgrimage and meditation.\n\nNote: The provided additional context does not relate to the question and answer.\n"
    },
    {
        "q_num": 37,
        "question_text": "Which one of the following describes best the concept of Nirvana in Buddhism?",
        "option_a": "The extinction of the flame of desire",
        "option_b": "The complete annihilation of self",
        "option_c": "A state of bliss and rest",
        "option_d": "A mental stage beyond all comprehension",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Nirvana in Buddhism is best described as the extinction of the flame of desire.  While it involves a cessation of suffering and a state of peace (option c), it's not simply \"bliss and rest\" but rather the extinguishing of the cycle of suffering caused by craving and attachment.  Option (b) is incorrect because while the concept of self is challenged in Buddhism,  it's not necessarily a complete annihilation. Option (d) is also not the best description, as while Nirvana is beyond ordinary understanding, it's not incomprehensible in principle.  The core of Buddhist teachings centers on overcoming suffering through understanding the nature of reality and ending desire, which aligns perfectly with option (a).\n\n\nGautama Buddha (Siddhartha Gautama): The historical founder of Buddhism, born in Lumbini, Nepal, around 563 BC. He left his princely life to seek enlightenment, achieving it at the age of 35 and subsequently spreading his teachings.  His teachings focused on the cessation of suffering through the Eightfold Path. His death at Kusinagara, around 483 BC, marked the beginning of the spread of Buddhism.\n\nNirvana:  The ultimate goal in Buddhism, a state of liberation from suffering and the cycle of rebirth. It is achieved by extinguishing craving and attachment.  Various interpretations exist, but the core concept is freedom from suffering.\n\nBrahmin:  A member of the highest caste in the Hindu social hierarchy, traditionally associated with priestly duties.  The Buddha's teachings challenged the Brahminical authority and their interpretations of religious practices.\n\nShakya:  The clan to which the Buddha belonged.  Siddhartha Gautama was a prince of the Shakya clan.\n\nKapilavastu:  The ancient city where Siddhartha Gautama spent his early life as a prince.  It's considered a significant site in Buddhist history.\n\nLumbini:  The birthplace of Siddhartha Gautama, located in present-day Nepal.  It's a sacred site for Buddhists worldwide.\n\nBanaras (Varanasi):  The city where the Buddha delivered his first sermon after attaining enlightenment.  It's a major pilgrimage site for Hindus and Buddhists.\n\nKusinagar: The city where the Buddha died.  It is an important pilgrimage site for Buddhists.\n\nMiddle Path:  A central concept in Buddhism that advocates for avoiding both extreme asceticism and excessive indulgence. It emphasizes moderation and balance in life.\n\n\n"
    },
    {
        "q_num": 38,
        "question_text": "According to the Constitution of India, which of the following are fundamental for the governance of the country?",
        "option_a": "Fundamental Rights",
        "option_b": "Fundamental Duties",
        "option_c": "Directive Principles of State Policy",
        "option_d": "Fundamental Rights and Fundamental Duties",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Fundamental Rights are guaranteed and protected by the Constitution of India.  Fundamental Duties, added later, are not constitutionally fundamental for governance in the same way.  Directive Principles of State Policy provide guidelines for the government but are not legally enforceable.  Therefore, only Fundamental Rights are explicitly fundamental for governance as per the Constitution.\n\nFundamental Rights:  These are basic human rights enshrined in Part III of the Indian Constitution, guaranteeing freedoms such as the right to equality, freedom of speech and expression, freedom of religion, and right to life and personal liberty.  They are justiciable, meaning they can be enforced through courts.\n\nFundamental Duties: Added to the Constitution in 1976 (42nd Amendment), these are moral obligations of citizens towards the nation, such as respecting the national flag, promoting harmony, and protecting the environment. They are not legally enforceable.\n\nDirective Principles of State Policy:  These are guidelines in Part IV of the Constitution directing the state to work towards social and economic justice, such as providing education and healthcare. They are not legally enforceable.\n"
    },
    {
        "q_num": 39,
        "question_text": "The people of India agitated against the arrival of Simon Commission because",
        "option_a": "Indians never wanted the review of the working of the Act of 1919",
        "option_b": "Simon Commission recommended the abolition of Dyarchy (Diarchy) in the Provinces",
        "option_c": "there was no Indian member in the Simon Commission",
        "option_d": "the Simon Commission suggested the partition of the country",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation: The Simon Commission, established in 1927 to review the workings of the Government of India Act 1919, faced widespread protests in India primarily because it did not include any Indian members.  This was seen as a major insult and a disregard for Indian aspirations for self-governance.  The other options are incorrect. While the Commission did recommend the abolition of dyarchy and made suggestions regarding the future governance of India, the lack of Indian representation was the central reason for the protests.  The Simon Commission did not suggest the partition of the country; that came later.  The Government of India Act 1919 introduced dyarchy (dual governance) in the provinces, aiming to gradually introduce self-rule.\n\n\n**Short notes on named entities:**\n\n* **Simon Commission:** A British statutory commission appointed in 1927 to investigate the working of the Government of India Act 1919.  Its all-British composition led to widespread protests in India.  The commission submitted its report in 1930, recommending, among other things, the abolition of dyarchy and the extension of responsible government in the provinces.\n\n* **Government of India Act 1919:** Also known as the Montagu-Chelmsford Reforms, this act introduced the system of dyarchy (dual governance) in the provinces of British India.  It aimed to gradually introduce self-rule while retaining British control over key areas.  The act was reviewed by the Simon Commission.\n\n* **Dyarchy (Diarchy):** A system of dual government introduced in some provinces of British India under the Government of India Act 1919.  It involved a division of powers between Indian ministers responsible to the provincial legislature and British officials who retained control over certain key areas.  The Simon Commission recommended its abolition.\n"
    },
    {
        "q_num": 40,
        "question_text": "Quit India Movement was launched in response to",
        "option_a": "Cabinet Mission Plan",
        "option_b": "Cripps Proposals",
        "option_c": "Simon Commission Report",
        "option_d": "Wavell Plan",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2013,
        "explanation": "correct_option: (b)\n\nexplanation: The Quit India Movement was launched in response to the Cripps Proposals.\n\nCripps Proposals:  In March 1942, during World War II, the British government sent Sir Stafford Cripps to India to negotiate a dominion status for India after the war.  The proposals offered India a large measure of self-government after the war, but fell short of complete independence immediately, leading to widespread rejection and triggering the Quit India Movement.\n\nCabinet Mission Plan:  A plan proposed in 1946 by the British government to address the constitutional future of India, proposing a three-tier federal structure.  It did not directly lead to the Quit India Movement.\n\nSimon Commission Report:  The Simon Commission, appointed in 1927, was tasked with reviewing the governance of India. Its report, published in 1930, was boycotted by Indian nationalists due to its lack of Indian representation. It did not directly lead to the Quit India Movement.\n\nWavell Plan: Proposed in 1945 by Lord Wavell, the Viceroy of India, this plan aimed to expand Indian participation in the government but failed to satisfy Indian demands for independence.  It came after the Quit India Movement.\n"
    },
    {
        "q_num": 41,
        "question_text": "The balance of payments of a country is a systematic record of",
        "option_a": "all import and export transactions of a country during a given period of time, normally a year",
        "option_b": "goods exported from a country during a year",
        "option_c": "economic transaction between the government of one country to another",
        "option_d": "capital movements from one country to another",
        "correct_option": "a",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (a)\n\nexplanation:The balance of payments (BoP) is a record of all economic transactions between the residents of a country and the rest of the world in a particular period (usually a year).  Option (a) accurately reflects this definition, encompassing all import and export transactions, both visible (goods) and invisible (services, transfers, income). Options (b), (c), and (d) only cover subsets of BoP transactions.  The current account reflects trade in goods and services, while the capital account covers capital movements.  Visible transactions refer to trade in goods, while invisible transactions relate to services, income, and transfers.  Balance of trade specifically refers to the difference between a country's imports and exports of goods.\n"
    },
    {
        "q_num": 42,
        "question_text": "The Reserve Bank of India regulates the commercial banks in matters of\n1. liquidity of assets\n2. branch expansion\n3. merger of banks\n4. winding-up of banks\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 4 only",
        "option_b": "2, 3 and 4 only",
        "option_c": "1, 2 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:The Reserve Bank of India (RBI) is the central bank of India and is responsible for regulating commercial banks.  The RBI's regulatory powers extend to various aspects of commercial bank operations, including:\n\n1. **Liquidity of assets:** The RBI sets reserve requirements (CRR and SLR) to ensure that banks maintain sufficient liquidity to meet their obligations and prevent banking crises.  It also monitors banks' asset quality and lending practices.\n\n2. **Branch expansion:** The RBI grants permission for commercial banks to open new branches, controlling their geographical reach and expansion strategies.\n\n3. **Merger of banks:** The RBI approves mergers and acquisitions of banks, ensuring financial stability and preventing monopolies.  It scrutinizes the financial health and strategic rationale of such mergers.\n\n4. **Winding-up of banks:** In cases of financial distress or insolvency, the RBI plays a crucial role in the winding-up process of banks, protecting depositors' interests and maintaining financial stability.  This involves overseeing liquidation or rehabilitation schemes.\n\nTherefore, the RBI regulates commercial banks in all the matters listed (1, 2, 3, and 4).  The other entities mentioned in the context are related to various aspects of Indian banking, finance, and monetary policy but are not directly involved in regulating commercial banks in the same way as the RBI.  For example, the Narsimhan Committee reports made significant recommendations on banking sector reforms, while the SARFAESI Act deals with the recovery of non-performing assets.  Other entities, such as  Debt Recovery Tribunal,  are involved in specific legal processes related to banking, but not the overall regulation of commercial banks.\n"
    },
    {
        "q_num": 43,
        "question_text": "An increase in the Bank Rate generally indicates that the",
        "option_a": "market rate of interest is likely to fall",
        "option_b": "Central Bank is no longer making loans to commercial banks",
        "option_c": "Central Bank is following an easy money policy",
        "option_d": "Central Bank is following a tight money policy",
        "correct_option": "d",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: An increase in the Bank Rate signifies that the central bank is adopting a tight monetary policy.  The Bank Rate is the interest rate at which the central bank lends money to commercial banks.  Raising this rate makes borrowing more expensive for commercial banks, leading to a decrease in lending and a rise in market interest rates. This is a contractionary monetary policy aimed at curbing inflation.\n\nShort notes on keywords and named entities:\n\nBank Rate: The interest rate at which the central bank lends money to commercial banks.  It's a key tool in monetary policy, influencing overall interest rates and credit availability.\n\nCentral Bank:  A country's central bank (like the Reserve Bank of India in India) is responsible for managing the nation's monetary policy, regulating banks, and maintaining financial stability.  Its actions significantly impact the economy.\n\nTight money policy: A monetary policy strategy employed by central banks to curb inflation by reducing the money supply and increasing interest rates.  This makes borrowing more expensive, slowing economic growth.\n\nEasy money policy: The opposite of a tight money policy, where the central bank aims to stimulate economic activity by increasing the money supply and lowering interest rates.  This makes borrowing cheaper.\n"
    },
    {
        "q_num": 44,
        "question_text": "In India, deficit financing is used for raising resources for",
        "option_a": "economic development",
        "option_b": "redemption of public debt",
        "option_c": "adjusting the balance of payments",
        "option_d": "reducing the foreign debt",
        "correct_option": "a",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: Deficit financing in India is primarily used to raise resources for economic development.  This involves the government spending more than it earns, financing the difference through borrowing or printing money. While deficit financing can indirectly influence other areas like the balance of payments (the record of a country's transactions with the rest of the world), redemption of public debt (paying back previous loans), and reducing foreign debt, its core purpose is to fund government programs aimed at boosting economic growth.\n\nRedemption of public debt refers to the repayment of government borrowings.  Adjusting the balance of payments involves managing the flow of money into and out of a country. Reducing foreign debt is the process of lowering a nation's obligations to foreign creditors.  Economic development encompasses a broad range of initiatives aimed at improving a country's economic performance, including infrastructure, education, and healthcare.\n"
    },
    {
        "q_num": 45,
        "question_text": "Which of the following characterizes/characterize the people of Indus Civilization?\n1. They possessed great palaces and temples.\n2. They worshipped both male and female deities.\n3. They employed horse-drawn chariots in warfare.\nSelect the correct statement/statements using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1, 2 and 3",
        "option_d": "None of the statements given above is correct",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation:\n\nStatement 1 is incorrect.  The Indus Civilization is known for its well-planned cities with standardized brick sizes and advanced drainage systems, but evidence of large palaces or temples is limited or debated among archaeologists.  Structures that have been interpreted as granaries or public buildings exist, but their exact function remains a topic of scholarly discussion.\n\nStatement 2 is correct. Archaeological evidence suggests the Indus people worshipped both male and female deities.  Figurines depicting both genders have been found, and some seals show figures that may represent deities with both masculine and feminine attributes.  The exact nature of their religious beliefs remains partially understood due to the undeciphered Indus script.\n\nStatement 3 is incorrect. While the Indus people domesticated animals including cattle, buffaloes, goats, sheep, pigs, dogs, cats, asses, camels, elephants, and rhinoceros (as noted in the provided text), there is no conclusive evidence of their use of horse-drawn chariots in warfare.  The presence of horses in the Indus Civilization is debated, with some evidence being considered inconclusive or potentially misidentified.\n\nTherefore, only statement 2 is definitively supported by current archaeological understanding of the Indus Civilization.\n"
    },
    {
        "q_num": 46,
        "question_text": "Which of the following diseases can be transmitted from one person to another through tattooing?\n1. Chikungunya\n2. Hepatitis B\n3. HIV-AIDS\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: Hepatitis B and HIV-AIDS are bloodborne diseases that can be transmitted through contaminated needles or instruments used in tattooing.  Hepatitis B is a viral infection affecting the liver, while HIV-AIDS is caused by the human immunodeficiency virus, leading to a compromised immune system.  Chikungunya is a viral disease spread primarily by mosquitoes and is not typically transmitted through tattooing.\n"
    },
    {
        "q_num": 47,
        "question_text": "Which of the following statements is/are applicable to Jain doctrine?\n1. The surest way of annihilating Karma is to practice penance.\n2. Every object, even the smallest particle has a soul.\n3. Karma is the bane of the soul and must be ended.\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: All three statements are applicable to Jain doctrine.\n\n1. **Penance and Karma annihilation:** Jainism emphasizes penance (tapas) as a crucial practice to reduce and ultimately annihilate karma.  Karma, in Jainism, is not simply a consequence of actions but a substance that clings to the soul, hindering its liberation.  Penance, through rigorous self-discipline and austerity, helps to shed this karmic burden.\n\n2. **Animism (Every object has a soul):**  Jainism is an animistic religion, believing that every object, no matter how small, possesses a soul (jiva).  This principle of Anekantavada (many-sidedness) emphasizes the interconnectedness of all beings and the inherent value of all life.\n\n3. **Karma as the bane of the soul:**  Jain philosophy views karma as the primary obstacle to liberation (moksha).  The cycle of birth and death (samsara) is driven by the accumulation of karma.  The ultimate goal of Jain practice is to purify the soul by eliminating karma, leading to liberation from this cycle.\n\n\n**Short notes on named entities:**\n\n* **Mahavira:** The 24th and last Tirthankara (spiritual teacher) of Jainism, considered the founder of Jainism in its present form. He emphasized non-violence (ahimsa) and rigorous asceticism as paths to liberation.  His teachings are central to Jain philosophy and practice.\n\n* **Karma:** In Jainism, karma is not simply a consequence of actions but a subtle substance that attaches to the soul, causing suffering and rebirth. It is seen as the primary obstacle to liberation.\n\n* **Moksha (Liberation):** The ultimate goal in Jainism, the complete liberation of the soul from the cycle of birth, death, and rebirth (samsara) by shedding all karmic bonds.\n\n* **Svetambara and Digambara:** The two major sects of Jainism, differing primarily in their views on monastic practices, especially regarding the wearing of clothes.  Svetambaras wear white clothes, while Digambaras traditionally go naked.\n\n* **Penance (Tapas):**  A crucial practice in Jainism involving rigorous self-discipline, austerity, and self-mortification aimed at reducing and eliminating karmic accumulation.  Various forms of tapas exist, ranging from fasting to extreme physical endurance.\n\n* **Ahimsa (Non-violence):**  The core principle of Jainism, emphasizing the avoidance of harm to all living beings, extending to even the smallest organisms.  It guides all aspects of Jain life, from diet to occupation.\n\n* **Anekantavada (Many-sidedness):** A core Jain principle emphasizing that reality is multifaceted and possesses multiple perspectives. It encourages a tolerance of diverse viewpoints and a rejection of absolutist claims.\n\n\n"
    },
    {
        "q_num": 48,
        "question_text": "Which one of the following terms describes not only the physical space occupied by an organism, but also its functional role in the community of organisms?",
        "option_a": "Ecotone",
        "option_b": "Ecological niche",
        "option_c": "Habitat",
        "option_d": "Home range",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "* **correct_option:** (b)\n* **explanation:** An ecological niche encompasses both the physical space occupied by an organism (its habitat) and its functional role within the community (its interactions with other organisms and its contribution to ecosystem processes).  A habitat only refers to the physical space.  A home range is the area an animal regularly uses, but doesn't describe its functional role. An ecotone is a transitional zone between ecosystems.\n"
    },
    {
        "q_num": 49,
        "question_text": "Photochemical smog is a resultant of the reaction among",
        "option_a": "NO2, O3 and peroxyacetyl nitrate in the presence of sunlight",
        "option_b": "CO, O2 and peroxyacetyl nitrate in the presence of sunlight",
        "option_c": "CO, CO2 and NO2 at low temperature",
        "option_d": "high concentration of NO2, O3 and CO in the evening",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (a)\n\nexplanation: Photochemical smog is primarily formed through a series of reactions involving nitrogen dioxide (NO2), ozone (O3), and volatile organic compounds (VOCs) in the presence of sunlight.  Peroxyacetyl nitrate (PAN) is a secondary pollutant formed during these reactions and is a key component of photochemical smog. Option (a) correctly identifies the major components: NO2, O3, and PAN,  all crucial in photochemical smog formation under sunlight.\n\nNO2 (Nitrogen dioxide): A reddish-brown toxic gas, a major air pollutant contributing to acid rain and smog.  It is formed from the combustion of fossil fuels.\n\nO3 (Ozone):  A highly reactive gas. In the troposphere (lower atmosphere), it's a major component of smog, causing respiratory problems. In the stratosphere, it forms the ozone layer, protecting us from harmful UV radiation.\n\nPeroxyacetyl nitrate (PAN): A secondary pollutant formed in photochemical smog. It is a powerful eye and respiratory irritant.\n\nCO (Carbon monoxide): A colorless, odorless, highly toxic gas produced by incomplete combustion of carbon-containing materials. It binds to hemoglobin, reducing oxygen transport in the blood.\n\nCO2 (Carbon dioxide): A greenhouse gas, contributing to global warming. It is produced by the combustion of fossil fuels and respiration.\n"
    },
    {
        "q_num": 50,
        "question_text": "Consider the following minerals:\n1. Calcium\n2. Iron\n3. Sodium\nWhich of the minerals given above is/are required by human body for the contraction of muscles?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: Calcium is crucial for muscle contraction.  It plays a vital role in the process by interacting with proteins like troponin and tropomyosin, facilitating the sliding filament mechanism that underlies muscle shortening.  While iron is essential for oxygen transport to muscles (hemoglobin), and sodium contributes to nerve impulse transmission which indirectly influences muscle activity, they are not directly involved in the contractile process itself.\n\nCalcium: A mineral essential for numerous bodily functions, including muscle contraction, nerve impulse transmission, blood clotting, and bone health. Calcium ions bind to proteins, triggering a cascade of events leading to muscle fiber shortening.\n\nIron: A crucial component of hemoglobin, the protein in red blood cells that carries oxygen throughout the body.  Adequate iron levels are necessary for muscle function as oxygen is vital for energy production in muscle cells.\n\nSodium: An electrolyte that plays a key role in maintaining fluid balance, nerve impulse transmission, and muscle function.  Sodium's role in muscle contraction is indirect; it contributes to the electrical signals that initiate muscle contraction.\n"
    },
    {
        "q_num": 51,
        "question_text": "Consider the following statements: The Parliamentary Committee on Public Accounts\n1. consists of not more than 25 Members of the Lok Sabha\n2. scrutinizes appropriation and finance accounts of the Government\n3. examines the report of the Comptroller and Auditor General of India\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\n\nexplanation:The Parliamentary Committee on Public Accounts (PAC) in India is a crucial financial committee that scrutinizes the government's finances.  Statement 1 is partially correct; while the PAC primarily consists of Lok Sabha members, the exact number can vary slightly and is not strictly limited to 25. Statement 2 is correct: a key function of the PAC is to examine the appropriation and finance accounts of the government to ensure proper use of public funds. Statement 3 is also correct: the PAC examines the reports of the Comptroller and Auditor General of India (CAG), an independent body that audits government accounts.  Therefore, all three statements are largely accurate, making option (d) the correct choice.\n\n**Short notes on named entities:**\n\n* **Parliamentary Committee on Public Accounts (PAC):**  A parliamentary committee responsible for auditing the government's financial accounts and ensuring accountability. Its members are primarily drawn from the Lok Sabha, and it plays a key role in India's financial oversight.\n\n* **Lok Sabha:** The lower house of the bicameral Parliament of India.  It is directly elected by the people of India and holds the primary legislative power.\n\n* **Comptroller and Auditor General of India (CAG):** An independent constitutional authority responsible for auditing the accounts of the Union and State governments.  The CAG's reports are crucial for ensuring financial transparency and accountability.\n\n* **Appropriation Accounts:**  Government accounts that show how budgeted funds were actually spent.  The PAC scrutinizes these accounts to identify irregularities or inefficiencies.\n\n* **Finance Accounts:** Government accounts that record the government's receipts and payments. The PAC examines these accounts to assess the government's financial health and management.\n"
    },
    {
        "q_num": 52,
        "question_text": "Consider the following Bhakti Saints:\n1. Dadu Dayal\n2. Guru Nanak\n3. Tyagaraja\nWho among the above was/were preaching when the Lodi dynasty fell and Babur took over?",
        "option_a": "1 and 3",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "1 and 2",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation: The Lodi dynasty fell in 1526 CE when Babur defeated Ibrahim Lodi in the First Battle of Panipat.  Guru Nanak (1469-1539 CE) and Tyagaraja (1767-1847 CE) were active during this period. Dadu Dayal (1544-1603 CE) began preaching after the fall of the Lodi dynasty. Therefore, only Guru Nanak and Tyagaraja were preaching when the Lodi dynasty fell and Babur took over.\n\n\nGuru Nanak:  The founder of Sikhism, Guru Nanak's teachings emphasized the oneness of God and the equality of all humankind, regardless of caste or creed. His emphasis on selfless service and devotion to God profoundly impacted the religious landscape of the Indian subcontinent. His birthplace is in Punjab.\n\n\nTyagaraja: A prominent composer of Carnatic music, Tyagaraja's compositions are renowned for their devotional fervor and musical excellence.  He was a staunch devotee of Lord Rama and his kritis (songs) continue to be integral to Carnatic music traditions.  His work significantly impacted South Indian religious and cultural life.\n\n\nDadu Dayal: A prominent Bhakti saint, Dadu Dayal's teachings emphasized a direct and personal relationship with God, transcending traditional religious barriers. His philosophy blended elements of Hinduism and Sufism, advocating for a simple life and devotion to the divine.  He was born in Gujarat and primarily preached in Rajasthan.\n"
    },
    {
        "q_num": 53,
        "question_text": "With reference to the food chains in ecosystems, which of the following kinds of organism is/are known as decomposer organism/organisms?\n1. Virus\n2. Fungi\n3. Bacteria\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: Fungi and bacteria are decomposer organisms.  They break down dead organic matter, releasing nutrients back into the ecosystem. Viruses, while impacting organisms, are not typically classified as decomposers in the context of food chains.\n\nViruses:  Submicroscopic infectious agents that replicate only inside the living cells of other organisms. They are acellular and consist of genetic material (DNA or RNA) enclosed in a protein coat. Viruses cause a wide range of diseases in plants, animals and humans.\n\nFungi:  Eukaryotic organisms that obtain nutrients by absorption. They are crucial decomposers in many ecosystems, breaking down organic matter and recycling nutrients.  Fungi also form symbiotic relationships with plants (mycorrhizae).\n\nBacteria:  Single-celled prokaryotic organisms found in diverse environments. Many bacteria are decomposers, playing a vital role in nutrient cycling.  Others are involved in various symbiotic relationships.\n"
    },
    {
        "q_num": 54,
        "question_text": "The most important fishing grounds of the world are found in the regions where",
        "option_a": "warm and cold atmospheric currents meet",
        "option_b": "rivers drain out large amounts of freshwater into the sea",
        "option_c": "warm and cold oceanic currents meet",
        "option_d": "continental shelf is undulating",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: The most productive fishing grounds in the world are located where warm and cold oceanic currents meet.  This is because the upwelling of nutrient-rich water from the deeper layers of the ocean occurs at these convergence zones.  These nutrients support a large phytoplankton population, which forms the base of the marine food web, leading to a high abundance of fish.\n\nWarm and cold atmospheric currents meeting (a) is less directly related to fishing grounds as the primary productivity is driven by oceanic currents and nutrient upwelling. Rivers draining into the sea (b) can bring nutrients, but the effect is localized and not as significant as the large-scale influence of converging ocean currents.  An undulating continental shelf (d) might offer varied habitats but doesn't directly explain the global distribution of the richest fishing grounds.\n"
    },
    {
        "q_num": 55,
        "question_text": "Which of the following is/are unique characteristic/characteristics of equatorial forests?\n1. Presence of tall, closely set trees with crowns forming a continuous canopy\n2. Coexistence of a large number of species\n3. Presence of numerous varieties of epiphytes\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:Equatorial forests, also known as tropical rainforests, are characterized by all three features: tall, closely set trees forming a dense canopy, high biodiversity (a large number of species coexisting), and a rich variety of epiphytes (plants that grow on other plants).  The dense canopy prevents sunlight from reaching the forest floor, creating a unique environment.  The consistently warm and humid climate supports a vast array of plant and animal life. Epiphytes thrive in this humid environment, attaching themselves to trees and other surfaces.\n"
    },
    {
        "q_num": 56,
        "question_text": "Which of the following constitute Capital Account?\n1. Foreign Loans\n2. Foreign Direct Investment\n3. Private Remittances\n4. Portfolio Investment\nSelect the correct answer using the codes given below.",
        "option_a": "1, 2 and 3",
        "option_b": "1, 2 and 4",
        "option_c": "2, 3 and 4",
        "option_d": "1, 3 and 4",
        "correct_option": "b",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (b)\n\nexplanation: The capital account reflects the net change in a country's financial assets and liabilities.  Foreign loans (1) and Foreign Direct Investment (2) directly impact a nation's capital account as they represent inflows and outflows of capital.  Portfolio Investment (4), which includes investments in stocks and bonds, also falls under the capital account.  Private Remittances (3), however, are considered part of the current account as they represent transfers of income rather than capital flows.  Therefore, only 1, 2, and 4 are components of the capital account.\n\nForeign Loans: These are funds borrowed from foreign entities, such as governments or international financial institutions. They increase a country's foreign liabilities and are a capital inflow.\n\nForeign Direct Investment (FDI): This involves long-term investments made by foreign entities to establish or acquire businesses in a country. FDI increases a country's capital stock and is a capital inflow.\n\nPrivate Remittances: These are personal transfers of money sent by individuals working abroad to their home countries. These are considered current account transactions as they represent income flows rather than capital flows.\n\nPortfolio Investment: This refers to short-term investments in a country's financial markets, such as stocks and bonds. These investments are easily reversible and are a major component of the capital account.  They represent capital flows into or out of the country.\n\nBalance of Payments: A record of all economic transactions between a country and the rest of the world in a particular period. It consists of the current account and the capital account.\n\nCurrent Account:  Records transactions related to goods and services, income, and current transfers.  It includes the balance of trade (visible and invisible), income from investments, and remittances.\n\nCapital Account: Records capital flows in and out of a country, including foreign direct investment, portfolio investment, and loans.\n"
    },
    {
        "q_num": 57,
        "question_text": "Consider the following historical places:\n1. Ajanta Caves\n2. Lepakshi Temple\n3. Sanchi Stupa\nWhich of the above places is/are also known for mural paintings?",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation:Ajanta Caves are renowned for their exquisite mural paintings, depicting scenes from the Jataka tales and Buddhist mythology.  These paintings, created over centuries, showcase a unique blend of Indian artistic traditions and are considered masterpieces of ancient Indian art. Lepakshi Temple, while architecturally significant, is not primarily known for its mural paintings. Sanchi Stupa, a significant Buddhist monument, is famous for its stupas and sculptures, but not for mural paintings.  Therefore, only Ajanta Caves are known for mural paintings.\n\nAjanta Caves:  Rock-cut cave monuments in Maharashtra, India, dating back to the 2nd century BCE to the 6th century CE.  Famous for their intricate Buddhist mural paintings and sculptures.\n\nLepakshi Temple: A 16th-century temple complex in Andhra Pradesh, India, known for its intricate carvings and architecture, particularly its massive monolithic pillars.\n\nSanchi Stupa: A large hemispherical Buddhist stupa in Madhya Pradesh, India, one of the oldest stone structures in India, dating back to the 3rd century BCE.  Known for its impressive architecture and sculptures.\n"
    },
    {
        "q_num": 58,
        "question_text": "With reference to the history of philosophical thought in India, consider the following statements regarding Sankhya school:\n1. Sankhya does not accept the theory of rebirth or transmigration of soul.\n2. Sankhya holds that it is the self-knowledge that leads to liberation and not any exterior influence or agent.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect.  Sankhya philosophy, while not explicitly detailing a creator god, does believe in rebirth and the transmigration of the soul (purusha).  Liberation (moksha) is achieved by escaping this cycle.  Statement 2 is correct.  Sankhya emphasizes self-knowledge (jnana) as the path to liberation, independent of external forces or divine intervention.  The focus is on understanding the distinction between purusha (consciousness) and prakriti (matter).\n\n\n**Short notes on named entities:**\n\n* **Sankhya:** One of the six schools of Indian philosophy, emphasizing the distinction between purusha (consciousness) and prakriti (matter) as the fundamental reality.  It advocates for self-knowledge as the path to liberation from the cycle of birth and death.\n\n* **Moksha:**  The ultimate goal in many Indian philosophical systems, representing liberation from the cycle of birth, death, and rebirth.  It implies freedom from suffering and the attainment of enlightenment.\n\n* **Purusha:** In Sankhya philosophy, purusha represents the individual consciousness, the pure self that is distinct from the material world (Prakriti).  It is unchanging and eternal.\n\n* **Prakriti:** In Sankhya philosophy, prakriti represents the material world, the dynamic energy that manifests into the physical universe.  It is constantly changing and evolving.\n\n* **Jnana:**  Knowledge or wisdom, particularly self-knowledge, considered essential for liberation in many Indian philosophical traditions.  It signifies understanding the true nature of reality.\n\n* **Kapila:**  Often considered the founder or systematizer of the Sankhya school of philosophy.  His teachings are said to have been the foundational text for the later development of Sankhya.\n\n\n"
    },
    {
        "q_num": 59,
        "question_text": "In the context of India, which of the following principles is/are implied institutionally in the parliamentary government?\n1. Members of the Cabinet are Members of the Parliament.\n2. Ministers hold the office till they enjoy confidence in the Parliament.\n3. Cabinet is headed by the Head of the State.\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (a)\n\nexplanation: In India's parliamentary system, the Cabinet is collectively responsible to the Parliament.  This means that ministers must retain the confidence of the Parliament to remain in office.  This is reflected in statement 2.  Further, the Indian Constitution mandates that members of the Cabinet must also be members of Parliament (statement 1).  Statement 3 is incorrect; the Cabinet is headed by the Prime Minister, not the President (Head of State).  Therefore, only statements 1 and 2 are true.\n\n\n**Short Notes:**\n\n* **Parliamentary Government:** A system of government where the executive branch (the government) is drawn from and accountable to the legislature (the parliament).  The head of government (Prime Minister) is usually the leader of the majority party in the parliament.  It contrasts with a presidential system where the executive and legislative branches are separate and independent.\n\n* **Cabinet:** A body of ministers who are collectively responsible for the government's policies and actions. In India, the cabinet is headed by the Prime Minister and its members are chosen from the Parliament.\n\n* **Parliament:**  The supreme legislative body of a country. In India, it consists of the President, the Rajya Sabha (Council of States), and the Lok Sabha (House of the People). It makes laws, debates national issues, and holds the government accountable.\n\n* **Head of State:** The chief public representative of a state. In India, the President is the Head of State, a largely ceremonial role, while the Prime Minister is the Head of Government, holding executive power.\n\n* **Swaran Singh Committee:** A committee appointed in 1975 to examine the working of the Indian parliamentary system. Its report concluded that the system was functioning well and did not require a change to a presidential system.\n\n* **Lok Sabha:** The lower house of the Indian Parliament. It is directly elected by the people and is more powerful than the Rajya Sabha.\n\n* **Rajya Sabha:** The upper house of the Indian Parliament.  It represents the states and has less power than the Lok Sabha in legislative matters.\n\n* **Prime Minister:** The head of government in India, chosen from the Lower House of Parliament (Lok Sabha). The Prime Minister leads the Cabinet and is responsible for the overall administration of the country.\n\n* **President:** The head of state in India.  The President's role is largely ceremonial, with executive power vested in the Prime Minister and the Council of Ministers.\n\n* **Collective Responsibility:** A constitutional convention in parliamentary systems where all members of the cabinet are responsible for government policy.  If one minister fails, the whole cabinet is responsible.\n\n* **Westminster Model:** A system of parliamentary government based on the British model, characterized by a fusion of powers between the executive and legislative branches.  India's parliamentary system is largely based on the Westminster model.\n"
    },
    {
        "q_num": 60,
        "question_text": "The annual range of temperature in the interior of the continents is high as compared to coastal areas. What is/are the reason/reasons?\n1. Thermal difference between land and water\n2. Variation in altitude between continents and oceans\n3. Presence of strong winds in the interior\n4. Heavy rains in the interior as compared to coasts\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: The high annual temperature range in continental interiors compared to coastal areas is primarily due to the difference in thermal properties of land and water (option 1).  Land heats up and cools down much faster than water. During the day, land surfaces absorb solar radiation quickly, leading to higher temperatures. At night, land loses heat rapidly, resulting in lower temperatures. Water, on the other hand, heats and cools slowly, moderating temperature fluctuations. This creates a larger temperature difference between day and night and between summer and winter in continental interiors. While altitude (option 2) can influence temperature, it's not the primary reason for the contrast between continental interiors and coasts. Strong winds (option 3) can affect local temperatures but don't explain the overall difference. Rainfall amounts (option 4) are not directly linked to the annual temperature range.  Therefore, only option 1 is the most significant factor.\n"
    },
    {
        "q_num": 61,
        "question_text": "Which of the following is/are the characteristic/characteristics of Indian coal?\n1. High ash content\n2. Low sulphur content\n3. Low ash fusion temperature\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Indian coal is characterized by high ash content and low ash fusion temperature.  The provided text states that Indian coal is bituminous, meaning it has undergone a moderate degree of metamorphism. Bituminous coal typically has a high ash content and a relatively low ash fusion temperature.  While the text mentions India lacks sulfur minerals, implying a low sulfur content in some minerals, it doesn't explicitly state this is true for all Indian coal. Therefore, only characteristics 1 and 3 are definitively supported by the given information.\n\n**Short Notes:**\n\n* **Indian Coal:** Coal found in India, primarily bituminous, characterized by high ash content and low ash fusion temperature.  Significant reserves exist in various regions like the Gondwana formations.  Lacks anthracite coal.\n\n* **Ash Content:** The percentage of non-combustible mineral matter in coal. High ash content reduces the coal's heating value and can cause operational problems in power plants.\n\n* **Sulfur Content:** The amount of sulfur present in coal. High sulfur content contributes to air pollution (acid rain) when burned.\n\n* **Ash Fusion Temperature:** The temperature at which the ash in coal starts to melt and fuse together.  A low ash fusion temperature can lead to slagging and fouling in power plants.\n\n* **Bituminous Coal:** A type of coal that is intermediate in rank between lignite and anthracite. It has a relatively high carbon content and is widely used as a fuel.\n\n* **Gondwana Formation:** A geological formation in India containing significant coal deposits.  It is older than the Carboniferous period.\n\n* **Anthracite:** A high-rank metamorphic coal with a high carbon content and low volatile matter content. It burns with a clean blue flame.  India lacks significant anthracite deposits.\n"
    },
    {
        "q_num": 62,
        "question_text": "Which of the following statements regarding laterite soils of India are correct?\n1. They are generally red in colour.\n2. They are rich in nitrogen and potash.\n3. They are well-developed in Rajasthan and UP.\n4. Tapioca and cashew nuts grow well on these soils.\nSelect the correct answer using the codes given below.",
        "option_a": "1, 2 and 3",
        "option_b": "2, 3 and 4",
        "option_c": "1 and 4",
        "option_d": "2 and 3 only",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Laterite soils are formed in areas with high rainfall and temperatures, leading to the leaching of nutrients.  This results in less fertile soil, which is generally red in color due to the high iron oxide content.  Statement 1 is correct. Statement 2 is incorrect because laterite soils are not rich in nitrogen and potash; in fact, they are deficient in these nutrients. Statement 3 is incorrect; laterite soils are well-developed in regions with high rainfall, such as parts of the Western Ghats and Eastern Ghats, not Rajasthan and UP. Statement 4 is correct; crops like tapioca and cashew nuts, which are relatively tolerant of low nutrient levels, can grow well in laterite soils.  Therefore, only statements 1 and 4 are correct.\n\nTapioca: A starchy root vegetable that requires well-drained soil and is relatively tolerant of poor soil conditions.\nCashew nuts:  The nut of the cashew tree, which thrives in tropical and subtropical climates and can tolerate less fertile soils.\nRajasthan: A state in northwestern India characterized by arid and semi-arid climates.\nUP (Uttar Pradesh): A state in northern India with a diverse range of climates and soil types.\n"
    },
    {
        "q_num": 63,
        "question_text": "Consider the following statements:\n1. Natural gas occurs in the Gondwana beds.\n2. Mica occurs in abundance in Kodarma.\n3. Dharwars are famous for petroleum.\nWhich of the statements given above is/are correct?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. Natural gas is found in Gondwana beds.  Statement 2 is correct. Kodarma is known for its abundant mica deposits. Statement 3 is incorrect. Dharwars are known for their mineral wealth, but not primarily for petroleum.  Petroleum is more associated with sedimentary basins.\n\nGondwana beds:  These are a sequence of sedimentary rock formations found in various parts of the world, including India, South America, Africa, and Australia.  They were formed during the Gondwana period, a significant geological time in Earth's history, and are known to contain various fossil fuels, including coal and natural gas.\n\nKodarma: A town in Jharkhand, India, renowned for its significant mica deposits. Mica is a group of minerals known for their sheet-like structure and excellent electrical insulation properties, making it crucial in various industries.\n\nDharwars: A group of ancient metamorphic rocks found in the Indian subcontinent, particularly in the southern part of the Indian peninsula.  They are rich in various minerals, including iron ore, gold, manganese, and others, but are not typically associated with large petroleum reserves.\n"
    },
    {
        "q_num": 64,
        "question_text": "Consider the following crops:\n1. Cotton\n2. Groundnut\n3. Rice\n4. Wheat\nWhich of these are Kharif crops?",
        "option_a": "1 and 4",
        "option_b": "2 and 3 only",
        "option_c": "1, 2 and 3",
        "option_d": "2, 3 and 4",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Kharif crops are those that are sown in the rainy season (June-September) and harvested in the autumn season (October-November).  Cotton, groundnut, and rice are all Kharif crops. Wheat is a Rabi crop, sown in the winter and harvested in the spring.\n\nCotton: A Kharif crop, requiring warm temperatures and sufficient rainfall for growth.  It's a major cash crop in many parts of the world, known for its fiber used in textile production.\n\nGroundnut: Also known as peanuts, this Kharif crop thrives in warm climates and well-drained soil.  It's a significant source of oil and protein, widely cultivated for both food and industrial uses.\n\nRice: A staple food crop globally, rice is a major Kharif crop, needing abundant water and warm temperatures to flourish.  Its cultivation is largely dependent on irrigation in many regions.\n\nWheat: A Rabi crop, it requires cooler temperatures and sufficient moisture during its growing season.  It's a major cereal crop, forming the basis of food security in many countries.\n"
    },
    {
        "q_num": 65,
        "question_text": "\"Climate is extreme, rainfall is scanty and the people used to be nomadic herders.\" The above statement best describes which of the following regions?",
        "option_a": "African Savannah",
        "option_b": "Central Asian Steppe",
        "option_c": "North American Prairie",
        "option_d": "Siberian Tundra",
        "correct_option": "b",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (b)\n\nexplanation: The statement describes a region with an extreme climate, scanty rainfall, and nomadic herders. This best fits the Central Asian Steppe.\n\nThe Central Asian Steppe is characterized by a continental climate with hot summers and cold winters, and low rainfall.  Historically, nomadic pastoralism was a dominant way of life in this region due to the limited arable land and the need to follow seasonal grazing patterns.\n\nAfrican Savannah: While some areas experience semi-arid conditions, the savannah is generally characterized by more rainfall than the steppe, supporting a greater diversity of vegetation and a more settled agricultural lifestyle in some areas.\n\nNorth American Prairie:  The prairies receive more rainfall than the steppe, leading to the development of grasslands suitable for agriculture. Nomadic herding was not as prevalent as in the steppe.\n\nSiberian Tundra: The tundra is a cold, treeless biome with permafrost, making it unsuitable for nomadic herding.  Rainfall is low, but the extreme cold and permafrost are defining characteristics.\n"
    },
    {
        "q_num": 66,
        "question_text": "Consider the following statements:\n1. Inflation benefits the debtors.\n2. Inflation benefits the bond-holders.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: Inflation erodes the real value of money.  For debtors, this means that the real value of their debt decreases over time, making it easier to repay.  Bondholders, on the other hand, receive a fixed amount of interest and principal payments. Inflation diminishes the real value of these payments, reducing their purchasing power and harming bondholders.\n\nDebtors: Individuals or entities who owe money.  They benefit from inflation because the real value of their debt decreases.\n\nBondholders: Individuals or entities who own bonds (a type of debt instrument). They are harmed by inflation because the real value of their bond payments decreases.\n\nInflation: A general increase in the prices of goods and services in an economy over a period of time.  When the price level rises, each unit of currency buys fewer goods and services. Consequently, inflation reflects a reduction in the purchasing power per unit of money – a loss of real value in the medium of exchange and unit of account within the economy.\n"
    },
    {
        "q_num": 67,
        "question_text": "Disguised unemployment generally means",
        "option_a": "large number of people remain unemployed",
        "option_b": "alternative employment is not available",
        "option_c": "marginal productivity of labour is zero",
        "option_d": "productivity of workers is low",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Disguised unemployment refers to a situation where more people are employed in a job than are actually needed.  Their marginal productivity is zero, meaning their contribution to output is negligible. Even if some workers are removed, the total output remains unchanged.  Options (a), (b), and (d) are related to unemployment but don't capture the essence of disguised unemployment, which specifically focuses on the zero marginal productivity of excess labor.\n\n* **Disguised unemployment:** A type of unemployment where people appear to be employed, but their contribution to production is minimal or nonexistent.  It's often seen in agricultural settings where family members work on a farm, even though their labor doesn't significantly increase output.\n\n* **Marginal productivity of labor:** The additional output produced by employing one more unit of labor, holding other inputs constant.  In disguised unemployment, this marginal productivity is zero.\n\n* **Unemployment:** The state of being without a job, actively seeking employment, and available for work.  Disguised unemployment is a *type* of unemployment.\n"
    },
    {
        "q_num": 68,
        "question_text": "Consider the following statements:\n1. The Council of Ministers in the Centre shall be collectively responsible to the Parliament.\n2. The Union Ministers shall hold the office during the pleasure of the President of India.\n3. The Prime Minister shall communicate to the President about the proposals for legislation.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is correct. The Council of Ministers is collectively responsible to the Parliament.  This means the entire council, not just the Prime Minister, is accountable to the Parliament.  A vote of no confidence can lead to the downfall of the entire government.\n\nStatement 2 is correct.  Union Ministers hold office during the pleasure of the President. This means the President can dismiss a minister at any time.  While the Prime Minister is appointed by the President, the President usually acts on the advice of the Prime Minister.\n\nStatement 3 is correct.  The Prime Minister communicates to the President proposals for legislation.  While the President has the power to assent to bills or return them for reconsideration, the legislative process primarily originates from the executive branch, with the Prime Minister playing a key role in communication with the President.\n\nTherefore, all three statements are correct.\n\n\nCouncil of Ministers:  The Council of Ministers is the executive branch of the Indian government. It comprises the Prime Minister and other ministers who are responsible for running the government and implementing policies.  They are collectively responsible to the Parliament.\n\nParliament: The Parliament of India is the supreme legislative body, comprising the President, the Rajya Sabha (Council of States), and the Lok Sabha (House of the People). It makes laws, approves budgets, and holds the executive accountable.\n\nPresident of India: The President of India is the head of state, a largely ceremonial position.  While holding significant powers on paper (like appointing the Prime Minister and dismissing ministers), the President usually acts on the advice of the Council of Ministers.\n\nPrime Minister: The Prime Minister is the head of government, the most powerful member of the Council of Ministers.  They are responsible for forming the government and leading the executive branch.  They advise the President on various matters, including legislative proposals.\n"
    },
    {
        "q_num": 69,
        "question_text": "Consider the following statements:\n1. National Development Council is an organ of the Planning Commission.\n2. The Economic and Social Planning is kept in the Concurrent List in the Constitution of India.\n3. The Constitution of India prescribes that Panchayats should be assigned the task of preparation of plans for economic development and social justice.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. The National Development Council (NDC) is not an organ of the Planning Commission.  The Planning Commission was replaced by NITI Aayog in 2015.  The NDC is a body constituted by the government to deliberate on matters related to national economic development.\n\nStatement 2 is correct.  Economic and social planning is a subject in the Concurrent List (List III) of the Seventh Schedule of the Indian Constitution. This means both the Union and State governments can make laws on this subject.\n\nStatement 3 is correct. The Constitution of India, through the 73rd Amendment Act, mandates that Panchayats should be given the responsibility of preparing plans for economic development and social justice at the local level.\n\n\n**Short Notes:**\n\n* **National Development Council (NDC):**  A body comprising the Prime Minister, Chief Ministers of all States, and other members. It serves as a forum for discussion and coordination of national economic and social development plans.\n\n* **Planning Commission:**  A body that existed in India from 1950 to 2015. It was responsible for formulating five-year plans for the country's economic development.  It has been replaced by NITI Aayog.\n\n* **NITI Aayog:**  A policy think tank that replaced the Planning Commission in 2015. Its role is to provide policy advice to the government and foster cooperative federalism.\n\n* **Concurrent List:**  One of the three lists in the Seventh Schedule of the Indian Constitution. Subjects in this list can be legislated upon by both the Union and State governments.  If there is a conflict, the Union law prevails.\n\n* **Panchayats:**  Local self-governing bodies at the village level in India.  Their functions and powers are defined by the Constitution and various state laws.  The 73rd Amendment Act significantly strengthened Panchayats.\n"
    },
    {
        "q_num": 70,
        "question_text": "Consider the following statements:\n1. The Chairman and the Deputy Chairman of the Rajya Sabha are not the members of that House.\n2. While the nominated members of the two Houses of the Parliament have no voting right in the presidential election, they have the right to vote in the election of the Vice President.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect. The Chairman and Deputy Chairman of the Rajya Sabha are members of the Rajya Sabha.  Statement 2 is correct. Nominated members of Parliament do not have voting rights in presidential elections but do have them in Vice-Presidential elections.\n\nRajya Sabha: The upper house of the Indian Parliament, representing the states.\n\nLok Sabha: The lower house of the Indian Parliament, representing the people.\n\nPresidential election:  The election of the President of India, where elected members of Parliament and state legislative assemblies form the electoral college.\n\nVice-Presidential election: The election of the Vice-President of India, where elected and nominated members of both houses of Parliament form the electoral college.\n\nNominated Members: Individuals appointed to Parliament by the President, typically representing specific fields of expertise.  They are not elected by the people.\n"
    },
    {
        "q_num": 71,
        "question_text": "With reference to National Legal Services Authority, consider the following statements:\n1. Its objective is to provide free and competent legal services to the weaker sections of the society on the basis of equal opportunity.\n2. It issues guidelines for the State Legal Services Authorities to implement the legal programmes and schemes throughout the country.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation:Both statements 1 and 2 are correct regarding the National Legal Services Authority (NALSA).  NALSA's primary objective is to provide free and competent legal services to the weaker sections of society, ensuring equal opportunities for access to justice (statement 1).  It also plays a crucial role in issuing guidelines and overseeing the implementation of legal aid programs and schemes by the State Legal Services Authorities (SLSAs) across the country (statement 2).  The Legal Services Authorities Act, 1987 established NALSA to monitor and evaluate the implementation of legal aid programs, and to lay down policies and principles for making legal services accessible.  The act aims to provide free and competent legal services to weaker sections based on Gandhian principles.  Eligible persons include those with low income, women, children, SC/STs, disabled persons, and victims of human trafficking.  NALSA organizes awareness camps and handles cases at various stages, including pre-litigation.  It works through a hierarchical structure involving State LSAs, District LSAs, and other entities.  Lok Adalats and other alternative dispute resolution mechanisms are also used.\n"
    },
    {
        "q_num": 72,
        "question_text": "During a thunderstorm, the thunder in the skies is produced by the\n1. meeting of cumulonimbus clouds in the sky\n2. lightning that separates the nimbus clouds\n3. violent upward movement of air and water particles\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3",
        "option_c": "1 and 3",
        "option_d": "None of the above produces the thunder",
        "correct_option": "b",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: Thunder is the sound produced by the rapid expansion of air heated by a lightning bolt.  Lightning is a massive electrical discharge that occurs within a cumulonimbus cloud or between a cloud and the ground.  The intense heat of the lightning causes the surrounding air to expand explosively, creating a shock wave that we perceive as thunder. Option 1 is incorrect because the meeting of cumulonimbus clouds does not directly produce thunder; it is the lightning within or between these clouds that does. Option 3 is partially correct; the violent upward movement of air is a key component in the formation of cumulonimbus clouds, but it's the lightning, not the air movement itself, that creates the sound of thunder.  Therefore, only option 2 accurately describes the cause of thunder.\n\nCumulonimbus clouds: These are large, towering clouds associated with thunderstorms. They are characterized by their vertical development and often produce heavy rain, hail, and strong winds.\n\nLightning: A massive electrical discharge that occurs in the atmosphere, usually during thunderstorms.  It is caused by the separation of electrical charges within a cloud or between a cloud and the ground.\n\nNimbus clouds:  A general term for clouds that produce precipitation. Cumulonimbus clouds are a type of nimbus cloud.\n"
    },
    {
        "q_num": 73,
        "question_text": "Consider the following pairs:\n   Tribe                    State\n1. Limboo (Limbu)           Sikkim\n2. Karbi                    Himachal Pradesh\n3. Dongaria Kondh           Odisha\n4. Bonda                    Tamil Nadu\nWhich of the above pairs are correctly matched?",
        "option_a": "1 and 3 only",
        "option_b": "2 and 4 only",
        "option_c": "1, 3 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "a",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (a)\n\nexplanation: Only the pair Limboo (Limbu) - Sikkim is correctly matched.  The Limboo (also spelled Limbu) are an indigenous group primarily residing in eastern Nepal and parts of Sikkim, India.  The other pairings are incorrect.  Karbi tribes are associated with Assam, not Himachal Pradesh. Dongaria Kondh people are primarily found in Odisha.  The Bonda tribe lives in Odisha, not Tamil Nadu.\n"
    },
    {
        "q_num": 74,
        "question_text": "Consider the following liquid assets:\n1. Demand deposits with the banks\n2. Time deposits with the banks\n3. Savings deposits with the banks\n4. Currency\nThe correct sequence of these assets in the decreasing order of liquidity is",
        "option_a": "1-4-3-2",
        "option_b": "4-3-2-1",
        "option_c": "2-3-1-4",
        "option_d": "4-1-3-2",
        "correct_option": "d",
        "subject": "economy",
        "year": 2013,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Liquidity refers to how easily an asset can be converted into cash without significant loss of value. Currency is the most liquid asset as it is already in cash form. Demand deposits are easily accessible through checks or debit cards. Savings deposits require a visit to the bank or online transfer, while time deposits have restrictions on withdrawals, making them the least liquid.  Therefore, the correct decreasing order of liquidity is currency, demand deposits, savings deposits, and time deposits.\n\nDemand deposits:  These are checking accounts that allow for immediate access to funds.  They are highly liquid and form a significant part of the money supply.\n\nTime deposits: These are accounts where funds are deposited for a fixed period, and early withdrawal usually incurs penalties.  They offer higher interest rates than demand deposits but are less liquid.\n\nSavings deposits: These accounts typically offer a lower interest rate than time deposits but allow for more flexibility in withdrawals compared to time deposits.  They are more liquid than time deposits but less liquid than demand deposits.\n\nCurrency: Physical money (notes and coins) is the most liquid asset, as it's readily usable for transactions.\n"
    },
    {
        "q_num": 75,
        "question_text": "In the context of Indian economy, 'Open Market Operations' refers to",
        "option_a": "borrowing by scheduled banks from the RBI",
        "option_b": "lending by commercial banks to industry and trade",
        "option_c": "purchase and sale of government securities by the RBI",
        "option_d": "None of the above",
        "correct_option": "c",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation: Open Market Operations (OMO) involve the Reserve Bank of India (RBI) buying or selling government securities.  This influences the money supply in the economy.\n\nScheduled banks are commercial banks that are members of a central bank's clearing system.  The RBI is India's central bank.  It regulates the banking system, manages the currency, and acts as the banker to the government.  Borrowing by scheduled banks from the RBI is a separate monetary policy tool (e.g., through the repo rate). Lending by commercial banks to industry and trade is a function of the commercial banking sector, not a direct action of the central bank in the context of OMO.\n"
    },
    {
        "q_num": 76,
        "question_text": "Priority Sector Lending by banks in India constitutes the lending to",
        "option_a": "agriculture",
        "option_b": "micro and small enterprises",
        "option_c": "weaker sections",
        "option_d": "All of the above",
        "correct_option": "d",
        "subject": "economy",
        "year": 2013,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Priority Sector Lending in India includes lending to agriculture, micro and small enterprises, and weaker sections.  \n\nAgriculture in India is a significant sector employing a large portion of the population.  Micro and small enterprises (MSEs) represent a crucial component of the Indian economy, generating substantial employment. Weaker sections refer to marginalized groups within society who require financial assistance to improve their livelihoods.  Banks are mandated to allocate a certain percentage of their lending to these priority sectors.\n"
    },
    {
        "q_num": 77,
        "question_text": "Which one among the following industries is the maximum consumer of water in India?",
        "option_a": "Engineering",
        "option_b": "Paper and pulp",
        "option_c": "Textiles",
        "option_d": "Thermal power",
        "correct_option": "d",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:The provided text mentions that thermal power plants constitute 61% of India's total installed power capacity (1231 GW out of 2000 GW).  Thermal power plants, especially coal-based ones, are significant consumers of water for cooling purposes. While the other options (textiles, paper and pulp, and engineering) also use water, the scale of water consumption in thermal power generation is considerably larger in India given its reliance on coal-fired plants.\n\nThe text provides information on various industries:\n\n* **Textiles:** This industry encompasses cotton, jute, silk, wool, and synthetic textiles.  Different regions of India specialize in different types of textiles (e.g., cotton in Mumbai, Ahmedabad; jute in Calcutta; wool in Punjab).  Water is used in various stages of textile production, including cleaning, dyeing, and finishing.\n\n* **Paper and pulp:** The paper industry uses wood pulp, bamboo, sabai grass, sugarcane bagasse, and recycled materials.  Significant water is required for pulping, papermaking, and cleaning processes. Major paper producing states include Madhya Pradesh, West Bengal, and Maharashtra.\n\n* **Engineering:**  The text mentions Hindustan Machine Tools, a Bangalore-based engineering company.  While engineering industries consume water, the scale is likely less compared to power generation or other water-intensive industries like textiles and paper.\n\n* **Thermal power:** As noted earlier, thermal power plants, especially coal-fired plants, are heavy water consumers for cooling systems.  The text highlights the significant contribution of thermal power to India's energy mix.\n"
    },
    {
        "q_num": 78,
        "question_text": "To obtain full benefits of demographic dividend, what should India do?",
        "option_a": "Promoting skill development",
        "option_b": "Introducing more social security schemes",
        "option_c": "Reducing infant mortality rate",
        "option_d": "Privatization of higher education",
        "correct_option": "a",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation:To achieve the full benefits of the demographic dividend, India needs to focus on skill development.  A young population without adequate skills cannot contribute productively to the economy.  While reducing infant mortality (c) and introducing social security schemes (b) are important for overall development and human capital, they don't directly address the core issue of maximizing the economic benefits of a large young population. Privatization of higher education (d) is a complex issue with potential benefits and drawbacks, but it is not the primary factor in realizing the demographic dividend.\n\nDemographic dividend:  Refers to the economic growth potential that can result from a young and growing population.  A large working-age population can boost productivity and economic output if they are skilled and employed.\n\nSkill development:  Involves providing training and education to enhance the capabilities of the workforce, making them more productive and employable.\n\nSocial security schemes: Government programs designed to provide financial protection and support to individuals during times of need, such as unemployment, illness, or old age.\n\nInfant mortality rate: The number of deaths of infants under one year old per 1,000 live births.  A low infant mortality rate indicates improved healthcare and living standards.\n\nPrivatization of higher education: Transferring the ownership and management of higher education institutions from the government to private entities.  This can lead to increased efficiency and competition but may also raise concerns about affordability and access.\n"
    },
    {
        "q_num": 79,
        "question_text": "In the context of cultural history of India, a pose in dance and dramatics called ‘Tribhanga’ has been a favourite of Indian artists from ancient times till today. Which one of the following statements best describes this pose?",
        "option_a": "One leg is bent and the body is slightly but oppositely curved at waist and neck",
        "option_b": "Facial expressions, hand gestures and make-up are combined to symbolize certain epic or historic characters",
        "option_c": "Movements of body, face and hands are used to express oneself or to tell a story",
        "option_d": "A little smile, slightly curved waist and certain hand gestures are emphasized to express the feelings of love or eroticism",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2013,
        "explanation": "* **correct_option:** (a)\n* **explanation:** The Tribhanga pose in Indian dance and dramatics involves a triple bending of the body.  One leg is bent, and the body curves slightly but oppositely at the waist and neck. Option (a) accurately describes this characteristic three-bend posture.\n\nTribhanga: A favourite pose in Indian classical dance and theatre, characterized by three distinct bends in the body: at the ankles, waist, and neck. This creates an S-shaped curve, conveying a sense of grace, elegance, and often, a feeling of pensive melancholy or subtle eroticism.  The pose's fluidity and expressiveness allow dancers to convey a wide range of emotions.\n\nOption (b): This describes the use of various elements like facial expressions, hand gestures (mudras), and makeup in performance, but not specifically the Tribhanga pose itself.\n\nOption (c): This describes the general expressive capabilities of dance and drama, not the unique features of the Tribhanga pose.\n\nOption (d): While Tribhanga can be used to express love or eroticism, it's not its defining characteristic, and the description is too narrow.\n"
    },
    {
        "q_num": 80,
        "question_text": "Annie Besant was\n1. responsible for starting the Home Rule Movement\n2. the founder of the Theosophical Society\n3. once the President of the Indian National Congress\nSelect the correct statement/statements using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation: Annie Besant was not responsible for starting the Home Rule Movement (though she was a prominent figure in it).  She was not the founder of the Theosophical Society (she became its president), but she *was* President of the Indian National Congress for a time.  Therefore, only statements 2 and 3 are correct.\n\nAnnie Besant:  A prominent Irish socialist, theosophist, and women's rights activist, she became a leading figure in Indian nationalism.  Her involvement in the Home Rule League significantly boosted its profile.  She championed Indian self-rule and education.\n\nHome Rule Movement:  A movement in India during World War I that advocated for self-governance.  It had two main branches, one led by Bal Gangadhar Tilak and another by Annie Besant and S. Subramanya Iyer.  It aimed to raise political consciousness and prepare Indians for self-rule.\n\nTheosophical Society: Founded in 1875, it promoted a synthesis of Eastern and Western spiritual thought.  Annie Besant became its president, playing a large role in expanding its influence in India.  Its focus included universal brotherhood, psychic research, and the study of comparative religion.\n\nIndian National Congress:  The major political party in India during the freedom struggle.  Annie Besant served as its president in 1917, advocating for greater Indian participation in governance.  It played a crucial role in achieving Indian independence.\n"
    },
    {
        "q_num": 81,
        "question_text": "The Ilbert Bill controversy was related to the",
        "option_a": "imposition of certain restrictions to carry arms by the Indians",
        "option_b": "imposition of restrictions on newspapers and magazines published in Indian languages",
        "option_c": "removal of disqualifications imposed on the Indian magistrates with regard to the trial of the Europeans",
        "option_d": "removal of a duty on imported cotton cloth",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation: The Ilbert Bill controversy centered on a bill introduced by Sir Courtenay Ilbert, the Law Member of the Viceroy's Council.  The bill proposed to remove the bar on Indian magistrates trying European British citizens in criminal cases. This sparked outrage among the British community in India, leading to widespread protests and ultimately, the bill being amended to reduce its scope.\n\nThe Ilbert Bill: This bill aimed at removing racial discrimination in the Indian judicial system, allowing Indian magistrates to try European offenders.  The controversy highlighted the deep-seated racial prejudices and power imbalances within the colonial administration.\n\nIndian magistrates:  These were judicial officers appointed by the British Indian government, often from among educated Indians. Their powers and jurisdiction were subject to various restrictions imposed by the colonial administration, one of which was the inability to try Europeans.\n\nEuropeans: In the context of the Ilbert Bill, this refers to British citizens residing in India. Their privileged status under the law fuelled the controversy.\n"
    },
    {
        "q_num": 82,
        "question_text": "A rise in general level of prices may be caused by\n1. an increase in the money supply\n2. a decrease in the aggregate level of output\n3. an increase in the effective demand\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "1 and 2 only",
        "option_c": "2 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:A rise in the general price level, also known as inflation, can be caused by several factors.  An increase in the money supply (1) leads to more money chasing the same amount of goods, driving up prices. A decrease in the aggregate level of output (2) means fewer goods are available, increasing their relative scarcity and price. An increase in effective demand (3) signifies a surge in consumer spending and investment, exceeding the economy's capacity to produce, thus fueling inflationary pressure. Therefore, all three factors (1, 2, and 3) can contribute to a rise in the general price level.\n\n\nMoney supply: The total amount of money in circulation in an economy at a given time. It includes currency in circulation, demand deposits, and other liquid assets.  Changes in the money supply directly impact inflation.\n\nAggregate level of output: The total quantity of goods and services produced in an economy during a specific period.  A decrease in output can lead to cost-push inflation.\n\nEffective demand: The total demand for goods and services in an economy at a given price level, comprising consumer spending, investment, government spending, and net exports.  An increase in effective demand can lead to demand-pull inflation.\n\nCPI (Consumer Price Index): A measure of the average change in prices paid by urban consumers for a basket of consumer goods and services.  It's a key indicator of inflation.\n\nWPI (Wholesale Price Index): A measure of the average change in prices received by domestic producers for their output. It's another indicator of inflation, often preceding changes in CPI.\n\nGDP (Gross Domestic Product): The total monetary or market value of all the finished goods and services produced within a country's borders in a specific time period.\n\nGVA (Gross Value Added): A measure of the value of goods and services produced in an economy, net of the value of intermediate goods and services used in the production process.  It provides a more accurate picture of economic activity than GDP in some cases.\n"
    },
    {
        "q_num": 83,
        "question_text": "Which one of the following groups of items is included in India's foreign-exchange reserves?",
        "option_a": "Foreign-currency assets, Special Drawing Rights (SDRs) and loans from foreign countries",
        "option_b": "Foreign-currency assets, gold holdings of the RBI and SDRs",
        "option_c": "Foreign-currency assets, loans from the World Bank and SDRs",
        "option_d": "Foreign-currency assets, gold holdings of the RBI and loans from the World Bank",
        "correct_option": "b",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation: India's foreign-exchange reserves include foreign-currency assets, gold holdings of the RBI, and Special Drawing Rights (SDRs).  Loans from foreign countries or international organizations are not included in the reserves.\n\nForeign-currency assets:  These are assets held by the Reserve Bank of India (RBI) in various foreign currencies.  They represent the largest component of India's forex reserves and are primarily used for international transactions and maintaining exchange rate stability.\n\nGold holdings of the RBI: The RBI holds a significant amount of gold as part of its reserves.  Gold serves as a store of value and a hedge against currency fluctuations.  Its value in the reserves is based on prevailing market prices.\n\nSpecial Drawing Rights (SDRs): SDRs are international reserve assets created by the International Monetary Fund (IMF). They supplement the official reserves of member countries and can be exchanged for various currencies.  SDRs provide additional liquidity and stability to the international monetary system.\n"
    },
    {
        "q_num": 84,
        "question_text": "Which one of the following is likely to be the most inflationary in its effect?",
        "option_a": "Repayment of public debt",
        "option_b": "Borrowing from the public to finance a budget deficit",
        "option_c": "Borrowing from banks to finance a budget deficit",
        "option_d": "Creating new money to finance a budget deficit",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation:Creating new money to finance a budget deficit (monetization of deficit) is the most inflationary option.  When a government creates new money, it increases the money supply without a corresponding increase in the production of goods and services. This leads to an increase in demand without a sufficient increase in supply, causing prices to rise – inflation.\n\nRepaying public debt reduces the money supply, having a deflationary effect. Borrowing from the public or banks to finance a deficit increases demand for loanable funds, potentially increasing interest rates but doesn't directly inject new money into the economy to the same extent as creating new money.  Therefore, it's less inflationary than option (d).\n\nA short note on the named entities:\n\n* **Inflation:** A general increase in the prices of goods and services in an economy over a period of time.  When the price level rises, each unit of currency buys fewer goods and services. Consequently, inflation reflects a reduction in the purchasing power per unit of money – a loss of real value in the medium of exchange and unit of account within the economy.\n* **Public debt:** The total amount of money that a government owes to its creditors. This includes debt held by individuals, corporations, and other governments.\n* **Budget deficit:** The difference between a government's spending and its revenue in a given period.  If a government spends more than it earns in taxes and other revenue, it runs a budget deficit.\n* **Monetization of deficit:** The process by which a government finances its budget deficit by creating new money. This is typically done by the central bank purchasing government bonds.  It can lead to significant inflation if not managed carefully.\n* **Consumer Price Index (CPI):** A measure of the average change in prices paid by urban consumers for a basket of consumer goods and services.  It's a key indicator of inflation.\n* **Wholesale Price Index (WPI):** A measure of the average change in prices received by domestic producers for their output. It's another measure of inflation, but it focuses on wholesale prices rather than consumer prices.  It often precedes changes in CPI.\n* **Reserve Bank of India (RBI):** India's central bank responsible for monetary policy, managing the country's foreign exchange reserves, and regulating the banking system.  Its actions significantly influence inflation.\n* **Fiscal policy:** Government policy relating to revenue, expenditure and debt management.  It has a significant impact on inflation.\n* **Monetary policy:** Actions undertaken by a central bank to manipulate the money supply and credit conditions to stimulate or restrain economic activity.  It's a key tool for managing inflation.\n\n\n"
    },
    {
        "q_num": 85,
        "question_text": "Supply of money remaining the same when there is an increase in demand for money, there will be",
        "option_a": "a fall in the level of prices",
        "option_b": "an increase in the rate of interest",
        "option_c": "a decrease in the rate of interest",
        "option_d": "an increase in the level of income and employment",
        "correct_option": "b",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (b)\nexplanation:When the supply of money is constant and the demand for money increases, the price of money (interest rate) must rise to equate supply and demand.  This is because with a fixed money supply, increased demand leads to scarcity, driving up the cost of borrowing.\n\nMoney supply: The total amount of money in circulation within an economy.  It includes various forms like currency, demand deposits, and other liquid assets.  Different measures exist (M1, M2, M3, M4), reflecting varying degrees of liquidity.  Central banks manage money supply through monetary policy tools.\n\nDemand for money: The amount of money individuals and firms wish to hold at a given time.  Demand is influenced by factors like income levels, interest rates, and price levels.  Higher income and prices typically increase money demand.\n\nInterest rate: The cost of borrowing money.  It represents the return lenders earn for forgoing the use of their funds.  Interest rates influence borrowing and investment decisions, impacting economic activity.  Central banks influence interest rates through monetary policy.\n\nPrice level: The average price of goods and services in an economy.  Inflation reflects a sustained increase in the price level, while deflation represents a sustained decrease.  Money supply and demand significantly impact price levels.\n\nIncome and employment:  Income represents the earnings of individuals and firms, while employment refers to the number of people working.  Both are key indicators of economic health, influenced by factors like interest rates, investment, and government policies.\n"
    },
    {
        "q_num": 86,
        "question_text": "Fruits stored in a cold chamber exhibit longer storage life because",
        "option_a": "exposure to sunlight is prevented",
        "option_b": "concentration of carbon dioxide in the environment is increased",
        "option_c": "rate of respiration is decreased",
        "option_d": "there is an increase in humidity",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Storing fruits in a cold chamber slows down the rate of respiration. Respiration is a metabolic process that produces heat and consumes oxygen, leading to the spoilage of fruits. Lowering the temperature reduces the rate of respiration, thus extending the storage life of the fruits.\n\nFruits: The edible part of a plant, often sweet and juicy.  A major agricultural product with significant post-harvest losses.\n\nCold chamber: A refrigerated storage facility used to preserve perishable goods, slowing down their rate of deterioration.  Essential for maintaining the quality and extending shelf life of fruits and vegetables.\n\nRespiration: The metabolic process in living organisms where energy is released from organic substances. In fruits, it leads to the production of heat and carbon dioxide, contributing to spoilage.  Lowering the temperature reduces its rate.\n\nSunlight exposure:  Exposure to sunlight can cause fruits to ripen faster and spoil more quickly due to increased heat and potential damage.  Cold storage prevents this.\n\nCarbon dioxide concentration: While increased carbon dioxide can sometimes slow down respiration in some fruits, it's not the primary reason for extended storage life in cold chambers.  The primary factor is the reduced temperature.\n\nHumidity: Humidity levels are important for maintaining fruit quality but are secondary to temperature in extending storage life.  Appropriate humidity levels prevent excessive moisture loss or wilting.\n"
    },
    {
        "q_num": 87,
        "question_text": "Consider the following fauna of India:\n1. Gharial\n2. Leatherback turtle\n3. Swamp deer\nWhich of the above is/are endangered?",
        "option_a": "1 and 2 only",
        "option_b": "3 only",
        "option_c": "1, 2 and 3",
        "option_d": "None",
        "correct_option": "c",
        "subject": "environment",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation:The Gharial (Gavialis gangeticus) is critically endangered,  the Leatherback turtle (Dermochelys coriacea) is vulnerable, and the Swamp deer (Cervus duvauceli) is endangered.  Therefore, all three are considered threatened.  The Gharial is a critically endangered crocodilian found in the rivers of the Indian subcontinent. Its population has drastically declined due to habitat loss and poaching. The Leatherback turtle is a large marine turtle with a wide distribution, but its populations are facing threats from fishing, pollution, and climate change. The Swamp deer is an endangered species of deer inhabiting the wetlands and grasslands of the Indian subcontinent.  Habitat loss and hunting are major threats to its survival.\n"
    },
    {
        "q_num": 88,
        "question_text": "Ball bearings are used in bicycles, cars, etc., because",
        "option_a": "the actual area of contact between the wheel and axle is increased",
        "option_b": "the effective area of contact between the wheel and axle is increased",
        "option_c": "the effective area of contact between the wheel and axle is reduced",
        "option_d": "None of the above statements is correct",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (c)\n\nexplanation: Ball bearings reduce friction by replacing sliding contact with rolling contact.  Instead of the wheel and axle rubbing directly against each other (large contact area, high friction), the ball bearings create many small points of contact, significantly reducing the effective area of contact between the wheel and axle.  This minimizes friction and wear, allowing for smoother and more efficient rotation.\n\nBall bearings:  These are rolling elements used to reduce friction between moving parts.  They consist of small, hard spheres (balls) contained within a raceway.\n\nWheel: A circular device that rotates around an axle.  Wheels are essential components of many machines and vehicles for facilitating movement.\n\nAxle: A rod or shaft that passes through the center of a wheel allowing it to rotate.  The axle is a crucial part of any rotating mechanism.\n"
    },
    {
        "q_num": 89,
        "question_text": "Consider the following phenomena:\n1. Size of the sun at dusk\n2. Colour of the sun at dawn\n3. Moon being visible at dawn\n4. Twinkle of stars in the sky\n5. Polestar being visible in the sky\nWhich of the above are optical illusions?",
        "option_a": "1, 2 and 3",
        "option_b": "3, 4 and 5",
        "option_c": "1, 2 and 4",
        "option_d": "2, 3 and 5",
        "correct_option": "a",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: Optical illusions are deceptive appearances.\n\n1. **Size of the sun at dusk:** The sun appears larger at dusk due to atmospheric refraction.  Light bends as it passes through the atmosphere, making the sun seem bigger than it actually is. This is not a trick of the eye in the sense that the perception is based on a real phenomenon – the bending of light – but it is a misrepresentation of the sun's actual size.\n\n2. **Colour of the sun at dawn:** The sun appears reddish at dawn and dusk because of Rayleigh scattering.  Shorter wavelengths of light (blue) are scattered more by the atmosphere than longer wavelengths (red), leading to the reddish hue. Again, this is a real atmospheric effect that alters our perception of the sun's color.\n\n3. **Moon being visible at dawn:** The moon's visibility at dawn is not an illusion; it's a matter of its position relative to the sun and Earth.  It's simply a matter of celestial mechanics and not a perceptual trick.\n\n4. **Twinkle of stars:** Stars twinkle due to atmospheric turbulence. Light from stars bends as it passes through the Earth's atmosphere, causing the apparent twinkling effect. This is a real atmospheric effect that affects our perception.\n\n5. **Polestar being visible:** The visibility of the Polestar (Polaris) is not an illusion; it's a result of its location near the celestial north pole. Its visibility depends on the observer's location and atmospheric conditions, but it's not an optical illusion.\n\nTherefore, only 1 and 2 can be considered optical illusions in the sense that they are misrepresentations of the sun's size and color due to real atmospheric effects.  However, the question is ambiguous as to what constitutes an \"optical illusion\".\n\n"
    },
    {
        "q_num": 90,
        "question_text": "Rainbow is produced when sunlight falls on drops of rain. Which of the following physical phenomena are responsible for this?\n1. Dispersion\n2. Refraction\n3. Internal reflection\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: Rainbow formation involves three physical phenomena:\n\n1. **Dispersion:** Sunlight is a mixture of seven colors. When sunlight enters a raindrop, it is refracted (bent) and dispersed into its constituent colors.  Different colors of light have different wavelengths, and are refracted at slightly different angles.\n\n2. **Refraction:**  The bending of light as it passes from one medium (air) to another (water) is called refraction. This occurs twice in a raindrop: once when light enters and again when it exits.\n\n3. **Internal reflection:**  After the first refraction, the light undergoes internal reflection within the raindrop before exiting. This reflection further separates the colors and intensifies the effect.\n\nThe combination of these three processes separates the white sunlight into its constituent colors, resulting in a rainbow.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Dispersion:** The separation of white light into its constituent colors (spectrum) due to differences in their wavelengths.  This is observed when light passes through a prism or raindrops.\n\n* **Refraction:** The bending of light as it passes from one medium to another with a different refractive index.  The amount of bending depends on the angle of incidence and the refractive indices of the two media.\n\n* **Internal reflection:** The reflection of light within a medium, occurring when the angle of incidence exceeds the critical angle. This happens when light travels from a denser medium to a rarer medium.\n\n* **Sunlight:** Electromagnetic radiation emitted by the Sun, composed primarily of visible light, infrared radiation, and ultraviolet radiation.  It is essential for photosynthesis and many other processes on Earth.\n\n* **Raindrops:** Droplets of water condensed from atmospheric water vapor. Their spherical shape and refractive properties are crucial for rainbow formation.\n\n\n"
    },
    {
        "q_num": 91,
        "question_text": "Many transplanted seedlings do not grow because",
        "option_a": "the new soil does not contain favourable minerals",
        "option_b": "most of the root hairs grip the new soil too hard",
        "option_c": "most of the root hairs are lost during transplantation",
        "option_d": "leaves get damaged during transplantation",
        "correct_option": "c",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation:  Transplanted seedlings often fail to thrive because a significant portion of their root hairs, crucial for water and nutrient absorption, are lost during the transplantation process.  The other options are less likely to be the primary cause of failure.  While unfavorable soil minerals (a) can impact growth, it's not the most common reason for failure immediately after transplanting. Root hairs gripping the soil too hard (b) is not a typical problem. Leaf damage (d) during transplantation can certainly stress the seedling, but root hair loss is generally a more significant factor affecting immediate survival.\n"
    },
    {
        "q_num": 92,
        "question_text": "Economic growth in country X will necessarily have to occur if",
        "option_a": "there is technical progress in the world economy",
        "option_b": "there is population growth in X",
        "option_c": "there is capital formation in X",
        "option_d": "the volume of trade grows in the world economy",
        "correct_option": "c",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (c)\nexplanation: Economic growth in country X doesn't *necessarily* occur due to (a) world technical progress, (b) population growth in X, or (d) world trade growth.  These factors can influence growth, but aren't guaranteed to lead to it.  Capital formation in X (c), however, is a necessary condition.  Capital formation refers to the increase in the stock of capital goods (machinery, equipment, infrastructure) within an economy.  An increase in capital goods directly contributes to increased productivity and output, which is the definition of economic growth.  Population growth without investment in capital can lead to lower per capita income.  Technological progress globally might not benefit country X if it doesn't adopt or adapt the technology. Similarly, increased global trade doesn't guarantee growth for country X if it doesn't participate or benefit from it.\n\nShort notes on important keywords and named entities:\n\n**Economic Growth:**  An increase in the production of goods and services in an economy over a period of time. It is usually measured by changes in real gross domestic product (GDP).  Higher economic growth often leads to improved living standards, but it's not a perfect measure of overall well-being.\n\n**Technical Progress:** Advances in technology and knowledge that improve the efficiency of production. This can lead to higher output with the same or fewer inputs. Technical progress is a key driver of long-term economic growth.\n\n**Population Growth:** An increase in the number of people in a country or region. While it can increase the labor force and potentially boost economic activity, it also places demands on resources and infrastructure.  Rapid population growth without corresponding economic development can lead to poverty.\n\n**Capital Formation:** The process of creating and accumulating capital goods, including machinery, equipment, and infrastructure. It is crucial for economic growth as it enhances productivity.  Insufficient capital formation can hinder economic advancement.\n\n**Volume of Trade:** The total value or quantity of goods and services exchanged in international trade.  Higher trade volume can stimulate economic activity but is not a guarantee of economic growth for any single country.  A country might experience a trade deficit despite increased global trade.\n\n**Country X:** A hypothetical country used in the question to illustrate the relationship between different economic factors and growth.  The characteristics of Country X are not specified, making it a generic representation of an economy.\n\n"
    },
    {
        "q_num": 93,
        "question_text": "Which of the following statements is/are correct?\n1. Viruses lack enzymes necessary for the generation of energy.\n2. Viruses can be cultured in any synthetic medium.\n3. Viruses are transmitted from one organism to another by biological vectors only.\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation:\n\n1. **Viruses lack enzymes necessary for the generation of energy:** This statement is correct. Viruses are obligate intracellular parasites, meaning they rely entirely on the host cell's machinery for replication and metabolism. They lack the necessary enzymes and organelles for energy production (like mitochondria).\n\n2. **Viruses can be cultured in any synthetic medium:** This statement is incorrect. Viruses require living host cells to replicate.  They cannot be grown in artificial media alone because they lack the metabolic capabilities to synthesize the components they need for reproduction.\n\n3. **Viruses are transmitted from one organism to another by biological vectors only:** This statement is incorrect. While biological vectors (like mosquitoes for Zika virus) play a crucial role in the transmission of some viruses, many viruses are transmitted through various routes, including direct contact (e.g., influenza), respiratory droplets (e.g., COVID-19), fecal-oral routes (e.g., rotavirus), and contaminated objects (e.g., norovirus).\n\nTherefore, only statement 1 is correct.\n"
    },
    {
        "q_num": 94,
        "question_text": "Which of the following leaf modifications occurs/occur in desert areas to inhibit water loss?\n1. Hard and waxy leaves\n2. Tiny leaves or no leaves\n3. Thorns instead of leaves\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: Desert plants exhibit adaptations to minimize water loss.  Hard and waxy leaves (1) reduce transpiration by creating a barrier against water evaporation. Tiny leaves or the absence of leaves (2) decreases the surface area available for transpiration. Thorns (3), which are modified leaves, further reduce water loss while also providing protection from herbivores. Therefore, all three modifications are found in desert environments to conserve water.\n"
    },
    {
        "q_num": 95,
        "question_text": "The known forces of nature can be divided into four classes, viz., gravity, electromagnetism, weak  nuclear force and strong nuclear force. With reference to them, which one of the following statements is not correct?",
        "option_a": "Gravity is the strongest of the four",
        "option_b": "Electromagnetism acts only on particles with an electric charge",
        "option_c": "Weak nuclear force causes radioactivity",
        "option_d": "Strong nuclear force holds protons and neutrons inside the nucleus of an atom",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: Gravity is the weakest of the four fundamental forces, not the strongest.  Electromagnetism acts on charged particles. The weak nuclear force is responsible for radioactive decay. The strong nuclear force binds protons and neutrons together in the atomic nucleus.\n\nGravity:  One of the four fundamental forces, gravity is the force of attraction between objects with mass. It's the weakest force but acts over vast distances, governing the motion of planets and stars.\n\nElectromagnetism: This force governs the interactions between electrically charged particles. It's responsible for phenomena like light, electricity, and magnetism.\n\nWeak nuclear force: This force is responsible for radioactive decay, a process where unstable atomic nuclei transform into more stable ones. It's involved in certain types of nuclear reactions.\n\nStrong nuclear force: This is the strongest of the four fundamental forces. It acts within the atomic nucleus, binding protons and neutrons together despite the electrostatic repulsion between the positively charged protons.\n"
    },
    {
        "q_num": 96,
        "question_text": "The efforts to detect the existence of Higgs boson particle have become frequent news in the recent past. What is/are the importance/ importances of discovering this particle?\n1. It will enable us to understand as to why elementary particles have mass.\n2. It will enable us in the near future to develop the technology of transferring matter from one point to another without traversing the physical space between them.\n3. It will enable us to create better fuels for nuclear fission.\nSelect the correct answer using the codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (a)\n\nexplanation: Discovering the Higgs boson is primarily important because it helps explain why elementary particles have mass.  The Higgs field, associated with the Higgs boson, interacts with particles, giving them mass.  Options 2 and 3 are incorrect.  There is currently no scientific basis to suggest that discovering the Higgs boson will lead to matter transportation or improved nuclear fission fuels.\n\nHiggs boson:  A fundamental particle predicted by the Standard Model of particle physics. Its discovery confirmed the existence of the Higgs field, a field that permeates all of space and interacts with particles to give them mass.\n\nElementary particles: The fundamental constituents of matter, such as quarks, leptons, and bosons.  They are considered to be indivisible and are the building blocks of all other matter.\n\nMass: A measure of an object's resistance to acceleration.  In the context of particle physics, mass is a fundamental property that influences how particles interact with each other and with forces.\n\nNuclear fission: A nuclear reaction where a heavy atomic nucleus splits into smaller nuclei, releasing a large amount of energy.  The process is used in nuclear power plants and nuclear weapons.\n"
    },
    {
        "q_num": 97,
        "question_text": "Mycorrhizal biotechnology has been used in rehabilitating degraded sites because mycorrhiza enables the plants to\n1. resist drought and increase absorptive area\n2. tolerate extremes of pH\n3. resist disease infestation\nSelect the correct answer using the Codes given below.",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2013,
        "explanation": "correct_option: (d)\nexplanation: Mycorrhizae are symbiotic relationships between fungi and plant roots.  These fungi increase the absorptive surface area of plant roots, enhancing nutrient and water uptake, thus improving drought resistance (1). Mycorrhizae also improve a plant's ability to tolerate diseases (3) by acting as a physical barrier to pathogens and by stimulating the plant's immune system. While mycorrhizae can indirectly influence pH tolerance (2) by altering nutrient availability, their direct impact on pH extremes is less significant compared to their effects on drought resistance and disease resistance.  Therefore, options 1 and 3 are the most direct and significant benefits of mycorrhizae in rehabilitating degraded sites.\n\nMycorrhizal biotechnology:  The application of mycorrhizal fungi to improve plant growth and soil health.  It's a sustainable approach used in land restoration.\n\nDegraded sites: Areas of land that have experienced significant loss of productivity and biodiversity due to various factors like pollution, deforestation, or unsustainable agricultural practices.  Rehabilitation aims to restore the ecological function and value of these sites.\n"
    },
    {
        "q_num": 98,
        "question_text": "Who among the following constitute the National Development Council?\n1. The Prime Minister\n2. The Chairman, Finance Commission\n3. Ministers of the Union Cabinet\n4. Chief Ministers of the States\nSelect the correct answer using the codes given below.",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "correct_option: (d)\n\nexplanation:The National Development Council (NDC) includes the Prime Minister, Union Cabinet Ministers, and Chief Ministers of States.  The Chairman of the Finance Commission is not a member. Therefore, the correct option is (d).\n\nPrime Minister: The head of government in India, leading the Union Cabinet and responsible for overall governance.\n\nUnion Cabinet Ministers: Ministers heading various ministries of the Union government, responsible for specific policy areas.\n\nChief Ministers of States: Heads of state governments in India, responsible for the administration of their respective states.\n\nFinance Commission: A constitutional body that makes recommendations to the President of India on the distribution of net proceeds of taxes between the Union and the States, and grants-in-aid to the States.  While its recommendations are crucial for resource allocation, its chairman isn't a member of the NDC.\n"
    },
    {
        "q_num": 99,
        "question_text": "The national income of a country for a given period is equal to the",
        "option_a": "total value of goods and services produced by the nationals",
        "option_b": "sum of total consumption and investment expenditure",
        "option_c": "sum of personal income of all individuals",
        "option_d": "money value of final goods and services produced",
        "correct_option": "d",
        "subject": "polity",
        "year": 2013,
        "explanation": "* **correct_option:** (d)\n\n* **explanation:** National income is the total value of final goods and services produced within a country's borders during a specific period. Option (d) accurately reflects this definition.\n\nOption (a) refers to Gross National Product (GNP), which includes goods and services produced by a nation's citizens both domestically and abroad.  Option (b) describes aggregate demand, a component of national income but not the income itself. Option (c) focuses on personal income, which excludes business profits and other income components included in national income.  Therefore, only option (d) correctly defines national income.\n\n**Short notes on important keywords and named entities:**\n\n* **National income:** The total value of goods and services produced within a country's geographical boundaries in a specific period. It's a key indicator of a nation's economic performance.\n\n* **Gross National Product (GNP):** The total value of goods and services produced by a country's residents, regardless of location.  It differs from GDP by including income earned abroad by domestic residents and excluding income earned domestically by foreign residents.\n\n* **Aggregate demand:**  The total demand for goods and services in an economy at a given price level. It's a macroeconomic concept comprising consumption, investment, government spending, and net exports.\n\n* **Personal income:** The total income received by individuals in a country, including wages, salaries, interest, dividends, and other sources of income. It excludes certain types of business income included in national income calculations.\n\n* **Final goods and services:** Goods and services that are sold to the final consumer and not used in the production of other goods and services.  Intermediate goods are excluded from national income calculations to avoid double counting.\n"
    },
    {
        "q_num": 100,
        "question_text": "Which of the following grants/grant direct credit assistance to rural households?\n1. Regional Rural Banks\n2. National Bank for Agriculture and Rural Development\n3. Land Development Banks\nSelect the correct answer using the codes given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2013,
        "explanation": "correct_option: (a)\nexplanation: Regional Rural Banks (RRBs) are primarily designed to provide credit and other financial services to rural areas, directly assisting rural households.  The National Bank for Agriculture and Rural Development (NABARD) provides financial assistance to institutions involved in rural development, including credit support, but doesn't directly grant credit to rural households. Land Development Banks primarily focus on providing long-term credit for land improvement and development, not directly to individual households.  Therefore, only RRBs provide direct credit assistance to rural households.\n\nRegional Rural Banks (RRBs): RRBs are a type of scheduled commercial bank in India, specifically designed to serve rural areas. They provide credit and other banking facilities to rural households and small businesses, playing a crucial role in rural financial inclusion.\n\nNational Bank for Agriculture and Rural Development (NABARD): NABARD is an apex development finance institution in India, dedicated to promoting sustainable rural development.  It acts as a refinancing institution for rural financial institutions, providing credit and other support for rural infrastructure and development initiatives.\n\nLand Development Banks (LDBs): LDBs are cooperative institutions that primarily focus on providing long-term credit to farmers for land improvement and development projects.  Their role is more in agricultural infrastructure than in direct credit to individual rural households.\n"
    }
]