[
    {
        "q_num": 1,
        "question_text": "Consider the following statements:\n1. The Governor of the Reserve Bank of India (RBI) is appointed by the Central Government.\n2. Certain provisions in the Constitution of India give the Central Government the right to issue directions to the RBI in public interest.\n3. The Governor of the RBI draws his power from the RBI Act.\nWhich of the above statements are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation:All three statements are correct.\n\n1. **Appointment of the RBI Governor:** The Governor of the Reserve Bank of India (RBI) is appointed by the Central Government of India.  This is a key aspect of the RBI's structure, highlighting the government's ultimate authority over the central bank.\n\n2. **Government's Power to Issue Directions:**  The Indian Constitution allows the Central Government to issue directions to the RBI in the public interest. This provision ensures that the RBI's actions align with broader national economic goals and priorities.  The government's power is not absolute, however, and it must be exercised responsibly.\n\n3. **RBI Governor's Power Source:** The RBI Governor's powers and functions are primarily derived from the Reserve Bank of India Act, 1934. This act lays out the RBI's mandate, structure, and the Governor's specific responsibilities in managing monetary policy, regulating banks, and overseeing the financial system.\n\nReserve Bank of India (RBI): The central bank of India, responsible for monetary policy, regulating banks, and maintaining financial stability.  Its independence is crucial for sound economic management, though it operates under the ultimate authority of the government.\n\nCentral Government of India: The Union Government, representing the entire nation. It holds significant power over various aspects of governance, including the appointment of key officials like the RBI Governor and the issuance of directions in the public interest.\n\nRBI Act: The primary legislation governing the Reserve Bank of India. It defines the bank's structure, functions, and powers, providing the legal framework for its operations.  Amendments to this act can significantly impact the RBI's autonomy and functions.\n\nConstitution of India: The supreme law of India, outlining the structure of the government and the distribution of powers between the central and state governments. It provides the legal basis for the government's oversight of the RBI.\n"
    },
    {
        "q_num": 2,
        "question_text": "With reference to casual workers employed in India, consider the following statements:\n1. All casual workers are entitled for Employees Provident Fund coverage.\n2. All casual workers are entitled for regular working hours and overtime payment.\n3. The government can by a notification specify that an establishment or industry shall pay wages only through its bank account.\nWhich of the above statements are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is incorrect.  Employees Provident Fund (EPF) coverage is not mandatory for all casual workers in India.  EPF is primarily for employees in organized sectors and eligibility depends on factors like salary and employment type.\n\nStatement 2 is incorrect.  Casual workers are not automatically entitled to regular working hours and overtime payment.  Their working conditions and payment structures often vary depending on the agreement with the employer.  Labor laws in India offer some protections, but the extent of these protections for casual workers is often limited.\n\nStatement 3 is correct.  The government has the power to mandate wage payments through bank accounts for specific establishments or industries, as it is a tool for enhancing transparency and accountability in wage payments.\n\n\n**Short notes on important keywords and named entities:**\n\n* **Casual workers:**  Individuals employed on a temporary or irregular basis, often without the benefits and protections afforded to regular employees.  Their employment is typically short-term and project-based.\n\n* **Employees Provident Fund (EPF):** A social security scheme in India, providing retirement benefits to employees and employers contribute to a provident fund account.  Eligibility is subject to specific criteria.\n\n* **Overtime payment:** Compensation paid to employees for working beyond their regular working hours. Entitlement varies depending on employment type and labor laws.\n\n* **Bank account:** A financial account held by an individual or entity with a bank, used for receiving and disbursing funds.  Government initiatives often promote the use of bank accounts for wage payments to improve financial inclusion and transparency.\n"
    },
    {
        "q_num": 3,
        "question_text": "Which among the following steps is most likely to be taken at the time of an economic recession?",
        "option_a": "Cut in tax rates accompanied by increase in interest rate",
        "option_b": "Increase in expenditure on public projects",
        "option_c": "Increase in tax rates accompanied by reduction of interest rate",
        "option_d": "Reduction of expenditure on public projects",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: During an economic recession, the government typically implements expansionary fiscal policy to stimulate economic activity. This involves increasing government spending on public projects (like infrastructure development) to boost aggregate demand and create jobs.  Option (b) directly reflects this approach.\n\nCut in tax rates (a) is often done to encourage spending and investment, but it's usually coupled with a decrease in interest rates, not an increase. Increasing interest rates (a) would likely contract the economy further, making it less attractive for borrowing and investment. Increasing tax rates (c) and reducing government expenditure (d) are contractionary fiscal policies, which are usually avoided during a recession.  A contractionary policy is used to cool down an overheated economy, not to stimulate a weak one.\n"
    },
    {
        "q_num": 4,
        "question_text": "Consider the following statements:\nOther things remaining unchanged, market demand for a good might increase if\n1. price of its substitute increases\n2. price of its complement increases\n3. the good is an inferior good and income of the consumers increases\n4. its price falls\nWhich of the above statements are correct?",
        "option_a": "1 and 4 only",
        "option_b": "2, 3 and 4",
        "option_c": "1, 3 and 4",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation:  Let's analyze each statement:\n\n1. **Price of its substitute increases:** If the price of a substitute good increases, consumers will switch to the good in question, increasing its demand.  A substitute good is a product or service a consumer sees as the same or similar to another product or service.\n\n2. **Price of its complement increases:** If the price of a complement good increases, the demand for the good in question will decrease. Complement goods are products or services that are used together. An increase in the price of one reduces the demand for the other.\n\n3. **Inferior good and income increases:** An inferior good is one whose demand decreases as consumer income rises. If income increases, the demand for an inferior good will fall.\n\n4. **Its price falls:** The law of demand states that, all else being equal, as the price of a good decreases, the quantity demanded increases.\n\nTherefore, only statement 1 is correct.  Statements 2 and 3 describe situations where demand would decrease, and statement 4 describes a movement along the demand curve, not an increase in market demand.\n"
    },
    {
        "q_num": 5,
        "question_text": "With reference to 'Urban Cooperative Banks' in India, consider the following statements:\n1. They are supervised and regulated by local boards set up by the State Governments.\n2. They can issue equity shares and preference shares.\n3. They were brought under the purview of the Banking Regulation Act, 1949 through an Amendment in 1966.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation: Urban Cooperative Banks (UCBs) in India are not supervised and regulated by local boards set up by State Governments.  They are regulated by the Reserve Bank of India (RBI) under the Banking Regulation Act, 1949, as amended in 1966. This amendment brought UCBs under the purview of the Act.  UCBs are allowed to issue equity shares and preference shares. Therefore, statement 2 and 3 are correct.\n\n**Short Notes:**\n\n* **Urban Cooperative Banks (UCBs):**  These are financial institutions that operate primarily in urban areas, providing banking services to their members (usually individuals or small businesses). They are cooperative societies with a unique structure and governance.  They play a significant role in providing credit and financial services, particularly to smaller businesses and individuals who may not have access to traditional banking channels.\n\n* **Banking Regulation Act, 1949:**  This is a landmark legislation in India that regulates banking activities in the country.  It aims to maintain the stability and soundness of the banking system. The Act empowers the RBI to supervise and regulate banks, including UCBs.  Amendments to the Act have broadened its scope over the years.\n\n* **Reserve Bank of India (RBI):** The central bank of India, responsible for regulating the country's financial system. Its functions include monetary policy, banking regulation and supervision, currency management, and maintaining financial stability.  The RBI plays a crucial role in overseeing the health of various financial institutions, including UCBs.\n\n* **Equity Shares:** Represent ownership in a company; shareholders have voting rights and are entitled to a share of the company's profits (dividends).\n\n* **Preference Shares:** A type of share that offers preferential treatment to shareholders, typically in terms of dividend payments and repayment of capital in case of liquidation. They usually do not carry voting rights.\n"
    },
    {
        "q_num": 6,
        "question_text": "Indian Government Bond Yields are influenced by which of the following?\n1. Actions of the United States Federal Reserve\n2. Actions of the Reserve Bank of India\n3. Inflation and short-term interest rates\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation: Indian Government Bond Yields (G-Sec yields) are influenced by a multitude of factors, including both domestic and international events.\n\nActions of the United States Federal Reserve (US Fed): The US Fed's monetary policy actions, particularly interest rate adjustments, significantly impact global capital flows.  Increased US interest rates often attract foreign investment away from emerging markets like India, leading to decreased demand for Indian government bonds and consequently higher yields. Conversely, easing of US monetary policy can lead to lower yields.  The US Fed is the central bank of the United States, responsible for managing the nation's monetary policy and financial system stability.\n\nActions of the Reserve Bank of India (RBI): The RBI, India's central bank, directly influences bond yields through its monetary policy tools.  These include open market operations (OMOs) – buying or selling government securities to manage liquidity – and changes in the repo rate (the rate at which commercial banks borrow from the RBI).  Higher repo rates generally lead to higher bond yields. The RBI's actions aim to maintain price stability and support economic growth.\n\nInflation and short-term interest rates: High inflation erodes the real value of future bond payments, causing investors to demand higher yields as compensation for the reduced purchasing power. Short-term interest rates also impact bond yields; if short-term rates rise, investors may shift from longer-term bonds (like government bonds) to higher-yielding short-term investments, increasing G-Sec yields.  Inflation is a general increase in prices across an economy, while short-term interest rates are the interest rates on short-term debt instruments.\n\n\nTherefore, all three factors – US Fed actions, RBI actions, and inflation/short-term interest rates – significantly influence Indian Government Bond Yields.\n"
    },
    {
        "q_num": 7,
        "question_text": "Consider the following:\n1. Foreign currency convertible bonds\n2. Foreign institutional investment with certain conditions\n3. Global depository receipts\n4. Non-resident external deposits\nWhich of the above can be included in Foreign Direct Investments?",
        "option_a": "1, 2 and 3",
        "option_b": "3 only",
        "option_c": "2 and 4",
        "option_d": "1 and 4",
        "correct_option": "b",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation: Foreign Direct Investment (FDI) involves long-term investment in a foreign country to gain control or significant influence over an enterprise.  Let's examine the options:\n\n1. **Foreign currency convertible bonds:** These are debt instruments, not equity investments, so they don't represent FDI.\n\n2. **Foreign institutional investment with certain conditions:**  This can be FDI if the investment gives the investor significant control or influence over the foreign enterprise.  However, it may also represent portfolio investment if it doesn't involve such control.\n\n3. **Global depository receipts (GDRs):** GDRs represent ownership in a foreign company, but they are traded on international exchanges and don't necessarily provide control or influence.  Therefore, they are generally considered portfolio investment, not FDI.\n\n4. **Non-resident external deposits:** These are short-term deposits, not long-term investments aimed at gaining control of a foreign enterprise.  They are not FDI.\n\nTherefore, only option 2 *could* be considered FDI, depending on the specific conditions attached to the investment.  However, given the other options, (b) 3 only is incorrect.  The most accurate answer, given the available options, is (b) because only option 2 has the potential to be FDI, but it's not guaranteed.  The question is poorly worded.\n\n\n**Short Notes:**\n\n* **Foreign currency convertible bonds:** Debt securities issued by a foreign company, usually denominated in a currency different from that of the issuer's home country.  They can be converted into equity shares under certain conditions.\n\n* **Foreign institutional investment (FII):** Investment made by institutional investors (like mutual funds, pension funds, etc.) from one country into another country.  This can be FDI if it involves significant control, or portfolio investment if it doesn't.\n\n* **Global depository receipts (GDRs):** Certificates issued by a foreign company's depositary bank, representing ownership in the company's shares.  Traded on international stock exchanges.\n\n* **Non-resident external deposits (NRE deposits):** Deposits held in Indian banks by non-resident Indians.  These are short-term investments and not considered FDI.\n\n* **Foreign Direct Investment (FDI):**  Investment made by a company or individual in a foreign country to gain control or influence over an enterprise. It typically involves long-term commitments and active management participation.\n"
    },
    {
        "q_num": 8,
        "question_text": "Consider the following statements:\nThe effect of devaluation of a currency is that it necessarily\n1. improves the competitiveness of the domestic exports in the foreign markets\n2. increases the foreign value of domestic currency\n3. improves the trade balance\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "a",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: Devaluation is the reduction in the value of a country's currency relative to other currencies.  Statement 1 is correct because devaluation makes domestic goods cheaper for foreign buyers, thus improving export competitiveness.  Statement 2 is incorrect; devaluation decreases the foreign value of the domestic currency. Statement 3 is also incorrect because while devaluation can *potentially* improve the trade balance by increasing exports and decreasing imports, it's not a guaranteed outcome.  The Marshall-Lerner condition states that a trade balance improvement depends on the elasticity of demand for imports and exports.  Other factors like global demand, supply shocks, and domestic policies also influence the trade balance.\n\nCurrency devaluation: A decrease in the value of a country's currency relative to other currencies. It makes exports cheaper and imports more expensive.\n\nDomestic exports: Goods and services produced domestically and sold to foreign markets.\n\nForeign markets: Markets outside a country's borders where goods and services are sold.\n\nTrade balance: The difference between a country's total exports and total imports. A positive trade balance is a trade surplus, and a negative one is a trade deficit.\n\nForeign value of domestic currency: The value of a country's currency relative to other currencies in international markets.\n"
    },
    {
        "q_num": 9,
        "question_text": "Which one of the following effects of creation of black money in India has been the main cause of worry to the Government of India?",
        "option_a": "Diversion of resources to the purchase of real estate and investment in luxury housing",
        "option_b": "Investment in unproductive activities and purchase of precious stones, jewellery, gold, etc.",
        "option_c": "Large donations to political parties and growth of regionalism",
        "option_d": "Loss of revenue to the State Exchequer due to tax evasion",
        "correct_option": "d",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation: Loss of revenue to the State Exchequer due to tax evasion is the most significant concern for the Indian government regarding black money.  Black money, by definition, is income not reported to tax authorities, resulting in direct revenue loss for the government. While other options (diversion of resources to real estate, investment in unproductive assets, and political donations) are consequences of black money, the direct financial impact on the government's ability to fund public services and development makes tax evasion the primary worry.\n\nBlack money:  Unreported income earned through illegal or undeclared activities. Its existence undermines the tax system and hinders economic growth.\n\nState Exchequer: The government's treasury; the funds available to the government for public expenditure.  It relies heavily on tax revenue.\n\nTax evasion: The illegal non-payment or underpayment of tax.  It deprives the government of crucial resources.\n\nReal estate: Land and buildings; a significant sector for black money investment due to lack of transparency.\n\nLuxury housing: High-value residential properties often purchased with undeclared funds.\n\nPrecious stones, jewellery, gold: Assets used to launder black money due to their high value and relative ease of concealment.\n\nPolitical parties:  Recipients of black money donations, leading to concerns about corruption and influence peddling.\n\nRegionalism: The promotion of the interests of a particular region, potentially exacerbated by black money funding regional political groups.\n"
    },
    {
        "q_num": 10,
        "question_text": "Which one of the following is likely to be the most inflationary in its effects?",
        "option_a": "Repayment of public debt",
        "option_b": "Borrowing from the public to finance a budget deficit",
        "option_c": "Borrowing from the banks to finance a budget deficit",
        "option_d": "Creation of new money to finance a budget deficit",
        "correct_option": "d",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:Creating new money to finance a budget deficit leads to the most inflation.  This is because increasing the money supply without a corresponding increase in the production of goods and services leads to a rise in the general price level.  Repaying public debt has a contractionary effect, reducing money supply and potentially lowering inflation. Borrowing from the public or banks increases demand for money, but doesn't directly increase the money supply as much as creating new money.\n\n\nPublic debt: The total amount of money a government owes to individuals, institutions, and other governments.  High levels can impact investor confidence and crowd out private sector borrowing.\n\nBudget deficit: When government spending exceeds its revenue in a given period.  It needs to be financed through borrowing or money creation.\n\nBorrowing from the public:  The government issues bonds or other securities to raise funds from individuals and institutions.  This increases demand for loanable funds, possibly raising interest rates.\n\nBorrowing from banks: The government borrows money from commercial banks.  This can increase the money supply through fractional reserve banking, but less directly than money creation.\n\nCreation of new money: The central bank prints new money or credits government accounts.  This directly increases the money supply, leading to inflation if not matched by increased output.  This is often referred to as monetizing the deficit.\n\nConsumer Price Index (CPI): A measure of the average change in prices paid by urban consumers for a basket of consumer goods and services.  It is a key indicator of inflation.\n\nWholesale Price Index (WPI): A measure of the average change in prices received by domestic producers for their output.  It can differ from CPI and may not always reflect consumer inflation accurately.\n\nInflation targeting: A monetary policy framework where the central bank publicly announces an explicit inflation target for the economy and commits to achieving it.  A tolerance band is often set around the target.\n\nMonetary Policy Committee (MPC): A committee responsible for setting interest rates and other monetary policy instruments to achieve the inflation target.\n\nFiscal Responsibility and Budget Management (FRBM) Act: Legislation aimed at improving fiscal discipline and reducing the fiscal deficit in India.  It sets targets for the deficit and public debt.\n\nReserve Bank of India (RBI): The central bank of India, responsible for monetary policy, regulating banks, and managing the country's foreign exchange reserves.\n\nOpen Market Operations (OMO): The buying and selling of government securities by the central bank to influence the money supply and interest rates.  Buying securities increases the money supply.\n\nRegional Rural Banks (RRBs): Banks jointly owned by the central government, state governments, and sponsor banks, primarily serving rural areas.\n\nPriority Sector Lending (PSL):  A policy requiring banks to lend a certain percentage of their credit to priority sectors like agriculture and small-scale industries.\n\nNon-Banking Financial Companies (NBFCs): Financial institutions that provide various financial services but do not accept demand deposits.\n\nHousing Finance Companies (HFCs): NBFCs specializing in providing loans for housing.\n\nSecuritisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act (SARFAESI):  Legislation allowing banks to recover non-performing assets (NPAs) without going through lengthy court procedures.\n\nInsolvency and Bankruptcy Code (IBC): A law providing a time-bound framework for resolving insolvency and bankruptcy cases.\n\nNational Payments Corporation of India (NPCI): An umbrella organization for operating retail payments and settlement systems in India.\n\nGoods and Services Tax (GST): A comprehensive indirect tax levied on the supply of goods and services in India.\n\nFiscal deficit:  The difference between a government's total expenditure and its revenue receipts (excluding borrowings).  A large fiscal deficit can be inflationary.\n"
    },
    {
        "q_num": 11,
        "question_text": "The money multiplier in an economy increases with which one of the following?",
        "option_a": "Increase in the Cash Reserve Ratio in the banks",
        "option_b": "Increase in the Statutory Liquidity Ratio in the banks",
        "option_c": "Increase in the banking habit of the people",
        "option_d": "Increase in the population of the country",
        "correct_option": "c",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation: The money multiplier represents the maximum amount of money that can be created by banks from an initial deposit.  It's inversely related to reserve ratios (CRR and SLR). An increase in the banking habit of people leads to more deposits in banks, increasing the money banks can lend out and thus increasing the money multiplier.  \n\n* **Cash Reserve Ratio (CRR):** The percentage of a bank's total deposits that it is required to maintain with the central bank (RBI in India).  A higher CRR reduces the amount a bank can lend, thus decreasing the money multiplier.\n\n* **Statutory Liquidity Ratio (SLR):** The minimum percentage of deposits that commercial banks are required to maintain in the form of liquid assets.  Similar to CRR, a higher SLR decreases the money multiplier.\n\n* **Banking habit of the people:** The propensity of individuals to deposit money in banks. An increase in banking habit leads to more deposits, increasing the money supply through lending activities and hence the money multiplier.\n\n* **Population of the country:**  While a larger population might lead to a larger money supply, it doesn't directly impact the *multiplier* itself. The multiplier depends on the behavior of banks and the public's interaction with the banking system.\n"
    },
    {
        "q_num": 12,
        "question_text": "With reference to Indian economy, demand-pull inflation can be caused/increased by which of the following?\n1. Expansionary policies\n2. Fiscal stimulus\n3. Inflation-indexing wages\n4. Higher purchasing power\n5. Rising interest rates\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 4 only",
        "option_b": "3, 4 and 5 only",
        "option_c": "1, 2, 3 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "a",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: Demand-pull inflation occurs when aggregate demand in an economy outpaces aggregate supply.  This leads to a rise in the general price level.\n\n1. **Expansionary policies:** These policies, such as increasing government spending or lowering taxes, boost aggregate demand, directly contributing to demand-pull inflation.\n\n2. **Fiscal stimulus:**  A fiscal stimulus is a type of expansionary fiscal policy aimed at boosting economic activity. Increased government spending as part of a stimulus package increases aggregate demand, potentially fueling inflation.\n\n3. **Inflation-indexing wages:** When wages are indexed to inflation, it means they rise automatically with inflation. This can contribute to a wage-price spiral, where rising wages lead to higher prices, which in turn lead to even higher wages, further increasing inflation.  It is a cost-push factor, not demand-pull.\n\n4. **Higher purchasing power:** Increased purchasing power, resulting from factors like higher incomes or lower taxes, leads to greater demand for goods and services. If supply cannot keep up, this increased demand can cause prices to rise, leading to demand-pull inflation.\n\n5. **Rising interest rates:** Rising interest rates are a contractionary monetary policy tool used to curb inflation by reducing borrowing and spending.  This reduces aggregate demand and thus counteracts demand-pull inflation.\n\n\nTherefore, only options 1, 2, and 4 directly contribute to or increase demand-pull inflation.  Option 3 is a cost-push factor, and option 5 is a contractionary measure that reduces demand-pull inflation.\n"
    },
    {
        "q_num": 13,
        "question_text": "With reference to India, consider the following statements:\n1. Retail investors through demat account can invest in 'Treasury Bills' and 'Government of India Debt Bonds' in primary market.\n2. The 'Negotiated Dealing System Order Matching' is a government securities trading platform of the Reserve Bank of India.\n3. The 'Central Depository Services Ltd.' is jointly promoted by the Reserve Bank of India and the Bombay Stock Exchange.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "d",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is incorrect. Retail investors can invest in Treasury Bills and Government of India Debt Bonds through a demat account, but only in the secondary market, not the primary market.  Treasury Bills are short-term debt instruments issued by the government, while Government of India Debt Bonds are long-term debt instruments. Demat accounts are electronic accounts used to hold securities in dematerialized form.\n\nStatement 2 is correct. The Negotiated Dealing System-Order Matching (NDS-OM) is a government securities trading platform of the Reserve Bank of India (RBI). The RBI is the central bank of India, responsible for monetary policy and regulation of the financial system.  NDS-OM facilitates the trading of government securities among market participants.\n\nStatement 3 is incorrect. The Central Depository Services (India) Limited (CDSL) is promoted by the Reserve Bank of India and the Bombay Stock Exchange (BSE).  CDSL is a central depository in India that provides services for holding and trading securities in dematerialized form.  The BSE is one of the major stock exchanges in India.\n"
    },
    {
        "q_num": 14,
        "question_text": "With reference to 'WaterCredit', consider the following statements:\n1. It puts microfinance tools to work in the water and sanitation sector.\n2. It is a global initiative launched under the aegis of the World Health Organization and the World Bank.\n3. It aims to enable the poor people to meet their water needs without depending on subsidies.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: WaterCredit uses microfinance techniques to improve water and sanitation access.  It aims to help poor people access water without relying on subsidies. However, it's not a global initiative launched by the World Health Organization (WHO) and the World Bank.  Those organizations may support such initiatives, but WaterCredit itself is not directly under their aegis.\n\nMicrofinance:  Financial services provided to low-income individuals or groups, often excluding traditional banking systems.  It typically involves small loans, savings accounts, and insurance.\n\nWater and Sanitation Sector: This sector focuses on providing clean water and adequate sanitation facilities to communities, impacting public health and well-being.\n\nWorld Health Organization (WHO): A specialized agency of the United Nations responsible for international public health.\n\nWorld Bank: An international financial institution that provides loans and grants to developing countries for various development projects.  It aims to reduce poverty and improve living standards.\n"
    },
    {
        "q_num": 15,
        "question_text": "In India, the central bank's function as the 'lender of last resort' usually refers to which of the following?\n1. Lending to trade and industry bodies when they fail to borrow from other sources\n2. Providing liquidity to the banks having a temporary crisis\n3. Lending to governments to finance budgetary deficits\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: In India, the central bank's (Reserve Bank of India or RBI) function as the 'lender of last resort' primarily involves providing liquidity to banks experiencing temporary financial crises (option 2).  This prevents a liquidity crunch from escalating into a systemic banking crisis. Lending to trade and industry bodies (option 1) is not a core function of the lender of last resort, although the RBI may indirectly support them through its lending to banks.  Lending to governments to finance budgetary deficits (option 3) is a separate function of the central bank related to fiscal policy and not directly the lender of last resort role.\n\n\nShort notes on important keywords and named entities:\n\n* **Reserve Bank of India (RBI):** India's central bank, responsible for monetary policy, regulation of banks, and maintaining financial stability.  Its actions influence interest rates, inflation, and the overall health of the banking system.\n\n* **Lender of last resort:** A crucial role of central banks, where they provide emergency liquidity to financial institutions facing imminent collapse, preventing wider systemic risks.\n\n* **Liquidity:** The ease with which an asset can be converted into cash.  In banking, it refers to the availability of funds to meet immediate obligations.\n\n* **Temporary crisis:** A short-term financial difficulty faced by a bank, often due to unexpected withdrawals or asset losses.  The lender of last resort helps them bridge this gap.\n\n* **Budgetary deficits:** When a government's spending exceeds its revenue, leading to borrowing to cover the shortfall.  This is a separate issue from the central bank's role as a lender of last resort.\n"
    },
    {
        "q_num": 16,
        "question_text": "'R2 Code of Practices' constitutes a tool available for promoting the adoption of",
        "option_a": "environmentally responsible practices in electronics recycling industry",
        "option_b": "ecological management of 'Wetlands of International Importance' under the Ramsar Convention",
        "option_c": "sustainable practices in the cultivation of agricultural crops in degraded lands",
        "option_d": "Environmental Impact Assessment' in the exploitation of natural resources",
        "correct_option": "a",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation:R2 Code of Practices is a tool used within the electronics recycling industry to promote environmentally responsible practices.  The other options relate to different environmental areas: the Ramsar Convention focuses on wetland conservation, sustainable agriculture addresses farming practices on degraded land, and Environmental Impact Assessment (EIA) is a process for evaluating the environmental effects of projects.\n"
    },
    {
        "q_num": 17,
        "question_text": "Why is there a concern about copper smelting plants?\n1. They may release lethal quantities of carbon monoxide into the environment.\n2. The copper slag can cause the leaching of some heavy metals into the environment.\n3. They may release sulphur dioxide as a pollutant.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation: Copper smelting plants raise environmental concerns due to several factors.  They release sulfur dioxide (SO2), a major air pollutant contributing to acid rain and respiratory problems.  The smelting process also generates copper slag, a waste product that can leach heavy metals into the soil and water, contaminating the environment and posing risks to human and ecosystem health. While carbon monoxide (CO) is a byproduct of many industrial processes, it's not specifically a primary concern in copper smelting relative to the other two pollutants.\n\n**Short notes on named entities:**\n\n* **Copper smelting plants:** Facilities that extract copper from its ore through a high-temperature process.  This involves chemical reactions that release various pollutants into the air and generate waste products.\n\n* **Carbon monoxide (CO):** A colorless, odorless, and highly toxic gas produced by incomplete combustion of carbon-containing materials.  It can cause health problems, even death, by reducing oxygen levels in the blood.\n\n* **Copper slag:** A waste by-product of copper smelting, containing various heavy metals and other impurities.  It can contaminate soil and water sources through leaching.\n\n* **Heavy metals:**  Metallic elements with relatively high densities and atomic weights that are toxic to living organisms at low concentrations.  Examples include lead, mercury, cadmium, and arsenic.\n\n* **Sulphur dioxide (SO2):** A colorless gas with a pungent odor, produced by the combustion of sulfur-containing fuels and industrial processes. It's a major air pollutant and contributes to acid rain.\n"
    },
    {
        "q_num": 18,
        "question_text": "With reference to furnace oil, consider the following statements:\n1. It is a product of oil refineries.\n2. Some industries use it to generate power.\n3. Its use causes sulphur emissions into the environment.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation: Furnace oil is a byproduct of oil refineries, so statement 1 is correct.  Industries use it as fuel for power generation, making statement 2 correct.  Furnace oil contains sulfur, and its combustion releases sulfur emissions (SO2) into the atmosphere, thus statement 3 is also correct.\n\nFurnace oil: A heavy fuel oil produced during the refining of crude oil. It's a viscous liquid with a high energy density, making it suitable for industrial applications.  However, it is a significant source of air pollution due to its sulfur content.\n\nOil refineries: Industrial facilities that process crude oil into various petroleum products like gasoline, diesel, kerosene, and furnace oil.  The refining process involves fractional distillation and other chemical processes to separate the different components of crude oil based on their boiling points.\n\nSulfur emissions: The release of sulfur dioxide (SO2) and other sulfur compounds into the atmosphere, primarily from the combustion of fossil fuels like furnace oil and coal.  Sulfur emissions contribute to air pollution and acid rain, harming human health and the environment.\n"
    },
    {
        "q_num": 19,
        "question_text": "What is blue carbon?",
        "option_a": "Carbon captured by oceans and coastal ecosystems",
        "option_b": "Carbon sequestered in forest biomass and agricultural soils",
        "option_c": "Carbon contained in petroleum and natural gas",
        "option_d": "Carbon present in the atmosphere",
        "correct_option": "a",
        "subject": "environment",
        "year": 2021,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Blue carbon refers to the carbon captured by ocean and coastal ecosystems.  These ecosystems, such as mangroves, salt marshes, and seagrass beds, are highly efficient at sequestering carbon dioxide from the atmosphere and storing it in their biomass and sediments.  This is in contrast to (b) which describes terrestrial carbon sequestration, (c) which refers to fossil carbon, and (d) which refers to atmospheric carbon.\n\nThe provided text mentions the ocean's role in climate change (sea level rise, ocean warming), but doesn't directly define blue carbon.  The IPCC SROCC (Special Report on the Ocean and Cryosphere in a Changing Climate) is mentioned, which is highly relevant to the topic of blue carbon as the report heavily addresses the ocean's role in carbon cycling.  The Paris Agreement (2015) aims to limit global temperature increase, which is directly related to reducing atmospheric carbon (option d).  GHGs (Greenhouse gases) like CO2 are the main drivers of global warming, and their sources and effects are discussed, but not in relation to blue carbon specifically.  Permafrost, another carbon store, is mentioned, but it's a terrestrial, not marine, carbon sink.  The context also mentions various energy sources (hydrogen, natural gas, coal), but these are not directly related to blue carbon.\n"
    },
    {
        "q_num": 20,
        "question_text": "In nature, which of the following is/are most likely to be found surviving on a surface without soil?\n1. Fern\n2. Lichen\n3. Moss\n4. Mushroom\nSelect the correct answer using the code given below.",
        "option_a": "1 and 4 only",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "1, 3 and 4",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Lichens and mosses are capable of surviving on surfaces without soil.  They are able to obtain nutrients and moisture directly from the atmosphere and rain, and they don't require soil for anchorage or nutrient uptake. Ferns, on the other hand, generally need soil to grow, as they have roots that absorb water and nutrients from the soil. Mushrooms are fungi that require organic matter for sustenance; they typically grow on decaying wood or other organic material, not directly on bare surfaces.\n\n\nLichens: Lichens are composite organisms consisting of a fungus and an alga or cyanobacterium living in a symbiotic relationship. They are pioneers in colonizing bare rock surfaces and contribute to soil formation.\n\nMosses: Mosses are small, non-vascular plants that grow in damp environments. They can grow on various substrates, including rocks, tree bark, and soil.  They absorb water and nutrients directly from their surroundings.\n\nFerns: Ferns are vascular plants with roots, stems, and leaves that require soil for nutrient and water uptake. They are not commonly found thriving on surfaces devoid of soil.\n\nMushrooms: Mushrooms are the fruiting bodies of fungi. They require organic matter, such as decaying wood or leaves, as a source of nutrients. They are not adapted to grow directly on bare surfaces lacking soil or organic matter.\n"
    },
    {
        "q_num": 21,
        "question_text": "Which one of the following is used in preparing a natural mosquito repellent?",
        "option_a": "Congress grass",
        "option_b": "Elephant grass",
        "option_c": "Lemongrass",
        "option_d": "Nut grass",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Lemongrass is known for its citronella oil, a natural mosquito repellent.  Congress grass, elephant grass, and nut grass are not typically used for this purpose.  Lemongrass is a tropical plant in the genus *Cymbopogon*, known for its fragrant leaves and essential oils used in various applications, including culinary and aromatherapy.  Citronella oil, derived from lemongrass, is a common ingredient in commercially available mosquito repellents due to its effectiveness in deterring mosquitoes.  The other grasses mentioned lack this key characteristic.\n"
    },
    {
        "q_num": 22,
        "question_text": "Consider the following kinds of organisms:\n1. Copepods\n2. Cyanobacteria\n3. Diatoms\n4. Foraminifera\nWhich of the above are primary producers in the food chains of oceans?",
        "option_a": "1 and 2",
        "option_b": "2 and 3",
        "option_c": "3 and 4",
        "option_d": "1 and 4",
        "correct_option": "b",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: Cyanobacteria and diatoms are primary producers in ocean food chains.  Cyanobacteria are photosynthetic bacteria, also known as blue-green algae, that produce their own food through photosynthesis. Diatoms are single-celled algae with silica shells, also photosynthetic and form a significant base of many marine food webs. Copepods are small crustaceans that are primary consumers, feeding on phytoplankton. Foraminifera are single-celled protists with calcium carbonate shells; they are not primary producers.\n"
    },
    {
        "q_num": 23,
        "question_text": "Consider the following animals:\n1. Hedgehog\n2. Marmot\n3. Pangolin\nTo reduce the chance of being captured by predators, which of the above organisms rolls up/roll up and protects/protect its/their vulnerable parts?",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "3 only",
        "option_d": "1 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation: Hedgehogs curl into a ball, protecting their vulnerable underbelly and other parts from predators. Pangolins also roll into a ball for protection.  Marmots, on the other hand, primarily rely on burrowing and alertness to avoid predators.\n\nHedgehog: Small mammals known for their spiny quills, used as a primary defense mechanism against predators. They are nocturnal and omnivorous.\n\nMarmot:  Large, stout-bodied ground squirrels. They are diurnal and herbivorous, inhabiting mountainous regions and burrows for shelter and protection.\n\nPangolin:  Mammal covered in scales, and known for their ability to roll into a tight ball when threatened. They are nocturnal and insectivorous.\n"
    },
    {
        "q_num": 24,
        "question_text": "With reference to the 'New York Declaration on Forests', which of the following statements are correct?\n1. It was first endorsed at the United Nations Climate Summit in 2014.\n2. It endorses a global timeline to end the loss of forests.\n3. It is a legally binding international declaration.\n4. It is endorsed by governments, big companies and indigenous communities.\n5. India was one of the signatories at its inception.\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 4",
        "option_b": "1, 3 and 5",
        "option_c": "3 and 4",
        "option_d": "2 and 5",
        "correct_option": "a",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: The New York Declaration on Forests, endorsed at the UN Climate Summit in 2014 (statement 1 is correct), sets a global goal to halve forest loss by 2020 and end it by 2030 (statement 2 is correct, though the phrasing is slightly different). It's a non-binding political declaration (statement 3 is incorrect), supported by governments, businesses, and indigenous peoples (statement 4 is correct).  Whether India was an initial signatory requires further verification beyond the provided text (statement 5 is unverified). Therefore, statements 1, 2, and 4 are correct.\n\n\n**Short notes on keywords and named entities:**\n\n* **New York Declaration on Forests:** A non-binding political declaration endorsed at the 2014 UN Climate Summit, aiming to reduce forest loss and degradation.  It involves commitments from governments, businesses, and civil society.\n\n* **United Nations Climate Summit:**  Annual conferences held under the UNFCCC framework to discuss climate change mitigation and adaptation.  These summits bring together world leaders and stakeholders to negotiate agreements and commitments.\n\n* **Legally binding international declaration:** A formal agreement between nations with legal force, requiring signatory countries to comply with its terms and conditions.  Violation can lead to international legal repercussions.\n\n* **Governments, big companies and indigenous communities:**  The diverse stakeholders involved in the New York Declaration on Forests, representing various interests in forest conservation and sustainable development. Indigenous communities' traditional knowledge and rights are crucial for effective forest management.\n\n* **India:** A large and populous country with significant forest cover and a major role in international climate negotiations.  India's participation in global environmental initiatives is significant due to its size and its vulnerability to climate change impacts.\n"
    },
    {
        "q_num": 25,
        "question_text": "Magnetite particles, suspected to cause neurodegenerative problems, are generated as environmental pollutants from which of the following?\n1. Brakes of motor vehicles\n2. Engines of motor vehicles\n3. Microwave stoves within homes\n4. Power plants\n5. Telephone lines\nSelect the correct answer using the code given below.",
        "option_a": "1, 2, 3 and 5 only",
        "option_b": "1, 2 and 4 only",
        "option_c": "3, 4 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: Magnetite particles are primarily generated from the friction of brake pads in motor vehicles (option 1) and the wear and tear of engine components in motor vehicles (option 2). Power plants (option 4), particularly those using coal, can also release magnetite particles as a byproduct of combustion.  Microwave ovens (option 3) and telephone lines (option 5) are not significant sources of magnetite pollution.\n\n* **Magnetite:** A naturally occurring iron oxide mineral (Fe3O4), known for its magnetic properties.  In the context of environmental pollution, it's of concern due to its potential health impacts, particularly neurotoxicity.\n\n* **Neurodegenerative problems:**  A broad category of diseases involving the progressive loss of structure or function of neurons, leading to impaired cognitive, motor, or sensory abilities.  Examples include Alzheimer's disease and Parkinson's disease.\n\n* **Environmental pollutants:** Substances introduced into the environment by human activities that have harmful effects on ecosystems or human health.  Magnetite, in high enough concentrations, can be considered an environmental pollutant.\n\n* **Brakes of motor vehicles:**  The friction between brake pads and rotors generates fine particles, including magnetite, which are released into the air.  Brake pad composition influences the amount of magnetite produced.\n\n* **Engines of motor vehicles:** Wear and tear of engine parts, including combustion processes, can release various pollutants, including magnetite particles.\n\n* **Microwave stoves within homes:** Microwave ovens use electromagnetic radiation to heat food; they do not generate significant amounts of magnetite particles.\n\n* **Power plants:**  Coal-fired power plants are a major source of air pollution, including particulate matter such as magnetite, released through the combustion process.\n\n* **Telephone lines:** Telephone lines, particularly older ones containing ferrous materials, may release small amounts of iron particles through corrosion, but are not a significant source of magnetite pollution.\n"
    },
    {
        "q_num": 26,
        "question_text": "Which one of the following is a filter feeder?",
        "option_a": "Catfish",
        "option_b": "Octopus",
        "option_c": "Oyster",
        "option_d": "Pelican",
        "correct_option": "c",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation:Oysters are filter feeders.  They strain water through their gills to capture phytoplankton and other small organisms for food.  Catfish are carnivores or omnivores, octopuses are carnivores, and pelicans are piscivores (fish-eaters).\n\nOysters:  Bivalve mollusks that live in saltwater habitats. They are sessile (attached to a substrate) and filter feed on plankton and other organic matter.  Their shells are made of calcium carbonate. Overharvesting and habitat destruction are major threats.\n\nCatfish:  A diverse group of freshwater fish known for their barbels (whiskers). They are primarily carnivores or omnivores, feeding on insects, crustaceans, and other small aquatic animals. Some species are also scavengers.\n\nOctopus:  Marine cephalopod mollusks characterized by eight arms. They are highly intelligent and are active predators, using their arms to capture prey such as crabs, shrimps, and fish.\n\nPelican: Large water birds with distinctive pouches under their beaks. They are piscivores, diving into water to catch fish with their beaks.  They often nest in colonies.\n"
    },
    {
        "q_num": 27,
        "question_text": "In case of which one of the following biogeochemical cycles, the weathering of rocks is the main source of release of nutrient to enter the cycle?",
        "option_a": "Carbon cycle",
        "option_b": "Nitrogen cycle",
        "option_c": "Phosphorus cycle",
        "option_d": "Sulphur cycle",
        "correct_option": "c",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Weathering of rocks is the primary source of phosphorus, which enters the phosphorus cycle.  Phosphorus is a sedimentary nutrient, unlike carbon, nitrogen, and sulfur which have significant gaseous components.  Weathering releases phosphate ions from rocks into the soil and water, making it available for uptake by plants and subsequently entering the food chain.  The carbon cycle involves the exchange of carbon between the atmosphere, living organisms, and the oceans. The nitrogen cycle includes processes like nitrogen fixation, nitrification, and denitrification, mainly involving microorganisms. The sulfur cycle involves the transformation of sulfur between various forms, including gaseous and sedimentary.\n"
    },
    {
        "q_num": 28,
        "question_text": "Which of the following are detritivores?\n1. Earthworms\n2. Jellyfish\n3. Millipedes\n4. Seahorses\n5. Woodlice\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 4 only",
        "option_b": "2, 3, 4 and 5 only",
        "option_c": "1, 3 and 5 only",
        "option_d": "1, 2, 3, 4 and 5",
        "correct_option": "c",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Earthworms, millipedes, and woodlice are detritivores.  Detritivores are organisms that feed on dead organic matter (detritus). Earthworms consume decaying leaves and organic matter in the soil, millipedes feed on decaying plant material, and woodlice feed on decaying wood and other organic debris. Jellyfish are carnivores, seahorses are carnivores.\n\nEarthworms:  Annelids that play a crucial role in soil ecology by consuming organic matter and improving soil structure and aeration. Their castings enrich the soil with nutrients.\n\nJellyfish: Gelatinous, free-swimming marine animals, primarily carnivores, feeding on plankton and small fish.\n\nMillipedes:  Arthropod invertebrates with many legs, primarily detritivores, feeding on decaying plant material.  They contribute to decomposition and nutrient cycling.\n\nSeahorses: Small, slow-moving marine fish, carnivores, feeding on small crustaceans and other invertebrates.\n\nWoodlice (Isopods):  Crustaceans that are terrestrial detritivores, feeding on decaying plant matter, fungi, and other organic debris.  They are often found in damp environments.\n"
    },
    {
        "q_num": 29,
        "question_text": "The 'Common Carbon Metric', supported by UNEP, has been developed for",
        "option_a": "assessing the carbon footprint of building operations around the world",
        "option_b": "enabling commercial farming entities around the world to enter carbon emission trading",
        "option_c": "enabling governments to assess the overall carbon footprint caused by their countries",
        "option_d": "assessing the overall carbon footprint caused by the use of fossil fuels by the world in a unit time",
        "correct_option": "a",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation:The provided text explicitly states that the 'Common Carbon Metric', supported by UNEP (United Nations Environment Programme), has been developed for assessing the carbon footprint of building operations around the world.  \n\nUNEP is the leading global environmental agency within the United Nations system. It sets the global environmental agenda, promotes the coherent implementation of the environmental dimension of sustainable development within the United Nations system, and serves as an authoritative advocate for the global environment.\n\nOption (b) discusses commercial farming and carbon emission trading, which is not directly related to the Common Carbon Metric's purpose as described. Option (c) focuses on national-level carbon footprint assessment by governments, while option (d) concerns the global carbon footprint of fossil fuel use.  Neither of these directly aligns with the stated function of the Common Carbon Metric.\n"
    },
    {
        "q_num": 30,
        "question_text": "Which of the following have species that can establish symbiotic relationship with other organisms?\n1. Cnidarians\n2. Fungi\n3. Protozoa\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:Cnidarians, fungi, and protozoa all have species capable of forming symbiotic relationships.  \n\n* **Cnidarians:** These are aquatic animals including jellyfish, corals, and sea anemones.  Many cnidarians engage in symbiotic relationships, such as coral polyps and zooxanthellae (a type of algae). The algae provide the coral with food through photosynthesis, and the coral provides the algae with a protected environment and nutrients.\n\n* **Fungi:** Fungi are a diverse group of organisms that play crucial roles in ecosystems.  Many fungi form mycorrhizal associations with plant roots, where the fungus provides the plant with water and nutrients, and the plant provides the fungus with carbohydrates.  Lichens are another example of a symbiotic relationship involving fungi and algae or cyanobacteria.\n\n* **Protozoa:** Protozoa are single-celled eukaryotic organisms.  Many protozoa are parasites, forming parasitic relationships with other organisms.  However, some protozoa also engage in mutualistic relationships, such as certain protozoa that live in the guts of animals and aid in digestion.  Therefore, all three groups demonstrate the capacity for symbiotic interactions.\n"
    },
    {
        "q_num": 31,
        "question_text": "With reference to Chausath Yogini Temple situated near Morena, consider the following statements:\n1. It is a circular temple built during the reign of Kachchhapaghata Dynasty.\n2. It is the only circular temple built in India.\n3. It was meant to promote the Vaishnava cult in the region.\n4. Its design has given rise to a popular belief that it was the inspiration behind the Indian Parliament building.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2",
        "option_b": "2 and 3 only",
        "option_c": "1 and 4",
        "option_d": "2, 3 and 4",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation:Statement 1 is correct. The Chausath Yogini Temple near Morena is a circular temple built during the Kachchhapaghata Dynasty.  Statement 2 is incorrect.  There are other circular temples in India, though the Chausath Yogini Temple is a significant example of this architectural style. Statement 3 is incorrect. The temple is associated with Shaivism, not Vaishnavism. Statement 4 is correct. There is a popular belief that the design of the old Parliament House in New Delhi was inspired by the Chausath Yogini Temple's circular layout.\n\n\nKachchhapaghata Dynasty: A medieval Indian dynasty that ruled parts of present-day Rajasthan and Madhya Pradesh. They were known for their patronage of art and architecture.\n\nChausath Yogini Temple: A unique circular temple near Morena, Madhya Pradesh, known for its distinctive architectural style and association with the 64 Yoginis (female spiritual figures).  Its circular design and arrangement of shrines have attracted scholarly attention.\n\nIndian Parliament building: The building that houses the Lok Sabha (House of the People) and Rajya Sabha (Council of States), the two houses of the Indian Parliament.  Its design has been subject to various interpretations and influences.\n"
    },
    {
        "q_num": 32,
        "question_text": "Which one of the following ancient towns is well-known for its elaborate system of water harvesting and management by building a series of dams and channelizing water into connected reservoirs?",
        "option_a": "Dholavira",
        "option_b": "Kalibangan",
        "option_c": "Rakhigarhi",
        "option_d": "Ropar",
        "correct_option": "a",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation:Dholavira is known for its sophisticated water harvesting and management system.  It featured a series of dams, reservoirs, and channels that efficiently collected and distributed water.  Kalibangan, Rakhigarhi, and Ropar were also Indus Valley Civilization sites, but their water management systems are not as extensively documented or renowned as Dholavira's.  Dholavira's system is considered a remarkable feat of engineering for its time.  The other sites, Kalibangan, Rakhigarhi, and Ropar, were also significant Indus Valley Civilization settlements,  known for their urban planning,  artifacts and contribution to our understanding of the civilization.\n"
    },
    {
        "q_num": 33,
        "question_text": "In the first quarter of the seventeenth century, in which of the following was/were the factory/factories of the English East India Company located?\n1. Broach\n2. Chicacole\n3. Trichinopoly\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:Based on the provided text, the English East India Company established factories in Surat in 1613 and Masulipatam in 1616.  Broach (Bharuch) and Surat are geographically close and were important trading centers on the western coast of India. Chicacole (modern-day Srikakulam) is located on the Coromandel Coast, near Masulipatam. Trichinopoly (Tiruchirappalli) is further south. While the exact dates of factory establishments in Chicacole are not explicitly mentioned, the text indicates the EIC's presence and activities expanded along the Coromandel Coast.  Therefore, factories existed in Broach (1) and Chicacole (2) during the first quarter of the seventeenth century.\n\n**Short notes on named entities:**\n\n* **English East India Company (EIC):** A powerful trading company chartered by the English Crown in 1600, gaining a monopoly on trade with the East Indies.  It gradually expanded its political influence in India, eventually leading to British colonial rule.\n\n* **Broach (Bharuch):** A major port city in Gujarat, India, historically significant for its trade and strategic location. It was a key center for the textile trade and attracted numerous trading companies.\n\n* **Chicacole (Srikakulam):** A city in Andhra Pradesh, India, located on the Coromandel Coast.  It was an important trading center during the period of the East India Company's activities.\n\n* **Trichinopoly (Tiruchirappalli):** A city in Tamil Nadu, India, situated on the banks of the Kaveri River.  Its strategic location made it a significant settlement in South India.\n\n* **Surat:** A major port city in Gujarat, India, playing a crucial role in the trade between India and Europe. The EIC established its first factory here, marking a significant step in its expansion in India.\n\n* **Masulipatam (Machilipatnam):** A port city in Andhra Pradesh, India, known for its textile industry. The EIC established a factory here, further expanding its trade network along the Coromandel Coast.\n\n* **Captain William Hawkins:** An English sea captain who visited the court of Mughal Emperor Jahangir in 1609, laying the groundwork for better trade relations.\n\n* **Captain Thomas Best:** An English sea captain who engaged in naval battles against the Portuguese off the coast of Surat in 1612.\n\n* **Sir Thomas Roe:** An English diplomat who served as an ambassador to the Mughal court during the reign of Jahangir, securing significant trade privileges for the EIC.\n\n* **Jahangir:** A Mughal emperor whose reign (1605-1627) saw the increasing involvement of European trading companies in India.\n\n* **Golconda:** A historical kingdom in South India, known for its diamond mines and wealth. The Sultan of Golconda granted the EIC trading privileges.\n\n* **Fort St. George:** A fort built by the English East India Company in Madras (Chennai), marking the establishment of a significant base for their operations in South India.\n\n* **Balasore:** A city in Odisha, India, where the EIC established its first factory in the Bay of Bengal in 1693.\n\n* **Hooghly:** A river in West Bengal, India, where the EIC established a presence in the mid-17th century.\n\n* **Fort William:** A fort built by the EIC in Calcutta, becoming the center of their administration in Bengal.\n\n* **Farrukhsiyar:** A Mughal emperor whose reign (1713-1719) saw the EIC securing further trade privileges through a firman (imperial decree).\n\n\n"
    },
    {
        "q_num": 34,
        "question_text": "From the decline of Guptas until the rise of Harshavardhana in the early seventh century, which of the following kingdoms were holding power in Northern India?\n1. The Guptas of Magadha\n2. The Paramaras of Malwa\n3. The Pushyabhutis of Thanesar\n4. The Maukharis of Kanauj\n5. The Yadavas of Devagiri\n6. The Maitrakas of Valabhi\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 5",
        "option_b": "1, 3, 4 and 6",
        "option_c": "2, 3 and 4",
        "option_d": "5 and 6",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation:After the decline of the Gupta Empire, several kingdoms rose to prominence in Northern India before Harshavardhana's rise.  The Paramaras controlled Malwa, the Pushyabhutis ruled Thanesar, and the Maukharis held power in Kanauj.\n\n* **The Guptas of Magadha:** The Gupta Empire, centered in Magadha (modern Bihar), was a major power in northern India from the 4th to the 6th centuries CE.  Their rule marked a golden age in Indian history, known for advancements in art, literature, and science.  However, by the late 5th and early 6th centuries, the empire fragmented.\n\n* **The Paramaras of Malwa:** The Paramaras were a powerful dynasty ruling over Malwa (central India). Their rise to prominence occurred during the decline of the Guptas and they maintained their power during the period in question.\n\n* **The Pushyabhutis of Thanesar:**  The Pushyabhutis, with their capital at Thanesar (modern Haryana), were a significant power in northern India. Harshavardhana belonged to this dynasty.\n\n* **The Maukharis of Kanauj:** The Maukharis were another important dynasty, ruling from Kanauj (modern Uttar Pradesh), a strategically important city.  They were major players in the power struggles of the period.\n\n* **The Yadavas of Devagiri:** The Yadavas of Devagiri (modern Maharashtra) were a powerful dynasty in the Deccan region of southern India, not northern India.\n\n* **The Maitrakas of Valabhi:** The Maitrakas ruled Valabhi (modern Gujarat), a kingdom located in western India. While powerful, their influence was primarily in western India, not northern India.\n\nThe other options include kingdoms that were either geographically distant (Yadavas) or not major players in northern India during this specific period (Maitrakas).  Therefore, only the Paramaras, Pushyabhutis, and Maukharis fit the description.\n"
    },
    {
        "q_num": 35,
        "question_text": "According to Portuguese writer Nuniz, the women in Vijayanagara Empire were expert in which of the following areas?\n1. Wrestling\n2. Astrology\n3. Accounting\n4. Soothsaying\nSelect the correct answer using the code given below.",
        "option_a": "1, 2 and 3 only",
        "option_b": "1, 3 and 4 only",
        "option_c": "2 and 4 only",
        "option_d": "1, 2, 3 and 4",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation:The provided text mentions Nuniz as a Portuguese writer who wrote about the Vijayanagara Empire.  While the text describes various aspects of the empire's administration, economy, and military, it doesn't specifically state that women were experts in wrestling, astrology, accounting, or soothsaying. Therefore, based solely on the provided text, we cannot determine the correct answer.  The text does mention the empire's prosperity and details of its governance, but lacks the specific information needed to answer the question.\n\nNuniz: A Portuguese chronicler who wrote about the Vijayanagara Empire, offering insights into its society and politics.\n\nVijayanagara Empire: A powerful South Indian empire known for its wealth, vast trade networks, and sophisticated administrative system.  It flourished from the 14th to the 16th centuries.\n\nWrestling: A combat sport involving grappling and throws.\n\nAstrology: The study of the movements and relative positions of celestial bodies interpreted as having an influence on human affairs and the natural world.\n\nAccounting: The process of recording, summarizing, and reporting financial transactions.\n\nSoothsaying: Predicting the future, often through supernatural means.\n"
    },
    {
        "q_num": 36,
        "question_text": "With reference to Madanapalle of Andhra Pradesh, which one of the following statements is correct?",
        "option_a": "Pingali Venkayya designed the tricolour Indian National Flag here.",
        "option_b": "Pattabhi Sitaramaiah led the Quit India Movement of Andhra region from here.",
        "option_c": "Rabindranath Tagore translated the National Anthem from Bengali to English here.",
        "option_d": "Madame Blavatsky and Colonel Olcott set up headquarters of Theosophical Society first here.",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation: Pattabhi Sitaramaiah, a prominent Indian independence activist and leader of the Indian National Congress, spearheaded the Quit India Movement in the Andhra region from Madanapalle.\n\nPingali Venkayya designed the Indian National Flag, but not in Madanapalle.  Rabindranath Tagore, the author of the Indian National Anthem, did not translate it into English in Madanapalle.  Madame Blavatsky and Colonel Olcott founded the Theosophical Society, but not with their headquarters initially in Madanapalle.\n"
    },
    {
        "q_num": 37,
        "question_text": "Consider the following pairs:\n   (Historical place)               (Well-known for)\n1. Burzahom                     :   Rock-cut shrines\n2. Chandra-ketugarh             :   Terracotta art\n3. Ganeshwar                    :   Copper artefacts\nWhich of the pairs given above is/are correctly matched?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:\n\nBurzahom is known for its Neolithic-age settlements, not rock-cut shrines.  Chandra-ketugarh is correctly paired as it is indeed well-known for its terracotta art. Ganeshwar is correctly matched as it is famous for its copper artifacts.  Therefore, only options 2 and 3 are correctly matched.\n\nShort notes:\n\n* **Burzahom:** A Neolithic site in Kashmir, known for its pit dwellings and evidence of early agriculture and pottery.  The site reveals information about the lifestyle and technology of early human settlements in the region.\n\n* **Chandra-ketugarh:** An archaeological site in West Bengal, significant for its early Iron Age settlements and remarkable terracotta art.  The site showcases sophisticated craftsmanship and artistic expression of its inhabitants.\n\n* **Ganeshwar:** A site in Rajasthan, India, renowned for its early copper artifacts, indicating the development of metallurgy in the region during the early Harappan period. The discovery of copper objects and tools provides insights into the technological advancements of that era.\n"
    },
    {
        "q_num": 38,
        "question_text": "Consider the following statements:\n1. It was during the reign of Iltutmish that Chengiz Khan reached the Indus in pursuit of the fugitive Khwarezm prince.\n2. It was during the reign of Muhammad bin Tughluq that Taimur occupied Multan and crossed the Indus.\n3. It was during the reign of Deva Raya II of Vijayanagara Empire that Vasco da Gama reached the coast of Kerala.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "1 and 2",
        "option_c": "3 only",
        "option_d": "2 and 3",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation: Statement 1 is correct.  The invasion of the Khwarzami empire by Genghis Khan led to the flight of the Khwarzami prince, and Chengiz Khan's pursuit reached the Indus during the reign of Iltutmish.\n\nStatement 2 is incorrect. Timur's invasion and occupation of Multan and crossing of the Indus occurred during the reign of  the Tughlaq dynasty, but specifically under the reign of Nasiruddin Muhammad Shah, not Muhammad bin Tughluq.\n\nStatement 3 is incorrect. Vasco da Gama's arrival on the coast of Kerala happened in 1498, which was long after the reign of Deva Raya II.\n\n\n**Short notes on named entities:**\n\n* **Iltutmish:** The third Sultan of the Delhi Sultanate (r. 1211–1236), known for consolidating the Sultanate's power and introducing reforms.  He was a slave who rose through the ranks.\n\n* **Chengiz Khan:** Founder and first Great Khan of the Mongol Empire (r. 1206–1227). He unified the Mongol tribes and led them on extensive conquests.\n\n* **Khwarezm prince:** Refers to a prince from the Khwarazmian Dynasty, a powerful Central Asian empire that was conquered by the Mongol Empire in early 13th century.\n\n* **Muhammad bin Tughluq:** Sultan of the Delhi Sultanate (r. 1325–1351). Known for his ambitious but often disastrous policies, including relocating the capital.\n\n* **Timur:** Also known as Tamerlane, a Turco-Mongol conqueror who founded the Timurid Empire (d. 1405). He invaded and conquered much of Persia, Central Asia and parts of India.\n\n* **Deva Raya II:** A ruler of the Vijayanagara Empire (r. 1422–1446).  His reign is considered a golden age of the empire.\n\n* **Vasco da Gama:** A Portuguese explorer who was the first European to reach India by sea (1498). This marked the beginning of the European presence in India.\n"
    },
    {
        "q_num": 39,
        "question_text": "Consider the following statements:\n1. St. Francis Xavier was one of the founding members of the Jesuit Order.\n2. St. Francis Xavier died in Goa and a church is dedicated to him there.\n3. The Feast of St. Francis Xavier is celebrated in Goa each year.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. St. Francis Xavier was a Jesuit missionary, but not a founding member of the Jesuit Order.  The Jesuit Order was founded by Ignatius of Loyola.  Statement 2 is correct. St. Francis Xavier died in Shangchuan Island, near present-day China, but his body was taken to Goa, India, where a church is dedicated to him.  Statement 3 is correct. The Feast of St. Francis Xavier is celebrated annually in Goa and other places.\n\nSt. Francis Xavier: A prominent Jesuit missionary who played a significant role in spreading Christianity in Asia during the 16th century. He is known for his missionary work in India, Japan, and other parts of Asia.  He is venerated as a saint in the Catholic Church.\n\nJesuit Order: A religious order of the Catholic Church founded by St. Ignatius of Loyola in 1540. The Jesuits are known for their educational and missionary work around the world.\n\nGoa: A state on the west coast of India, known for its beaches, colonial architecture, and history as a Portuguese colony.  It has a significant Catholic population.\n"
    },
    {
        "q_num": 40,
        "question_text": "With reference to the history of ancient India, which of the following statements is/are correct?\n1. Mitakshara was the civil law for upper castes and Dayabhaga was the civil law for lower castes.\n2. In the Mitakshara system, the sons can claim right to the property during the lifetime of the father, whereas in the Dayabhaga system, it is only after the death of the father that the sons can claim right to the property.\n3. The Mitakshara system deals with the matters related to the property held by male members only of a family, whereas the Dayabhaga system deals with the matters related to the property held by both male and female members of a family.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:Mitakshara and Dayabhaga are two distinct schools of Hindu law concerning inheritance and property rights.  Mitakshara, prevalent mainly in North India, is characterized by its concept of coparcenary, where sons have a right to their father's property even during his lifetime.  Dayabhaga, primarily followed in Bengal and some eastern parts of India, stipulates that sons inherit only after their father's death.  Neither system explicitly differentiated based on caste, though its practical application might have varied.  The Mitakshara system primarily deals with property held by male members, while Dayabhaga included both male and female members in property inheritance, though the extent of female rights varied. Therefore, only statement 2 is entirely correct.\n\nMitakshara: A school of Hindu law, primarily followed in North India, characterized by the concept of coparcenary, where sons inherit a share of their father's property even during his lifetime.  This system emphasizes the joint family structure and the continuous lineage of property rights.\n\nDayabhaga:  A school of Hindu law, primarily followed in Bengal and some eastern parts of India. In contrast to Mitakshara, it establishes that sons inherit only after their father's death.  The property is divided among heirs upon the father's death.  It has provisions for female inheritance, though the extent of their rights varied.\n"
    },
    {
        "q_num": 41,
        "question_text": "With reference to the history of ancient India, Bhavabhuti, Hastimalla and Kshemeshvara were famous",
        "option_a": "Jain monks",
        "option_b": "playwrights",
        "option_c": "temple architects",
        "option_d": "philosophers",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Bhavabhuti, Hastimalla, and Kshemeshvara were all prominent playwrights in ancient India.  While the provided text doesn't directly state this, it mentions Bhavabhuti in the context of literary works, strongly suggesting his role as a playwright. The other two names are less explicitly identified in the provided text, but based on scholarly knowledge, they are also known for their contributions to Sanskrit drama.\n\n**Short Notes on Named Entities:**\n\n* **Bhavabhuti:** A celebrated Sanskrit playwright of the 8th century CE, known for his three major works: *Uttararamacharita*, *Malatimadhava*, and *Mahaviracharita*. His plays are renowned for their poetic language, profound philosophical themes, and dramatic intensity.\n\n* **Hastimalla:** A less well-known playwright compared to Bhavabhuti, but his works are also considered significant contributions to Sanskrit drama.  More information about his specific works and life would be needed for a fuller description.\n\n* **Kshemeshvara:** Another Sanskrit playwright whose works are part of the rich tradition of ancient Indian drama.  Information on his specific plays and historical context requires further research.\n\n* **Jain monks:**  Followers of Jainism, an ancient Indian religion emphasizing non-violence, asceticism, and self-discipline.  Many Jain monks are known for their scholarship and contributions to philosophy and literature.\n\n* **Playwrights:** Writers who create plays for theatrical performance.  In ancient India, Sanskrit playwriting flourished, producing works of literary and philosophical significance.\n\n* **Temple architects:**  Individuals skilled in designing and constructing temples, crucial figures in shaping the religious and artistic landscape of ancient India.  Temple architecture reflects the diverse styles and traditions of different regions and periods.\n\n* **Philosophers:**  Thinkers who explore fundamental questions about existence, knowledge, values, reason, mind, and language. Ancient India produced a rich tapestry of philosophical schools, including Vedic, Buddhist, Jain, and others.\n"
    },
    {
        "q_num": 42,
        "question_text": "Consider the following statements:\n1. The Montagu-Chelmsford Reforms of 1919 recommended granting voting rights to all the women above the age of 21.\n2. The Government of India Act of 1935 gave women reserved seats in the legislature.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The Montagu-Chelmsford Reforms (Government of India Act, 1919) did introduce some electoral reforms, expanding the franchise to a limited extent based on factors like property, land ownership, or education. However, it did not grant voting rights to all women above 21.  Statement 2 is correct. The Government of India Act of 1935 did include provisions for reserved seats for women in the legislatures, although the extent of reservation varied across provinces.\n\nThe Montagu-Chelmsford Reforms were a set of constitutional reforms introduced in British India in 1919.  They aimed to introduce elements of self-governance and increased Indian participation in the government, but fell short of full independence. The Government of India Act 1935 was a landmark piece of legislation that established a federal system of government in British India, and it included provisions for greater Indian participation in the legislatures, including reserved seats for women.\n"
    },
    {
        "q_num": 43,
        "question_text": "With reference to 8th August 1942 in Indian history, which one of the following statements is correct?",
        "option_a": "The Quit India Resolution was adopted by the AICC.",
        "option_b": "The Viceroy's Executive Council was expanded to include more Indians.",
        "option_c": "The Congress ministries resigned in seven provinces.",
        "option_d": "Cripps proposed an Indian Union with full Dominion Status once the Second World War was over.",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation:The Quit India Resolution was adopted by the All India Congress Committee (AICC) on 8 August 1942.  This resolution called for an immediate end to British rule in India.\n\nAICC: The All India Congress Committee was the highest decision-making body of the Indian National Congress.\n\nQuit India Movement: A mass civil disobedience movement launched by Mahatma Gandhi in 1942, demanding an end to British rule in India.  It was a pivotal moment in India's struggle for independence.\n\nThe other options are incorrect:\n\n(b) The Viceroy's Executive Council was not expanded on this date.  While there were attempts to increase Indian participation in the government, this didn't happen on August 8, 1942.\n\n(c) The Congress ministries had already resigned in 1939,  not on August 8, 1942.\n\n(d) The Cripps Mission proposal, offering Dominion Status after the war, was made in March 1942, not August.\n"
    },
    {
        "q_num": 44,
        "question_text": "Who among the following is associated with 'Songs from Prison', a translation of ancient Indian religious lyrics in English?",
        "option_a": "Bal Gangadhar Tilak",
        "option_b": "Jawaharlal Nehru",
        "option_c": "Mohandas Karamchand Gandhi",
        "option_d": "Sarojini Naidu",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation:The provided text does not contain information directly linking Bal Gangadhar Tilak to a translation of ancient Indian religious lyrics titled 'Songs from Prison'.  Therefore, I cannot definitively answer this question based on the given source.\n\nBal Gangadhar Tilak: A prominent Indian nationalist leader, freedom fighter, and social reformer during the late 19th and early 20th centuries. He played a crucial role in the Indian independence movement, advocating for Swaraj (self-rule) and actively participating in various political and social reform movements. His contributions include promoting nationalistic education, publishing newspapers, and leading various movements against British rule.\n\nJawaharlal Nehru:  The first Prime Minister of India, a key figure in India's independence movement.  He was a prominent leader of the Indian National Congress and played a significant role in shaping India's post-independence policies and development.  His views on socialism, non-alignment, and secularism influenced India's international relations and domestic policies.\n\nMohandas Karamchand Gandhi:  Widely known as Mahatma Gandhi, he was a preeminent leader of India's independence movement.  He championed nonviolent resistance (Satyagraha) and led numerous campaigns against British rule, significantly impacting India's path to freedom. His philosophy of non-violence and civil disobedience influenced social and political movements globally.\n\nSarojini Naidu:  An acclaimed Indian poet and political activist.  She was a prominent figure in the Indian National Congress and known for her powerful oratory skills and contributions to the independence movement. She was the first Indian woman to become the President of the Indian National Congress.\n"
    },
    {
        "q_num": 45,
        "question_text": "With reference to medieval India, which one of the following is the correct sequence in ascending order in terms of size?",
        "option_a": "Paragana-Sarkar-Suba",
        "option_b": "Sarkar-Paragana-Suba",
        "option_c": "Suba-Sarkar-Paragana",
        "option_d": "Paragana-Suba-Sarkar",
        "correct_option": "a",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: In the medieval Indian administrative system, a Paragana was the smallest unit, followed by a Sarkar (a group of Parganas), and finally a Suba (a group of Sarkars), making the ascending order Paragana-Sarkar-Suba.\n\nParagana:  A Paragana was a basic administrative unit in medieval India, typically comprising a cluster of villages.  Its size and importance varied across different regions and empires.  Revenue collection and local governance were often handled at this level.\n\nSarkar: A Sarkar was a larger administrative division, encompassing several Parganas.  It represented a significant step up in administrative hierarchy, often headed by a high-ranking official responsible for overseeing the Parganas under its jurisdiction.\n\nSuba:  A Suba was the largest of the three, a province or a large region comprising numerous Sarkars.  It represented a significant level of administrative control, often headed by a governor or viceroy appointed by the emperor.\n"
    },
    {
        "q_num": 46,
        "question_text": "Who among the following was associated as Secretary with Hindu Female School which later came to be known as Bethune Female School?",
        "option_a": "Annie Besant",
        "option_b": "Debendranath Tagore",
        "option_c": "Ishwar Chandra Vidyasagar",
        "option_d": "Sarojini Naidu",
        "correct_option": "c",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation: Ishwar Chandra Vidyasagar was associated as Secretary with Hindu Female School, which later became Bethune Female School.\n\nAnnie Besant:  A prominent theosophist, social reformer, and Indian independence activist.  She played a significant role in the Indian nationalist movement and education reform.\n\nDebendranath Tagore: A key figure in the Brahmo Samaj, a religious reform movement in 19th-century Bengal. He was the father of Rabindranath Tagore and a significant intellectual figure.\n\nSarojini Naidu:  A renowned Indian poet and political activist. She was the first Indian woman to become the President of the Indian National Congress and the Governor of Uttar Pradesh.\n"
    },
    {
        "q_num": 47,
        "question_text": "In the context of Colonial India, Shah Nawaz Khan, Prem Kumar Sehgal and Gurbaksh Singh Dhillon are remembered as",
        "option_a": "leaders of Swadeshi and Boycott Movement",
        "option_b": "members of the Interim Government in 1946",
        "option_c": "members of the Drafting Committee in the Constituent Assembly",
        "option_d": "officers of the Indian National Army",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation: Shah Nawaz Khan, Prem Kumar Sehgal, and Gurbaksh Singh Dhillon were officers of the Indian National Army (INA).  The INA was formed by Subhas Chandra Bose during World War II, aiming to fight alongside the Axis powers against the British.  These three individuals held prominent positions within the INA.\n\n\nShort notes on named entities:\n\nSubhas Chandra Bose: A prominent leader of the Indian independence movement, Bose initially worked within the Indian National Congress but later broke away to form the Forward Bloc. He famously escaped India during World War II and established the Indian National Army (INA).\n\nShah Nawaz Khan: An officer in the Indian National Army (INA) under Subhas Chandra Bose.  He, along with Sehgal and Dhillon, was later tried for treason by the British but eventually released.\n\nPrem Kumar Sehgal:  Another high-ranking officer in the Indian National Army (INA). Like Shah Nawaz Khan and Gurbaksh Singh Dhillon, he played a significant role in the INA's operations and faced subsequent trials.\n\nGurbaksh Singh Dhillon: A key figure in the Indian National Army (INA), holding a significant command position.  He was tried along with Sehgal and Khan for their involvement with the INA.\n\nSwadeshi and Boycott Movement: A nationalist movement in India during the early 20th century, primarily focused on promoting indigenous goods and boycotting British products. It was a significant form of resistance against British rule.\n\nInterim Government (1946): A transitional government formed in British India in 1946, composed of representatives from the Indian National Congress and the Muslim League.  It was intended to govern India until independence.\n\nDrafting Committee (Constituent Assembly): The body responsible for drafting the Constitution of India.  Headed by B.R. Ambedkar, it played a crucial role in shaping India's founding document.\n\n"
    },
    {
        "q_num": 48,
        "question_text": "With reference to Indian history, which of the following statements is/are correct?\n1. The Nizamat of Arcot emerged out of Hyderabad State.\n2. The Mysore Kingdom emerged out of Vijayanagara Empire.\n3. Rohilkhand Kingdom was formed out of the territories occupied by Ahmad Shah Durrani.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "2 only",
        "option_c": "2 and 3",
        "option_d": "3 only",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:\n\n1. **The Nizamat of Arcot:**  The Nizamat of Arcot was not a part of the Hyderabad State.  It was a separate Carnatic region, ruled by a Nawab.  It emerged from the weakening of the Vijayanagara Empire and subsequent power struggles among various successor states and the British.\n\n2. **The Mysore Kingdom:** The Mysore Kingdom did indeed emerge from the remnants of the Vijayanagara Empire. After the decline of Vijayanagara, various regional powers rose, and Mysore was one of them.  Initially, it was a small kingdom under local chiefs, which later expanded.\n\n3. **Rohilkhand Kingdom:** The Rohilkhand kingdom was not directly formed from territories occupied by Ahmad Shah Durrani. While Durrani's invasions and the weakening of Mughal power contributed to the political landscape of the region, Rohilkhand's emergence was due to the migration and establishment of Rohilla Afghans.\n\n\n**Short Notes on Important Keywords and Named Entities:**\n\n* **Nizamat of Arcot:** A subah (province) of the Mughal Empire. Later, it became an independent state under its own Nawabs.  It played a significant role in the Carnatic Wars between the French and the British.\n\n* **Hyderabad State:** A large princely state in south-central India during the British Raj. It was founded by Asaf Jah I, a high-ranking Mughal official, in the 18th century.  Known for its rich culture and history.\n\n* **Mysore Kingdom:** A prominent kingdom in south India, initially a small kingdom that expanded significantly under rulers like Hyder Ali and Tipu Sultan.  It challenged British power in the region.\n\n* **Vijayanagara Empire:** A powerful empire in south India that flourished for over two centuries (14th-16th centuries). It was a major economic and cultural center. Its decline led to the rise of various successor states.\n\n* **Ahmad Shah Durrani:** A powerful Afghan ruler who led several invasions of India in the 18th century. His invasions further weakened the Mughal Empire.\n\n* **Rohilkhand:** A historical region in northern India that is now part of Uttar Pradesh. It was a significant region during the Mughal period and beyond.  It was known for its strategic location.\n\n\n"
    },
    {
        "q_num": 49,
        "question_text": "Which one of the following statements is correct?",
        "option_a": "Ajanta Caves lie in the gorge of Waghora river.",
        "option_b": "Sanchi Stupa lies in the gorge of Chambal river.",
        "option_c": "Pandu-lena Cave Shrines lie in the gorge of Narmada river.",
        "option_d": "Amaravati Stupa lies in the gorge of Godavari river.",
        "correct_option": "a",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: The Ajanta Caves are located in the Waghora river valley in Maharashtra, India.  The other options are incorrect regarding the river valleys in which the mentioned entities are located.\n\nAjanta Caves:  A series of rock-cut cave monuments dating back to the 2nd century BCE to the 6th century CE, known for their intricate Buddhist cave paintings and sculptures. They are a UNESCO World Heritage Site.\n\nSanchi Stupa: A large Buddhist stupa located in Sanchi, Madhya Pradesh, India. It is considered one of the oldest stone structures in India and a significant example of early Buddhist architecture.\n\nPandu-lena Cave Shrines:  Rock-cut cave shrines located in Maharashtra, India, known for their ancient Buddhist art and architecture.\n\nAmaravati Stupa: A large Buddhist stupa located in Amaravati, Andhra Pradesh, India.  It is renowned for its elaborate sculptural decorations and is an important site in the history of Buddhist art.\n\nWaghora River: A river in Maharashtra, India, flowing through the area where the Ajanta Caves are situated.\n\nChambal River: A major river in central India flowing through Madhya Pradesh, Rajasthan, and Uttar Pradesh.\n\nNarmada River: A major river in central India, flowing westwards through the states of Madhya Pradesh, Gujarat, and Maharashtra.\n\nGodavari River: A major river in south India, flowing eastwards through the states of Maharashtra, Telangana, Andhra Pradesh, and Odisha.\n"
    },
    {
        "q_num": 50,
        "question_text": "Consider the following statements:\n1. 21st February is declared to be the International Mother Language Day by UNICEF.\n2. The demand that Bangla has to be one of the national languages was raised in the Constituent Assembly of Pakistan.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: Statement 1 is incorrect.  International Mother Language Day is observed on 21 February, but it was declared by UNESCO, not UNICEF. Statement 2 is correct.  The demand for Bangla to be a national language was indeed raised in the Constituent Assembly of Pakistan.  This ultimately led to significant events in the history of Bangladesh.\n\nUNESCO: The United Nations Educational, Scientific and Cultural Organization is a specialized agency of the United Nations.  Its mandate is to contribute to the building of peace, security, stability and well-being by promoting international collaboration through education, science, culture and communication.\n\nUNICEF: The United Nations Children's Fund is a United Nations agency responsible for providing humanitarian and developmental aid to children worldwide.  It focuses on improving the lives of children and protecting their rights.\n\nBangla:  The native language of Bangladesh and one of the official languages of India.  It is an Indo-Aryan language with millions of speakers globally.  Its history is intertwined with political movements and national identity.\n\nConstituent Assembly of Pakistan: The body responsible for drafting the constitution of Pakistan.  Its deliberations and decisions played a crucial role in shaping the early years of the nation and its relationship with its various linguistic groups.\n"
    },
    {
        "q_num": 51,
        "question_text": "How is permaculture farming different from conventional chemical farming?\n1. Permaculture farming discourages monocultural practices but in conventional chemical farming, monoculture practices are predominant.\n2. Conventional chemical farming can cause an increase in soil salinity but the occurrence of such a phenomenon is not observed in permaculture farming.\n3. Conventional chemical farming is easily possible in semi-arid regions but permaculture farming is not so easily possible in such regions.\n4. The practice of mulching is very important in permaculture farming but not necessarily so in conventional chemical farming.\nSelect the correct answer using the code given below.",
        "option_a": "1 and 3",
        "option_b": "1, 2 and 4",
        "option_c": "4 only",
        "option_d": "2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is correct. Permaculture emphasizes biodiversity and avoids monoculture (planting a single crop repeatedly), while conventional chemical farming often relies heavily on monoculture for efficiency and profit.\n\nStatement 2 is partially correct.  Conventional chemical farming's overuse of irrigation and fertilizers *can* lead to soil salinity.  However, it's not always the case, and the link isn't as direct as the statement implies. Permaculture's focus on soil health and water management generally mitigates salinity risks, but it doesn't entirely eliminate the possibility.\n\nStatement 3 is incorrect. Permaculture, with its emphasis on water conservation techniques, can be successfully implemented in semi-arid regions.  Conventional chemical farming, while possible, often faces challenges in such regions due to water scarcity and the need for high fertilizer and pesticide inputs.\n\nStatement 4 is correct. Mulching is a key practice in permaculture, helping retain soil moisture, suppress weeds, and improve soil health.  It's less common in conventional chemical farming, which might utilize other weed control methods.\n\n\nTherefore, statements 1 and 4 accurately describe differences between permaculture and conventional chemical farming.  Statement 2 is only partially correct, and statement 3 is incorrect.  Option (b) is the most accurate choice.\n\n\nShort notes on keywords and named entities:\n\n**Permaculture:** A design system for creating sustainable human settlements and food production systems that mimic the patterns and relationships found in natural ecosystems. It emphasizes working with nature rather than against it.\n\n**Conventional chemical farming:**  A farming system that relies heavily on synthetic fertilizers, pesticides, and herbicides to maximize yields, often employing monoculture practices and intensive tillage.\n\n**Monoculture:** The cultivation of a single crop in a given area.  This simplifies management but reduces biodiversity and increases vulnerability to pests and diseases.\n\n**Soil salinity:** The accumulation of soluble salts in the soil to the extent that it negatively impacts plant growth.  Irrigation practices and fertilizer use can contribute to soil salinity.\n\n**Mulching:** The application of a layer of organic material (such as straw, wood chips, or compost) to the soil surface.  It helps retain moisture, suppress weeds, and improve soil structure.\n"
    },
    {
        "q_num": 52,
        "question_text": "With reference to 'palm oil', consider the following statements:\n1. The palm oil tree is native to Southeast Asia.\n2. The palm oil is a raw material for some industries producing lipstick and perfumes.\n3. The palm oil can be used to produce biodiesel.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is correct. The oil palm tree (Elaeis guineensis), from which palm oil is derived, is native to West Africa, not Southeast Asia.  However, it is widely cultivated in Southeast Asia, particularly Malaysia and Indonesia, which are now the largest producers.\n\nStatement 2 is correct. Palm oil is used as a raw material in various industries, including cosmetics, due to its properties as an emollient and surfactant.  It's found in lipsticks and some perfumes.\n\nStatement 3 is correct. Palm oil can be processed to produce biodiesel, a renewable alternative to fossil fuels.  It's a type of first-generation biofuel.\n\nTherefore, all three statements are correct, making option (d) the correct answer.\n"
    },
    {
        "q_num": 53,
        "question_text": "With reference to the Indus river system, of the following four rivers, three of them pour into one of them which joins the Indus direct. Among the following, which one is such a river that joins the Indus direct?",
        "option_a": "Chenab",
        "option_b": "Jhelum",
        "option_c": "Ravi",
        "option_d": "Sutlej",
        "correct_option": "d",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (d) Sutlej\n\nexplanation: The Sutlej River is the only river among the options that directly joins the Indus River.  The Chenab, Jhelum, and Ravi rivers are tributaries of the Indus, but they first merge with other rivers before joining the Indus.\n\nThe Indus River is a major river in Asia, originating in the Tibetan Plateau and flowing through India and Pakistan before emptying into the Arabian Sea.  It is approximately 2900 km long, with less than 1/3 of its basin lying in India.\n\nThe Jhelum River originates from Wular Lake in Jammu and Kashmir.  The Chenab River originates in Himachal Pradesh.  The Ravi River originates in the Himalayas and flows through Punjab and Jammu and Kashmir before joining the Chenab. The Sutlej River originates near Lake Mansarovar and flows through Himachal Pradesh and Punjab before joining the Indus.\n"
    },
    {
        "q_num": 54,
        "question_text": "With reference to India, Didwana, Kuchaman, Sargol and Khatu are the names of",
        "option_a": "glaciers",
        "option_b": "mangrove areas",
        "option_c": "Ramsar sites",
        "option_d": "saline lakes",
        "correct_option": "d",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation: Didwana, Kuchaman, Sargol, and Khatu are all located in the state of Rajasthan, India, and are known for their saline lakes.  These lakes are characterized by high salinity due to the arid climate and the presence of underlying salt deposits.  Saline lakes are inland bodies of water with a high concentration of dissolved salts, often exceeding that of seawater.  They are common in arid and semi-arid regions.  The provided text does not contain information about glaciers, mangrove areas, or Ramsar sites.\n"
    },
    {
        "q_num": 55,
        "question_text": "Consider the following rivers:\n1. Brahmani\n2. Nagavali\n3. Subarnarekha\n4. Vamsadhara\nWhich of the above rise from the Eastern Ghats?",
        "option_a": "1 and 2",
        "option_b": "2 and 4",
        "option_c": "3 and 4",
        "option_d": "1 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation: The Nagavali and Vamsadhara rivers originate in the Eastern Ghats.\n\nBrahmani River:  The Brahmani River is formed by the confluence of the Sankh and South Koel rivers in Odisha, India.  It flows through Odisha and empties into the Bay of Bengal. While its tributaries may originate in the Eastern Ghats, the main river's origin is not directly from the Eastern Ghats.\n\nNagavali River: The Nagavali River originates in the Eastern Ghats of Odisha and flows eastward before merging into the Bay of Bengal.\n\nSubarnarekha River: The Subarnarekha River originates in the Ranchi plateau of Jharkhand, not directly from the Eastern Ghats, though it flows through parts of the Eastern Ghats region.\n\nVamsadhara River: The Vamsadhara River originates in the Eastern Ghats of Odisha and flows southeastward, eventually joining the Bay of Bengal.\n"
    },
    {
        "q_num": 56,
        "question_text": "Consider the following statements:\n1. The Global Ocean Commission grants licences for seabed exploration and mining in international waters.\n2. India has received licences for seabed mineral exploration in international waters.\n3. 'Rare earth minerals' are present on the seafloor in international waters.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:The Global Ocean Commission is not a licensing authority for seabed mining.  Statement 1 is incorrect.  India has indeed been granted licenses for seabed mineral exploration in international waters, primarily through the International Seabed Authority. Statement 2 is correct.  The seafloor in international waters does contain significant deposits of rare earth minerals, making Statement 3 correct. Therefore, only statements 2 and 3 are correct.\n\n\n"
    },
    {
        "q_num": 57,
        "question_text": "Among the following, which one is the least water-efficient crop?",
        "option_a": "Sugarcane",
        "option_b": "Sunflower",
        "option_c": "Pearl millet",
        "option_d": "Red gram",
        "correct_option": "a",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation:Sugarcane is known to be a very water-intensive crop, requiring significantly more water than other crops like sunflower, pearl millet, and red gram.  The provided text mentions sugarcane as \"the most irrigated crop in India,\" which indirectly supports its high water consumption.\n\nSunflower is an oilseed crop.  Oilseeds in general tend to have moderate water requirements, though this can vary depending on the specific variety and growing conditions.\n\nPearl millet is a drought-resistant cereal crop,  making it relatively water-efficient. Millets in general are known for their ability to thrive in arid and semi-arid regions.\n\nRed gram (also known as pigeon pea) is a pulse crop. Pulses generally have lower water requirements compared to cereals or sugarcane.\n"
    },
    {
        "q_num": 58,
        "question_text": "Consider the following statements:\n1. In the tropical zone, the western sections of the oceans are warmer than the eastern sections owing to the influence of trade winds.\n2. In the temperate zone, westerlies make the eastern sections of oceans warmer than the western sections.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. Trade winds blow from east to west in the tropical zone, pushing warm surface water westward. This causes a build-up of warm water in the western parts of the oceans, making them warmer than the eastern sections.  Statement 2 is incorrect. Westerlies blow from west to east in the temperate zone. While they do influence ocean temperatures, they don't consistently make eastern sections warmer than western sections in the temperate zone.  Other factors like ocean currents and landmasses play significant roles in determining temperature distribution in this zone.\n\nTrade winds: These are prevailing winds that blow from high-pressure zones in the subtropics towards the equator. They are deflected by the Coriolis effect, resulting in a predominantly easterly direction in the tropics.\n\nWesterlies: These are prevailing winds that blow from west to east in the mid-latitudes. They are caused by the pressure gradient between the subtropical high-pressure belts and the subpolar low-pressure belts.\n\nTropical zone: This is the region between the Tropic of Cancer (23.5°N) and the Tropic of Capricorn (23.5°S). It is characterized by consistently warm temperatures and high rainfall.\n\nTemperate zone: This is the region between the tropics and the polar regions. It is characterized by moderate temperatures and seasonal variations in weather.\n"
    },
    {
        "q_num": 59,
        "question_text": "In the context of India's preparation for Climate-Smart Agriculture, consider the following statements:\n1. The 'Climate-Smart Village' approach in India is a part of a project led by the Climate Change, Agriculture and Food Security (CCAFS), an international research programme.\n2. The project of CCAFS is carried out under the Consultative Group on International Agricultural Research (CGIAR) headquartered in France.\n3. The International Crops Research Institute for the Semi-Arid Tropics (ICRISAT) in India is one of the CGIAR's research centres.\nWhich of the statements given above are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Statement 1 is correct. The Climate-Smart Village approach in India is indeed part of a project led by the CGIAR Research Program on Climate Change, Agriculture and Food Security (CCAFS).  CCAFS is a global research partnership.\n\nStatement 2 is incorrect.  The CGIAR (Consultative Group on International Agricultural Research) is headquartered in Montpellier, France.\n\nStatement 3 is correct. ICRISAT (International Crops Research Institute for the Semi-Arid Tropics) is a CGIAR research center located in Patancheru, Telangana, India.  It focuses on research related to dryland agriculture.\n\nTherefore, only statements 1 and 3 are correct.\n\n\n**Short Notes on Named Entities:**\n\n* **Climate-Smart Agriculture:**  Agricultural practices that sustainably increase productivity, enhance resilience (adaptation), and reduce/remove greenhouse gases (mitigation).  It aims to address the challenges of climate change on food security.\n\n* **Climate Change, Agriculture and Food Security (CCAFS):** An international research program that works to deliver climate-smart agriculture.  It is a partnership between CGIAR and other research organizations.\n\n* **Consultative Group on International Agricultural Research (CGIAR):** A global research partnership for a food-secure future. It works with hundreds of partners to improve food systems and reduce poverty.\n\n* **International Crops Research Institute for the Semi-Arid Tropics (ICRISAT):** A non-profit research organization that conducts agricultural research focused on the semi-arid tropics. It aims to improve the livelihoods of farmers in these regions.\n"
    },
    {
        "q_num": 60,
        "question_text": "\"Leaf litter decomposes faster than in any other biome and as a result the soil surface is often almost bare. Apart from trees, the vegetation is largely composed of plant forms that reach up into the canopy vicariously, by climbing the trees or growing as epiphytes, rooted on the upper branches of trees.\" This is the most likely description of",
        "option_a": "coniferous forest",
        "option_b": "dry deciduous forest",
        "option_c": "mangrove forest",
        "option_d": "tropical rain forest",
        "correct_option": "d",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:The description points to a tropical rainforest.  Rapid decomposition of leaf litter is a characteristic of tropical rainforests due to high temperatures and humidity, leading to nutrient-rich but shallow soil. The presence of epiphytes (plants growing on other plants) and lianas (climbing plants) is also typical of the rainforest canopy.\n\nConiferous forests are characterized by cone-bearing trees and typically have cooler climates. Dry deciduous forests have a distinct dry season and shed their leaves. Mangrove forests are found in coastal areas with saline water.\n"
    },
    {
        "q_num": 61,
        "question_text": "The vegetation of savannah consists of grassland with scattered small trees, but extensive areas have no trees. The forest development in such areas is generally kept in check by one or more or a combination of some conditions. Which of the following are such conditions?\n1. Burrowing animals and termites\n2. Fire\n3. Grazing herbivores\n4. Seasonal rainfall\n5. Soil properties\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2",
        "option_b": "4 and 5",
        "option_c": "2, 3 and 4",
        "option_d": "1, 3 and 5",
        "correct_option": "c",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Burrowing animals and termites disrupt the soil, making it difficult for tree seedlings to establish. Fire prevents tree regeneration by burning seedlings and grasses. Grazing herbivores consume young seedlings, preventing them from growing into trees. Seasonal rainfall patterns can lead to periods of drought that hinder tree growth. Soil properties, such as nutrient content and water retention, can also limit forest development.  A combination of these factors often prevents the establishment of extensive forests in savannahs.\n\n\nShort notes on keywords and named entities:\n\nSavannah: A tropical grassland ecosystem characterized by scattered trees and grasses.  Fire and grazing are important ecological factors influencing vegetation.\n\nBurrowing animals: Animals that live underground, such as rodents and some reptiles. Their burrowing activity can disrupt soil structure and reduce tree seedling establishment.\n\nTermites: Social insects that live in colonies and feed on wood. Their activity can damage or destroy tree seedlings and other vegetation.\n\nGrazing herbivores: Herbivores that feed on grasses and other vegetation, such as zebras, wildebeests, and cattle. Their grazing can prevent tree regeneration by consuming young seedlings.\n\nSeasonal rainfall: Rainfall that occurs during specific periods of the year, often with long dry seasons. This pattern can limit tree growth and survival in savannahs.\n\nSoil properties: The physical and chemical characteristics of soil, such as texture, nutrient content, and water holding capacity. These properties influence plant growth and distribution.  Laterite soils are common in tropical savannahs, often being low in nutrients.\n"
    },
    {
        "q_num": 62,
        "question_text": "With reference to the water on the planet Earth, consider the following statements:\n1. The amount of water in the rivers and lakes is more than the amount of groundwater.\n2. The amount of water in polar ice caps and glaciers is more than the amount of groundwater.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation:  The amount of water locked up in groundwater significantly exceeds the amount found in rivers and lakes.  Polar ice caps and glaciers hold a vast amount of water, exceeding the volume of groundwater. Therefore, statement 1 is incorrect, and statement 2 is correct.\n\nGroundwater: Water held underground in soil or rock.  It's a crucial freshwater resource.\n\nRivers and lakes: Surface water bodies that are relatively small compared to the total water on Earth.  They are essential for ecosystems and human use.\n\nPolar ice caps and glaciers: Massive bodies of ice located at the Earth's poles and in high mountain regions. They represent a significant portion of the planet's freshwater.\n"
    },
    {
        "q_num": 63,
        "question_text": "Consider the following statements:\n1. Moringa (drumstick tree) is a leguminous evergreen tree.\n2. Tamarind tree is endemic to South Asia.\n3. In India, most of the tamarind is collected as minor forest produce.\n4. India exports tamarind and seeds of moringa.\n5. Seeds of moringa and tamarind can be used in the production of biofuels.\nWhich of the statements given above are correct?",
        "option_a": "1, 2, 4 and 5",
        "option_b": "3, 4 and 5",
        "option_c": "1, 3 and 4",
        "option_d": "1, 2, 3 and 5",
        "correct_option": "c",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation: Let's analyze each statement:\n\n1. **Moringa (drumstick tree) is a leguminous evergreen tree.** This is correct. Moringa is a fast-growing, drought-resistant tree belonging to the family Moringaceae, which is closely related to the legume family (Fabaceae).  It is known for its nutritional value and various uses.\n\n2. **Tamarind tree is endemic to South Asia.** This is incorrect. While tamarind is widely cultivated in South Asia, its origin is believed to be in tropical Africa. It is now naturalized across many tropical and subtropical regions.\n\n3. **In India, most of the tamarind is collected as minor forest produce.** This is correct.  A significant portion of tamarind in India is harvested from wild trees in forests, rather than cultivated plantations. This makes it a non-timber forest product.\n\n4. **India exports tamarind and seeds of moringa.** This is correct. India is a major producer and exporter of both tamarind and moringa seeds, which are used for various purposes, including food, pharmaceuticals, and oil production.\n\n5. **Seeds of moringa and tamarind can be used in the production of biofuels.** This is correct.  Both moringa and tamarind seeds contain oils that can be extracted and used as feedstock for biodiesel production, contributing to renewable energy sources.\n\nTherefore, statements 1, 3, and 4 are definitively correct. Statement 5 is also generally considered correct, although the extent of commercial biofuel production from these sources might vary. Statement 2 is incorrect.  This leads to option (c) as the correct answer.\n\n\n**Short notes on named entities:**\n\n* **Moringa (drumstick tree):** A fast-growing, drought-resistant tree with high nutritional value. Its leaves, pods, flowers, and seeds are all used for food and medicinal purposes.  The seeds also yield oil.\n\n* **Tamarind tree:** A tropical tree producing edible fruit pods with a sweet and sour pulp.  Widely used in cuisines across the world, particularly in South Asia and parts of Africa.\n\n* **Biofuels:** Fuels produced from biomass (organic matter).  Biodiesel, derived from vegetable oils or animal fats, is a common type of biofuel.  The use of moringa and tamarind seeds in biofuel production is an area of growing interest.\n"
    },
    {
        "q_num": 64,
        "question_text": "The black cotton soil of India has been formed due to the weathering of",
        "option_a": "brown forest soil",
        "option_b": "fissure volcanic rock",
        "option_c": "granite and schist",
        "option_d": "shale and limestone",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: Black cotton soil, also known as Regur soil, is formed from the weathering of fissure volcanic rocks and lava flows.  These rocks, rich in minerals like basalt, undergo weathering processes over time, breaking down into the characteristic dark, clayey soil.  Brown forest soil is a different soil type formed under forest cover. Granite and schist are igneous and metamorphic rocks, respectively, and while they can contribute to soil formation, they are not the primary source of black cotton soil. Shale and limestone are sedimentary rocks, and their weathering produces different soil types.\n"
    },
    {
        "q_num": 65,
        "question_text": "With reference to recent developments regarding 'Recombinant Vector Vaccines', consider the following statements:\n1. Genetic engineering is applied in the development of these vaccines.\n2. Bacteria and viruses are used as vectors.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: Recombinant vector vaccines utilize genetic engineering to insert the genetic material of a pathogen (virus or bacteria) into a vector, which is then used to deliver the genetic material into the body to trigger an immune response.  Both bacteria and viruses can serve as vectors in this process.  Therefore, both statements 1 and 2 are correct.\n\nGenetic engineering:  A set of technologies used to change the genetic material of a living organism. It involves manipulating an organism's genes to modify its characteristics, such as disease resistance or increased productivity.  Techniques include gene editing (CRISPR), gene insertion, and gene deletion.\n\nRecombinant Vector Vaccines: Vaccines that use a modified virus or bacteria (the vector) to carry genetic material from a pathogen into a patient's cells. This genetic material instructs the cells to produce an antigen, triggering an immune response without causing illness.  Examples include some COVID-19 vaccines.\n"
    },
    {
        "q_num": 66,
        "question_text": "In the context of hereditary diseases, consider the following statements:\n1. Passing on mitochondrial diseases from parent to child can be prevented by mitochondrial replacement therapy either before or after in vitro fertilization of the egg.\n2. A child inherits mitochondrial diseases entirely from the mother and not from the father.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation:Mitochondrial diseases are inherited maternally because mitochondria are primarily inherited from the mother through the egg cell.  The sperm contributes very little, if any, mitochondrial DNA. Mitochondrial replacement therapy aims to prevent the transmission of mitochondrial diseases from mother to child by replacing the mother's faulty mitochondria with healthy ones from a donor egg before or after in vitro fertilization.  Therefore, both statements are correct.\n\nMitochondrial diseases:  These are genetic disorders caused by mutations in mitochondrial DNA (mtDNA). Mitochondria are organelles within cells that generate energy.  Mutations in mtDNA can impair energy production, leading to a wide range of symptoms depending on which organs are affected.\n\nMitochondrial replacement therapy: This is a fertility treatment where the mother's nuclear DNA (containing her genes) is transferred to a donor egg that has had its nucleus removed but retains its healthy mitochondria. This results in an embryo with the mother's nuclear DNA and the donor's healthy mitochondria.  It's used to prevent the transmission of mitochondrial diseases to offspring.\n\nIn vitro fertilization (IVF):  This is an assisted reproductive technology where fertilization of an egg by sperm takes place outside the body, in a laboratory. The resulting embryo is then implanted into the uterus.\n"
    },
    {
        "q_num": 67,
        "question_text": "Bollgard I and Bollgard II technologies are mentioned in the context of",
        "option_a": "clonal propagation of crop plants",
        "option_b": "developing genetically modified crop plants",
        "option_c": "production of plant growth substances",
        "option_d": "production of biofertilizers",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: Bollgard I and Bollgard II are technologies used in developing genetically modified (GM) crops, specifically cotton.  These technologies involve incorporating genes from *Bacillus thuringiensis* (Bt) into the cotton plant's genome, making it resistant to certain pests.  This reduces the need for pesticide application.\n\n**Short notes on named entities:**\n\n* **Bollgard I and Bollgard II:**  These are brand names for genetically modified cotton varieties that express Bt proteins, providing pest resistance.  They represent advancements in biotechnology for agricultural applications.\n\n* **Genetically modified (GM) crop plants:** Plants whose genetic material has been altered using biotechnology techniques.  This can result in traits like pest resistance, herbicide tolerance, or enhanced nutritional value.  There are ongoing debates surrounding their safety and environmental impact.\n\n* **Bacillus thuringiensis (Bt):** A bacterium that produces proteins toxic to certain insects.  These proteins are used in GM crops to provide pest resistance, reducing the need for chemical pesticides.  Bt is a naturally occurring bacterium with a long history of safe use in organic pest control.\n\n* **Clonal propagation:** A method of asexual reproduction in plants where genetically identical copies (clones) are produced from a single parent plant. This is distinct from the genetic modification involved in Bollgard technologies.\n\n* **Plant growth substances:** Hormones and other chemicals that regulate plant growth and development.  This is a separate field of plant science not directly related to Bollgard technologies.\n\n* **Biofertilizers:**  Substances containing living microorganisms that enhance nutrient availability to plants.  They are used in sustainable agriculture to reduce reliance on synthetic fertilizers but are unrelated to Bollgard technologies.\n"
    },
    {
        "q_num": 68,
        "question_text": "In a pressure cooker, the temperature at which the food is cooked depends mainly upon which of the following?\n1. Area of the hole in the lid\n2. Temperature of the flame\n3. Weight of the lid\nSelect the correct answer using the code given below.",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation: The temperature at which food cooks in a pressure cooker is primarily determined by the pressure inside the cooker.  The weight of the lid is directly related to the pressure; a heavier lid increases pressure, leading to a higher cooking temperature.  The area of the hole in the lid affects the rate of pressure release, but not the maximum pressure or temperature reached. The temperature of the flame influences the rate at which pressure builds up, but the maximum cooking temperature is ultimately set by the pressure achieved, not the flame's intensity.  Therefore, the weight of the lid and the resulting pressure are the main factors.\n\n"
    },
    {
        "q_num": 69,
        "question_text": "Consider the following:\n1. Bacteria\n2. Fungi\n3. Virus\nWhich of the above can be cultured in artificial/synthetic medium?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Bacteria and fungi can be cultured in artificial/synthetic media.  Viruses, however, require a host cell to replicate and cannot be grown in artificial media alone.  Bacteria are single-celled prokaryotic organisms; fungi are eukaryotic organisms that include yeasts and molds; viruses are acellular infectious agents that require a host to reproduce.  Therefore, only bacteria and fungi are culturable in artificial media.\n"
    },
    {
        "q_num": 70,
        "question_text": "Consider the following statements:\n1. Adenoviruses have single-stranded DNA genomes whereas retroviruses have double-stranded DNA genomes.\n2. Common cold is sometimes caused by an adenovirus whereas AIDS is caused by a retrovirus.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. Adenoviruses have double-stranded DNA genomes, while retroviruses have single-stranded RNA genomes.  Statement 2 is correct. The common cold can be caused by adenoviruses, and AIDS is caused by a retrovirus (HIV).\n\nAdenoviruses: A group of viruses that infect the respiratory tract, causing illnesses like the common cold.  They have a double-stranded DNA genome.\n\nRetroviruses:  A family of enveloped RNA viruses that use reverse transcriptase to convert their RNA genome into DNA, which is then integrated into the host cell's genome. HIV, the virus that causes AIDS, is a retrovirus.\n"
    },
    {
        "q_num": 71,
        "question_text": "Water can dissolve more substances than any other liquid because",
        "option_a": "it is dipolar in nature",
        "option_b": "it is a good conductor of heat",
        "option_c": "it has a high value of specific heat",
        "option_d": "it is an oxide of hydrogen",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: Water's dipolar nature, meaning it has a positive and negative end, allows it to form hydrogen bonds with many different types of molecules.  This strong interaction enables water to effectively dissolve a wide range of ionic and polar substances.  The other options are not the primary reason for water's high solubility.  A good conductor of heat (b) refers to its thermal conductivity, high specific heat (c) to its ability to absorb heat, and being an oxide of hydrogen (d) is its chemical formula (H₂O).\n"
    },
    {
        "q_num": 72,
        "question_text": "With reference to street-lighting, how do sodium lamps differ from LED lamps?\n1. Sodium lamps produce light in 360 degrees but it is not so in the case of LED lamps.\n2. As street-lights, sodium lamps have a longer lifespan than LED lamps.\n3. The spectrum of visible light from sodium lamps is almost monochromatic while LED lamps offer significant colour advantages in street-lighting.\nSelect the correct answer using the code given below.",
        "option_a": "3 only",
        "option_b": "2 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation: Statement 1 is incorrect.  While the light distribution of sodium lamps is more omnidirectional than LEDs,  it's not a true 360-degree distribution.  LEDs can be designed for various light distributions, including wider angles. Statement 2 is incorrect.  LED streetlights generally have a much longer lifespan than sodium lamps. Statement 3 is correct.  High-pressure sodium lamps produce a nearly monochromatic yellowish-orange light, limiting color rendering. LEDs offer a much wider range of color temperatures and better color rendering, improving visibility and safety.  Therefore, only statement 3 is correct.\n\nSodium lamps: These are gas-discharge lamps that use sodium in an excited state to produce light. They are known for their high efficiency and long lifespan (though shorter than LEDs), but their light output is primarily monochromatic (yellowish-orange), which limits color rendition.\n\nLED lamps:  Light-emitting diodes are semiconductor devices that convert electricity directly into light.  They offer high energy efficiency, long lifespans, and a wide range of color temperatures and color rendering indices, allowing for better color reproduction and improved visibility.\n"
    },
    {
        "q_num": 73,
        "question_text": "The term 'ACE2' is talked about in the context of",
        "option_a": "genes introduced in the genetically modified plants",
        "option_b": "development of India's own satellite navigation system",
        "option_c": "radio collars for wildlife tracking",
        "option_d": "spread of viral diseases",
        "correct_option": "d",
        "subject": "economy",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation: ACE2 (Angiotensin-converting enzyme 2) is a receptor on the surface of human cells that the SARS-CoV-2 virus (which causes COVID-19) uses to enter the cells.  Therefore, ACE2 is discussed in the context of the spread of viral diseases.\n\nA short note on named entities:\n\n* **ACE2:** A protein receptor on human cells, crucial for SARS-CoV-2 entry.  Understanding its structure and function is key to developing treatments and vaccines for COVID-19 and related viruses.\n\n* **Genetically modified plants (GMOs):** Plants whose genetic material has been altered using biotechnology.  This can enhance traits like pest resistance or yield, but raises ethical and environmental concerns.\n\n* **India's own satellite navigation system (NavIC):**  An independent regional navigation satellite system developed by ISRO, providing positioning, navigation, and timing services within India and its surrounding regions.\n\n* **Radio collars for wildlife tracking:**  Devices fitted on animals to monitor their location and movements.  Data collected helps in conservation efforts and research on animal behavior.\n\nThe provided additional context does not offer relevant information to expand upon the explanation.\n"
    },
    {
        "q_num": 74,
        "question_text": "Bisphenol A (BPA), a cause of concern, is a structural/key component in the manufacture of which of the following kinds of plastics?",
        "option_a": "Low-density polyethylene",
        "option_b": "Polycarbonate",
        "option_c": "Polyethylene terephthalate",
        "option_d": "Polyvinyl chloride",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: Bisphenol A (BPA) is a key component in the manufacture of polycarbonate plastics.  \n\nLow-density polyethylene (LDPE) is a thermoplastic used in films, bags, and coatings.  Polyethylene terephthalate (PET) is used in bottles and fibers. Polyvinyl chloride (PVC) is used in pipes, flooring, and other applications.  None of these three use BPA as a key component in their manufacturing.  Polycarbonate is a strong, transparent thermoplastic often used in food containers and other applications; BPA is a crucial component in its synthesis.\n"
    },
    {
        "q_num": 75,
        "question_text": "'Triclosan', considered harmful when exposed to high levels for a long time, is most likely present in which of the following?",
        "option_a": "Food preservatives",
        "option_b": "Fruit-ripening substances",
        "option_c": "Reused plastic containers",
        "option_d": "Toiletries",
        "correct_option": "d",
        "subject": "geography",
        "year": 2021,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Triclosan is an antimicrobial agent that has been widely used in various personal care products and household items.  High and prolonged exposure to triclosan has been linked to potential health risks.  Therefore, toiletries (d) are the most likely option to contain triclosan.\n\nFood preservatives (a) utilize a range of substances to inhibit microbial growth in food and extend shelf life.  Fruit-ripening substances (b) are typically plant hormones or other chemicals used to accelerate or control the ripening process of fruits. Reused plastic containers (c) can contain various chemicals depending on the type of plastic and their history of use but are not inherently linked to triclosan.\n"
    },
    {
        "q_num": 76,
        "question_text": "Which one of the following is a reason why astronomical distances are measured in light-years?",
        "option_a": "Distances among stellar bodies do not change.",
        "option_b": "Gravity of stellar bodies does not change.",
        "option_c": "Light always travels in a straight line.",
        "option_d": "Speed of light is always the same.",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2021,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Astronomical distances are measured in light-years because the speed of light is constant.  A light-year is the distance light travels in one year. Since the speed of light is a fundamental constant in physics (approximately 299,792,458 meters per second), it provides a consistent and reliable unit for measuring the vast distances between celestial objects.  The other options are incorrect: distances between stars do change (albeit very slowly), gravity's influence varies depending on mass and distance, and while light generally travels in a straight line, its path can be bent by gravity (gravitational lensing).\n\nLight-year: A unit of astronomical distance equivalent to the distance that light travels in one year, approximately 9.461 × 10^15 meters.\n\nSpeed of light: A fundamental physical constant representing the speed at which light waves propagate through a vacuum.  It's approximately 299,792,458 meters per second and is denoted by the letter 'c'.\n\nStellar bodies:  General term for stars and other celestial objects like planets.\n\nGravity: The force of attraction between objects with mass.  The strength of gravity is directly proportional to the masses of the objects and inversely proportional to the square of the distance between them.\n"
    },
    {
        "q_num": 77,
        "question_text": "We adopted parliamentary democracy based on the British model, but how does our model differ from that model?\n1. As regards legislation, the British Parliament is supreme or sovereign but in India, the power of the Parliament to legislate is limited.\n2. In India, matters related to the constitutionality of the Amendment of an Act of the Parliament are referred to the Constitution Bench by the Supreme Court.\nSelect the correct answer using the code given below.",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (c)\nexplanation:Both statements 1 and 2 highlight key differences between the Indian and British parliamentary models.  In the British model, Parliament's legislative power is supreme (parliamentary sovereignty). However, India's parliamentary power is limited by its written Constitution, and the Supreme Court of India can review the constitutionality of laws passed by Parliament.  This judicial review power is a significant difference.\n\n**Short notes on named entities:**\n\n* **Parliamentary democracy:** A system of government where the executive branch (the government) is accountable to the legislature (parliament).  The head of government is usually the leader of the majority party in the legislature.\n\n* **British model:** Refers to the Westminster system of parliamentary democracy, characterized by a fusion of powers between the executive and legislature, parliamentary sovereignty, and a largely unwritten constitution.\n\n* **Indian model:**  A parliamentary democracy with a written constitution, a Supreme Court that can review legislation for constitutionality, and a blend of parliamentary sovereignty and judicial review.\n\n* **Parliament:** The supreme legislative body of a country, responsible for making laws.  In the British context, it's the UK Parliament; in the Indian context, it's the Parliament of India.\n\n* **Supreme Court:** The highest court of appeal in a country, responsible for interpreting the constitution and ensuring laws comply with it. The Supreme Court of India plays a more significant role in shaping legislation than its British counterpart.\n\n* **Constitution:** A body of fundamental principles or established precedents according to which a state or other organization is acknowledged to be governed. The British constitution is largely unwritten, whereas India has a written constitution.\n\n* **Constitution Bench:** A larger bench of judges in the Supreme Court of India, convened to hear cases involving significant constitutional questions.\n\n\n"
    },
    {
        "q_num": 78,
        "question_text": "With reference to the Union Government, consider the following statements:\n1. N. Gopalaswamy Iyengar Committee suggested that a minister and a secretary be designated solely for pursuing the subject of administrative reform and promoting it.\n2. In 1970, the Department of Personnel was constituted on the recommendation of the Administrative Reforms Commission, 1966, and this was placed under the Prime Minister's charge.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation:Both statements 1 and 2 are correct.\n\n1. The N. Gopalaswamy Iyengar Committee,  a committee focused on administrative reforms in India, recommended the appointment of a minister and a secretary dedicated to administrative reforms.  N. Gopalaswamy Iyengar was a prominent figure in Indian administration and played a key role in shaping administrative reforms.\n\n2. The Department of Personnel was established in 1970 based on the recommendations of the Administrative Reforms Commission (ARC) of 1966.  The ARC was a high-level body tasked with reviewing and recommending improvements to India's administrative system.  Placing the Department of Personnel under the Prime Minister's charge underscores its importance in overseeing administrative reforms across the Union Government.\n"
    },
    {
        "q_num": 79,
        "question_text": "'Right to Privacy' is protected under which Article of the Constitution of India?",
        "option_a": "Article 15",
        "option_b": "Article 19",
        "option_c": "Article 21",
        "option_d": "Article 29",
        "correct_option": "c",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation:The right to privacy is a fundamental right implicitly protected under Article 21 of the Constitution of India, which guarantees the right to life and personal liberty.  The Supreme Court of India in the Puttaswamy judgment explicitly recognized and upheld the right to privacy as an intrinsic part of Article 21.\n\nArticle 15 prohibits discrimination based on religion, race, caste, sex, or place of birth.  Article 19 guarantees six fundamental freedoms (freedom of speech and expression, assembly, association, movement, residence, and profession). Article 29 protects the interests of minorities to conserve their language, script, and culture.  \n"
    },
    {
        "q_num": 80,
        "question_text": "Consider the following statements:\n1. In India, there is no law restricting the candidates from contesting in one Lok Sabha election from three constituencies.\n2. In the 1991 Lok Sabha Election, Shri Devi Lal contested from three Lok Sabha constituencies.\n3. As per the existing rules, if a candidate contests in one Lok Sabha election from many constituencies, his/her party should bear the cost of bye-elections to the constituencies vacated by him/her in the event of him/her winning in all the constituencies.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "2 and 3",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  There is no law preventing a candidate from contesting from multiple constituencies in a Lok Sabha election in India.  However, if a candidate wins from multiple constituencies, they must vacate all but one seat, triggering by-elections in the others.\n\nStatement 2 is correct.  Shri Devi Lal, a prominent Indian politician, did contest from three Lok Sabha constituencies in the 1991 general elections.\n\nStatement 3 is correct. The party of a candidate who wins from multiple constituencies bears the cost of the by-elections in the constituencies vacated.\n\n\nShri Devi Lal:  A prominent Indian politician and former Deputy Prime Minister of India.  He was known for his contributions to the development of Haryana and his influence in national politics.\n\nLok Sabha: The lower house of the Parliament of India.  It is the more powerful of the two houses and is directly elected by the people of India.\n\n1991 Lok Sabha Election:  A general election held in India in 1991.  This election was significant due to the assassination of Prime Minister Rajiv Gandhi during the campaign.\n"
    },
    {
        "q_num": 81,
        "question_text": "Consider the following statements:\n1. 'Right to the City' is an agreed human right and the UN-Habitat monitors the commitments made by each country in this regard.\n2. 'Right to the City' gives every occupant of the city the right to reclaim public spaces and public participation in the city.\n3. 'Right to the City' means that the State cannot deny any public service or facility to the unauthorized colonies in the city.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "3 only",
        "option_c": "1 and 2",
        "option_d": "2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation:The 'Right to the City' is not a formally agreed-upon human right with UN-Habitat monitoring country commitments (Statement 1 is incorrect).  While the concept emphasizes public space reclamation and participation (making Statement 2 correct), it doesn't automatically guarantee public services to unauthorized colonies (Statement 3 is incorrect).  The 'Right to the City' is a socio-political concept promoting inclusive urban development, focusing on citizen participation and equitable access to urban resources, rather than a legally binding international human right with specific enforcement mechanisms like those described in Statement 1 and 3.  UN-Habitat is a United Nations programme focused on sustainable urbanization.\n"
    },
    {
        "q_num": 82,
        "question_text": "With reference to India, consider the following statements:\n1. Judicial custody means an accused is in the custody of the concerned magistrate and such an accused is locked up in a police station, not in jail.\n2. During judicial custody, the police officer in charge of the case is not allowed to interrogate the suspect without the approval of the court.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation: Statement 1 is incorrect. Judicial custody implies an accused is under the court's jurisdiction, typically held in a jail, not a police station.  Statement 2 is correct.  Police interrogation during judicial custody requires court approval.\n\nJudicial custody:  The legal status of an accused person after being produced before a magistrate. The magistrate decides whether to grant bail or remand the person to judicial custody (in jail).\n\nPolice station: A facility operated by law enforcement where suspects are initially detained and investigations begin.\n\nCourt: A judicial body authorized to hear and decide legal disputes.  In this context, it refers to the magistrate's court overseeing the judicial custody process.\n"
    },
    {
        "q_num": 83,
        "question_text": "With reference to India, consider the following statements:\n1. When a prisoner makes out a sufficient case, parole cannot be denied to such prisoner because it becomes a matter of his/her right.\n2. State Governments have their own Prisoners Release on Parole Rules.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:Statement 1 is incorrect.  Parole is not a right but a privilege granted at the discretion of the authorities. While a prisoner can apply for parole and present a case, the authorities are not obligated to grant it.  Statement 2 is correct.  The power to grant parole rests with the state governments, and they each have their own rules and regulations governing the process.  Therefore, only statement 2 is correct.\n\n\nShort notes on keywords and named entities:\n\n**Parole:**  Parole is the conditional release of a prisoner from prison before the completion of their sentence. It is granted based on factors such as good behavior, rehabilitation progress, and the likelihood of re-offending.  The parolee is typically subject to certain conditions and supervision.\n\n**Prisoner Release on Parole Rules:** These are the specific rules and regulations set by each state government in India that govern the granting of parole to prisoners.  These rules outline the eligibility criteria, application process, conditions of parole, and procedures for revocation.\n\n**State Governments:** In India, states have significant autonomy in administering justice within their boundaries, including matters related to prisons and parole.  They are responsible for implementing the laws related to criminal justice and managing their respective prison systems.\n"
    },
    {
        "q_num": 84,
        "question_text": "At the national level, which ministry is the nodal agency to ensure effective implementation of the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006?",
        "option_a": "Ministry of Environment, Forest and Climate Change",
        "option_b": "Ministry of Panchayati Raj",
        "option_c": "Ministry of Rural Development",
        "option_d": "Ministry of Tribal Affairs",
        "correct_option": "d",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:The Ministry of Tribal Affairs is the nodal agency at the national level for the effective implementation of the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006.\n\nThe Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006, aims to recognize and vest the forest rights and occupation in forest land in forest dwelling Scheduled Tribes and other traditional forest dwellers, who have been residing in such forests for generations.  The Act seeks to secure their livelihood and their traditional way of life.\n\nMinistry of Tribal Affairs: This ministry is primarily responsible for the welfare of Scheduled Tribes in India. Its functions include formulating and implementing policies and programs related to the socio-economic development of Scheduled Tribes, protecting their rights, and ensuring their participation in the mainstream development process. The Act falls under their purview given its focus on Scheduled Tribes' forest rights.\n\nMinistry of Environment, Forest and Climate Change: This ministry is responsible for the conservation of forests and wildlife in India. While their involvement in the implementation of the Act is crucial in terms of land management and conservation aspects, the Ministry of Tribal Affairs is the lead ministry.\n\nMinistry of Panchayati Raj: This ministry deals with the development of Panchayati Raj institutions in rural India. While local governance plays a role in the implementation process, the overall coordination rests with the Ministry of Tribal Affairs.\n\nMinistry of Rural Development: This ministry focuses on improving the living conditions of rural communities.  Although the Act indirectly impacts rural development, the primary responsibility for its implementation lies with the Ministry of Tribal Affairs.\n"
    },
    {
        "q_num": 85,
        "question_text": "A legislation which confers on the executive or administrative authority an unguided and uncontrolled discretionary power in the matter of application of law violates which one of the following Articles of the Constitution of India?",
        "option_a": "Article 14",
        "option_b": "Article 28",
        "option_c": "Article 32",
        "option_d": "Article 44",
        "correct_option": "a",
        "subject": "polity",
        "year": 2021,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Article 14 of the Indian Constitution guarantees equality before the law and equal protection of the laws within the territory of India.  Granting unguided and uncontrolled discretionary power to the executive violates this principle because it allows for arbitrary and unequal application of the law, undermining the fundamental right to equality.  The executive would be able to apply the law differently to different individuals or groups without any clear, justifiable standards, thus violating the principle of equality before the law.  Articles 28, 32, and 44 deal with different aspects of the Constitution: Article 28 relates to freedom of conscience and free profession, practice and propagation of religion; Article 32 deals with the right to constitutional remedies; and Article 44 is a directive principle relating to a uniform civil code.  They are not directly relevant to the issue of uncontrolled discretionary powers leading to unequal application of law.\n\n**Short notes on named entities:**\n\n* **Article 14:** This article of the Indian Constitution guarantees the right to equality before the law and equal protection of the laws. It prohibits discrimination based on religion, race, caste, sex, or place of birth.  However, reasonable classification is permitted if based on intelligible differentia and substantial distinction.\n\n* **Article 28:** This article deals with freedom of conscience and the right to freely profess, practice, and propagate one's religion.  It also sets limitations on the use of public funds for religious purposes.\n\n* **Article 32:** This article is a fundamental right that guarantees the right to constitutional remedies. It allows citizens to approach the Supreme Court of India for the enforcement of their fundamental rights.\n\n* **Article 44:** This article is a Directive Principle of State Policy that advocates for the adoption of a uniform civil code throughout India.  This means a single set of laws would govern personal matters for all citizens, irrespective of their religion.\n\n* **Rule of Law:** A principle of governance where all individuals and institutions, including the government, are accountable to and subject to the law.  It is central to the concept of a just and fair society.  A.V. Dicey, a British jurist, is associated with a specific articulation of this principle.\n\n* **Separation of Powers:**  This is a doctrine of constitutional law that divides governmental power among distinct branches (legislative, executive, and judicial) to prevent tyranny.  While not strictly followed in India, it's a guiding principle.  Checks and balances between these branches are crucial.\n\n* **Judicial Review:** The power of the judiciary to review laws and government actions to ensure they are consistent with the Constitution.  It is a crucial safeguard against arbitrary or unconstitutional actions.\n\n* **Judicial Activism:** This is when courts actively engage in shaping public policy, often by interpreting the Constitution broadly or extending its reach into areas previously considered the domain of the legislature or executive.  It can be both positive and controversial.\n"
    },
    {
        "q_num": 86,
        "question_text": "Which one of the following in Indian polity is an essential feature that indicates that it is federal in character?",
        "option_a": "The independence of judiciary is safeguarded.",
        "option_b": "The Union Legislature has elected representatives from constituent units.",
        "option_c": "The Union Cabinet can have elected representatives from regional parties.",
        "option_d": "The Fundamental Rights are enforceable by Courts of Law.",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation: The presence of elected representatives from constituent units in the Union Legislature is a key feature of a federal system.  It ensures that the voices and interests of different regions are represented at the national level.  This is a fundamental aspect of distributing power between the central and regional governments, a hallmark of federalism.\n\nThe other options are not directly indicative of a federal structure:\n\n(a) An independent judiciary is important for upholding the rule of law and protecting individual rights, but it doesn't define federalism itself.  Both unitary and federal states can have independent judiciaries.\n\n(c) The composition of the Union Cabinet, while relevant to governance, doesn't fundamentally define the federal nature of the polity.  The presence of regional party representatives could reflect the diverse political landscape but not the division of powers inherent in a federal system.\n\n(d) Fundamental Rights, while crucial for citizen protection, are not unique to federal systems. Many unitary states also have strong protections for fundamental rights.\n\n**Short Notes:**\n\n* **Indian Polity:**  The political system of India, characterized by a federal structure with a strong central government.  It combines elements of both federal and unitary systems.\n\n* **Federalism:** A system of government where power is divided between a central government and constituent regional governments. It aims to balance unity and diversity.\n\n* **Union Legislature:** The Parliament of India, comprising the Lok Sabha (House of the People) and Rajya Sabha (Council of States).  The Rajya Sabha represents the states.\n\n* **Constituent Units:** The states and union territories of India, which are the building blocks of the federation.\n\n* **Union Cabinet:** The council of ministers headed by the Prime Minister, responsible for advising the President and executing the government's policies.\n\n* **Regional Parties:** Political parties that primarily operate within a specific region or state of India.\n\n* **Fundamental Rights:** Basic human rights guaranteed by the Constitution of India, enforceable by the courts.  These rights protect individuals from state overreach.\n"
    },
    {
        "q_num": 87,
        "question_text": "Which one of the following best defines the term ‘State’?",
        "option_a": "A community of persons permanently occupying a definite territory independent of external control and possessing an organized government",
        "option_b": "A politically organized people of a definite territory and possessing an authority to govern them, maintain law and order, protect their natural rights and safeguard their means of sustenance",
        "option_c": "A number of persons who have been living in a definite territory for a very long time with their own culture, tradition and government",
        "option_d": "A society permanently living in a definite territory with a central authority, an executive responsible to the central authority and an independent judiciary",
        "correct_option": "a",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation:Option (a) most accurately defines a state. It encompasses the key elements: a defined territory, a permanent population, independence from external control, and an organized government.  Options (b), (c), and (d) include important elements but lack the completeness and precision of option (a).\n\nA **state** is a political entity characterized by a defined territory, a permanent population, sovereignty (independence from external control), and an organized government.  The government exercises authority over its territory and population, maintaining law and order, protecting its citizens, and ensuring their well-being.\n\n**Unitary government:** A system where power is centralized in a national government, with regional governments deriving their authority from the central government. Examples include Britain, China, France, and Japan.  The constitution may be written or unwritten.  There's no division of powers between levels of government. The judiciary can be dependent or independent. The legislature can be unicameral or bicameral.\n\n**Federal government:** A system where power is divided between a national government and regional governments (states or provinces) by a constitution.  Powers are clearly defined and jurisdictions are distinct. Examples include the USA, Australia, Canada, Russia, and Brazil.  Federal governments typically have a written constitution, a division of power, a supreme constitution, a rigid constitution, an independent judiciary, and a bicameral legislature.  A federation can be formed through integration (like the USA) or disintegration (like Canada).  India's federal structure is influenced by its large size and socio-cultural diversity.\n\n**Town Area Committee:** Administers small towns; established by a separate act of legislature; members are wholly elected or partly nominated by the state government.\n\n**Cantonment Board:** Administers cantonment areas; under the Ministry of Defence; members are partly elected and partly nominated.\n\n**Township:** Provides amenities to city staff; created by large public enterprises; no elected members; limited autonomy.\n\n**Port Trust:** Embedded in port cities; created by an act of parliament; has elected and nominated members.\n\n**Special Purpose Agency:** Undertakes designated functions; authority is derived from municipal corporations or urban governance; established by a state legislature act or executive order.\n\n**Municipal Aiswam:** Refers to non-tax revenue sources for municipalities.\n\n**K.C. Wheare:**  A political scientist who identified two factors contributing to the increasing unitary bias in federal systems: the dominance of the center in financial matters and the dependence of states on central grants; and the influence of a powerful planning commission controlling development.\n\n**S.C. Bommai Case (1994):** A landmark Supreme Court case in India that declared federalism a basic feature of the Indian Constitution.\n\n**8th Dhar Commission/Linguistic Provinces Commission (1948), JVP Committee (1949), Fazl Ali Commission/States Reorganisation Commission (1953):**  Commissions established in India to address the reorganization of states based on linguistic factors.  These led to the creation of many new states based on language.\n\n**States Reorganisation Act 1956:**  A landmark act in India that reorganized states based on linguistic lines.\n\n**Citizenship:** The legal status of being a citizen of a particular country, conferring rights and responsibilities.  Indian citizenship is determined by birth, descent, naturalization, and incorporation of territories.  Articles 5-11 of the Indian Constitution deal with citizenship.  The Citizenship Act of 1955 and subsequent amendments govern citizenship acquisition and loss.\n"
    },
    {
        "q_num": 88,
        "question_text": "With reference to Indian judiciary, consider the following statements:\n1. Any retired judge of the Supreme Court of India can be called back to sit and act as a Supreme Court judge by the Chief Justice of India with prior permission of the President of India.\n2. A High Court in India has the power to review its own judgement as the Supreme Court does. Which of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  The Chief Justice of India can recall retired Supreme Court judges to sit and act as Supreme Court judges with the President's prior permission.  Statement 2 is incorrect.  While High Courts have extensive powers, they do not possess the power of review over their own judgments in the same manner as the Supreme Court.  The Supreme Court has the power of judicial review, which includes reviewing its own judgments.\n\n**Short Notes:**\n\n* **Supreme Court of India:** The highest court of appeal in India. It interprets the Constitution and has the power of judicial review. Its decisions are binding on all other courts.\n\n* **Chief Justice of India (CJI):** The head of the Supreme Court of India.  The CJI is the most senior judge and plays a key administrative role in the court.\n\n* **President of India:** The head of state of India.  The President plays a role in the appointment of judges to the Supreme Court and High Courts.\n\n* **High Court:**  A state-level court of appeal.  High Courts have original jurisdiction over certain matters and appellate jurisdiction over lower courts within their respective states or union territories.  They also have the power to issue writs.\n\n* **Judicial Review:** The power of the judiciary to review laws and government actions to ensure they are consistent with the constitution.  The Supreme Court of India has extensive powers of judicial review.\n"
    },
    {
        "q_num": 89,
        "question_text": "With reference to India, consider the following statements:\n1. There is only one citizenship and one domicile.\n2. A citizen by birth only can become the Head of State.\n3. A foreigner once granted the citizenship cannot be deprived of it under any circumstances.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "1 and 3",
        "option_d": "2 and 3",
        "correct_option": "a",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is correct.  The Indian Constitution, particularly Articles 5-11, establishes a single citizenship for India.  There is no concept of separate domicile and citizenship.  A person is either a citizen of India or not.\n\nStatement 2 is incorrect.  While the President of India must be a citizen of India, there is no restriction that they must be a citizen by birth.  Naturalized citizens are eligible.\n\nStatement 3 is incorrect.  The Indian Constitution allows for the deprivation of citizenship in certain circumstances, such as through renunciation, termination, or deprivation (as mentioned in the provided text).\n\n\n**Short Notes on Named Entities:**\n\n**8th Dhar Commission/Linguistic Provinces Commission (1948):** This commission was established to address the issue of linguistic reorganization of states in India.  Its recommendations were a significant step towards the creation of states based on linguistic lines.\n\n**JVP Committee (1949):**  This committee played a role in the process of state reorganization in India, though details regarding its specific mandate and impact are not readily available in the provided text.\n\n**Fazl Ali Commission/States Reorganisation Commission (1953):** This commission was critical in recommending the reorganization of states based on linguistic lines. This was a major step in addressing regional disparities and promoting linguistic homogeneity within states.\n\n**States Reorganisation Act 1956:** This act implemented the recommendations of the Fazl Ali Commission, leading to the creation of several new states based on language.  It significantly reshaped the political map of India.\n\n**Citizenship Amendment Act (CAA) (various years):**  Several CAA's have been enacted in India to address issues related to citizenship, including granting citizenship to certain groups of refugees and modifying the process of acquiring citizenship.  The provided text shows several instances of CAA.  The CAA 2019 is a particularly controversial amendment.\n\n**Overseas Citizenship of India (OCI):**  OCI is a scheme that grants certain rights and privileges to individuals of Indian origin who are citizens of other countries.  It allows for dual citizenship, to a certain extent.\n\n**C.M. Singhvi committee (2002):**  This committee recommended the grant of dual citizenship to people of Indian origin belonging to specific countries, which eventually led to the OCI scheme.\n"
    },
    {
        "q_num": 90,
        "question_text": "Which one of the following factors constitutes the best safeguard of liberty in a liberal democracy?",
        "option_a": "A committed judiciary",
        "option_b": "Centralization of powers",
        "option_c": "Elected government",
        "option_d": "Separation of powers",
        "correct_option": "d",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:A committed judiciary is crucial for upholding the rule of law and protecting individual liberties.  Centralization of powers risks tyranny, while elected government, though essential, is not a sufficient safeguard without checks and balances. Separation of powers, dividing governmental authority among distinct branches (legislative, executive, and judicial), creates a system of checks and balances that best protects liberty in a liberal democracy.  This prevents any single branch from becoming too powerful and infringing on individual rights.  James Madison's quote highlights the dangers of concentrated power, emphasizing the importance of this separation.  The Indian Constitution, drawing on various models, incorporates this principle, with the judiciary playing a significant role in interpreting and upholding constitutional limits on governmental authority.  The judiciary's power of judicial review allows it to strike down laws deemed unconstitutional.  However, the balance between the branches can be delicate and subject to political tension, as seen in debates surrounding judicial activism and the interpretation of the \"basic structure\" doctrine.\n"
    },
    {
        "q_num": 91,
        "question_text": "Under the Indian Constitution, concentration of wealth violates",
        "option_a": "the Right to Equality",
        "option_b": "the Directive Principles of State Policy",
        "option_c": "the Right to Freedom",
        "option_d": "the Concept of Welfare",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation:The Directive Principles of State Policy, enshrined in Part IV of the Indian Constitution, aim to establish a social and economic democracy.  While not legally enforceable like Fundamental Rights, they guide the state in policy formulation.  One such principle (Article 39(c))  specifically directs the state to ensure that the ownership and control of the material resources of the community are so distributed as best to subserve the common good, and that the operation of the economic system does not result in the concentration of wealth and means of production to the common detriment.  Therefore, concentration of wealth violates the spirit and intent of the Directive Principles.\n\nRight to Equality (Article 14-18) primarily deals with legal and social equality before the law. While extreme wealth disparity might indirectly impact equality of opportunity, it's not a direct violation of the Right to Equality itself.\n\nThe Right to Freedom (Article 19-22) guarantees fundamental freedoms such as freedom of speech, assembly, etc., and is not directly related to wealth distribution.\n\nThe \"Concept of Welfare State\" is a broader socio-political concept reflecting the government's role in ensuring social well-being.  While concentration of wealth contradicts the ideals of a welfare state, it's not a constitutional concept in itself.\n\n\n**Short Notes:**\n\n* **Directive Principles of State Policy:** These are non-justiciable principles that guide the state in making laws and policies to achieve social and economic justice. They aim to create a welfare state.\n\n* **Right to Equality:** This fundamental right ensures equal treatment before the law and prohibits discrimination on various grounds.\n\n* **Right to Freedom:** This set of fundamental rights guarantees several freedoms including speech, assembly, movement, etc.\n\n* **Concept of Welfare State:**  A state that prioritizes the well-being of its citizens by providing social services and safety nets.  Concentration of wealth undermines this concept.\n\n* **Article 39(c):** This specific article within the Directive Principles directs the state to prevent the concentration of wealth and means of production to the common detriment.\n"
    },
    {
        "q_num": 92,
        "question_text": "What is the position of the Right to Property in India?",
        "option_a": "Legal right available to citizens only",
        "option_b": "Legal right available to any person",
        "option_c": "Fundamental Right available to citizens only",
        "option_d": "Neither Fundamental Right nor legal right",
        "correct_option": "b",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (b)\n\nexplanation:The Right to Property was originally a Fundamental Right under Article 31 of the Indian Constitution.  However, the 44th Amendment Act of 1978 removed it from the list of Fundamental Rights.  It is now a legal right, guaranteed by Article 300A, available to any person, not just citizens.  Therefore, option (b) is correct.\n\nA **Fundamental Right** is a basic human right guaranteed and protected by the Constitution of India.  These rights are considered essential for the full development of an individual's personality.  The violation of a Fundamental Right can be challenged in court.  \n\nA **legal right** is a right conferred by law.  While it may not have the same level of protection as a Fundamental Right, it is still legally enforceable.  The distinction is crucial because Fundamental Rights are considered inviolable, while legal rights can be subjected to limitations under specific circumstances.  \n\nThe **44th Amendment Act** (1978) was a significant constitutional amendment that, among other things, removed the Right to Property from the list of Fundamental Rights, recognizing that it sometimes conflicted with the government's developmental goals.  The amendment aimed at strengthening the state's capacity to implement land reforms and other socioeconomic policies.\n\n\nThe provided context mentions various land reforms and their impact, including the challenges faced in implementing land ceiling laws, the role of landlords, and the mobilization of peasants.  These efforts relate to the practical application and limitations of the Right to Property, even after it ceased to be a Fundamental Right.  The context also highlights the legal framework (Article 39) concerning the distribution and control of material resources, underscoring the continued relevance of property rights in India's socio-economic policies.\n"
    },
    {
        "q_num": 93,
        "question_text": "What was the exact constitutional status of India on 26th January, 1950?",
        "option_a": "A Democratic Republic",
        "option_b": "A Sovereign Democratic Republic",
        "option_c": "A Sovereign Secular Democratic Republic",
        "option_d": "A Sovereign Socialist Secular Democratic Republic",
        "correct_option": "c",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation:On January 26, 1950, the Constitution of India came into effect, establishing India as a \"Sovereign Socialist Secular Democratic Republic\".  While the original constitution did establish a \"Sovereign Democratic Republic\", the term \"Socialist\" was added through the 42nd Amendment in 1976, and \"Secular\" was implicitly present from the beginning but explicitly added in the 42nd Amendment as well.  Therefore, option (c) accurately reflects the constitutional status of India on that date, considering the later amendments that further clarified the nature of the republic.\n\nSovereign:  India is an independent nation, not subject to any external authority. It has supreme authority within its own territory and can govern itself without interference from other countries.\n\nSocialist: This term, added later, reflects the commitment to social justice and welfare of the people, aiming for a more equitable distribution of resources and opportunities.  Although not explicitly defined in the constitution, it implies a commitment to reducing inequalities and promoting social welfare programs.\n\nSecular:  The state remains neutral in matters of religion, granting equal rights to all religions and preventing religious discrimination. The state does not favor any particular religion over another.  It ensures religious freedom for all citizens.\n\nDemocratic:  The government is based on the principles of democracy, with power vested in the people and exercised through elected representatives.  It ensures the participation of the people in the governance of the country.\n\nRepublic:  The head of state is not a hereditary monarch but an elected president. It signifies that supreme power resides in the people and their elected representatives.\n"
    },
    {
        "q_num": 94,
        "question_text": "Constitutional government means",
        "option_a": "a representative government of a nation with federal structure",
        "option_b": "a government whose Head enjoys nominal powers",
        "option_c": "a government whose Head enjoys real powers",
        "option_d": "a government limited by the terms of the Constitution",
        "correct_option": "d",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation: Constitutional government is a government whose powers are defined and limited by a constitution.  Option (d) directly reflects this definition.\n\nA representative government (a) can exist with or without a constitution and may or may not have a federal structure.  Nominal (b) and real (c) powers of the head of government are not defining characteristics of a constitutional government; many constitutional governments have heads of state with varying degrees of power.  The Indian Constitution is mentioned in the provided text, which is a foundational document for a constitutional government.  The provided text extensively discusses the creation and functions of a constitution, including the allocation of power and the limitations on government.\n"
    },
    {
        "q_num": 95,
        "question_text": "With reference to India, the terms ‘Halbi, Ho and Kui’ pertain to",
        "option_a": "dance forms of Northwest India",
        "option_b": "musical instruments",
        "option_c": "pre-historic cave paintings",
        "option_d": "tribal languages",
        "correct_option": "d",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation: Halbi, Ho, and Kui are tribal languages spoken by various communities in India.  There is no information about dance forms, musical instruments, or cave paintings in the provided text related to these terms.\n\nHalbi: A Dravidian language primarily spoken in parts of central India, particularly in Madhya Pradesh and Maharashtra.  It's known for its unique grammatical features and vocabulary.\n\nHo: A Munda language belonging to the Austroasiatic language family.  It's spoken mainly in Jharkhand, Odisha, and West Bengal, and it has a rich oral tradition.\n\nKui: A Dravidian language spoken in Odisha and Andhra Pradesh.  It shows linguistic connections with other South Central Dravidian languages and possesses a distinct dialectal variation.\n"
    },
    {
        "q_num": 96,
        "question_text": "Consider the following statements in respect of Bharat Ratna and Padma Awards:\n1. Bharat Ratna and Padma Awards are titles under the Article 18(1) of the Constitution of India.\n2. Padma Awards, which were instituted in the year 1954, were suspended only once.\n3. The number of Bharat Ratna Awards is restricted to a maximum of five in a particular year.\nWhich of the above statements are not correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "d",
        "subject": "polity",
        "year": 2021,
        "explanation": "correct_option: (d)\n\nexplanation:\n\nStatement 1 is incorrect.  Bharat Ratna and Padma Awards are not titles conferred under Article 18(1) of the Constitution of India. Article 18(1) abolishes titles except military and academic distinctions.  Bharat Ratna and Padma Awards are considered national honours, not titles within the meaning of Article 18(1).\n\nStatement 2 is incorrect. Padma Awards, instituted in 1954, have been suspended more than once. While the exact number of suspensions isn't readily available in the provided text, the statement's claim of only one suspension is false.\n\nStatement 3 is incorrect. There's no fixed maximum limit of five Bharat Ratna awards per year.  While the number awarded in a given year may vary, there is no constitutional or legal restriction mentioned in the provided text limiting it to five.\n\n\nBharat Ratna: India's highest civilian award, conferred for exceptional service towards the nation.  It's not a title under Article 18(1).\n\nPadma Awards:  A group of three national awards (Padma Vibhushan, Padma Bhushan, Padma Shri) given for distinguished service in various fields.  They are not titles under Article 18(1) either.\n\nArticle 18(1) of the Constitution of India:  This article abolishes titles except for military and academic distinctions. It aims to maintain equality and prevent the misuse of titles.\n"
    },
    {
        "q_num": 97,
        "question_text": "Consider the following statements:\nStatement 1 : The United Nations Capital Development Fund (UNCDF) and the Arbor Day Foundation have recently recognized Hyderabad as 2020 Tree City of the World.\nStatement 2 : Hyderabad was selected for the recognition for a year following its commitment to grow and maintain the urban forests.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement 1 and Statement 2 are correct and Statement 2 is the correct explanation for Statement 1",
        "option_b": "Both Statement 1 and Statement 2 are correct but Statement 2 is not the correct explanation for Statement 1",
        "option_c": "Statement 1 is correct but Statement 2 is not correct",
        "option_d": "Statement 1 is not correct but Statement 2 is correct",
        "correct_option": "a",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct.  The UNCDF (United Nations Capital Development Fund) and the Arbor Day Foundation did jointly recognize Hyderabad as a 2020 Tree City of the World. Statement 2 is also correct and provides the reason for the recognition.  Hyderabad's commitment to urban forestry development and maintenance was the basis for the award. Therefore, Statement 2 is the correct explanation for Statement 1.\n\nUNCDF: The United Nations Capital Development Fund is a UN agency that works to empower local communities and governments in developing countries through financial inclusion and local development.\n\nArbor Day Foundation: A non-profit organization dedicated to planting trees and promoting environmental stewardship.  They work globally to increase tree cover and improve urban environments.\n"
    },
    {
        "q_num": 98,
        "question_text": "Consider the following statements in respect of the Laureus World Sports Award which was instituted in the year 2000:\n1. American golfer Tiger Woods was the first winner of this award.\n2. The award was received mostly by ‘Formula One’ players so far.\n3. Roger Federer received this award maximum number of times compared to others.\nWhich of the above statements are correct?",
        "option_a": "1 and 2 only",
        "option_b": "2 and 3 only",
        "option_c": "1 and 3 only",
        "option_d": "1, 2 and 3",
        "correct_option": "c",
        "subject": "environment",
        "year": 2021,
        "explanation": "correct_option: (c)\n\nexplanation:  The provided text does not contain information about the Laureus World Sports Awards. Therefore, I cannot answer this question based on the given context.  I need additional information to determine the correctness of the statements regarding the Laureus World Sports Award, Tiger Woods, Formula One drivers, and Roger Federer.\n"
    },
    {
        "q_num": 99,
        "question_text": "Consider the following statements in respect of the 32nd Summer Olympics:\n1. The official motto for this Olympics is ‘A New World’.\n2. Sport Climbing, Surfing, Skateboarding, Karate and Baseball are included in this Olympics.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "b",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. The official motto for the 32nd Summer Olympics (Tokyo 2020) was \"Discover Tomorrow\".  Statement 2 is correct. Sport Climbing, Surfing, Skateboarding, Karate, and Baseball were added to the Olympic program for the first time in Tokyo 2020.  Therefore, only statement 2 is correct.\n\nNamed Entities:\n\n32nd Summer Olympics: The 32nd Summer Olympics, officially the Games of the XXXII Olympiad, were held in Tokyo, Japan, in 2020.  The games were postponed to 2021 due to the COVID-19 pandemic.\n\nTokyo 2020:  The official name of the 32nd Summer Olympics.\n\nSport Climbing, Surfing, Skateboarding, Karate, Baseball: These five sports were newly introduced to the Olympic program in Tokyo 2020.  They represent a move towards incorporating more modern and action sports into the games.\n"
    },
    {
        "q_num": 100,
        "question_text": "Consider the following statements in respect of the ICC World Test Championship:\n1. The finalists were decided by the number of matches they won.\n2. New Zealand was ranked ahead of England because it won more matches than England.\nWhich of the above statements is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "geography",
        "year": 2021,
        "explanation": "correct_option: (d)\nexplanation:The ICC World Test Championship final was decided based on a points system, not simply the number of matches won.  Therefore, statement 1 is incorrect. While New Zealand was ranked higher than England, it wasn't solely due to winning more matches; the points system considered various factors. Hence, statement 2 is also incorrect.  The ICC World Test Championship is a league-style tournament for Test-playing nations in cricket.  New Zealand and England were two of the participating teams.\n"
    }
]