[
    {
        "q_num": 1,
        "question_text": "Consider the following statements:\n1. Jhelum River passes through Wular Lake.\n2. Krishna River directly feeds Kolleru Lake.\n3. Meandering of Gandak River formed Kanwar Lake.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Only statement 1 is correct.\n\n* Jhelum River: The Jhelum River originates from the Wular Lake in Jammu and Kashmir, India.  It is one of the six major rivers of the Indus River system.  The Wular Lake is the largest freshwater lake in Asia.\n\n* Krishna River: The Krishna River is a major river in peninsular India. While Kolleru Lake is located in the Krishna River delta, it's not directly fed by the Krishna River; it receives water primarily from other smaller rivers and rainfall.\n\n* Gandak River: The Gandak River is a transboundary river flowing through Nepal and India. While the Gandak River does meander, Kanwar Lake's formation isn't solely attributed to its meandering.  Several factors contribute to the formation of lakes.\n"
    },
    {
        "q_num": 2,
        "question_text": "Consider the following pairs:\n   Port                                Well known as\n1. Kamarajar Port:                     First major port in India registered as a company.\n2. Mundra Port:                        Largest privately owned port in India\n3. Visakhapatnam:                      Largest container port in India\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one pair",
        "option_b": "Only two pairs",
        "option_c": "All three pairs",
        "option_d": "None of the pairs",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation: Only the statement about Kamarajar Port is correct.  Kamarajar Port is indeed the first major port in India registered as a company. Mundra Port is the largest private port, but not necessarily the largest overall.  Visakhapatnam is a significant container port, but not definitively the largest in India.\n\n\nKamarajar Port: Located in Ennore, Tamil Nadu, it's a significant port handling a wide range of cargo. Its status as the first major port registered as a company in India is a key distinction in its history.\n\nMundra Port: Situated in Gujarat, it's a large private port known for its significant contribution to India's trade.  Its private ownership is a key characteristic.\n\nVisakhapatnam Port: Located in Andhra Pradesh, it's a major port handling various types of cargo, including containers.  While it's a large and important port, its claim as the absolute largest container port requires further verification.\n"
    },
    {
        "q_num": 3,
        "question_text": "Consider the following trees:\n1. Jackfruit (Artocarpus heterophyllus)\n2. Mahua (Madhuca indica)\n3. Teak (Tectona grandis)\nHow many of the above are deciduous trees?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation: Jackfruit (Artocarpus heterophyllus) is an evergreen tree. Mahua (Madhuca indica) is a deciduous tree. Teak (Tectona grandis) is a deciduous tree.  Therefore, only two of the listed trees are deciduous.\n\nJackfruit: A large, tropical fruit tree belonging to the mulberry family. It is native to the Indian subcontinent and Southeast Asia and is known for its large, spiky fruit.  It is an evergreen tree, meaning it retains its leaves throughout the year.\n\nMahua: A medium-sized deciduous tree native to India.  It is known for its fragrant flowers, which are used to make alcohol and other products.  Deciduous trees shed their leaves seasonally.\n\nTeak: A large, deciduous tree highly valued for its strong, durable timber. Native to Southeast Asia, it is widely cultivated for its wood used in furniture, construction, and shipbuilding.  It sheds its leaves during the dry season.\n"
    },
    {
        "q_num": 4,
        "question_text": "Consider the following statements:\n1. India has more arable area than China.\n2. The proportion of irrigated area is more in India as compared to China.\n3. The average productivity per hectare in Indian agriculture is higher than that in China.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Based on the provided text, only statement 1 might be correct.  The document mentions India having 141 million hectares of net sown area compared to China's 80 million hectares. This suggests India has a larger arable area. However, definitive proof for the other two statements is absent. The text highlights India's lower productivity compared to China and discusses irrigation needs, but doesn't offer a direct comparison of irrigated area proportions between the two countries. Therefore, only one statement might be correct.\n\nIndia: A large country in South Asia, known for its diverse geography, large population, and significant agricultural sector.  Its agricultural practices vary widely by region and are influenced by climate and available resources.\n\nChina: Another large Asian country with a vast and productive agricultural sector. It is a major producer and exporter of grains.  Its agricultural practices are also diverse, but generally more technologically advanced than those in India.\n\nArable area: Land suitable for cultivation of crops.  The size of a country's arable land is a key indicator of its agricultural potential.\n\nIrrigated area: Land that receives supplemental irrigation, making it suitable for agriculture even in areas with limited rainfall.  Irrigation significantly boosts crop yields.\n\nProductivity per hectare:  A measure of agricultural efficiency, indicating the amount of crop yield obtained per unit of land area.  Higher productivity reflects better farming techniques and resource utilization.\n"
    },
    {
        "q_num": 5,
        "question_text": "Which one of the following is the best example of repeated falls in sea level, giving rise to present-day extensive marshland?",
        "option_a": "Bhitarkanika Mangroves",
        "option_b": "Marakkanam Salt Pans",
        "option_c": "Naupada Swamp",
        "option_d": "Rann of Kutch",
        "correct_option": "d",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation: The Rann of Kutch is an extensive marshland formed by repeated falls in sea level.  The other options represent different types of wetlands or coastal ecosystems, but not directly resulting from repeated sea-level drops on the same scale as the Rann.\n\nBhitarkanika Mangroves: A mangrove ecosystem in Odisha, India, characterized by dense mangrove forests in a deltaic region.  Mangroves thrive in coastal areas with brackish water and are influenced by tidal fluctuations, but not necessarily formed primarily by repeated sea level drops.\n\nMarakkanam Salt Pans: Salt pans are shallow, artificial or natural basins used for salt production through evaporation of seawater.  They are not directly related to extensive marshland formation due to repeated sea-level falls.\n\nNaupada Swamp: A freshwater or brackish wetland, likely influenced by local hydrological conditions, rather than large-scale sea-level changes.\n\nRann of Kutch: A large salt marsh in Gujarat, India.  Its formation is linked to tectonic activity and fluctuations in sea level, with repeated falls in sea level contributing significantly to its extensive marshland nature. The area is largely flat and experiences seasonal inundation.\n"
    },
    {
        "q_num": 6,
        "question_text": "Ilmenite and rutile, abundantly available in certain coastal tracts of India, are rich sources of which one of the following?",
        "option_a": "Aluminium",
        "option_b": "Copper",
        "option_c": "Iron",
        "option_d": "Titanium",
        "correct_option": "d",
        "subject": "geography",
        "year": 2023,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Ilmenite and rutile are titanium-iron oxides.  Ilmenite's chemical formula is FeTiO₃, and rutile is TiO₂.  Both minerals are significant sources of titanium.  Therefore, the correct answer is (d) Titanium.\n\nAluminium is a lightweight metal used extensively in various applications. Copper is a reddish-brown metal known for its excellent electrical conductivity. Iron is a strong, versatile metal used in construction and manufacturing. Titanium is a strong, lightweight, corrosion-resistant metal used in aerospace, medical implants, and other specialized applications.\n"
    },
    {
        "q_num": 7,
        "question_text": "About three-fourths of world's cobalt, a metal required for the manufacture of batteries for electric motor vehicles, is produced by",
        "option_a": "Argentina",
        "option_b": "Botswana",
        "option_c": "the Democratic Republic of the Congo",
        "option_d": "Kazakhstan",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation: The provided text states that about three-fourths of the world's cobalt is produced by the Democratic Republic of the Congo.  Cobalt is a metal crucial for manufacturing electric vehicle batteries.\n\nArgentina:  A South American country, not significantly associated with cobalt production in the context provided.\n\nBotswana: A Southern African country. The text mentions Botswana in relation to the Kalahari Desert, but doesn't link it to significant cobalt production.\n\nDemocratic Republic of the Congo: A Central African country, a major producer of cobalt, a key component in electric vehicle batteries.  Its significant cobalt reserves and production contribute substantially to the global supply.\n\nKazakhstan: A Central Asian country, not prominently mentioned in the provided text as a significant cobalt producer.\n"
    },
    {
        "q_num": 8,
        "question_text": "Which one of the following is a part of the Congo Basin?",
        "option_a": "Cameroon",
        "option_b": "Nigeria",
        "option_c": "South Sudan",
        "option_d": "Uganda",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: The Congo Basin is a large sedimentary basin located in Central Africa.  Cameroon is a country located within the Congo Basin.  Nigeria, South Sudan, and Uganda are not within the Congo Basin.\n\nCameroon: A country in Central Africa, bordering the Gulf of Guinea, known for its diverse geography, including rainforests and volcanic mountains. Part of it lies within the Congo Basin.\n\nNigeria: A West African country, located on the Gulf of Guinea, known for its large population and oil production.  It is not part of the Congo Basin.\n\nSouth Sudan: A landlocked country in East Africa, known for its recent history of independence and ongoing conflicts. It's not located within the Congo Basin.\n\nUganda: A landlocked country in East Africa, known for its diverse wildlife and Lake Victoria. It is not part of the Congo Basin.\n"
    },
    {
        "q_num": 9,
        "question_text": "Consider the following statements:\n1. Amarkantak Hills are at the confluence of Vindhya and Sahyadri Ranges.\n2. Biligirirangan Hills constitute the easternmost part of Satpura Range.\n3. Seshachalam Hills constitute the southernmost part of Western Ghats.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Only statement 1 is partially correct.  Amarkantak Hills are located at the source of the Narmada River, which is considered the meeting point of the Vindhya and Satpura ranges, not the Vindhya and Sahyadri ranges.  The Sahyadri range (also known as the Western Ghats) is much further west. Statement 2 is incorrect; Biligirirangan Hills are not part of the Satpura range. Statement 3 is also incorrect; Seshachalam Hills are part of the Eastern Ghats, not the southernmost part of the Western Ghats.\n\nAmarkantak Hills: Situated in Madhya Pradesh, India, Amarkantak is a plateau marking the source of the Narmada and Son rivers. It's considered a significant geographical point in the central Indian highlands, where the Vindhya and Satpura ranges meet.\n\nVindhya Range: An ancient mountain range in central India, stretching east-west.  It's characterized by a relatively low elevation compared to the Himalayas.\n\nSahyadri Range (Western Ghats): A mountain range along the western coast of the Indian peninsula.  It's known for its biodiversity and high rainfall.\n\nBiligirirangan Hills: Located in Karnataka, India, these hills are part of the Eastern Ghats, a range of mountains that runs along India's eastern coast.\n\nSatpura Range:  A mountain range in central India, running roughly parallel to the Vindhya Range.  It forms a part of the central Indian highlands.\n\nSeshachalam Hills:  Located in Andhra Pradesh, India, these hills are part of the Eastern Ghats and are known for their rich biodiversity and temples.\n"
    },
    {
        "q_num": 10,
        "question_text": "With reference to India's projects on connectivity, consider the following statements:\n1. East-West Corridor under Golden Quadrilateral Project connects Dibrugarh and Surat.\n2. Trilateral Highway connects Moreh in Manipur and Chiang Mai in Thailand via Myanmar.\n3. Bangladesh-China-India-Myanmar Economic Corridor connects Varanasi in Uttar Pradesh with Kunming in China.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect. The East-West Corridor under the Golden Quadrilateral Project connects Silchar (Assam) and Porbandar (Gujarat), not Dibrugarh and Surat.\n\nStatement 2 is correct. The Trilateral Highway connects Moreh in Manipur to Mae Sot in Thailand via Myanmar.  While Chiang Mai is a significant city in Northern Thailand, the highway's terminus is Mae Sot.\n\nStatement 3 is incorrect. The Bangladesh-China-India-Myanmar Economic Corridor (BCIM-EC) is a proposed economic corridor connecting Kolkata (India) to Kunming (China) via Bangladesh and Myanmar.  Varanasi is not part of this corridor.\n\n\n**Short Notes:**\n\n* **Golden Quadrilateral Project:** A network of high-speed highways connecting India's major metropolitan cities.  It significantly improved national connectivity and transportation efficiency.\n\n* **East-West Corridor:** One of the components of the Golden Quadrilateral Project, designed to improve connectivity between the eastern and western parts of India.\n\n* **Trilateral Highway:** A highway project involving India, Myanmar, and Thailand to enhance regional connectivity across South East Asia. It aims to facilitate trade and people-to-people contact.\n\n* **Moreh (Manipur):** A town on the India-Myanmar border, serving as a crucial gateway for trade and transportation between the two countries.\n\n* **Chiang Mai (Thailand):** A major city in Northern Thailand, known for its cultural heritage and tourism.\n\n* **Myanmar:** A country in Southeast Asia, geographically located between India and Thailand. It plays a vital role in regional connectivity initiatives.\n\n* **Bangladesh-China-India-Myanmar Economic Corridor (BCIM-EC):** A proposed economic cooperation initiative between four countries aiming to enhance trade, infrastructure, and cultural exchange.\n\n* **Varanasi (Uttar Pradesh):** An ancient city in Uttar Pradesh, India, known for its religious significance and cultural heritage.  It's not directly involved in the BCIM-EC.\n\n* **Kunming (China):** A major city in Southwestern China, serving as a significant transportation and trade hub.\n"
    },
    {
        "q_num": 11,
        "question_text": "Consider the following statements:\nStatement-I  : India, despite having uranium deposits, depends on coal for most of its electricity production.\nStatement-II : Uranium, enriched to the extent of at least 60%, is required for the production of electricity.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Statement I is correct. India possesses uranium deposits but relies heavily on coal for electricity generation.  Statement II is incorrect.  Uranium enrichment to 60% or more is needed for weapons-grade material, not for electricity production in nuclear power plants.  Nuclear reactors utilize uranium enriched to a much lower level (typically around 3-5%).\n\nIndia: A large country in South Asia known for its diverse geography, culture, and economy.  It has significant reserves of uranium, a radioactive element used in nuclear power generation.  Despite this, a large portion of its electricity comes from coal-fired power plants.\n\nCoal: A fossil fuel used extensively for electricity generation worldwide due to its abundance and relatively low cost.  It is a major source of energy for India, but its use contributes significantly to air pollution.\n\nUranium: A naturally occurring radioactive element used as fuel in nuclear reactors.  It needs to be enriched to increase the concentration of fissile isotopes (like U-235) to make it suitable for use in reactors.  The enrichment level required for nuclear power plants is significantly lower than that needed for nuclear weapons.\n"
    },
    {
        "q_num": 12,
        "question_text": "Consider the following statements:\nStatement-I  : Marsupials are not naturally found in India.\nStatement-II : Marsupials can thrive only in montane grasslands with no predators.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: Statement I is correct. Marsupials, mammals that raise their young in a pouch, are not naturally found in India.  Statement II is incorrect. Marsupials' habitats are diverse and not limited to montane grasslands without predators.  Their survival depends on a range of factors, including food availability, climate, and the presence of competitors and predators.  \n\nMarsupials:  A group of mammals characterized by the raising of their young in a pouch.  They have a wide distribution across the globe, but are notably absent from many regions, including India.  Examples include kangaroos, koalas, and wombats.\n\nIndia: A large country in South Asia known for its diverse geography and rich biodiversity.  It is situated in a tropical and subtropical region, which is not the primary habitat for marsupials.\n\nMontane grasslands: Grasslands found at high altitudes in mountainous regions. These areas often have specific climatic conditions and limited biodiversity.\n\nPredators: Animals that hunt and kill other animals for food. The presence or absence of predators can significantly impact the populations of other species.\n"
    },
    {
        "q_num": 13,
        "question_text": "Invasive Species Specialist Group' (that develops Global Invasive Species Database) belongs to which one of the following organizations?",
        "option_a": "The International Union for Conservation of Nature",
        "option_b": "The United Nations Environment Programme",
        "option_c": "The United Nations World Commission for Environment and Development",
        "option_d": "The World Wide Fund for Nature",
        "correct_option": "a",
        "subject": "environment",
        "year": 2023,
        "explanation": "* **correct_option:** (a)\n* **explanation:** The Invasive Species Specialist Group (ISSG), responsible for developing the Global Invasive Species Database, is part of the International Union for Conservation of Nature (IUCN).  The IUCN is a global organization dedicated to conserving the world's biodiversity.  It uses a set of criteria to evaluate the extinction risk of species and publishes the IUCN Red List of Threatened Species. The UNEP (United Nations Environment Programme) is a leading global environmental authority, working with UN member states to establish a global environmental agenda. The UN World Commission on Environment and Development (WCED) was a high-level UN body that produced the Brundtland Report, which introduced the concept of sustainable development. The WWF (World Wide Fund for Nature) is a global conservation organization working to protect endangered species and their habitats.\n"
    },
    {
        "q_num": 14,
        "question_text": "Consider the following fauna:\n1. Lion-tailed Macaque\n2. Malabar Civet\n3. Sambar Deer\nHow many of the above are generally nocturnal or most active after sunset?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation: The Malabar Civet and Lion-tailed Macaque are nocturnal animals, while the Sambar Deer is primarily crepuscular (most active during dawn and dusk), although it can be active at other times of the day as well.  Therefore, only two of the listed animals are generally nocturnal or most active after sunset.\n\nLion-tailed Macaque: An Old World monkey endemic to the Western Ghats of southern India.  It is arboreal and primarily frugivorous, with a distinctive lion-like mane.  It is largely nocturnal or crepuscular.\n\nMalabar Civet: A small carnivorous mammal found in the Western Ghats.  It is known for its distinctive striped coat and is primarily nocturnal.\n\nSambar Deer: A large deer species found across much of South and Southeast Asia. They are generally crepuscular, meaning most active during dawn and dusk, but can also be active during the day or night depending on factors like predation pressure and habitat.\n"
    },
    {
        "q_num": 15,
        "question_text": "Which of the following organisms perform waggle dance for others of their kin to indicate the direction and the distance to a source of their food?",
        "option_a": "Butterflies",
        "option_b": "Dragonflies",
        "option_c": "Honeybees",
        "option_d": "Wasps",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: Honeybees are known to perform the waggle dance to communicate the location of food sources to other bees in their colony.  The dance conveys both the direction and distance to the food. Butterflies, dragonflies, and wasps do not exhibit this specific behavior.\n\nButterflies:  Insects with large, often brightly colored wings. They undergo complete metamorphosis (egg, larva, pupa, adult).  Many are important pollinators.\n\nDragonflies:  Predatory insects with two pairs of strong, transparent wings.  They are skilled fliers and hunters, typically found near water.\n\nHoneybees: Social insects living in colonies with a complex social structure (queen, workers, drones). They are vital pollinators and produce honey.\n\nWasps:  A large group of stinging insects, many of which are social and live in colonies.  Some are parasitoids, others are predators or scavengers.\n"
    },
    {
        "q_num": 16,
        "question_text": "Consider the following statements:\n1. Some mushrooms have medicinal properties.\n2. Some mushrooms have psycho-active properties.\n3. Some mushrooms have insecticidal properties.\n4. Some mushrooms have bioluminescent properties.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation:Statement 1 is correct as some mushrooms like shiitake and reishi have medicinal properties. Statement 2 is correct as certain mushrooms contain psilocybin, a psychoactive compound. Statement 3 is correct as some mushrooms produce toxins that act as insecticides. Statement 4 is correct as some mushrooms exhibit bioluminescence, emitting light.  Therefore, all four statements are correct.\n"
    },
    {
        "q_num": 17,
        "question_text": "Consider the following statements regarding the Indian squirrels:\n1. They build nests by making burrows in the ground.\n2. They store their food materials like nuts and seeds in the ground.\n3. They are omnivorous.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Indian squirrels are known to build nests in tree hollows or on branches, not burrows in the ground.  They also cache food, including nuts and seeds, in various locations, but not exclusively in the ground.  They are omnivorous, consuming a variety of plant and animal matter. Therefore, only statement 3 is correct.\n\nIndian squirrels:  A diverse group of rodents found across India, exhibiting varied behaviours and diets depending on species and habitat.  They play an important role in seed dispersal and ecosystem dynamics.\n\nOmnivorous:  Describes an animal that consumes both plant and animal matter.\n\n\n"
    },
    {
        "q_num": 18,
        "question_text": "Consider the following statements:\n1. Some microorganisms can grow in environments with temperature above the boiling point of water.\n2. Some microorganisms can grow in environments with temperature below the freezing point of water.\n3. Some microorganisms can grow in highly acidic environment with a pH below 3.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "* **correct_option:** (c)\n* **explanation:**  All three statements are correct.\n\n1. **Some microorganisms can grow in environments with temperatures above the boiling point of water:** Certain extremophile archaea thrive in hydrothermal vents, which have temperatures far exceeding 100°C.  These organisms have adapted to survive under extreme heat conditions.\n\n2. **Some microorganisms can grow in environments with temperatures below the freezing point of water:**  Psychrophiles are microorganisms adapted to cold environments, capable of growth at temperatures below 0°C. They are found in polar regions, glaciers, and deep ocean waters.\n\n3. **Some microorganisms can grow in highly acidic environments with a pH below 3:** Acidophiles are microorganisms that thrive in highly acidic environments, often with pH values below 3. They are found in environments like acidic mines, sulfur springs, and the stomachs of certain animals.  They possess specific mechanisms to survive and function under such extreme acidic conditions.\n"
    },
    {
        "q_num": 19,
        "question_text": "Which one of the following makes a tool with a stick to scrape insects from a hole in a tree or a log of wood?",
        "option_a": "Fishing cat",
        "option_b": "Orangutan",
        "option_c": "Otter",
        "option_d": "Sloth bear",
        "correct_option": "b",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation: Orangutans are known for their tool use, including using sticks to extract insects from tree holes or logs.  Fishing cats are skilled hunters but not known for this specific tool use. Otters are aquatic mammals and don't typically use tools in this way. Sloth bears are known for their termite-eating habits, but not for using sticks as tools to extract insects from holes.\n"
    },
    {
        "q_num": 20,
        "question_text": "Consider the following:\n1. Aerosols\n2. Foam agents\n3. Fire retardants\n4. Lubricants\nIn the making of how many of the above are hydrofluorocarbons used?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "c",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: Hydrofluorocarbons (HFCs) are used in aerosols, foam agents, and fire retardants.  They are not typically used in lubricants, although some specialized lubricants might contain them.  Therefore, HFCs are used in three of the listed applications.\n\nAerosols:  Aerosols are colloidal systems containing small solid or liquid particles suspended in a gas.  HFCs are used as propellants in some aerosol products because they have low toxicity and do not deplete the ozone layer.\n\nFoam agents:  Foam agents create stable foams often used in fire suppression or other applications.  HFCs can be used as blowing agents to create the foam structure.\n\nFire retardants:  Fire retardants suppress or slow the spread of fire.  Some fire retardants utilize HFCs to help suppress combustion.\n\nLubricants: Lubricants reduce friction between moving parts. While HFCs have some properties that might seem suitable for lubrication, they are not commonly used as primary lubricants.  They might be present as minor components in some specialized applications.\n"
    },
    {
        "q_num": 21,
        "question_text": "Consider the following statements:\nStatement-I  : Interest income from the deposits in Infrastructure Investment Trusts (InvITs) distributed to their investors is exempted from tax, but the dividend is taxable.\nStatement-II : InvITs are recognized as borrowers under the 'Securitization and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002'.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "d",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation:Statement-I is incorrect.  Interest income from InvITs is taxable, while dividend income is generally exempt from tax under certain conditions.  Statement-II is correct. InvITs are indeed recognized as borrowers under the Securitization and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act).  This allows them to leverage their assets for financing infrastructure projects.\n\nInfrastructure Investment Trusts (InvITs):  These are trust structures that pool investments in infrastructure projects, allowing investors to participate in the returns generated by these projects.  They offer a way to invest in large-scale infrastructure without direct ownership.\n\nSecuritization and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act): This act provides a framework for securitization of financial assets and efficient enforcement of security interests.  It aims to streamline the process of recovering dues from borrowers who default on their loans.  The inclusion of InvITs under this act facilitates their borrowing and access to credit for infrastructure development.\n"
    },
    {
        "q_num": 22,
        "question_text": "Consider the following statements:\nStatement-I  : In the post-pandemic recent past, many Central Banks worldwide had carried out interest rate hikes.\nStatement-II : Central Banks generally assume that they have the ability to counteract the rising consumer prices via monetary policy means.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "a",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Statement-I is correct as many central banks globally increased interest rates in the post-pandemic period to combat inflation.  Statement-II is also correct; central banks generally believe monetary policy tools can control rising consumer prices.  Statement-II is the reason for Statement-I because the interest rate hikes were a direct application of monetary policy to curb inflation.\n\n\nCentral Banks:  Independent institutions responsible for managing a country's monetary policy, including setting interest rates and managing money supply. Their primary goal is usually price stability (controlling inflation).\n\nMonetary Policy: Actions undertaken by a central bank to manipulate the money supply and credit conditions to stimulate or restrain economic activity.  Tools include interest rate adjustments, reserve requirements, and open market operations.\n\nConsumer Prices: The average price level of goods and services purchased by consumers.  Changes in consumer prices are a key indicator of inflation.\n"
    },
    {
        "q_num": 23,
        "question_text": "Consider the following statements:\nStatement-I  : Carbon markets are likely to be one of the most widespread tools in the fight against climate change.\nStatement-II : Carbon markets transfer resources from the private sector to the State.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: Statement I is correct. Carbon markets are a significant mechanism being explored globally to mitigate climate change by putting a price on carbon emissions, incentivizing emission reductions.  Statement II is incorrect. Carbon markets primarily function through the buying and selling of carbon credits between private entities (companies, organizations), with governments often playing a regulatory role but not necessarily directly transferring resources from the private sector to the state.  While governments might benefit through revenue generation from carbon tax schemes, that's distinct from the core mechanism of carbon markets.\n"
    },
    {
        "q_num": 24,
        "question_text": "Which one of the following activities of the Reserve Bank of India is considered to be part of 'sterilization'?",
        "option_a": "Conducting 'Open Market Operations'",
        "option_b": "Oversight of settlement and payment systems",
        "option_c": "Debt and cash management for the Central and State Governments",
        "option_d": "Regulating the functions of Non-banking Financial Institutions",
        "correct_option": "a",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation:Sterilization, in the context of the Reserve Bank of India (RBI), refers to the process of neutralizing the impact of foreign exchange market interventions on domestic money supply.  When the RBI sells foreign currency, it receives rupees, potentially increasing domestic liquidity. Sterilization involves offsetting this increase through actions like open market operations (OMOs).  Option (a), conducting OMOs, is the correct answer because the buying and selling of government securities in the open market is a key tool used by the RBI for sterilization.\n\nOpen Market Operations (OMOs):  The RBI's buying or selling of government securities to influence money supply and interest rates.  Buying securities injects liquidity, while selling withdraws it.\n\nOversight of settlement and payment systems:  The RBI's role in ensuring the smooth and efficient functioning of payment systems like RTGS and NEFT. This is not directly related to sterilization.\n\nDebt and cash management for the Central and State Governments: The RBI's function of managing the government's borrowing and cash balances.  While related to monetary policy, it's not the primary mechanism for sterilization.\n\nRegulating the functions of Non-banking Financial Institutions (NBFCs): The RBI's regulatory oversight of NBFCs to ensure their financial stability and adherence to regulations. This is unrelated to sterilization.\n"
    },
    {
        "q_num": 25,
        "question_text": "Consider the following markets:\n1. Government Bond Market\n2. Call Money Market\n3. Treasury Bill Market\n4. Stock Market\nHow many of the above are included in capital markets?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "b",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation: Capital markets are markets for long-term securities.  The Government Bond Market and Treasury Bill Market are both capital markets as they deal with long-term debt instruments. The Call Money Market is a money market dealing with short-term borrowing and lending between banks. The Stock Market is a capital market dealing with long-term equity investments. Therefore, only two of the given markets are included in capital markets.\n\nGovernment Bond Market: This market deals with the buying and selling of government bonds, which are long-term debt instruments issued by governments to finance their spending.  These bonds are considered relatively low-risk investments.\n\nCall Money Market: This is a short-term money market where banks borrow and lend funds to each other for short periods, typically overnight or for a few days. It plays a vital role in managing short-term liquidity in the banking system.\n\nTreasury Bill Market:  This market involves the trading of short-term debt securities (Treasury bills or T-bills) issued by governments. T-bills are typically less than a year in maturity.\n\nStock Market: This market facilitates the trading of company shares (stocks or equities), representing ownership in a corporation. It is a crucial mechanism for companies to raise capital and for investors to participate in the growth of businesses.\n"
    },
    {
        "q_num": 26,
        "question_text": "Which one of the following best describes the concept of 'Small Farmer Large Field'?",
        "option_a": "Resettlement of a large number of people, uprooted from their countries due to war, by giving them a large cultivable land which they cultivate collectively and share the produce",
        "option_b": "Many marginal farmers in an area organize themselves into groups and synchronize and harmonize selected agricultural operations",
        "option_c": "Many marginal farmers in an area together make a contract with a corporate body and surrender their land to the corporate body for a fixed term for which the corporate body makes a payment of agreed amount to the farmers",
        "option_d": "A company extends loans, technical knowledge and material inputs to a number of small farmers in an area so that they produce the agricultural commodity required by the company for its manufacturing process and commercial production",
        "correct_option": "b",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:The concept of 'Small Farmer Large Field' refers to a situation where many marginal farmers in a specific area collaborate to synchronize and harmonize their agricultural operations.  This allows them to achieve economies of scale and improve efficiency despite their individual small landholdings.  Options (a), (c), and (d) describe different agricultural models. Option (a) describes a collective farming model after resettlement. Option (c) describes contract farming where farmers lease their land. Option (d) describes a company-farmer partnership where the company provides resources and buys the produce.\n\n\n**Short Notes on Keywords and Named Entities:**\n\n* **Small Farmer:** A farmer with a relatively small landholding, often insufficient to provide a comfortable living.  They often lack resources and access to technology compared to larger farms.\n\n* **Large Field:**  In the context of \"Small Farmer Large Field,\" it doesn't refer to a single, physically large field, but rather the collective effect of many small farms working together, creating a larger scale of operation.\n\n* **Marginal Farmers:** Farmers who cultivate very small plots of land, often resulting in low income and vulnerability. They are often a target of various agricultural development programs.\n\n* **Collective farming:** A system where farmers pool their resources and work together, sharing the produce. This model has been used in various parts of the world with varying levels of success.\n\n* **Contract farming:** An agreement between a farmer and a company where the farmer agrees to grow a specific crop for the company, receiving payment based on the contract.  This can offer price stability but can also lead to dependence on the company.\n\n* **World Bank 1996:** A reference to a report or publication by the World Bank in 1996 which may have discussed the factors affecting cropping patterns, including economic, agronomic, and governmental factors.\n\n* **Cropping patterns:** The types of crops and their sequencing on a farm or in a region over time, influenced by various factors like climate, soil type, market demand and government policies.\n\n* **Subsistence farming:** Farming primarily to meet the needs of the farmer and their family, with little or no surplus for sale.\n\n* **Commercial farming:** Farming primarily for profit, producing crops or livestock for sale in the market.\n\n* **Plantation agriculture:** Large-scale farming of a single crop, often requiring significant capital investment and labor.  Typically associated with colonial history and export crops.\n\n* **Cooperative farming:** Farmers voluntarily pool their resources and cooperate for more efficient farming while retaining individual ownership of their land.  This model aims to improve bargaining power and access to resources.\n\n* **MSP (Minimum Support Price):** A government-set price for certain agricultural products, guaranteeing a minimum price to farmers, aiming to prevent price crashes and ensure farmers' income stability.\n\n* **Contract farming opportunities:** The possibility for farmers to enter into contracts with companies to supply crops or livestock, often providing more predictable income but also potentially limiting farmer autonomy.\n\n* **Rural credit:** Access to loans and financial services for farmers in rural areas, crucial for investment in inputs and equipment.\n"
    },
    {
        "q_num": 27,
        "question_text": "Consider the following statements:\n1. The Government of India provides Minimum Support Price for niger (Guizotia abyssinica) seeds.\n2. Niger is cultivated as a Kharif crop.\n3. Some tribal people in India use niger seed oil for cooking.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation:\n\nStatement 1: The provided text mentions Minimum Support Price (MSP) and its relevance to farmers, but doesn't explicitly state whether it applies to niger seeds.  Therefore, we cannot confirm this statement.\n\nStatement 2: Niger is mentioned in the context of oilseeds and agricultural production. While the text provides information about Kharif and Rabi crops,  it doesn't specify the cropping season of niger.  Therefore, we cannot confirm this statement.\n\nStatement 3: The text mentions niger seed oil, and in the broader context of the document, discusses the use of oilseeds and agricultural products by various groups, including tribal communities. This statement can be considered likely true based on the available context.\n\n\nTherefore, only one statement (Statement 3) can be confidently asserted as correct based on the provided text.  The other two statements lack direct confirmation.\n\n**Short Notes on Named Entities:**\n\n* **Minimum Support Price (MSP):** A price fixed by the government to protect farmers from price fluctuations in the market. It acts as a safety net, ensuring farmers receive a minimum price for their produce, even if market prices are lower.\n\n* **Niger (Guizotia abyssinica):** An oilseed crop cultivated for its seeds, which are rich in oil.  The oil is used for various purposes, including cooking, and the seeds themselves have other uses.\n\n* **Kharif crop:** A crop that is sown at the beginning of the monsoon season (usually June-July) and harvested in the autumn (September-October).\n\n* **Rabi crop:** A crop that is sown in winter (October-November) and harvested in spring (March-April).\n\n\n"
    },
    {
        "q_num": 28,
        "question_text": "Consider the investments in the following assets:\n1. Brand recognition\n2. Inventory\n3. Intellectual property\n4. Mailing list of clients\nHow many of the above are considered intangible investments?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation: Brand recognition, inventory, intellectual property, and a mailing list of clients are all intangible assets.  Intangible assets are non-physical assets that have value to a business.\n\n* **Brand recognition:**  The awareness and perception of a brand in the market.  High brand recognition translates to higher sales and customer loyalty.\n\n* **Inventory:**  Goods held for sale in the ordinary course of business. While inventory itself is tangible, the *value* derived from it (e.g., the profit margin) is often considered part of the intangible investment.\n\n* **Intellectual property:**  Intangible creations of the mind, such as patents, copyrights, trademarks, and trade secrets. These assets provide competitive advantages and generate revenue streams.\n\n* **Mailing list of clients:** A database of customer contact information. This list represents a valuable asset, as it allows for direct marketing and relationship building, leading to increased sales and customer retention.  The value lies in the information itself, not the physical list.\n"
    },
    {
        "q_num": 29,
        "question_text": "Consider the following:\n1. Demographic performance\n2. Forest and ecology\n3. Governance reforms\n4. Stable government\n5. Tax and fiscal efforts\nFor the horizontal tax devolution, the Fifteenth Finance Commission used how many of the above as criteria other than population area and income distance?",
        "option_a": "Only two",
        "option_b": "Only three",
        "option_c": "Only four",
        "option_d": "All five",
        "correct_option": "c",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation:The Fifteenth Finance Commission used three criteria other than population, area, and income distance for horizontal tax devolution.  These were demographic performance, forest and ecology, and governance reforms.  Stable government and tax and fiscal efforts were not explicitly mentioned as criteria in the context of the question.\n\n\nDemographic performance refers to the various indicators reflecting the population's characteristics, including size, growth rate, age structure, and distribution.  Forest and ecology encompass the extent and health of forest cover and ecological diversity within a region. Governance reforms refer to improvements in the efficiency, transparency, and accountability of government operations.  Stable government indicates a political system with consistent leadership and effective policy-making. Tax and fiscal efforts relate to the government's capacity to collect taxes and manage its finances effectively.  The Fifteenth Finance Commission is a constitutional body in India responsible for recommending the distribution of tax revenues between the central and state governments.\n"
    },
    {
        "q_num": 30,
        "question_text": "Consider the following infrastructure sectors:\n1. Affordable housing\n2. Mass rapid transport\n3. Health care\n4. Renewable energy\nOn how many of the above does UNOPS Sustainable Investments in Infrastructure and Innovation (S3i) initiative focus for its investments?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (d)\n\nexplanation: The provided text does not contain information about the UNOPS Sustainable Investments in Infrastructure and Innovation (S3i) initiative's investment focus.  Therefore, a definitive answer cannot be provided based solely on this document.  The document focuses on India's economic survey, covering various sectors like agriculture, industry, services, fiscal developments, and monetary management.  It mentions infrastructure development extensively, including roads, railways, and aviation, but doesn't detail the specific areas of focus for the UNOPS S3i initiative.  Affordable housing, mass rapid transport, healthcare, and renewable energy are mentioned in the question but not in relation to the UNOPS initiative within the provided text.\n"
    },
    {
        "q_num": 31,
        "question_text": "In essence, what does Due Process of Law’ mean?",
        "option_a": "The principle of natural justice",
        "option_b": "The procedure established by law",
        "option_c": "Fair application of law",
        "option_d": "Equality before law",
        "correct_option": "c",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation:Due process of law essentially means the fair application of law.  It ensures that legal proceedings are fair and impartial, respecting fundamental rights and principles of justice. While it incorporates elements of natural justice (fairness and impartiality) and the procedure established by law, its core meaning lies in the equitable treatment of individuals under the law.  Equality before the law is a related but distinct concept, focusing on the absence of special privileges and equal subjection to the law, whereas due process emphasizes the fairness of the *application* of the law.\n\nNatural justice:  A set of principles ensuring fairness in legal proceedings, including the right to be heard and a fair trial.  It emphasizes impartiality and the avoidance of bias.\n\nProcedure established by law:  The legal processes and steps followed in the application of a law.  Due process requires that these procedures are fair and reasonable.\n\nFair application of law:  The equitable and impartial application of the law to all individuals, ensuring that no one is unfairly disadvantaged or discriminated against.  This is the core of due process.\n\nEquality before the law: The principle that all individuals are subject to the same laws and are treated equally under the law, without any special privileges or exemptions.\n\nRule of law:  A principle of governance where all individuals and authorities are accountable under the law.  It ensures justice, protects democratic values, and prevents arbitrary use of power.  The rule of law is essential for due process to function effectively.\n\nArticle 14 (Equality before the law): This article of the Indian Constitution guarantees equality before the law and equal protection of the laws within the territory of India.  It prohibits discrimination based on factors such as religion, race, caste, sex, or place of birth.\n\nArticle 21 (Protection of life and personal liberty): This article guarantees that no person shall be deprived of his life or personal liberty except according to procedure established by law. This is often interpreted to include the right to due process.\n\nVeroparan case (1950): This case dealt with the interpretation of Article 21 and the scope of due process in India.  It clarified the limitations of challenging the validity of a law based solely on its reasonableness or fairness.\n\nMenaka Gandhi case (1978): This landmark case significantly expanded the interpretation of Article 21 to include various facets of life and personal liberty beyond mere physical freedom, including the right to livelihood, privacy, and a healthy environment. This broadened the scope of due process in India.\n"
    },
    {
        "q_num": 32,
        "question_text": "Consider the following statements:\nStatement-I  : In India, prisons are managed by State Governments with their own rules and regulations for the day-to-day administration of prisons.\nStatement-II : In India, prisons are governed by the Prisons Act, 1894 which expressly kept the subject of prisons in the control of Provincial Governments.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "a",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Statement-I is correct. In India, the day-to-day administration of prisons falls under the purview of individual State Governments, each with its own set of rules and regulations.  Statement-II is also correct. The Prisons Act of 1894 explicitly placed the control of prisons under the Provincial Governments (which are now the State Governments). Therefore, Statement-II correctly explains Statement-I.\n\n**Short notes:**\n\n* **Prisons Act, 1894:** This Act is the primary legislation governing prisons in India.  It established the framework for prison administration and initially vested power over prisons in the then Provincial Governments.  It has been amended over time but remains the foundational legal instrument.\n\n* **State Governments (India):**  These are the governments of the individual states that constitute the Indian Union. They have significant autonomy in managing their own affairs, including areas like prison administration, law and order, and public health, subject to the overall authority of the national government.\n\n* **Provincial Governments (historical context):** Before India's independence, the British Raj administered the country through provinces. The Provincial Governments were responsible for the administration of their respective provinces, including matters such as prison management.  After independence, these became the State Governments.\n"
    },
    {
        "q_num": 33,
        "question_text": "Which one of the following statements best reflects the Chief purpose of the ‘Constitution’ of a country?",
        "option_a": "It determines the objective for the making of necessary laws.",
        "option_b": "It enables the creation of political offices and a government.",
        "option_c": "It defines and limits the powers of government.",
        "option_d": "It secures social justice, social equality and social security.",
        "correct_option": "c",
        "subject": "polity",
        "year": 2023,
        "explanation": "```text\ncorrect_option: (c)\nexplanation: The chief purpose of a country's constitution is to define and limit the powers of the government.  While a constitution may influence law-making objectives (a), enable government creation (b), and aim for social improvements (d), its core function is establishing a framework that constrains governmental authority to prevent tyranny and protect citizens' rights.  The provided text extensively details the Indian Constitution's functions, emphasizing the importance of limiting government power and protecting fundamental rights as central to its purpose.\n\nA constitution is a body of fundamental principles that determine how a state is organized and governed. It allocates power, defines rights, and sets limits on government authority.  The Indian Constitution, a prime example, goes beyond basic rules to reflect societal aspirations and goals.  A bill of rights is a list of fundamental rights protected by a constitution, such as those in the Indian and South African Constitutions.  The Indian Constitution’s fundamental rights include equality, freedom, and protection against exploitation.  Directive Principles of State Policy are non-justiciable guidelines for government action.  The Preamble summarizes the Constitution's goals.  The Constituent Assembly drafted the Indian Constitution.  First Past the Post (FPTP) and Proportional Representation (PR) are different electoral systems.  The Election Commission of India is an independent body that conducts elections.  Preventive detention is the lawful imprisonment of a person to prevent future criminal activity.  Judicial review is the power of the judiciary to examine the constitutionality of laws. Public Interest Litigation (PIL) allows individuals or groups to bring cases to court on behalf of the public interest.  Federalism is a system of government that divides power between a central government and regional governments.  The Rajya Sabha is the upper house of the Indian Parliament, representing the states.  The Lok Sabha is the lower house of the Indian Parliament, directly elected by the people.  The basic structure doctrine limits the amending power of the Parliament.\n```\n"
    },
    {
        "q_num": 34,
        "question_text": "In India, which one of the following Constitutional Amendments was widely believed to be enacted to overcome the judicial interpretations of the Fundamental Rights?",
        "option_a": "1st Amendment",
        "option_b": "42nd Amendment",
        "option_c": "44th Amendment",
        "option_d": "86th Amendment",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation: The 42nd Amendment is widely believed to have been enacted to overcome certain judicial interpretations of Fundamental Rights, particularly those related to the limits of Parliament's power to amend the Constitution.  The Kesavananda Bharati case (1973) established the \"basic structure\" doctrine, limiting Parliament's amending power. The 42nd Amendment, enacted in 1976, attempted to curtail this limitation, but was later partially overturned by the Supreme Court.\n\nThe 1st Amendment addressed concerns regarding the interpretation of fundamental rights, but it did not directly counter a significant judicial interpretation in the same way the 42nd Amendment did. The 44th and 86th Amendments dealt with other constitutional matters and are not directly linked to overcoming judicial interpretations of Fundamental Rights in the same way the 42nd Amendment was.\n\n\n**Short notes on named entities:**\n\n* **1st Amendment:**  This amendment, passed soon after the adoption of the Indian Constitution, primarily aimed to clarify and restrict the scope of certain fundamental rights to prevent their misuse and to address concerns raised by the judiciary regarding their interpretation.\n\n* **42nd Amendment:** This amendment, enacted during the Emergency, made significant changes to the Constitution, including adding the words \"socialist,\" \"secular,\" and \"integrity\" to the Preamble.  A key aspect was its attempt to remove limitations on Parliament's power to amend the Constitution, a direct response to the Kesavananda Bharati case's \"basic structure\" doctrine.\n\n* **44th Amendment:** This amendment largely reversed some of the more controversial aspects of the 42nd Amendment, restoring some checks and balances to the amendment process.\n\n\n* **86th Amendment:** This amendment dealt with the right to education and is not directly related to judicial interpretations of fundamental rights.\n\n* **Kesavananda Bharati case (1973):** This landmark Supreme Court case established the doctrine of \"basic structure\" of the Constitution, limiting the power of Parliament to amend the fundamental aspects of the Constitution.  It declared that Parliament cannot alter the core features of the Constitution, even through amendments.\n\n* **Golak Nath case (1967):**  This Supreme Court case initially held that Parliament could not amend fundamental rights.  However, this decision was later overturned by the Kesavananda Bharati case.\n\n* **Shankar Prasad case (1951):** This Supreme Court case initially upheld Parliament's power to amend fundamental rights, but its interpretation was later challenged and modified by subsequent cases.\n\n* **Indira Gandhi vs Raj Narain (1975):** This case also related to the 42nd Amendment and its impact on the judiciary. It is important to note that the 42nd Amendment was largely a response to judicial pronouncements limiting the scope of amendments.\n\n* **Art. 13:** This article deals with judicial review, empowering courts to invalidate laws that violate fundamental rights.\n\n* **Art. 31A:** This article restricts the scope of fundamental rights relating to property.\n\n* **Art. 368:** This article deals with the procedure for amending the Constitution.\n"
    },
    {
        "q_num": 35,
        "question_text": "Consider the following organizations/bodies in India:\n1. The National Commission for Backward Classes\n2. The National Human Rights Commission\n3. The National Law Commission\n4. The National Consumer Disputes Redressal Commission\nHow many of the above are constitutional bodies?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "a",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation: Only the National Commission for Backward Classes is a constitutional body, established under Article 338B of the Constitution.  The National Human Rights Commission, the National Law Commission, and the National Consumer Disputes Redressal Commission are statutory bodies created by Parliament through respective Acts.\n\nShort notes on named entities:\n\n* **National Commission for Backward Classes (NCBC):** A constitutional body established to investigate and monitor matters relating to socially and educationally backward classes.  Its mandate includes inquiring into complaints of deprivation of rights and safeguards.\n\n* **National Human Rights Commission (NHRC):** A statutory body established to protect human rights.  It investigates complaints of human rights violations and makes recommendations to the government.\n\n* **National Law Commission:** A statutory body that reviews and recommends changes to laws.  It provides expert advice on legal matters to the government.\n\n* **National Consumer Disputes Redressal Commission (NCDRC):** A statutory body that addresses consumer grievances and provides redressal for consumer disputes.  It functions as the apex consumer court in the country.\n"
    },
    {
        "q_num": 36,
        "question_text": "Consider the following statements:\n1. If the election of the President of India is declared void by the Supreme Court of India, all acts done by him/her in the performance of duties of his/her office of President before the date of decision become invalid.\n2. Election for the post of the President of India can be postponed on the ground that some Legislative Assemblies have been dissolved and elections are yet to take place.\n3. When a Bill is presented to the President of India, the Constitution prescribes time limits within which he/she has to declare his/her assent.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1 is incorrect.  If the Supreme Court declares the election of the President void, acts performed before the decision remain valid.  The President's actions are not retroactively invalidated.\n\nStatement 2 is incorrect. The Constitution doesn't provide for postponement of Presidential elections due to dissolved Assemblies.  Elections proceed even if some Assemblies are dissolved.\n\nStatement 3 is incorrect. The Constitution doesn't specify a time limit for the President to assent to a bill.  While there's an expectation of timely action, there's no legally mandated timeframe.\n\n\nTherefore, only one statement is incorrect, making (a) the correct option.\n\n\n**Short Notes:**\n\n* **President of India:** The head of state of India, elected indirectly by an electoral college.  The President's powers are largely ceremonial, with real executive power vested in the Council of Ministers headed by the Prime Minister.  The President's role is significant in times of national emergency.\n\n* **Supreme Court of India:** The highest court of appeal in India, responsible for interpreting the Constitution and ensuring its enforcement.  Its decisions are binding on all other courts in the country.\n\n* **Legislative Assemblies:** The state-level legislatures in India, responsible for making laws for their respective states.  These assemblies are elected by the people of the state.\n\n* **Bill:** A proposed law that needs to be passed by both houses of Parliament (and in some cases, state legislatures) and receive the President's assent to become law.\n\n* **Council of Ministers:** The body of ministers who advise the President and are collectively responsible to the Parliament.  In practice, the Council of Ministers, headed by the Prime Minister, exercises the executive power of the government.\n\n\n"
    },
    {
        "q_num": 37,
        "question_text": "With reference to Finance Bill and Money Bill in the Indian Parliament, consider the following statements:\n1. When the Lok Sabha transmits Finance Bill to the Rajya Sabha, it can amend or reject the Bill.\n2. When the Lok Sabha transmits Money Bill to the Rajya Sabha, it cannot amend or reject the Bill, it can only make recommendations.\n3. In the case of disagreement between the Lok Sabha and the Rajya Sabha, there is no joint sitting for Money Bill, but a joint sitting becomes necessary for Finance Bill.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  The Rajya Sabha cannot amend or reject a Finance Bill; it can only recommend amendments.  The Lok Sabha can accept or reject these recommendations.\n\nStatement 2 is correct.  The Rajya Sabha can only make recommendations on a Money Bill; it cannot amend or reject it. The Lok Sabha has the final say.\n\nStatement 3 is incorrect. There is no joint sitting for either a Money Bill or a Finance Bill in case of disagreement between the Lok Sabha and the Rajya Sabha.  A joint sitting is only applicable to certain other types of bills.\n\n\n**Short Notes:**\n\n**Finance Bill:** A bill dealing with the imposition, abolition, remission, alteration, or regulation of taxes.  It's an integral part of the annual budget.  It must be passed by both houses of Parliament, but the Rajya Sabha's power is limited to recommending amendments, not rejecting the bill.\n\n**Money Bill:** A bill that deals exclusively with matters specified in Article 110 of the Indian Constitution. These primarily concern taxation, borrowing of money, and expenditure from the Consolidated Fund of India.  Only the Lok Sabha can introduce a Money Bill, and the Rajya Sabha's powers are further restricted compared to a Finance Bill; it can only recommend amendments, which the Lok Sabha can accept or reject. The President's assent is necessary for a Money Bill to become law.\n\n\n**Lok Sabha:** The lower house of the Indian Parliament, representing the people directly elected. It holds more power than the Rajya Sabha, especially regarding Money Bills.\n\n**Rajya Sabha:** The upper house of the Indian Parliament, representing the states. It has limited power concerning financial bills compared to the Lok Sabha.\n\n\n"
    },
    {
        "q_num": 38,
        "question_text": "Consider the following statements:Once the Central Government notifies an area as a 'Community Reserve'\n1. the Chief Wildlife Warden of the State becomes the governing authority of such forest\n2. hunting is not allowed in such area\n3. people of such area are allowed to collect non-timber forest produce\n4. people of such area are allowed traditional agricultural practices\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation:All four statements are correct regarding Community Reserves in India.  Once an area is notified as a Community Reserve by the Central Government:\n\n1. The Chief Wildlife Warden of the State becomes the governing authority.  This ensures local management and oversight.\n\n2. Hunting is prohibited. This protects wildlife within the reserve.\n\n3. People are allowed to collect non-timber forest produce (NTFP). This allows for sustainable use of resources by local communities, supporting their livelihoods.\n\n4. Traditional agricultural practices are permitted. This acknowledges the historical relationship between communities and the land, promoting sustainable coexistence.\n\nChief Wildlife Warden: The head of the wildlife department in a state, responsible for the management and conservation of wildlife and forests.\n\nCommunity Reserve: A protected area involving local communities in conservation efforts, allowing for sustainable use of resources while protecting wildlife.  It's a participatory approach to conservation.  This differs from a National Park, Sanctuary, or other protected areas with stricter regulations.\n\nNon-timber forest produce (NTFP):  Products from forests other than timber, such as fruits, nuts, medicinal plants, resins, etc., which are often harvested sustainably by local communities.  These products play a vital role in the local economy and culture.\n\nTraditional agricultural practices: Farming methods passed down through generations, often adapted to local environments and resources.  These practices are usually environmentally sustainable and respect biodiversity.\n"
    },
    {
        "q_num": 39,
        "question_text": "With reference to 'Scheduled Areas' in India, consider the following statements:\n1. Within a State, the notification of an area as Scheduled Area takes place through an Order of the President.\n2. The largest administrative unit forming the Scheduled Area is the District and the lowest is the cluster of villages in the Block.\n3. The Chief Ministers of the concerned States are required to submit annual reports to the Union Home Ministry on the administration of Scheduled Areas in the States.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Statement 1 is incorrect.  The notification of a Scheduled Area within a state is done by a Presidential Order under Article 244(1) of the Constitution of India.\n\nStatement 2 is incorrect. While the district can be the largest administrative unit, it's not always the case. The lowest unit is not always a cluster of villages in a block; it varies depending on the specific state and its administrative structure.\n\nStatement 3 is incorrect.  There is no such mandatory requirement for Chief Ministers to submit annual reports to the Union Home Ministry on Scheduled Areas administration.  Monitoring mechanisms exist, but they don't mandate this specific annual report format.\n\nTherefore, only one statement is incorrect making option (a) the correct answer.\n\n\nScheduled Areas:  Areas declared as Scheduled Areas under Article 244(1) of the Indian Constitution, primarily inhabited by tribal communities, granting them special protections and administrative arrangements.\n\nPresident of India: The head of state of the Republic of India, with powers to issue ordinances, assent to bills, etc.  In the context, the President plays a key role in notifying Scheduled Areas.\n\nUnion Home Ministry: The central government ministry responsible for internal security, border management, and administration of the states.\n\nChief Ministers: The heads of the state governments in India, responsible for the administration of their respective states.\n\nArticle 244(1): A constitutional provision that deals with the administration of Scheduled Areas and Scheduled Tribes.\n\nArticle 371:  A set of articles (371, 371A, 371B, etc.) that provide special provisions for certain states, often related to administrative arrangements, languages, or other issues specific to those states.  These articles address the unique characteristics and needs of various states.\n\nPESA Act 1996 (Panchayats (Extension to Scheduled Areas) Act): An act that grants greater autonomy and powers to local self-governing bodies in Scheduled Areas, empowering tribal communities in their own governance.\n\nSixth Schedule: A provision in the Indian Constitution that deals with the administration of tribal areas in certain states in Northeast India, providing a unique administrative structure for these regions.  It aims to protect and safeguard the customs and traditions of the tribal communities.\n\n\n"
    },
    {
        "q_num": 40,
        "question_text": "Consider the following statements:\nStatement-I  : The Supreme Court of India has held in some judgements that the reservation policies made under Article 16(4) of the Constitution of India would be limited by Article 335 for maintenance of efficiency of administration.\nStatement-II : Article 335 of the Constitution of India defines the term 'efficiency of administration'.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Statement I is correct because the Supreme Court has indeed interpreted Article 16(4) (reservation in matters of employment) in light of Article 335 (maintenance of efficiency of administration), holding that reservations cannot compromise administrative efficiency to an unacceptable degree.  Statement II is incorrect because Article 335 doesn't define \"efficiency of administration\"; it only mentions the need to maintain it while making reservations.  The definition is left to judicial interpretation.\n\n**Short notes on named entities:**\n\n* **Article 16(4) of the Constitution of India:** This article allows for the reservation of appointments or posts in favor of any backward class of citizens which, in the opinion of the State, is not adequately represented in the services under the State.\n\n* **Article 335 of the Constitution of India:** This article directs that the claims of the members of the Scheduled Castes and the Scheduled Tribes shall be taken into consideration, consistently with the maintenance of efficiency of administration, in the making of appointments to services and posts in connection with the affairs of the Union or of a State.\n\n* **Supreme Court of India:** The highest court of appeal in India, responsible for interpreting the Constitution and ensuring its enforcement.  Its judgements are binding on all lower courts.\n"
    },
    {
        "q_num": 41,
        "question_text": "In which one of the following regions was Dhanyakataka, which flourished as a prominent Buddhist centre under the Mahasanghikas, located?",
        "option_a": "Andhra",
        "option_b": "Gandhara",
        "option_c": "Kalinga",
        "option_d": "Magadha",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation: Dhanyakataka was a prominent Buddhist center located in Andhra.  The Mahasanghikas were a significant Buddhist school.\n\nAndhra: A historical region in south-central India, known for its ancient kingdoms and its role in the spread of Buddhism.\n\nGandhara: A historical region encompassing parts of modern-day Afghanistan and Pakistan, also an important center of Buddhism, particularly known for Gandhara art.\n\nKalinga: An ancient kingdom located in present-day Odisha, India.  It had its own distinct culture and history.\n\nMagadha: An ancient kingdom in eastern India, a powerful state known for its role in the rise of Buddhism and the Mauryan Empire.  It was strategically located, fertile, and possessed advanced military capabilities including the early use of elephants in warfare.  Important cities include Rajgir and Pataliputra.\n"
    },
    {
        "q_num": 42,
        "question_text": "With reference to ancient India, consider the following statements:\n1. The concept of Stupa is Buddhist in origin.\n2. Stupa was generally a repository of relics.\n3. Stupa was a votive and commemorative structure in Buddhist tradition.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:All three statements are correct.  Stupas, originating in ancient India, are fundamentally associated with Buddhism. They primarily served as repositories for relics of important Buddhist figures, acting as both votive offerings and commemorative structures within the Buddhist tradition.\n"
    },
    {
        "q_num": 43,
        "question_text": "With reference to ancient South India, Korkai, Poompuhar and Muchiri were well known as",
        "option_a": "capital cities",
        "option_b": "ports",
        "option_c": "centres of iron-and-steel making",
        "option_d": "shrines of Jain Tirthankaras",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation: Korkai, Poompuhar, and Muchiri were prominent port cities in ancient South India.  The provided text does not offer detailed information on these specific locations, but it does discuss the importance of coastal areas in trade and the detailed mapping of coastal regions in contrast to inland areas.  Option (a) is incorrect because while some of these might have been capitals at certain points, they were primarily known for their port activity. Options (c) and (d) are not supported by the text.\n\nKorkai: A significant port city in ancient Tamil Nadu, known for its trade connections with Rome and other regions.\n\nPoompuhar: An ancient port city in Tamil Nadu, famed for its trade in pearls and other valuable goods.  Its location on the coast facilitated extensive maritime trade.\n\nMuchiri: Another important port in ancient South India, involved in extensive maritime trade networks.  Its exact location is still debated by historians.\n"
    },
    {
        "q_num": 44,
        "question_text": "Which one of the following explains the practice of ‘Vattakirutal’ as mentioned in Sangam poems?",
        "option_a": "Kings employing women bodyguards",
        "option_b": "Learned persons assembling in royal courts to discuss religious and philosophical matters",
        "option_c": "Young girls keeping watch over agricultural fields and driving away birds and animals",
        "option_d": "A king defeated in a battle committing ritual suicide by starving himself to death",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: Vattakirutal, as described in Sangam poems, refers to young girls guarding agricultural fields and scaring away birds and animals.  The Sangam literature, a collection of Tamil poems from the Sangam age (roughly 300 BC – 300 AD), offers insights into various aspects of ancient Tamil society, including agricultural practices.  The other options are not supported by the provided text or common understanding of Sangam literature.  While kings might have had bodyguards, there's no specific mention of women bodyguards being part of \"Vattakirutal\".  Discussions in royal courts were common but not directly related to this term.  Ritual suicide by starvation after defeat is also not connected to \"Vattakirutal\".\n\nSangam: A group or assembly of Tamil poets, likely under chiefly or royal patronage in Madurai.  Their works were compiled between 300-600 AD.\n\nSangam literature: A body of classical Tamil literature comprising poems and prose works that provide valuable information about ancient Tamil society, culture, and history.\n\nMadurai: An ancient city in Tamil Nadu, India, historically significant as a center of Tamil culture and learning.  It was a major city during the Sangam period.\n\nVattakirutal: A practice described in Sangam poems, referring to young girls protecting agricultural fields from animals and birds.\n"
    },
    {
        "q_num": 45,
        "question_text": "Consider the following dynasties:\n1. Hoysala\n2. Gahadavala\n3. Kakatiya\n4. Yadava\nHow many of the above dynasties established their kingdoms in early eighth century AD?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "None",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation: None of the listed dynasties—Hoysala, Gahadavala, Kakatiya, and Yadava—established their kingdoms in the early eighth century AD.  The provided text does not contain information about the exact founding dates of these dynasties, but it mentions other dynasties and empires active around that time (Pala, Pratihara, Rashtrakuta), indicating that the early 8th century was a period of multiple powerful empires in India.\n\nHoysala: The Hoysala dynasty was a prominent power in South India, known for its temple architecture. Their rise to power began later than the early 8th century.\n\nGahadavala: The Gahadavala dynasty ruled parts of present-day Uttar Pradesh in North India.  Their rule likely started after the early 8th century.\n\nKakatiya: The Kakatiya dynasty was a powerful dynasty in the Deccan region of South India, known for their administration and irrigation systems.  Their rise to prominence occurred after the early 8th century.\n\nYadava: The Yadava dynasty ruled in the Deccan region of South India.  Their rise to power was later than the early 8th century.\n"
    },
    {
        "q_num": 46,
        "question_text": "With reference to ancient Indian History, consider the following pairs:\n   Literary work                Author\n1. Devichandragupta        :    Bilhana\n2. Hammira-Mahakavya       :    Nayachandra Suri\n3. Milinda-panha           :    Nagarjuna\n4. Nitivakyamrita          :    Somadeva Suri\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "* **correct_option:** (b)\n* **explanation:** Only two pairs are correctly matched.\n\n    * **Devichandragupta:** This work was authored by Bilhana.  Bilhana was a Kashmiri poet who served in the court of Vikramaditya VI of the Chalukya dynasty.  His work is a significant source for information about the Chalukya period.\n\n    * **Hammira-Mahakavya:**  This Kavya (epic poem) was written by Nayachandra Suri.  It is a significant source of information about the reign of Hammira Deva, a ruler of Ranthambhor. Nayachandra Suri was a Jain writer.\n\n    * **Milinda-panha:**  This work is not authored by Nagarjuna.  Nagarjuna was a prominent Mahayana Buddhist philosopher and alchemist.  The Milinda-panha (Questions of Milinda) is a dialogue between the Greek King Menander (Milinda) and the Buddhist monk Nagasena.\n\n    * **Nitivakyamrita:** This work was not authored by Somadeva Suri. Somadeva Suri is known for his authorship of the Kathasaritsagara.  The Nitivakyamrita is a collection of moral aphorisms.  The author's identity is debated.\n"
    },
    {
        "q_num": 47,
        "question_text": "“Souls are not only the property of animal and plant life, but also of rocks, running water and many other natural objects not looked on as living by other religious sects.”\nThe above statement reflects one of the core beliefs of which one of the following religious sects of ancient India?",
        "option_a": "Buddhism",
        "option_b": "Jainism",
        "option_c": "Shaivism",
        "option_d": "Vaishnavism",
        "correct_option": "b",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation:The statement reflects a core belief of Jainism.  Jainism believes in the concept of *jiva*, or soul, which is not limited to animals and plants but extends to all forms of existence, including inanimate objects like rocks and water.  This concept of ubiquitous souls is central to Jain philosophy and its emphasis on non-violence (ahimsa) towards all beings.\n\nBuddhism focuses on the cycle of birth, death, and rebirth, with emphasis on achieving enlightenment to escape this cycle.  Shaivism and Vaishnavism are branches of Hinduism, focusing on the worship of Shiva and Vishnu respectively, and do not typically ascribe souls to inanimate objects in the same way Jainism does.\n"
    },
    {
        "q_num": 48,
        "question_text": "Who among the following rulers of Vijayanagara Empire constructed a large dam across Tungabhadra River and a canal-cum-aqueduct several kilometres long from the river to the capital city?",
        "option_a": "Devaraya I",
        "option_b": "Mallikarjuna",
        "option_c": "Vira Vijaya",
        "option_d": "Virupaksha",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation:The provided text does not explicitly state which Vijayanagara ruler constructed the dam and canal.  However, based on the available information, it is likely Devaraya I. While the text mentions several rulers, it doesn't directly link dam construction to any specific individual.  More information is needed to definitively answer the question.\n\n\nDevaraya I: A ruler of the Vijayanagara Empire.  Further details about his reign and accomplishments are needed to confirm his involvement in the construction project.\n\nMallikarjuna: Another ruler of the Vijayanagara Empire.  The text offers no information about his involvement in water infrastructure projects.\n\nVira Vijaya:  A ruler of the Vijayanagara Empire, with no mention of dam or canal construction in the given text.\n\nVirupaksha: Yet another ruler of the Vijayanagara Empire. The provided text does not connect him to the construction of the described waterworks.\n\nTungabhadra River: A major river in southern India, forming a natural border between Karnataka and Andhra Pradesh.  Its waters have historically been crucial for irrigation and water supply.\n\nVijayanagara Empire: A powerful empire in South India, known for its impressive architecture, sophisticated administration, and economic prosperity.  Its rulers played a significant role in the development of water management systems.\n"
    },
    {
        "q_num": 49,
        "question_text": "Who among the following rulers of medieval Gujarat surrendered Diu to Portuguese?",
        "option_a": "Ahmad Shah",
        "option_b": "Mahmud Begarha",
        "option_c": "Bahadur Shah",
        "option_d": "Muhammad Shah",
        "correct_option": "c",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation: Bahadur Shah of Gujarat surrendered Diu to the Portuguese.\n\nAhmad Shah I (1411-1443): The real founder of the independent Sultanate of Gujarat, he shifted the capital from Patan to Ahmedabad and is known for his architectural contributions.  His reign saw the beginning of a unique Gujarati architectural style.\n\nMahmud Begada (1458-1511):  The most famous Sultan of Gujarat, his reign was marked by significant expansion and consolidation of power. He engaged in conflicts with neighboring kingdoms and even briefly allied with the Portuguese.\n\nBahadur Shah (1526-1537): The last independent Sultan of Gujarat, his reign saw the kingdom's eventual conquest by the Mughal Empire.  He is notable for surrendering Diu to the Portuguese.\n\nMuhammad Shah: While not directly mentioned in the provided context in relation to Diu, this name appears in other historical contexts associated with the Delhi Sultanate.  The provided text does not offer details about a ruler of Gujarat with this name related to the Portuguese.\n"
    },
    {
        "q_num": 50,
        "question_text": "By which one of the following Acts was the Governor General of Bengal designated as the Governor General of India?",
        "option_a": "The Regulating Act",
        "option_b": "The Pitt’s India Act",
        "option_c": "The Charter Act of 1793",
        "option_d": "The Charter Act of 1833",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2023,
        "explanation": "* **correct_option:** (d)\n* **explanation:** The Charter Act of 1833 designated the Governor-General of Bengal as the Governor-General of India.  This act marked a significant step towards centralizing the British administration in India.\n\nThe Regulating Act of 1773 established the office of the Governor-General of Bengal and an Executive Council, but it did not extend the Governor-General's authority beyond Bengal. Pitt's India Act of 1784 further reformed the East India Company's governance, creating a Board of Control to oversee the Company's political affairs, but it didn't change the Governor-General's territorial jurisdiction.  The Charter Act of 1793 made some adjustments to the Company's governance but didn't alter the Governor-General's title.\n\n\n**Short Notes:**\n\n* **Governor-General of Bengal:** The highest-ranking British official in Bengal Presidency before 1833.  He oversaw the administration and governance of the region.\n* **Governor-General of India:** The supreme head of the British administration in India from 1833 onwards, wielding authority over the entire subcontinent.\n* **The Regulating Act (1773):** The first major attempt by the British Parliament to regulate the East India Company's affairs in India, aiming for greater control and accountability.  It established a Supreme Court in Calcutta and introduced reforms in the Company's governance.\n* **Pitt's India Act (1784):**  Strengthened the British government's control over the East India Company by creating the Board of Control, aiming to separate commercial and political functions.\n* **Charter Act of 1793:** Renewed the East India Company's charter, making minor changes to its governance structure.\n* **Charter Act of 1833:** A landmark act that fundamentally reshaped the British administration in India. It abolished the Company's trading monopoly (except for tea and opium) and officially made the Governor-General of Bengal the Governor-General of India, signifying a move towards centralized control.  It also initiated reforms in the civil service.\n* **East India Company (EIC):** A powerful British trading company that gradually assumed political control over large parts of India.  Its actions played a major role in shaping India's colonial history.\n* **Lord Warren Hastings:** The first Governor-General of Bengal, appointed under the Regulating Act of 1773. His governorship was marked by significant administrative and political developments.\n* **Lord William Bentinck:**  Served as the Governor-General of India after the passage of the Charter Act of 1833. He is known for his social and administrative reforms.\n\n"
    },
    {
        "q_num": 51,
        "question_text": "Consider the following statements in relation to Janani Suraksha Yojana:\n1. It is a safe motherhood intervention of the State Health Departments.\n2. Its objective is to reduce maternal and neonatal mortality among poor pregnant women.\n3. It aims to promote institutional delivery among poor pregnant women.\n4. Its objective includes providing public health facilities to sick infants up to one year of age.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "c",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation: Statements 1, 2, and 3 accurately describe the Janani Suraksha Yojana (JSY).  JSY is a safe motherhood initiative implemented by state health departments to reduce maternal and neonatal mortality among poor pregnant women by promoting institutional deliveries. Statement 4 is incorrect; JSY's focus is primarily on pregnant women and their newborns, not providing public health facilities to sick infants up to one year of age.\n\n\nJanani Suraksha Yojana (JSY): A program aimed at reducing maternal and neonatal mortality rates among poor pregnant women in India by promoting institutional deliveries and providing financial assistance.\n\nMaternal mortality: The death of a woman during pregnancy, childbirth, or within six weeks after delivery.\n\nNeonatal mortality: The death of an infant within the first 28 days of life.\n\nInstitutional delivery: Childbirth that takes place in a healthcare facility, such as a hospital or birthing center.\n"
    },
    {
        "q_num": 52,
        "question_text": "Consider the following statements in the context of interventions being undertaken under Anaemia Mukt Bharat Strategy:\n1. It provides prophylactic calcium supplementation for pre-school children, adolescents and pregnant women.\n2. It runs a campaign for delayed cord clamping at the time of childbirth.\n3. It provides for periodic deworming to children and adolescents.\n4. It addresses non-nutritional causes of anaemia in endemic pockets with special focus on malaria, hemoglobinopathies and fluorosis.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "d",
        "subject": "modern_indian_history",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation:The Anaemia Mukt Bharat Strategy aims to reduce anaemia prevalence in India through various interventions. Let's examine the statements:\n\n1. **Prophylactic calcium supplementation:** While calcium is important for bone health and may play a role in iron absorption, the primary focus of tackling anaemia is iron deficiency.  Calcium supplementation alone isn't the core strategy for anaemia reduction.\n\n2. **Delayed cord clamping:** This practice allows for greater transfer of blood and iron from the mother to the newborn, reducing the risk of neonatal anaemia. This is a key component of the strategy.\n\n3. **Periodic deworming:** Intestinal parasites can contribute to anaemia by causing blood loss.  Deworming is a crucial part of preventing and treating anaemia.\n\n4. **Addressing non-nutritional causes:**  Malaria, hemoglobinopathies (like sickle cell anaemia), and fluorosis are all known causes of anaemia.  Addressing these specific causes in endemic areas is essential.\n\nTherefore, statements 2, 3, and 4 are correct.  Statement 1 is not entirely accurate in its emphasis.  Thus, the correct option is (c).\n\n\n**Short notes on named entities:**\n\n* **Anaemia Mukt Bharat Strategy:** A national health program in India aimed at reducing anaemia prevalence, primarily through iron and folic acid supplementation, improved nutrition, and addressing underlying health issues.\n\n* **Prophylactic:**  Relating to preventing disease; in this context, preventative measures to avoid anaemia.\n\n* **Hemoglobinopathies:** A group of inherited blood disorders that affect the structure or production of haemoglobin, the protein in red blood cells that carries oxygen.  Sickle cell anaemia is a common example.\n\n* **Fluorosis:** A condition caused by excessive fluoride intake, leading to skeletal and dental problems, and potentially affecting iron absorption and causing anaemia.\n\n* **Malaria:** A mosquito-borne infectious disease caused by a parasite that infects red blood cells, resulting in anaemia.\n\n* **Pre-school children, adolescents, pregnant women:** These groups are particularly vulnerable to anaemia due to rapid growth, increased iron demands (pregnancy), and poor dietary intake.\n\n\n"
    },
    {
        "q_num": 53,
        "question_text": "Consider the following statements:\n1. Carbon fibres are used in the manufacture of components used in automobiles and aircrafts.\n2. Carbon fibres once used cannot be recycled.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. Carbon fibers are strong, lightweight materials used in various applications, including automotive and aircraft components.  Statement 2 is incorrect. While recycling carbon fiber is challenging due to the complex composite structures, research and development are ongoing to find effective and economically viable methods for recycling carbon fiber-reinforced polymers (CFRPs).  Therefore, it's inaccurate to state that carbon fibers *cannot* be recycled.\n"
    },
    {
        "q_num": 54,
        "question_text": "Consider the following actions:\n1. Detection of car crash/collision which results in the deployment of airbags almost instantaneously\n2. Detection of accidental free fall of a laptop towards the ground which results in the immediate turning off of the hard drive\n3. Detection of the tilt of the smartphone which results in the rotation of display between portrait and landscape mode\nIn how many of the above actions is the function of accelerometer required?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: An accelerometer measures acceleration, including the acceleration due to gravity.  \n\n1. **Car crash detection:**  A sudden, sharp deceleration is detected by the accelerometer, triggering airbag deployment.\n\n2. **Laptop free fall detection:** The accelerometer detects a sudden increase in downward acceleration, indicating a fall, and triggers the hard drive shutdown.\n\n3. **Smartphone tilt detection:** The accelerometer senses changes in the orientation of the phone due to tilting, enabling the rotation of the display.\n\nTherefore, an accelerometer is required for all three actions.  Airbags are safety devices that inflate rapidly to protect vehicle occupants during a collision. A hard drive is a data storage device in a computer.  A smartphone is a mobile phone with advanced computing capabilities.\n"
    },
    {
        "q_num": 55,
        "question_text": "With reference to the role of biofilters in Recirculating Aquaculture System, consider the following statements:\n1. Biofilters provide waste treatment by removing uneaten fish feed.\n2. Biofilters convert ammonia present in fish waste to nitrate.\n3. Biofilters increase phosphorus as nutrient for fish in water.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation: Biofilters in Recirculating Aquaculture Systems (RAS) are crucial for waste treatment.  Statement 1 is incorrect because while biofilters indirectly help manage uneaten feed by processing the resulting ammonia, they don't directly remove the feed itself.  Statement 2 is correct; nitrifying bacteria within the biofilter convert toxic ammonia (NH3) into less harmful nitrite (NO2-) and then nitrate (NO3-). Statement 3 is incorrect; biofilters don't increase phosphorus; they help remove it, although some phosphorus might be incorporated into the biomass of the filter media. Therefore, only statement 2 is correct.\n\nRecirculating Aquaculture System (RAS): A closed-loop aquaculture system that recirculates water, minimizing water usage and waste discharge.  Biofilters are essential components of RAS.\n\nBiofilter: A biological filter that uses beneficial microorganisms (bacteria) to break down harmful waste products (e.g., ammonia) in aquaculture systems.  Different types of biofilters exist, each with varying media and designs to optimize microbial growth and efficiency.\n\nAmmonia (NH3): A highly toxic waste product of fish metabolism.  It needs to be efficiently removed or converted to less harmful forms in aquaculture systems.\n\nNitrate (NO3-): A less toxic form of nitrogen, a byproduct of ammonia oxidation within a biofilter. While still a nutrient, it's significantly less harmful to fish than ammonia.  High nitrate levels can still be problematic in aquaculture systems, requiring periodic water changes or other management strategies.\n"
    },
    {
        "q_num": 56,
        "question_text": "Consider the following pairs:\n   Objects in space             Description\n1. Cepheids              :      Giant clouds of dust and gas in space\n2. Nebulae               :      Stars which brighten and dim periodically\n3. Pulsars               :      Neutron stars that are formed when massive stars run out of fuel and collapse\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Only the pair \"Cepheids : Stars which brighten and dim periodically\" is correctly matched.  Cepheids are a type of variable star whose brightness fluctuates regularly. Nebulae are giant clouds of gas and dust, and pulsars are rapidly rotating neutron stars. Therefore, only one pair is correctly matched.\n\nCepheids:  These are giant stars that pulsate, causing their brightness to vary periodically. This periodic variation is crucial in astronomy for determining distances to other galaxies.\n\nNebulae:  These are immense clouds in space, primarily composed of dust, hydrogen, helium, and other ionized gases.  They are often the birthplaces of stars.  There are different types of nebulae, including emission, reflection, and dark nebulae.\n\nPulsars:  These are highly magnetized, rotating neutron stars that emit beams of electromagnetic radiation.  They are formed after the core-collapse supernova of a massive star.  The rapid rotation and strong magnetic field are responsible for their characteristic pulsed emission.\n"
    },
    {
        "q_num": 57,
        "question_text": "Which one of the following countries has its own Satellite Navigation System?",
        "option_a": "Australia",
        "option_b": "Canada",
        "option_c": "Israel",
        "option_d": "Japan",
        "correct_option": "d",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation: Japan has its own satellite navigation system called the Quasi-Zenith Satellite System (QZSS).  Australia, Canada, and Israel do not currently have their own independent global navigation satellite systems.  Japan is an island nation in East Asia known for its technological advancements.  The QZSS enhances the accuracy and reliability of GPS signals in Japan and surrounding areas.\n"
    },
    {
        "q_num": 58,
        "question_text": "Consider the following statements:\n1. Ballistic missiles are jet-propelled at subsonic speeds throughout their flights, while cruise missiles are rocket-powered only in the initial phase of flight.\n2. Agni-V is a medium-range supersonic cruise missile, while BrahMos is a solid-fuelled intercontinental ballistic missile.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "d",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (d)\n\nexplanation:Statement 1 is incorrect. Ballistic missiles are rocket-powered, not jet-propelled.  They may reach supersonic or even hypersonic speeds, but are not subsonic throughout their flight. Cruise missiles use jet engines for sustained flight at subsonic or supersonic speeds after an initial rocket boost.\n\nStatement 2 is also incorrect. Agni-V is a long-range ballistic missile, not a medium-range cruise missile. BrahMos is a supersonic cruise missile, not an intercontinental ballistic missile.  It uses a two-stage solid-fuel propulsion system.\n\nAgni-V:  A long-range ballistic missile developed by India.  Its long range and advanced capabilities make it a significant component of India's nuclear deterrent strategy.\n\nBrahMos: A supersonic cruise missile jointly developed by India and Russia. Its speed and precision make it a potent weapon system.  It's known for its relatively short flight time, making it difficult to intercept.\n"
    },
    {
        "q_num": 59,
        "question_text": "Consider the following statements regarding mercury pollution:\n1. Gold mining activity is a source of mercury pollution in the world.\n2. Coal-based thermal power plants cause mercury pollution.\n3. There is no known safe level of exposure to mercury.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: All three statements are correct.  Gold mining often involves the use of mercury to separate gold from other materials, releasing mercury into the environment. Coal combustion releases mercury into the atmosphere.  And scientific consensus indicates there is no safe level of mercury exposure, as it is a potent neurotoxin that accumulates in the body.\n"
    },
    {
        "q_num": 60,
        "question_text": "With reference to green hydrogen, consider the following statements:\n1. It can be used directly as a fuel for internal combustion.\n2. It can be blended with natural gas and used as fuel for heat or power generation.\n3. It can be used in the hydrogen fuel cell to run vehicles.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation: Green hydrogen, produced using renewable energy sources, has several applications.  Statement 1 is incorrect because green hydrogen, unlike fossil fuels, does not combust in an internal combustion engine in the same way. Statement 2 is correct; green hydrogen can be blended with natural gas for use in power generation or heating systems.  Statement 3 is also correct as green hydrogen is a key fuel source for hydrogen fuel cells used to power vehicles.  Therefore, two out of the three statements are correct.\n\nGreen hydrogen:  Hydrogen produced from renewable sources like solar or wind power through electrolysis (splitting water into hydrogen and oxygen).  It's considered a clean energy source as its production doesn't release greenhouse gases.\n\nHydrogen fuel cell: An electrochemical device that converts the chemical energy of hydrogen into electricity directly, producing only water vapor as a byproduct.  More efficient than internal combustion engines.\n\nNatural gas: A naturally occurring fossil fuel, primarily composed of methane, used for heating and power generation.  Blending with green hydrogen can reduce its carbon footprint.\n\nInternal combustion engine: An engine that burns fuel (gasoline, diesel etc.) to generate power.  Green hydrogen is not directly compatible with this type of engine in the same way as traditional fuels.\n"
    },
    {
        "q_num": 61,
        "question_text": "Consider the following countries:\n1. Bulgaria\n2. Czech Republic\n3. Hungary\n4. Latvia\n5. Lithuania\n6. Romania\nHow many of the above-mentioned countries share a land border with Ukraine?",
        "option_a": "Only two",
        "option_b": "Only three",
        "option_c": "Only four",
        "option_d": "Only five",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation:  Bulgaria, Hungary, Romania, and Latvia share a land border with Ukraine.  Therefore, four of the mentioned countries share a land border with Ukraine.\n\nBulgaria: A country in Southeastern Europe, bordering Romania, Serbia, North Macedonia, Greece, Turkey, and Ukraine.  Known for its Black Sea coastline and rich history.\n\nCzech Republic: A landlocked country in Central Europe, bordering Germany, Austria, Slovakia, and Poland.  It is known for its rich history, Prague Castle, and its beer.\n\nHungary: A landlocked country in Central Europe, bordering Slovakia, Austria, Slovenia, Croatia, Serbia, Romania, and Ukraine.  Known for its thermal baths and history.\n\nLatvia: A Baltic country in Northern Europe, bordering Lithuania, Estonia, Russia, Belarus, and Ukraine.  It is known for its beautiful beaches and its historical cities.\n\nLithuania: A Baltic country in Northern Europe, bordering Latvia, Poland, Belarus, Russia, and Kaliningrad Oblast (Russia).  Known for its medieval architecture and its natural beauty.\n\nRomania: A country in Southeastern Europe, bordering Bulgaria, Serbia, Hungary, Ukraine, Moldova, and the Black Sea. Known for its diverse landscapes and its history.\n\nUkraine: A large country in Eastern Europe, bordering Russia, Belarus, Poland, Slovakia, Hungary, Romania, Moldova, and the Black Sea.  Currently embroiled in a major war with Russia.\n"
    },
    {
        "q_num": 62,
        "question_text": "With reference to the Earth's atmosphere, which one of the following statements is correct?",
        "option_a": "The total amount of insolation received at the equator is roughly about 10 times of that received at the poles.",
        "option_b": "Infrared rays constitute roughly two-thirds of insolation.",
        "option_c": "Infrared waves are largely absorbed by water vapour that is concentrated in the lower atmosphere.",
        "option_d": "Infrared waves are a part of visible spectrum of electromagnetic waves of solar radiation.",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "* **correct_option:** (c)\n* **explanation:** Infrared radiation is a portion of the electromagnetic spectrum with wavelengths longer than visible light.  Water vapor, a significant component of the lower atmosphere, effectively absorbs infrared radiation. This absorption contributes to the greenhouse effect, warming the Earth's surface. Option (a) is incorrect because the amount of insolation received at the equator is significantly higher than at the poles, but not by a factor of 10. Option (b) is incorrect as visible light constitutes the largest portion of insolation. Option (d) is incorrect because infrared waves are not part of the visible spectrum; they are a type of electromagnetic radiation with longer wavelengths.\n\nInsolation:  The amount of solar radiation received by the Earth's surface.  It varies with latitude, time of year, and atmospheric conditions.\n\nInfrared rays: A type of electromagnetic radiation with longer wavelengths than visible light.  They are a significant component of Earth's heat balance, being emitted by the Earth's surface and absorbed by greenhouse gases.\n\nWater vapor:  A gaseous phase of water, a major component of the Earth's atmosphere. Its concentration varies with location and altitude, playing a crucial role in weather patterns and the greenhouse effect.\n"
    },
    {
        "q_num": 63,
        "question_text": "Consider the following statements:\nStatement-I  : The soil in tropical rain forests is rich in nutrients.\nStatement-II : The high temperature and moisture of tropical rain forests cause dead organic matter in the soil to decompose quickly.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "d",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (d)\nexplanation:Statement-I is incorrect. The soil in tropical rainforests is generally not rich in nutrients.  While there is a high rate of decomposition due to high temperature and humidity (Statement-II is correct), the nutrients are quickly absorbed by the dense vegetation and are not stored in the soil.  The rapid decomposition and nutrient uptake leave the soil relatively nutrient-poor.  Therefore, Statement-II is not the correct explanation for Statement-I.\n\nTropical rain forests: These forests are characterized by high temperatures, humidity, and rainfall exceeding 200 cm annually.  The dense vegetation quickly absorbs nutrients, resulting in nutrient-poor soil despite rapid decomposition of organic matter.  A high diversity of plant and animal life is a defining feature.\n\nEcological Succession: This is the process of change in the species composition of an ecological community over time. It can be primary (starting from bare rock) or secondary (starting from existing soil).  It involves changes in productivity, nutrient cycling, and species diversity, culminating in a relatively stable climax community.\n\nBiogeochemical cycles: These are the cyclical pathways of chemical elements through living organisms (bio) and the physical environment (geo).  Important cycles include carbon, nitrogen, phosphorus, and water cycles.  These cycles are vital for ecosystem functioning and nutrient availability.\n"
    },
    {
        "q_num": 64,
        "question_text": "Consider the following statements:\nStatement-I  : The temperature contrast between continents and oceans is greater during summer than in winter.\nStatement-II : The specific heat of water is more than that of land surface.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Statement-I is correct.  The temperature contrast between continents and oceans is indeed greater during summer than in winter. This is because land heats up and cools down faster than water.  Statement-II is also correct. Water has a higher specific heat capacity than land.  This means that water requires more energy to raise its temperature by a given amount than land does.  Statement-II is the correct explanation for Statement-I because the higher specific heat of water leads to the smaller temperature fluctuations observed over oceans compared to land, resulting in a greater temperature contrast between land and sea during summer (when land heats up more quickly) than during winter (when land cools down more quickly).\n"
    },
    {
        "q_num": 65,
        "question_text": "Consider the following statements:\n1. In a seismograph, P waves are recorded earlier than S waves.\n2. In P waves, the individual particles vibrate to and fro in the direction of wave propagation whereas in S waves, the particles vibrate up and down at right angles to the direction of wave propagation.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is correct. P-waves (primary waves) are longitudinal waves, meaning the particle motion is parallel to the direction of wave propagation.  They travel faster than S-waves in all media.  Therefore, they are recorded first on a seismograph. S-waves (secondary waves) are transverse waves, meaning the particle motion is perpendicular to the direction of wave propagation. They travel slower than P-waves.\n\nStatement 2 is incorrect. In P-waves, particles vibrate parallel (to and fro) to the wave's direction, not perpendicular. In S-waves, particles vibrate perpendicular (up and down or side to side) to the wave's direction.\n\nSeismograph: An instrument used to detect and record seismic waves (vibrations) caused by earthquakes or other sources.\n\nP-waves (Primary waves):  Longitudinal seismic waves that travel faster than S-waves. The particle motion is parallel to the wave propagation direction.\n\nS-waves (Secondary waves): Transverse seismic waves that travel slower than P-waves.  The particle motion is perpendicular to the wave propagation direction.\n"
    },
    {
        "q_num": 66,
        "question_text": "With reference to coal-based thermal power plants in India, consider the following statements:\n1. None of them uses seawater.\n2. None of them is set up in water-stressed district.\n3. None of them is privately owned.How many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Statements 2 and 3 are incorrect.  Many coal-based thermal power plants in India are located in water-stressed districts, and a significant number are privately owned.  Therefore, only statement 1 could potentially be correct (depending on the specific definition of \"uses seawater\"—some plants might use minimal amounts for cooling purposes, but not in the way that would be typical of a seawater-based plant). However, given the other two statements are demonstrably false, only one statement can be considered correct.  Therefore, the correct option is (a).\n"
    },
    {
        "q_num": 67,
        "question_text": "‘Wolbachia method’ is sometimes talked about with reference to which one of the following?",
        "option_a": "Controlling the viral diseases spread by mosquitoes",
        "option_b": "Converting crop residues into packing material",
        "option_c": "Producing biodegradable plastics",
        "option_d": "Producing biochar from thermochemical conversion of biomass",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: The Wolbachia method is a technique used to control the spread of viral diseases transmitted by mosquitoes, specifically those causing diseases like dengue fever, Zika virus, and chikungunya.  It involves introducing *Wolbachia* bacteria into mosquito populations.  *Wolbachia* is a naturally occurring bacterium that infects many insect species and can interfere with the ability of viruses to replicate within the mosquito, thus reducing their transmission.\n\nThe other options are unrelated to the Wolbachia method:\n\n(b) Converting crop residues into packing material: This involves using agricultural waste to create packaging, a process unrelated to disease control.\n\n(c) Producing biodegradable plastics:  This refers to creating plastics that decompose naturally, a different field of biotechnology.\n\n(d) Producing biochar from thermochemical conversion of biomass: Biochar is a charcoal-like material produced from biomass pyrolysis, used for soil amendment and carbon sequestration, not disease control.\n"
    },
    {
        "q_num": 68,
        "question_text": "Consider the following activities:\n1. Spreading finely ground basalt rock on farmlands extensively\n2. Increasing the alkalinity of oceans by adding lime\n3. Capturing carbon dioxide released by various industries and pumping it into abandoned subterranean mines in the form of carbonated waters\nHow many of the above activities are often considered and discussed for carbon capture and sequestration?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation: Activities 1 and 3 are discussed for carbon capture and sequestration.\n\nSpreading finely ground basalt rock on farmlands enhances weathering, which consumes atmospheric CO2 and stores it as carbonate minerals in the soil.  This is a form of enhanced weathering, a carbon removal strategy.\n\nCapturing carbon dioxide from industrial sources and storing it in abandoned subterranean mines (often as carbonated water) is a common carbon capture and storage (CCS) method.  Various geological formations are explored for safe and permanent CO2 storage.  \n\nIncreasing the alkalinity of oceans by adding lime is not typically considered a mainstream method for carbon capture and sequestration.  While ocean alkalinity enhancement (OAE) has been proposed as a way to increase the ocean's capacity to absorb CO2, it is a less developed and more controversial approach compared to enhanced weathering or CCS.\n"
    },
    {
        "q_num": 69,
        "question_text": "'Aerial metagenomics' best refers to which one of the following situations?",
        "option_a": "Collecting DNA samples from air in a habitat at one go",
        "option_b": "Understanding the genetic makeup of avian species of a habitat",
        "option_c": "Using air-borne devices to collect blood samples from moving animals",
        "option_d": "Sending drones to inaccessible areas to collect plant and animal samples from land surfaces and water bodies",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation: Aerial metagenomics refers to the collection and analysis of microbial DNA from air samples. Option (a) directly describes this process.  Option (b) focuses on avian genetics, not airborne microbes. Option (c) involves airborne devices for blood collection, not DNA from the air. Option (d) describes drone-based sample collection from land and water, not air.\n\nGenome Editing:  A method of altering an organism's DNA, including plants, animals, and bacteria.  It can change physical traits and mitigate disease risk. Techniques include CRISPR, ZFNs, and TALENs. Unlike GMOs, it modifies existing genetic material rather than introducing foreign genes.\n\nCRISPR: A genome editing technology using clustered regularly interspaced short palindromic repeats and a Cas9 enzyme to precisely cut and modify DNA sequences.\n\nGMOs: Genetically modified organisms, created by introducing foreign genes into an organism's genome. This differs from genome editing, which modifies existing genes.\n\nMetagenomics: The study of genetic material recovered directly from environmental samples. Aerial metagenomics is a specific application focused on air samples.\n"
    },
    {
        "q_num": 70,
        "question_text": "'Microsatellite DNA' is used in the case of which one of the following?",
        "option_a": "Studying the evolutionary relationships among various species of fauna",
        "option_b": "Stimulating 'stem cells' to transform into diverse functional tissues",
        "option_c": "Promoting clonal propagation of horticultural plants",
        "option_d": "Assessing the efficacy of drugs by conducting series of drug trials in a population",
        "correct_option": "a",
        "subject": "science_and_technology",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Microsatellite DNA, also known as Simple Sequence Repeats (SSRs), are short, repetitive DNA sequences found throughout the genome.  Variations in the number of repeats at these loci are highly polymorphic and can be used to study genetic diversity within and between populations. This makes microsatellite DNA a powerful tool in studying evolutionary relationships among various species of fauna (option a).  The other options are incorrect: Microsatellite DNA is not directly involved in stem cell stimulation (b), clonal propagation (c), or drug efficacy assessment (d).\n\nMicrosatellite DNA: Short, repetitive DNA sequences used in population genetics and evolutionary studies due to high polymorphism.  Variations in repeat numbers are used as genetic markers.\n\nFauna:  The animal life of a particular region, habitat, or geological period.\n\nStem cells: Undifferentiated cells capable of self-renewal and differentiation into specialized cell types.  Used in regenerative medicine and research.\n\nClonal propagation: A form of asexual reproduction where offspring are genetically identical to the parent plant. Used extensively in horticulture.\n\nDrug trials:  Controlled experiments to assess the safety and efficacy of a new drug or treatment in a human population.\n"
    },
    {
        "q_num": 71,
        "question_text": "Consider the following statements with reference to India:\n1. According to the 'Micro, Small and Medium Enterprises Development (MSMED) Act, 2006', the 'medium enterprises' are those with investments in plant and machinery between ₹15 crore and ₹25 crore.\n2. All bank loans to the Micro, Small and Medium Enterprises qualify under the priority sector.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "a",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is incorrect.  According to the MSMED Act, 2006, medium enterprises are classified based on investment in plant and machinery and annual turnover.  The investment ranges are different for manufacturing and service enterprises.  For manufacturing, it's ₹10 crore to ₹50 crore, and for services, it's ₹5 crore to ₹25 crore.\n\nStatement 2 is also incorrect.  While many MSME loans are prioritized, not *all* bank loans to MSMEs automatically qualify for priority sector lending.  The priority sector lending (PSL) criteria are defined by the Reserve Bank of India (RBI) and include specific sub-categories within the MSME sector.\n\n\nMicro, Small and Medium Enterprises Development (MSMED) Act, 2006: This Act governs the development and regulation of micro, small, and medium enterprises (MSMEs) in India. It provides a framework for their registration, promotion, and protection.  The Act aims to foster growth and competitiveness among MSMEs.\n\nPriority Sector Lending:  This is a lending target set by the Reserve Bank of India (RBI) for commercial banks in India.  It mandates that a certain percentage of their lending must go to sectors deemed crucial for national development, such as agriculture, small-scale industries, and education.  The goal is to ensure credit reaches underserved sectors.\n\nReserve Bank of India (RBI): The central bank of India, responsible for monetary policy, regulating banks and financial institutions, and maintaining the stability of the Indian financial system.  The RBI plays a vital role in the country's economic development and financial health.\n"
    },
    {
        "q_num": 72,
        "question_text": "With reference to Central Bank digital currencies, consider the following statements:\n1. It is possible to make payments in a digital currency without using US dollar or SWIFT system.\n2. A digital currency can be distributed with a condition programmed into it such as a time-frame for spending it.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct because CBDCs can be designed to operate independently of existing fiat currencies like the US dollar and payment systems like SWIFT.  They can utilize their own distributed ledger technology and transaction mechanisms.\n\nStatement 2 is correct. A key feature of CBDCs is programmability.  Central banks can embed conditions into the digital currency, such as expiration dates or restrictions on how and when the currency can be spent.  This allows for greater control and potential for specific policy applications.\n\nSWIFT (Society for Worldwide Interbank Financial Telecommunication): A secure network that enables financial institutions worldwide to send and receive information about financial transactions.  It's crucial for international payments.\n\nUS dollar: The official currency of the United States, widely used in international trade and finance.\n"
    },
    {
        "q_num": 73,
        "question_text": "In the context of finance, the term 'beta' refers to",
        "option_a": "the process of simultaneous buying and selling of an asset from different platforms",
        "option_b": "an investment strategy of a portfolio manager to balance risk versus reward",
        "option_c": "a type of systemic risk that arises where perfect hedging is not possible",
        "option_d": "a numeric value that measures the fluctuations of a stock to changes in the overall stock market",
        "correct_option": "d",
        "subject": "environment",
        "year": 2023,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Beta, in finance, is a measure of a stock's volatility in relation to the overall market.  A beta of 1 indicates that the stock's price will move with the market. A beta greater than 1 suggests higher volatility than the market, while a beta less than 1 implies lower volatility.\n\n(a)  Arbitrage refers to the simultaneous buying and selling of an asset to profit from price differences across markets.  It's not directly related to beta.\n\n(b) Asset allocation is an investment strategy that involves diversifying investments across different asset classes to balance risk and return. This is a separate concept from beta.\n\n(c) Basis risk is a type of systemic risk related to imperfect hedging, where the hedging instrument doesn't perfectly offset the risk of the underlying asset.  It's not the definition of beta.\n"
    },
    {
        "q_num": 74,
        "question_text": "Consider the following statements:\n1. The Self-Help Group (SHG) programme was originally initiated by the State Bank of India by providing microcredit to the financially deprived.\n2. In an SHG, all members of a group take responsibility for a loan that an individual member takes.\n3. The Regional Rural Banks and Scheduled Commercial Banks support SHGs.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is incorrect.  The Self-Help Group (SHG) programme was not originally initiated by the State Bank of India. While banks do play a significant role in supporting SHGs, the program's origins are more complex and involve various government and non-governmental organizations.\n\nStatement 2 is correct.  SHGs operate on the principle of collective responsibility.  Members are jointly liable for loans taken by any individual within the group, fostering a strong sense of accountability and mutual support.\n\nStatement 3 is correct. Regional Rural Banks (RRBs) and Scheduled Commercial Banks (SCBs) are key financial institutions that provide support and credit to SHGs, playing a crucial role in their sustainability and growth.\n\n\n**Short Notes:**\n\n* **Self-Help Groups (SHGs):**  SHGs are small, informal groups of people, typically women, who come together to pool their savings and provide microcredit to members.  This empowers them economically and socially.\n\n* **State Bank of India (SBI):**  India's largest commercial bank, offering a wide range of banking services.  It plays a significant role in the Indian economy and supports various government initiatives.\n\n* **Regional Rural Banks (RRBs):** Banks specifically designed to provide financial services to rural areas, often playing a crucial role in poverty alleviation and rural development.\n\n* **Scheduled Commercial Banks (SCBs):**  Commercial banks licensed by the Reserve Bank of India (RBI), providing a range of banking services to individuals and businesses.  They play a vital role in the nation's financial system.\n"
    },
    {
        "q_num": 75,
        "question_text": "Consider the following statements:\nStatement-I  : India's public sector health care system largely focuses on curative care with limited preventive, promotive and rehabilitative care.\nStatement-II : Under India's decentralized approach to health care delivery, the States are primarily responsible for organizing health services.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:Statement I accurately reflects a significant characteristic of India's public health system.  While the system provides curative care, its capacity for preventive, promotive, and rehabilitative aspects remains limited.  Statement II is also correct; India's healthcare delivery is decentralized, with states holding primary responsibility for organizing and managing health services.  However, Statement II doesn't explain Statement I. The limited focus on preventive care in Statement I is a separate issue from the decentralized structure described in Statement II.  Both statements are true, but one doesn't explain the other.\n\n\n"
    },
    {
        "q_num": 76,
        "question_text": "Consider the following statements:\nStatement-I  : According to the United Nations' World Water Development Report, 2022', India extracts more than a quarter of the world's groundwater withdrawal each year.\nStatement-II : India needs to extract more than a quarter of the world's groundwater each year to satisfy the drinking water and sanitation needs of almost 18% of world's population living in its territory.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "```text\ncorrect_option: (c)\nexplanation:Statement I is correct.  According to the UN World Water Development Report 2022, India accounts for more than 25% of global groundwater extraction.  Statement II is incorrect. While India does have a large population, the report doesn't link the high groundwater extraction solely to drinking water and sanitation needs.  The high extraction is also due to agriculture and other uses.\n\n\nUnited Nations: An intergovernmental organization founded in 1945.  It aims to maintain international peace and security, develop friendly relations among nations, achieve international cooperation, and be a centre for harmonizing the actions of nations.  Its headquarters are in New York City.\n\nWorld Water Development Report: An annual publication by the UN that assesses the state of the world’s water resources and related issues.  It provides data, analysis, and recommendations for sustainable water management.\n\nIndia: A large, diverse country in South Asia with a significant population. It faces challenges related to water resources, including high groundwater extraction rates.\n```\n"
    },
    {
        "q_num": 77,
        "question_text": "Consider the following statements:\n1. According to the Constitution of India, the Central Government has a duty to protect States from internal disturbances.\n2. The Constitution of India exempts the States from providing legal counsel to a person being held for preventive detention.\n3. According to the Prevention of Terrorism Act, 2002, confession of the accused before the police cannot be used as evidence.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:\n\nStatement 1:  The Constitution of India does not explicitly state a duty to protect states from internal disturbances.  While the central government has powers to intervene in state matters under various articles (e.g., Article 356 – President's Rule), it's not framed as a *duty*.\n\nStatement 2: The Constitution of India does *not* exempt states from providing legal counsel to a person held under preventive detention.  The right to legal counsel is a crucial aspect of due process, even in preventive detention cases.\n\nStatement 3:  The Prevention of Terrorism Act (POTA), 2002,  was controversial and its provisions were debated extensively.  While POTA aimed to address terrorism, it did *not* automatically exclude confessions made to the police as evidence.  The admissibility of such evidence would depend on the specific circumstances and legal arguments.\n\n\nTherefore, only statement 1 could be considered partially correct, depending on the interpretation of \"duty.\"  The other statements are incorrect.\n\n\nShort Notes on Named Entities:\n\n* **Constitution of India:** The supreme law of India, establishing the framework for the government, defining fundamental rights and duties, and outlining the structure of the federal system.  It is a living document, amendable through specific procedures.\n\n* **Preventive Detention:**  The imprisonment of a person without trial, based on the apprehension that they may commit a future crime, to prevent potential harm to public order or national security.  It is subject to constitutional safeguards and judicial review.\n\n* **Prevention of Terrorism Act (POTA), 2002:** A controversial anti-terrorism law in India that was repealed in 2004. It included provisions relating to detention without trial and the admissibility of evidence.  Its strict measures raised concerns about human rights.\n\n* **Article 356:** A provision in the Indian Constitution that allows the central government to impose President's rule in a state if the state government fails to function according to the Constitution. It is a controversial provision, often used in cases of political conflict between the center and state.\n\n* **Article 19:** Article 19 of the Indian Constitution guarantees fundamental rights relating to freedoms of speech, assembly, association, movement, residence, and profession.  These freedoms are subject to reasonable restrictions.\n\n* **Article 20:** This article protects against ex post facto laws (laws that make something illegal after the act occurred), double jeopardy (being tried twice for the same crime), and self-incrimination. It is a crucial safeguard for the accused.\n\n* **Article 21:** This article guarantees the right to life and personal liberty, a fundamental right that has been interpreted expansively by the Supreme Court to include various aspects of human dignity.\n\n* **Article 31A, 80:** These articles deal with limitations on fundamental rights and the composition of the Rajya Sabha, respectively.\n\n* **Art. 32 & Art. 226:**  These articles deal with the right to constitutional remedies (Art. 32, Supreme Court) and the power of High Courts to issue writs.\n\n* **Art. 33:** This article empowers Parliament to make laws restricting fundamental rights of members of the armed forces.\n\n* **Art. 34:**  This article relates to the suspension of fundamental rights during the operation of martial law.\n\n* **Art. 35:** This article deals with the power of Parliament to make laws implementing the provisions of Part III (Fundamental Rights).\n\n* **Art. 12:** This article defines the 'State' for the purposes of fundamental rights, encompassing government bodies at all levels.\n\n* **Art. 13:** This article provides for judicial review, enabling courts to invalidate laws that violate fundamental rights.\n\n* **Art. 14, 15, 16, 25-30, 44:** These articles relate to the fundamental right to equality and freedom of religion.  Article 44 deals with the directive principle of a uniform civil code.\n\n* **Art. 73 & 74:** These articles deal with the organization of the Parliament and State legislatures.\n\n* **Art. 352, 356, 360, 361:** These articles relate to emergency provisions in the Indian Constitution.\n\n* **Art. 368:** This article outlines the procedure for amending the Constitution.\n\n* **Art. 370:**  This article grants special autonomous status to Jammu and Kashmir.\n\n* **Art. 371:** This article makes special provisions for certain states and union territories.\n\n* **Art. 109:** This article deals with the special procedure for money bills.\n\n* **Art. 243G:** This article deals with the powers, authority and responsibilities of Panchayats.\n\n* **Art. 257:** This article deals with the relationship between the Union and State governments.\n\n\n"
    },
    {
        "q_num": 78,
        "question_text": "Which one of the following countries has been suffering from decades of civil strife and food shortages and was in news in the recent past for its very severe famine?",
        "option_a": "Angola",
        "option_b": "Costa Rica",
        "option_c": "Ecuador",
        "option_d": "Somalia",
        "correct_option": "d",
        "subject": "economy",
        "year": 2023,
        "explanation": "* **correct_option:** (d)\n* **explanation:** Somalia has suffered from decades of civil strife and food shortages, leading to severe famines, including a very recent one that made international news.\n\nAngola:  Angola is a country in southwestern Africa. It has experienced periods of civil war and conflict, but not to the same sustained and devastating degree as Somalia.  It possesses significant oil reserves.\n\nCosta Rica: Costa Rica is a Central American country known for its commitment to environmental conservation and ecotourism. It has a relatively stable political climate and does not have a history of widespread famine.\n\nEcuador: Ecuador is a country on the west coast of South America.  While it faces economic and social challenges, it has not experienced the prolonged civil strife and recurring famines characteristic of Somalia.\n\n\nSomalia: Located in the Horn of Africa, Somalia has been plagued by decades of civil war, clan conflicts, and political instability. This has resulted in widespread poverty, food insecurity, and frequent severe famines.  The lack of a strong central government and recurring droughts exacerbate the situation, making it extremely vulnerable to famine.\n"
    },
    {
        "q_num": 79,
        "question_text": "Consider the following statements:\n1. In India, the Biodiversity Management Committees are key to the realization of the objectives of the Nagoya Protocol.\n2. The Biodiversity Management Committees have important functions in determining access and benefit sharing, including the power to levy collection fees on the access of biological resources within its jurisdiction.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:The Nagoya Protocol on Access to Genetic Resources and the Fair and Equitable Sharing of Benefits Arising out of their Utilization to the Convention on Biological Diversity is an international agreement.  In India, the Biodiversity Management Committees (BMCs) are established under the Biological Diversity Act, 2002, to implement the objectives of the Nagoya Protocol at the local level.  These committees play a crucial role in regulating access to biological resources within their jurisdiction and ensuring benefit-sharing with local communities.  They have the power to levy fees on access to these resources. Therefore, both statements 1 and 2 are correct.\n\nNagoya Protocol: An international treaty aiming to ensure fair and equitable sharing of benefits arising from the utilization of genetic resources.  It addresses issues of access to genetic resources and associated traditional knowledge.\n\nBiodiversity Management Committees (BMCs): Local-level bodies in India established under the Biological Diversity Act, 2002.  They are responsible for implementing the provisions of the Act, including regulating access to biological resources and ensuring benefit-sharing with local communities.  They have powers to levy fees for accessing biological resources within their jurisdiction.\n\nBiological Diversity Act, 2002: An Indian law designed to conserve biological diversity, sustainably use its components, and ensure fair and equitable sharing of benefits arising from the utilization of genetic resources.\n"
    },
    {
        "q_num": 80,
        "question_text": "Consider the following statements in respect of election to the President of India:\n1. The members nominated to either House of the Parliament or the Legislative Assemblies of States are also eligible to be included in the Electoral College.\n2. Higher the number of elective Assembly seats, higher is the value of vote of each MLA of that State.\n3. The value of vote of each MLA of Madhya Pradesh is greater than that of Kerala.\n4. The value of vote of each MLA of Arunachal Pradesh is greater than that of Puducherry because the ratio of total population to total number of elective seats in Puducherry is greater as compared to Arunachal Pradesh.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:\n\nStatement 1 is correct.  The Electoral College for the President of India includes elected members of Parliament (Lok Sabha and Rajya Sabha) and elected members of the State Legislative Assemblies. Nominated members are not part of the Electoral College.\n\nStatement 2 is incorrect.  The value of each MLA's vote is not directly proportional to the number of elective Assembly seats in their state.  The value is determined by a formula that considers the state's population and the number of elected members in its Legislative Assembly.  A state with a larger population relative to its number of MLAs will have a higher vote value for each MLA.\n\nStatement 3 is incorrect. The value of the vote of each MLA depends on the ratio of the state's population to the number of elected members in its Legislative Assembly. Without knowing the population and number of MLAs in Madhya Pradesh and Kerala, we cannot definitively say which state has a higher vote value per MLA.\n\nStatement 4 is incorrect. The value of each MLA's vote is determined by the ratio of the state's population to its number of elected MLAs. A higher ratio leads to a lower value of each MLA's vote.  Therefore, if Puducherry has a greater ratio of population to elected seats than Arunachal Pradesh, then the value of each MLA's vote in Puducherry would be lower, not higher.\n\nTherefore, only statement 1 is correct.\n\n\n**Short Notes on Important Keywords and Entities:**\n\n* **President of India:** The head of state of the Republic of India, elected indirectly by an Electoral College comprising elected members of Parliament and State Legislative Assemblies.  The President is the supreme commander of the Indian armed forces and has significant ceremonial and certain executive powers.\n\n* **Electoral College:**  The body of electors who elect the President of India. It consists of the elected members of both houses of Parliament and the elected members of the Legislative Assemblies of all states and union territories.\n\n* **Lok Sabha:** The lower house of the Indian Parliament.  Its members are directly elected by the people of India.\n\n* **Rajya Sabha:** The upper house of the Indian Parliament.  Its members are indirectly elected by the elected members of the State Legislative Assemblies.\n\n* **State Legislative Assemblies:** The lower houses of the state legislatures in India. Their members are directly elected by the people of each state.\n\n* **Madhya Pradesh:** A state in central India.\n\n* **Kerala:** A state in south-west India.\n\n* **Arunachal Pradesh:** A state in north-east India.\n\n* **Puducherry:** A union territory in south India.  Union territories have Legislative Assemblies but their representation in the Electoral College is different compared to states.\n\n* **MLA:** Member of the Legislative Assembly.\n"
    },
    {
        "q_num": 81,
        "question_text": "With reference to the Indian History, Alexander Rea, A. H. Longhurst, Robert Sewell, James Burgess and Walter Elliot were associated with",
        "option_a": "archaeological excavations",
        "option_b": "establishment of English Press in Colonial India",
        "option_c": "establishment of Churches in Princely States",
        "option_d": "construction of railways in Colonial India",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: Alexander Rea, A. H. Longhurst, Robert Sewell, James Burgess, and Walter Elliot were all prominent figures in the field of archaeology in India during the British colonial period.  They were involved in archaeological surveys, excavations, and the preservation of historical sites and artifacts.\n\nRobert Sewell:  A prominent archaeologist and historian who worked extensively on the epigraphy and history of South India.  Known for his work on the inscriptions of the Vijayanagara Empire and other South Indian dynasties.\n\nJames Burgess:  A key figure in the development of Indian archaeology. He served as the first Director-General of the Archaeological Survey of India and was instrumental in documenting and preserving many important historical sites.\n\nWalter Elliot:  A British administrator and scholar who made significant contributions to the study of South Indian history and archaeology. His work focused on epigraphy and the history of various dynasties in the region.\n\nAlexander Rea:  A significant figure in the archaeological exploration and documentation of South India.  He conducted extensive surveys and excavations, contributing greatly to our understanding of South Indian antiquities.\n\nA. H. Longhurst:  Known for his contributions to archaeological work in India, particularly in the area of Buddhist sites. His expertise contributed to the understanding and preservation of ancient Buddhist architecture and sculpture.\n"
    },
    {
        "q_num": 82,
        "question_text": "Consider the following pairs:\n   Site                 Well known for\n1. Besnagar     :       Shaivite cave shrine\n2. Bhaja        :       Buddhist cave shrine\n3. Sittanavasal :       Jain cave shrine\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Only one pair is correctly matched. Besnagar is known for a Shaivite cave shrine.  Bhaja is known for Buddhist cave shrines. Sittanavasal is known for Jain cave shrines.  Therefore, only the first pair is correctly matched.\n\nBesnagar:  Located in Madhya Pradesh, India.  Famous for its ancient cave shrines dedicated to Lord Shiva (Shaivite).  The caves contain intricate carvings and sculptures.\n\nBhaja: Situated in Maharashtra, India.  Known for its ancient rock-cut Buddhist cave shrines, dating back to the 2nd century BCE.  These caves exhibit early Buddhist art and architecture.\n\nSittanavasal: Found in Tamil Nadu, India.  Famous for its ancient Jain cave shrines, showcasing remarkable murals and sculptures. The murals depict scenes from Jain mythology and philosophy.\n"
    },
    {
        "q_num": 83,
        "question_text": "Consider the following statements:\nStatement-I  : 7th August is declared as the National Handloom Day.\nStatement-II : It was in 1905 that the Swadeshi Movement was launched on the same day.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "b",
        "subject": "modern_indian_history",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation: Statement-I is correct.  7th August is indeed celebrated as National Handloom Day in India.  Statement-II is also correct. The Swadeshi Movement was launched in 1905. However,  the Swadeshi Movement's launch date is not the reason for choosing August 7th as National Handloom Day. The selection of the date is likely due to other factors related to the handloom industry's history or significance.  Therefore, while both statements are individually true, Statement-II does not explain Statement-I.\n\n\n**Short Notes:**\n\n* **National Handloom Day:** A day observed annually in India to celebrate and promote the country's handloom industry, its weavers, and its rich textile heritage.  It aims to raise awareness about the importance of handlooms and encourage their continued use and preservation.\n\n* **Swadeshi Movement:** A movement in India during the early 20th century that advocated for the use of indigenous goods and the boycott of British products. It was a significant part of the Indian independence movement, promoting self-reliance and economic nationalism.\n"
    },
    {
        "q_num": 84,
        "question_text": "Consider the following statements in respect of the National Flag of India according to the Flag Code of India, 2002:\nStatement-I  : One of the standard sizes of the National Flag of India is 600 mm x 400 mm.\nStatement-II : The ratio of the length to the height (width) of the Flag shall be 3:2.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation: Statement I is correct as 600 mm x 400 mm is one of the standard sizes mentioned in the Flag Code of India, 2002.  Statement II is also correct; the Flag Code specifies a 3:2 ratio of length to height. However, Statement II is not the explanation for Statement I. The given dimensions in Statement I simply represent one example that adheres to the ratio defined in Statement II.  There are other standard sizes that also maintain the 3:2 ratio.\n\n\nFlag Code of India, 2002:  This is a set of rules and regulations that govern the display and use of the Indian national flag.  It dictates the acceptable sizes, materials, and methods of display.\n\nNational Flag of India: The official flag of the Republic of India, featuring three horizontal bands of saffron, white, and green, with a navy blue Ashoka Chakra in the center.\n"
    },
    {
        "q_num": 85,
        "question_text": "Consider the following statements in respect of the Constitution Day:\nStatement-I  : The Constitution Day is celebrated on 26th November every year to promote constitutional values among citizens.\nStatement-II : On 26th November, 1949, the Constituent Assembly of India set up a Drafting Committee under the Chairmanship of Dr. B. R. Ambedkar to prepare a Draft Constitution of India.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Statement I is correct.  Constitution Day is celebrated on 26th November every year to commemorate the adoption of the Constitution of India.  Statement II is incorrect. The Constituent Assembly of India adopted the Constitution on 26th November 1949. The Drafting Committee, chaired by Dr. B.R. Ambedkar, was formed much earlier, on 29th December 1946.\n\n\nDr. B.R. Ambedkar:  A prominent jurist, economist, and social reformer, Dr. B.R. Ambedkar was the chairman of the Drafting Committee of the Constituent Assembly. He played a pivotal role in drafting the Indian Constitution.\n\nConstitution Day: Celebrated annually on November 26th, Constitution Day commemorates the adoption of the Constitution of India by the Constituent Assembly in 1949.  It aims to raise awareness about the fundamental rights, duties, and values enshrined in the Constitution.\n\nConstituent Assembly of India: A body of elected representatives that drafted the Constitution of India. It met from December 1946 to November 1949, debating and finalizing the provisions of the Constitution.  Its members represented various sections of Indian society.\n"
    },
    {
        "q_num": 86,
        "question_text": "Consider the following statements:\nStatement-I  : Switzerland is one of the leading exporters of gold in terms of value.\nStatement-II : Switzerland has the second largest gold reserves in the world.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation: Statement I is correct. Switzerland is a major hub for gold refining and trading, leading to significant exports in terms of value, even though it may not possess the largest reserves.  Statement II is incorrect.  Switzerland does not have the second largest gold reserves in the world.  While it holds substantial gold, other countries possess significantly larger reserves.  Therefore, Statement I is correct but Statement II is not.\n"
    },
    {
        "q_num": 87,
        "question_text": "Consider the following statements:\nStatement-I  : Recently, the United States of America (USA) and the European Union (EU) have launched the 'Trade and Technology Council'.\nStatement-II : The USA and the EU claim that through this they are trying to bring technological progress and physical productivity under their control.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Statement I is correct. The US and the EU did launch the Trade and Technology Council.  Statement II is incorrect. While the council aims to cooperate on technology issues, the stated goal is not to control technological progress and productivity globally, but rather to align their approaches and standards in areas of mutual interest.  The USA (United States of America) and the EU (European Union) are major economic and political blocs.  The Trade and Technology Council is a recent initiative aimed at fostering cooperation and setting standards in various technological sectors.\n"
    },
    {
        "q_num": 88,
        "question_text": "Consider the following statements:\nStatement-I  : India accounts for 3-2% of global export of goods.\nStatement-II : Many local companies and some foreign companies operating in India have taken advantage of India's 'Production-linked Incentive' scheme.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "b",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (b)\n\nexplanation:Statement I is incorrect.  While the exact percentage fluctuates, India's share of global goods exports is significantly higher than 3-2%.  Sources indicate it's closer to around 2%  in recent years. Statement II is correct.  India's Production-Linked Incentive (PLI) scheme aims to boost domestic manufacturing and attract foreign investment by offering incentives linked to increased production.  Many companies have indeed participated.  Therefore, both statements are correct, but Statement II does not explain Statement I.  The low export share (Statement I) is due to various factors beyond the PLI scheme's influence, including global competition, trade policies, and infrastructural limitations.\n\nShort notes on important keywords and named entities:\n\n* **India:** A large, diverse South Asian country with a significant and growing economy, although its share of global trade remains relatively modest.\n* **Global export of goods:** The total value of goods exported worldwide, a key indicator of global trade and economic activity.\n* **Production-linked Incentive (PLI) scheme:** An Indian government initiative offering financial incentives to companies increasing domestic production in target sectors.  It aims to boost manufacturing and exports.\n* **Local companies:** Businesses based and operating within India.\n* **Foreign companies:** Businesses headquartered outside India but operating within the country.\n"
    },
    {
        "q_num": 89,
        "question_text": "Consider the following statements:The 'Stability and Growth Pact' of the European Union is a treaty that\n1. limits the levels of the budgetary deficit of the countries of the European Union\n2. makes the countries of the European Union to share their infrastructure facilities\n3. enables the countries of the European Union to share their technologies\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation: The Stability and Growth Pact (SGP) of the European Union primarily aims to limit the levels of budgetary deficits of EU member states.  It does not mandate infrastructure or technology sharing among member states.  Therefore, only statement 1 is correct.\n\nThe Stability and Growth Pact: A set of rules designed to ensure that government budget deficits in the Eurozone remain sustainable.  It aims to prevent excessive deficits that could destabilize the euro currency and the wider European economy.  The pact involves surveillance of member states' fiscal policies and the imposition of sanctions for non-compliance.\n\nEuropean Union: A political and economic alliance of 27 European countries. Following World War II, there was a growing increase in the need for closer cooperation among European nations in order to foster economic growth and prevent further conflict.  It follows a system of supranational governance, meaning that its institutions have authority over member states in certain policy areas.\n"
    },
    {
        "q_num": 90,
        "question_text": "Consider the following statements:\n1. Recently, all the countries of the United Nations have adopted the first-ever compact for international migration, the 'Global Compact for Safe, Orderly and Regular Migration (GCM)'.\n2. The objectives and commitments stated in the GCM are binding on the UN member countries.\n3. The GCM addresses internal migration or internally displaced people also in its objectives and commitments.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (a)\nexplanation:Statement 1 is incorrect.  The Global Compact for Safe, Orderly and Regular Migration (GCM) was adopted by the UN in 2018, but not all UN member states adopted it.  Some countries have expressed reservations or refused to endorse it.\n\nStatement 2 is incorrect. The GCM is a non-binding agreement.  It sets out objectives and commitments, but it does not impose legally binding obligations on member states.\n\nStatement 3 is incorrect. While the GCM aims to address many aspects of international migration, it primarily focuses on international migration and does not specifically address internal migration or internally displaced people in its objectives and commitments.  Other international agreements and frameworks deal with those issues.\n\n\nGlobal Compact for Safe, Orderly and Regular Migration (GCM): A non-binding intergovernmental agreement adopted by the UN in 2018, aiming to improve international cooperation on migration.  It addresses issues like protecting migrants' rights, combating smuggling, and promoting regular migration pathways.  It is not universally accepted by all UN member states.\n\nUnited Nations (UN): An intergovernmental organization established in 1945 to promote international cooperation and maintain international peace and security.  It comprises 193 member states, each with a single vote in the General Assembly.  The UN has various specialized agencies and bodies addressing global challenges.\n"
    },
    {
        "q_num": 91,
        "question_text": "With reference to Home Guards, consider the following statements:\n1. Home Guards are raised under the Home Guards Act and Rules of the Central Government.\n2. The role of the Home Guards is to serve as an auxiliary force to the police in maintenance of internal security.\n3. To prevent infiltration on the international border/coastal areas, the Border Wing Home Guards Battalions have been raised in some States.\nHow many of the above statements are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is incorrect. Home Guards are raised under the Home Guards Acts and Rules of the respective State Governments, not the Central Government.  Statement 2 is correct. Home Guards act as an auxiliary force to the police, assisting in maintaining internal security. Statement 3 is also correct.  Border Wing Home Guards Battalions are raised in some states to prevent infiltration along international borders and coastal areas. Therefore, only two statements (2 and 3) are correct.\n\nHome Guards:  Home Guards are voluntary, part-time, auxiliary forces in many states of India. They assist regular police and other security forces in maintaining law and order and internal security.  Their role includes disaster relief, assisting during emergencies, and supporting regular police in various tasks.\n\nInternal Security: This refers to the security of a nation from internal threats, such as crime, terrorism, insurgency, and civil unrest.  It involves maintaining law and order, protecting critical infrastructure, and preventing and responding to internal threats.\n\nBorder Wing Home Guards Battalions: These are specialized units of Home Guards deployed along international borders and coastal areas to assist in preventing infiltration, smuggling, and other border-related crimes.  They work closely with border security forces.\n"
    },
    {
        "q_num": 92,
        "question_text": "With reference to India, consider the following pairs:ActionThe Act under which it is covered\n1. Unauthorized wearing of police or military uniformsThe Official Secrets Act, 1923\n2. Knowingly misleading or otherwise interfering with a police officer or military officer when engaged in their dutiesThe Indian Evidence Act, 1872\n3. Celebratory gunfire which can endanger the personal safety of othersThe Arms (Amendment) Act, 2019\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "modern_indian_history",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Only one pair is correctly matched.\n\n1. **Unauthorized wearing of police or military uniforms:** This is covered under the **Official Secrets Act, 1923**.  The Official Secrets Act, 1923, deals with the unauthorized communication of official information and related offenses, which includes the unauthorized use of uniforms.\n\n2. **Knowingly misleading or otherwise interfering with a police officer or military officer when engaged in their duties:** This would fall under various sections of the Indian Penal Code, 1860, not the Indian Evidence Act, 1872. The Indian Evidence Act deals with the admissibility of evidence in court, not the actions themselves.\n\n3. **Celebratory gunfire which can endanger the personal safety of others:** This is covered under the **Arms Act**, and the 2019 amendment likely tightened regulations around this specific issue, but it's not solely covered by the 2019 amendment.  The Arms Act itself deals with the possession, use, and licensing of arms.\n\n\nThe Indian Evidence Act, 1872: This Act lays down the rules of evidence that are applicable in Indian courts.  It governs how evidence is presented and admitted in legal proceedings.\n\nThe Arms (Amendment) Act, 2019: This Act amended the Arms Act to further regulate the possession and use of firearms in India, likely focusing on stricter penalties for misuse.\n\nThe Official Secrets Act, 1923: This Act protects state secrets and prevents unauthorized disclosure of sensitive information. It also covers actions like unauthorized use of uniforms or insignia.\n"
    },
    {
        "q_num": 93,
        "question_text": "Consider the following pairs:Regions often mentioned in newsReason for being in news\n1. North Kivu and IturiWar between Armenia and Azerbaijan\n2. Nagorno-KarabakhInsurgency in Mozambique\n3. Kherson and ZaporizhzhiaDispute between Israel and Lebanon\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation:Only one pair is correctly matched.  Nagorno-Karabakh is a region at the center of a long-standing dispute between Armenia and Azerbaijan.  North Kivu and Ituri are regions in the Democratic Republic of Congo experiencing conflict, but not directly related to the Armenia-Azerbaijan war. Kherson and Zaporizhzhia are regions in Ukraine affected by the ongoing conflict with Russia,  not related to the Israel-Lebanon dispute.\n\n\nNorth Kivu and Ituri:  These are provinces in the eastern Democratic Republic of Congo, known for ongoing armed conflicts, often involving various rebel groups and ethnic tensions.\n\nNagorno-Karabakh: This is a mountainous region internationally recognized as part of Azerbaijan but largely populated by ethnic Armenians and controlled by Armenian separatists.  It's the site of a decades-long conflict with Azerbaijan.\n\nKherson and Zaporizhzhia: These are regions in southern Ukraine that were occupied by Russia during its 2022 invasion.  The Zaporizhzhia Nuclear Power Plant, located in the region, has been a major concern during the conflict.\n\n\n"
    },
    {
        "q_num": 94,
        "question_text": "Consider the following statements:\nStatement-I  : Israel has established diplomatic relations with some Arab States.\nStatement-II : The 'Arab Peace Initiative' mediated by Saudi Arabia was signed by Israel and Arab League.\nWhich one of the following is correct in respect of the above statements?",
        "option_a": "Both Statement-I and Statement-II are correct and Statement-II is the correct explanation for Statement-I",
        "option_b": "Both Statement-I and Statement-II are correct and Statement-II is not the correct explanation for Statement-I",
        "option_c": "Statement-I is correct but Statement-II is incorrect",
        "option_d": "Statement-I is incorrect but Statement-II is correct",
        "correct_option": "c",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (c)\n\nexplanation:Statement I is correct. Israel has normalized relations with several Arab states, most notably the UAE, Bahrain, Morocco, and Sudan, through agreements like the Abraham Accords.  Statement II is incorrect. While Saudi Arabia played a significant role in mediating the Arab Peace Initiative (API) in 2002,  the API was proposed by Saudi Arabia and endorsed by the Arab League, but it was never formally signed by Israel and the Arab League as a binding agreement.  Although there have been some steps towards normalization, full implementation of the API remains elusive.\n\nIsrael: A country in the Middle East, established in 1948.  It has a complex history and ongoing conflicts with neighboring Palestinian territories and some Arab nations.  Recently, it has pursued normalization of relations with some Arab states.\n\nArab States: Refers to the group of nations in the Middle East and North Africa where Arabic is an official language.  These states have diverse political systems and foreign policy orientations, with varying levels of engagement with Israel.\n\nArab Peace Initiative (API): A 2002 Saudi Arabian peace plan proposing a comprehensive resolution to the Israeli-Palestinian conflict. It offers normalization of relations with Israel in exchange for a complete Israeli withdrawal from occupied territories and a just solution to the Palestinian refugee issue.  It has been endorsed by the Arab League but hasn't been fully implemented due to various obstacles.\n\nSaudi Arabia: A kingdom in Western Asia, a significant player in regional politics and the oil market. It has taken a lead role in mediating regional conflicts and proposing peace plans, such as the Arab Peace Initiative.\n"
    },
    {
        "q_num": 95,
        "question_text": "Consider the following pairs with regard to sports awards:\n1. Major Dhyan ChandKhel Ratna Award\n2. Arjuna AwardFor the lifetime achievement by a sportsperson\n3. Dronacharya AwardTo honour eminent coaches who have successfully trained sportspersons or teams\n4. Rashtriya Khel Protsahan PuraskarTo recognize the contribution made by sportspersons even after their retirement\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "a",
        "subject": "history_art_and_culture",
        "year": 2023,
        "explanation": "* **correct_option:** (a)\n* **explanation:** Only one pair is correctly matched.  Major Dhyan Chand Khel Ratna Award is given to the best sportsperson in India.  The Arjuna Award is given for outstanding achievement in sports and games. The Dronacharya Award is indeed given to honour eminent coaches.  The Rashtriya Khel Protsahan Puraskar recognizes the contribution of individuals and institutions in the promotion and development of sports. Therefore, only the pairing of Dronacharya Award with its description is correct.\n\n**Short Notes:**\n\n* **Major Dhyan Chand Khel Ratna Award:** India's highest sporting honour, named after legendary hockey player Major Dhyan Chand, recognizes outstanding achievements in sports.  It's awarded annually to individuals who demonstrate exceptional skill and dedication.\n\n* **Arjuna Award:** A prestigious Indian sporting award, named after the legendary warrior Arjuna from the Mahabharata, it recognizes outstanding achievement in sports and games.  Recipients demonstrate consistent excellence and contribute significantly to their chosen sport.\n\n* **Dronacharya Award:**  Named after the legendary teacher Dronacharya from the Mahabharata, this award honors coaches who have made exceptional contributions to the training and development of sportspersons or teams.  It recognizes their expertise and dedication in nurturing sporting talent.\n\n* **Rashtriya Khel Protsahan Puraskar:**  This award acknowledges the contributions of individuals and institutions who promote and support sports in India.  It recognizes their efforts in fostering a positive sporting environment and developing sporting talent at various levels.\n"
    },
    {
        "q_num": 96,
        "question_text": "Consider the following statements in respect of the 44th Chess Olympiad, 2022:\n1. It was the first time that Chess Olympiad was held in India.\n2. The official mascot was named 'Thambi'.\n3. The trophy for the winning team in the open section is the Vera Menchik Cup.\n4. The trophy for the winning team in the women's section is the Hamilton-Russell Cup.\nHow many of the statements given above are correct?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "Only three",
        "option_d": "All four",
        "correct_option": "b",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (b)\nexplanation:Statement 1 is correct. The 44th Chess Olympiad, held in 2022, was the first time the event was hosted in India.  Statement 2 is correct.  The official mascot was indeed named 'Thambi'. Statement 3 is incorrect. The Vera Menchik Cup is awarded to the winning team in the women's section, not the open section. Statement 4 is correct. The Hamilton-Russell Cup is the trophy for the winning team in the women's section. Therefore, only three statements are correct.\n\nChess Olympiad: A biennial chess tournament organized by FIDE (World Chess Federation), where teams representing different countries compete.\n\nThambi: The mascot of the 44th Chess Olympiad held in India.\n\nVera Menchik Cup:  Awarded to the winning team in the women's section of the Chess Olympiad.\n\nHamilton-Russell Cup: Awarded to the winning team in the women's section of the Chess Olympiad.\n"
    },
    {
        "q_num": 97,
        "question_text": "Consider the following pairs:Area of conflict mentioned in newsCountry where it is located\n1. DonbasSyria\n2. KachinEthiopia\n3. TigrayNorth Yemen\nHow many of the above pairs are correctly matched?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "a",
        "subject": "polity",
        "year": 2023,
        "explanation": "correct_option: (a)\n\nexplanation: Only one pair is correctly matched.\n\n* Donbas is located in Ukraine, not Syria.  Donbas is a region in eastern Ukraine that has been the site of a conflict between Ukrainian government forces and Russian-backed separatists since 2014.\n* Kachin is a state in northern Myanmar (formerly Burma), not Ethiopia.  The Kachin conflict is a long-running civil war between the Myanmar military and the Kachin Independence Army.\n* Tigray is a region in northern Ethiopia, not North Yemen. The Tigray War is an ongoing conflict between the Ethiopian government and the Tigray People's Liberation Front (TPLF).\n\nTherefore, none of the pairs are correctly matched except for the Tigray-Ethiopia pair.\n"
    },
    {
        "q_num": 98,
        "question_text": "In the recent years Chad, Guinea, Mali and Sudan caught the international attention for which one of the following reasons common to all of them?",
        "option_a": "Discovery of rich deposits of rare earth elements",
        "option_b": "Establishment of Chinese military bases",
        "option_c": "Southward expansion of Sahara Desert",
        "option_d": "Successful coups",
        "correct_option": "d",
        "subject": "geography",
        "year": 2023,
        "explanation": "correct_option: (d)\n\nexplanation: Chad, Guinea, Mali, and Sudan have all experienced successful coups in recent years.  While the other options might be true for some of these countries individually at different times, none are a common factor for all four in the recent period.\n\n* **Chad:** A landlocked country in Central Africa known for its vast Sahara Desert region and diverse ethnic groups. It has a history of political instability marked by frequent coups and rebellions.\n* **Guinea:** A West African country with significant bauxite reserves. It has also experienced periods of political turmoil, including coups.\n* **Mali:** A landlocked country in West Africa, known for its rich history and cultural heritage.  It has faced numerous challenges, including political instability and coups.\n* **Sudan:** A large country in Northeast Africa, bordering the Red Sea.  It has a complex history and has experienced numerous conflicts and coups.  The recent events in Sudan have drawn significant international attention due to the ongoing political instability and conflict.\n\n\nThe provided context does not contain information relevant to the question's focus on recent coups in Chad, Guinea, Mali, and Sudan.  The context focuses on various geographical features, resources, and geopolitical issues in Africa and beyond, but does not provide specific details about the coup events in these four countries.\n"
    },
    {
        "q_num": 99,
        "question_text": "Consider the following heavy industries:\n1. Fertilizer plants\n2. Oil refineries\n3. Steel plants\nGreen hydrogen is expected to play a significant role in decarbonizing how many of the above industries?",
        "option_a": "Only one",
        "option_b": "Only two",
        "option_c": "All three",
        "option_d": "None",
        "correct_option": "c",
        "subject": "environment",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Green hydrogen, produced using renewable energy sources to power electrolysis, can decarbonize fertilizer production (by replacing natural gas in ammonia synthesis), oil refining (by providing clean energy for processes), and steelmaking (by reducing iron ore with hydrogen instead of coal).  Therefore, green hydrogen is expected to play a significant role in decarbonizing all three industries.\n\nFertilizer plants: These plants primarily produce ammonia (NH₃), a crucial component of fertilizers.  Traditional ammonia production is energy-intensive and relies heavily on natural gas, a significant source of greenhouse gas emissions. Green hydrogen offers a cleaner alternative.\n\nOil refineries: These facilities process crude oil into various fuels and petrochemicals.  Many refinery processes require significant energy input.  Replacing fossil fuel-based energy with green hydrogen can significantly reduce their carbon footprint.\n\nSteel plants: Steel production is a major source of CO₂ emissions, largely due to the use of coal in blast furnaces to reduce iron ore. Green hydrogen can directly reduce iron ore, resulting in a cleaner steelmaking process.\n"
    },
    {
        "q_num": 100,
        "question_text": "Consider the following statements about G-20:\n1. The G-20 group was originally established as a platform for the Finance Ministers and Central Bank Governors to discuss the international economic and financial issues.\n2. Digital public infrastructure is one of India's G-20 priorities.\nWhich of the statements given above is/are correct?",
        "option_a": "1 only",
        "option_b": "2 only",
        "option_c": "Both 1 and 2",
        "option_d": "Neither 1 nor 2",
        "correct_option": "c",
        "subject": "economy",
        "year": 2023,
        "explanation": "correct_option: (c)\nexplanation:Statement 1 is correct. The G20 was initially established as a forum for finance ministers and central bank governors to address global economic and financial matters.  Statement 2 is also correct.  India, during its G20 presidency, prioritized digital public infrastructure (DPI).  DPI refers to digital infrastructure that is publicly owned and operated, aiming to provide digital services to citizens.  India's focus on DPI reflects its commitment to digital inclusion and bridging the digital divide.\n\nG-20: The Group of Twenty (G20) is an intergovernmental forum comprising 19 countries and the European Union.  It aims to address major issues related to the global economy, international finance, climate, energy, and sustainable development.  The G20's membership includes both developed and developing economies, representing a significant portion of the world's population and GDP.  The group holds annual summits, with a rotating presidency.\n\nDigital Public Infrastructure:  A set of digital systems and services that are publicly owned and operated.  The goal is to provide essential digital services to citizens, promoting digital inclusion and equity.  Examples include digital identity systems, payment platforms, and data sharing networks.  DPI can be a catalyst for innovation and economic growth, enabling efficient and transparent governance.\n"
    }
]